import React, { Component } from 'react';
import LunarCalendar from '../solar2lunar/LunarCalendar'
import IconConfig from '../../../config/IconConfig'
//import DatePicker from 'react-native-datepicker'
//import DateTimePicker from 'react-native-modal-datetime-picker';
/*
夫妻宮：(日支)
一、為用神，不受沖合
以命格分析此生在夫妻間契合度有80分，也代表配偶有助力。
二、為用神，被閒神沖
以命格分析此生在夫妻間的契合度約有60分~70分，配偶有時候不是很甘心的幫忙。
三、為用神：被忌神沖
以命格分析此生在夫妻間是(聚少離多，或晚婚)，助力將減弱為60分。
沖忌神(如子用神沖午忌神)
以命格分析此生在夫妻間助力仍大，可得90分，可以早婚。
四、為用神：(一)被合為忌神：以命格分析此生在夫妻間助力減少，僅得60分。(二)被合為用神：以命格分析此生在夫妻間助力增加，可得90分。
五、為閒神：夫妻間相處狀況時好時壞，但以目前社會現象，依您的八字診斷結果還算可以，如果要更好，必須兩人一起努力經營婚姻才是。
六、為忌神，不受沖合
以命格分析此生在夫妻間較無助力，請平凡過一生吧。
七、為忌神、受閒神沖
以命格分析此生，顯然夫妻間的契合度只有10分，並沒有太大的助力。
八、為忌神：(一)被用神沖：以命格分析此生在夫妻間較無助力，但可得20分的助力。(二)沖用神：以命格分析此生配偶無助力，會各自發展事業，夫妻間互動為負80分。
九、為忌神：(一)合為用神：以命格分析此生夫妻間相害力減少，夫妻間仍有助力得50分。(二)合為忌神：以命格分析此生夫妻間相阻力增加，夫妻間互動為負80分。
十、夫妻宮得位(男日支正財、女日支正官)，為用神。
以先天命盤分析您的夫妻宮得到正位，以夫妻間的助力會有100分。
十一、夫妻宮得位(男日支正財、女日支正官)，雖為忌神。
以先天命盤分析您夫妻宮因得位，故配偶雖無大助力，卻可安守本份，兼顧家庭，故有50分。
十二、夫妻宮不喜被爭合如巳日受申月酉時
以先天命盤分析您的婚姻會三心二意，也易有感情糾紛產生。
六神論婚姻
(1)忌官殺多2個以上，日主無氣(以女命為主)→茲因命中注定此生婚姻緣薄，同時容易受夫欺負。
(2)忌印多3個以上，官殺無氣(以女命為主)→一生為女強人，較不得夫緣，丈夫成就平平，若有財生，不在此限。
夫妻間應多多溝通，互相激勵共同打拼才對。
(3)忌比劫多，官殺無氣(以女命為主)→一生為女強人，較不得夫緣，若有財生官，不在此限。
(4)忌食傷多，無財生官(以女命為主)→一生為女強人，較不得夫緣，茲因命中注定，此生難有好婚姻，您難道不能稍微放手嗎?
(5)忌財殺官多，日主無氣(以女命為主)→為夫辛勞，夫不感激，若日主有氣(有祿刃)，不在此限。
(6)神煞：若八字中有以下三個神煞以上(男、女命同論)
【桃花、華蓋、孤辰、寡宿】
茲因命中注定此生難有好婚姻，夫妻間唯有多說好話，多做好事才能改變此一婚姻不美狀況。
(1)女命忌庚子日、壬子日、乙卯日、辛酉日
男命忌庚申日
茲因命中注定此生難有好婚姻，有可能會走向離婚的路。
(2)女命忌三透比劫。(天干)
因天生個性使然，不易屈服，算是命中注定此生難有好婚姻。
(3)男女命忌丑戌未三刑於日支
茲因命中注定此生難有好婚姻，因雙方都蠻恃勢，太自信，欠考慮而種下敗因。
(4)男女命忌亡神，劫煞沖於日支
茲因命中注定此生難有好婚姻，因有外力介入，應提防。
(5)男女命忌坐華蓋於日支
茲因命中注定此生婚姻因信念不同，而造成婚姻不美。
(6)男女命忌坐孤辰或寡宿於日支
茲因命中注定此生難有好婚姻，是因欠缺溝通而造成，請加強溝通。
(7)女命忌本主同宮。(庚子年、庚子日或甲午年、甲午日)
茲因命中注定此生難有好婚姻，此乃有強出頭的情況，需忍耐。
(8)女命忌多合(三合以上)
茲因命中注定此生難有好婚姻，有太多的事絆住了，無自由可言，當然不好。
(9)女命忌月支沖日支
表婚姻不美，在日常生活中，可能無法有瓊瑤小說式的浪漫，唯有相互體諒，才能有好的結局。
*/
/*
大格局就学四种
一、格局——只学四种
1、正格身旺：八字命局中生助日主的力量大。印枭、比劫旺。
2、正格身弱：八字命局中克泄日主的力量大。伤食、才财、官杀旺。
3、专旺格：八字命局中全是生助日主的力量。除日主外，其他七个字都是印枭、比劫。
4、从弱格：八字命局中全是克泄日主的力量》。除日主外，其他七个字都是伤食、才财、官杀。
二、用神
1、正格身旺：以伤食、才财、官杀为喜用。（喜神和用神不用区分啦！这种区分留到你成为大师的时候再看吧）
2、正格身弱：以印枭、比劫为喜用。
3、专旺格：以印枭、比劫为喜用。
4、从弱格：以伤食、才财、官杀为喜用。
三、合化
天干五合：甲己合土 乙庚合金 丙辛合水 丁壬合木 戊癸合火
1、天干五合必须是相邻的。比如年干有甲，月干为己则算合。如果年干为甲，时干为己。隔太远，不算合。遥合有合之情，无合之意。
2、五合有成化与不成化之分。只有月支有引化的权利。月支为引化之神。比如天干甲己能合，月支为辰主气为戊，那么甲己合化成功。天干甲和己被辰引化为两个戊。不成化，如果月支无引化神，就不能成化。
3、月令余气亦可引化。
4、相合成化不能与月提主气相违。
5、争合如能成化，都能成化。
四、地支合会冲害
地支六合：子丑合土 寅亥合木 卯戌合火 辰酉合金 申巳合水 午未合火
地支三合：申子辰合水 亥卯未合木 寅午戌合火 巳酉丑合金
地支三会：寅卯辰会木 巳午未会火 申酉戌会金 亥子丑会水
1、地支六合，只有相邻才论合，隔位不合
2、三合与三会，隔位也能合会，三合还能成半合局，申子、亥卯、寅午、巳酉相合称生地半合。子辰、卯未、午戌、酉丑相合称墓地半合。也是隔位也能合。
3、天干有化神引化，化神为阴则化为阴，化神为阳则化为阳。
4、化神不能与月提主气相违逆
5、地支合会从力量上来讲：会局力量最强，其次是三合，其次是生地半合，其次是墓地半合，力量最弱的是六合。
6、地支相冲，相邻才论冲
7、地支三刑隔位也能相刑
8、子卯刑，午午、酉酉、辰辰、亥亥自刑，一般需要相邻才论
*/
/*
日元天干看性格，详细的看性格，必须是以十神来论定
十神性格（细看性格）
官杀为喜：具自律性、能约束鞭策自己、责任心强、光明磊落、权力欲重、威望高。
官杀为忌：自由放任、逃避责任能力差、不拘小节、明哲保身、软弱怕事、受欺负。
印枭为喜：注重名誉、气质高雅性温和、具同情心、仁慈端正、乐于奉献、人缘好。
印枭为忌：虚荣粉饰、糊涂计较喜幻想、感情用事、缺乏进取、过分依赖、嫉妒人。
劫比为喜：独立自主、事业心强喜竞争、好学上进、自尊自立、崇尚友善、朋友多。
劫比为忌：顽愚固执、主观刚烈性格暴、孤僻高傲、六亲无缘、被人利诱、无知己。
伤食为喜：表现欲强、学识才华技艺高、知书达理、重情重义、聪明美貌、有名誉。
伤食为忌：冷漠寡情、不正思维多傲慢、孤芳自赏、任性愚昧、刚愎自用、多叛逆。
财才为喜：占有欲强、唯金钱衡量标准、慷慨大方、待人诚实、谋财有道、肯拼搏。
财才为忌：好逸恶劳、蛮横专制重利益、媚上轻下、忘恩负义、风流多情、桃花劫。
五行特点 
甲：甲为阳木，为参天大树，栋梁之才，性格仁德温厚，外表平静内心极强，喜静恶动，自律自重，大成则兴邦治国，小成则养家立业。仁义礼智信中，木主仁。
　　为喜神旺相时，为人主观不屈服，喜恭维恶批评。
　　为忌神旺相时，其性必恶，固执己见，麻木不仁。
　　甲木为弱时，失去挺拔个性，徒有其表，外强中干，性格懦弱，没有立场，随风摆动，没主见没胆识，难挑重担。
　　
乙：乙为阴木，似藤萝花草，柔中带刚，外表仁厚，内心刚强，有极强的容忍力和变通力，坚韧不拔不惧险阻，乙木好似花卉，喜争奇斗艳，天生爱美，注重外表仪容，自尊心强，也容易自卑。
　　为喜神旺相时，亦如甲木具仁寿之德，激流勇进，越挫越勇，比甲木能屈能伸。
　　为忌神旺相时，过分坚持，过分执着，积怨越深，爆发越大，只图自己安乐，不顾千夫所指。乙木太弱时，毫无生气，人穷志短，性格忧郁，悲观内向。
　　
丙：丙为阳火，比喻为太阳，光照大地，万物赖以为生。丙火人性格，温暖和煦，热情豪放，光明磊落，大公无私，上进心强，仁义礼智信中，火主礼。
　　为喜神旺相时，乐天知命，不惧逆境，心有骄阳，不惧寒冬，充满活力，永远灿烂，相信春天总会到来。
　　为忌神旺相时，过分火爆，易起争执，个性偏激，到处惹事。狂妄自大，不可一世。
　　丙火为弱时，委曲求全，黯淡无光。
　　
丁：丁为阴火，比喻为灯烛之火，不刚不烈，不弱不衰，性虽阴柔，昭然不绝。
　　为喜神旺相时，待人有仪，温文尔雅，心地善良，忠孝两全，体恤他人，助人为乐。
　　为忌神旺相时，内敛狠毒，不喜张扬，默默策划，性格阴森，表面一套，背后一套，防不胜防，祸患深藏，不露痕迹。
　　丁火太弱时，刚性不足，缺乏坚定，做事优柔寡断，犹豫不决，危急关头，临阵脱逃。
　　
戊：戊为阳土，比喻为山岳城墙，戊土厚重，宽厚包容，仁义礼智信，土主信，戊土个性，稳重守信，固重不移，万物所系，广结人缘。
　　为喜神旺相时，为人稳重，能做实事，不喜浮夸，重视信用，一诺千金，敦厚朴实。
　　为忌神旺相时，保守顽固，死守不变，浑浊不化，不通世情，不受规劝，顽石一般。
　　戊土太弱时，戊土太弱容易失去信心，过分忍让，受辱委屈，糊涂用事，自食其果。
　　
己：己为阴土，比喻为泥沙湿土，己土卑湿，能生万物，己土个性，不卑不亢，不偏不倚，处事中正。
　　为喜神旺相时，谦虚谨慎，富而不骄，穷而不屈，乐而知足。心量广大，志气高昂。
　　为忌神旺相时，过分叛逆，自私自我，包容性差，浊而不清。卑鄙阴险，内心狠毒
　　
庚：庚为阳金，比喻为刀斧剑锋 个性刚健硬朗，仁义礼智信，金主义，庚金人，义气为重。
　　为喜神旺相时，沉着坚韧，是非分明，意志坚定，自强不息，两肋插刀，在所不辞，
　　为忌神旺相时，倔强易怒，冲动好斗，不受约束，铁石心肠，见利忘义，失去正义。
　　庚金太弱时，意志不坚，精明过头，两两计较，剑走偏锋，逃之夭夭。
　　
辛：辛为阴金，比喻为金钗首饰，不及庚金刚锐，其毅性内在，辛金的确很辛苦，善纠缠。
　　为喜神旺相时，大仁大义，性格冷静，心思缜密，临危不乱，处变不惊，不甘趋炎附势。
　　为忌神旺相时，不仁不义，言多必失，得罪众人，自恃华丽，孤芳自赏。
　　辛金为弱时，刚阳不足，胆小怕事，逆来顺受，唯唯诺诺。
　　
壬：壬为阳水，刚阳奔放，比喻为江河湖海，仁义礼智信中，水主智。形虽柔而质实刚，刚柔相济，似水柔情。壬水性格，机灵聪敏，有智有谋。
　　为喜神旺相时，壬水主动，处事积极，待人热情，甘为服务，思维活跃，善于钻营。
　　为忌神旺相时，性情善变，容易激动，喜怒无常，爱则欲其生，恨则欲其死。
　　壬水为弱时，迁徙不止，聪明过分，聪明反被聪明误，缺乏责任，粗枝大叶，乐少忧多。
　　
癸：癸为阴水，比喻为雨露之水，又好比天之津液，至阴至柔。水亦主智，内心缜密，办事周详，面面俱到。
　　为喜神旺相时，心慈性善，助人之乐，犹如春雨，滋生万物，实惠布福，不分贵贱，一视同仁。
　　为忌神旺相时，性柔情弱，悲观失控，过分自我，淫溺无耻
　　癸水为弱时，个性内向，阳刚不足，气魄不够，处事优柔，瞻前顾后，一事无成。
*/


//阴阳原值来处理八字命学的“调候原则”。其计算的干支阴阳气含原值如下表：
//+7,+6,+5,+3,+2,+1,-1,-2,-3,-5,-6,-7
var powerchange = new Array();
powerchange["丙"] = 7
powerchange["丁"] = 5
powerchange["甲"] = 3
powerchange["乙"] = 1
powerchange["戊"] = 1
powerchange["己"] = -1
powerchange["庚"] = -1
powerchange["辛"] = -3
powerchange["壬"] = -5
powerchange["癸"] = -7
powerchange["巳"] = 7
powerchange["未"] = 6
powerchange["午"] = 5
powerchange["寅"] = 3
powerchange["辰"] = 2
powerchange["卯"] = 1
powerchange["申"] = -1
powerchange["戌"] = -2
powerchange["酉"] = -3
powerchange["亥"] = -5
powerchange["丑"] = -6
powerchange["子"] = -7

//目前一共有3类藏干表，有一种是60/30/10或者70/30分布的，目前采用总气是30的，但是在午和未的划分中，采用的后一种，按罗盘，应该是前一种，对午的最大影响就是土多火多的问题
var hidetable = new Array();
hidetable['子'] = ['癸主20', '壬余10'];
hidetable['丑'] = ['己主18', '辛中3', '癸余9'];
hidetable['寅'] = ['甲主16', '丙中7', '戊余7'];
hidetable['卯'] = ['乙主20', '甲余10'];
hidetable['辰'] = ['戊主18', '癸中3', '乙余9'];
hidetable['巳'] = ['丙主16', '庚中9', '戊余5'];
hidetable['午'] = ['丁主11', '己中9', '丙余10'];
//hidetable['午'] = ['丁主20', '丙余10'];
hidetable['未'] = ['己主18', '乙中3', '丁余9'];
hidetable['申'] = ['庚主17','壬中3','己余7','戊余3'];
hidetable['申'] = ['庚主17', '壬中3', '戊余10'];
hidetable['酉'] = ['辛主20', '庚余10'];
hidetable['戌'] = ['戊主18', '丁中3', '辛余9'];
hidetable['亥'] = ['壬主18', '甲中5', '戊余7'];
var daykey = '甲乙丙丁戊己庚辛壬癸'
var earthkey = '子丑寅卯辰巳午未申酉戌亥'
var fivekey = '木火土金水'







class EightrandomModule extends React.Component {

    constructor(porp) {
        super(porp);
        this.state = {
            isDatePickerVisible: false,
            isTimePickerVisible: false,
            switchstate: true,
            selectedValue: '男',
            datepicker: "",
            datepickershow: "",
            timepicker: "",
            Tip: ""
        }
    }
    getrongqin(self,target)
    {
        //角、亢、氐、房、心、尾、箕
		//斗、牛、女、虚、危、室、壁
		//奎、娄、胃、昴、毕、觜、参
		//井、鬼、柳、星、张、翼、轸
        const t =   ["参","觜","毕","昴","胃","娄","奎",
                    "壁","室","危","虚","女","牛","斗",
                    "箕","尾","心","房","氐","亢","角",
                    "轸","翼","张","星","柳","鬼","井"]
        var index = t.indexOf(self)
        var indextarget = t.indexOf(target)
        var tt = new Array()
        tt["参"]=["命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣"]
        tt["觜"]=["荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰"]
        tt["毕"]=["衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安"]
        tt["昴"]=["安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危"]
        tt["胃"]=["危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成"]
        tt["娄"]=["成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏"]
        tt["奎"]=["坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友"]

        tt["壁"]=["友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲"]
        tt["室"]=["亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业"]
        tt["危"]=["业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣"]
        tt["虚"]=["荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰"]
        tt["女"]=["衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安"]
        tt["牛"]=["安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危"]
        tt["斗"]=["危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成",""]

        tt["箕"]=["","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成"]
        tt["尾"]=["成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏"]
        tt["心"]=["坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲","友"]
        tt["房"]=["友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎","亲"]
        tt["氐"]=["亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣","胎"]
        tt["亢"]=["胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰","荣"]
        tt["角"]=["荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安","衰"]

        tt["轸"]=["衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危","安"]
        tt["翼"]=["安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成","危"]
        tt["张"]=["危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏","成"]
        tt["星"]=["成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友","坏"]
        tt["柳"]=["坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲","友"]
        tt["鬼"]=["友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命","亲"]
        tt["井"]=["亲","友","坏","成","危","安","衰","荣","胎","亲","友","坏","成","","危","安","衰","荣","业","亲","友","坏","成","危","安","衰","荣","命"]
        var o ={}
        o.r = tt[t[index]][indextarget]
        o.d = indextarget - index
        if(Math.abs(o.d)<=14)
        {
            o.d = Math.abs(o.d)
        }
        else if(o.d>0){
            o.d = (28 - o.d)%14
        }else{
            o.d = (28 + o.d)%14
        }
        return o;

    }
    /*
    日干旺包括四个方面： 得令，得地，得生，得助.
    得令： 日干旺于月支，处长生，沐浴，冠带，临官，帝旺之地为得令.
    得地： 日干在其余各支中得长生（须阳日干），禄刃（支中藏干的本气为比，为劫）这里用的临官，或逢墓库（阳日干逢墓库为有根，阴日干无气，故无根）.
    现在简化一些，只要存在帝旺且有印有元，就可以得地
    得生： 日干得四柱干支中的正偏印之生为得生.
    得助： 日干与四柱其它天干同类为逢比肩劫财帮身，此为得助.

    ps：目前计算，不考虑墓库计算，所以得地的标准和得令一样，但是都去掉了沐浴
    */
    getpowerself(EightDate,buildeight,luckyear,precent){

        const daykey = "甲乙丙丁戊己庚辛壬癸"
        const shen = "木火土金水木火土金水"
        var index = Math.floor(daykey.indexOf(EightDate[4])/2)
        var assistindex = (index - 1 + 5)%5
        const key = "长生，冠带，临官（建禄），帝旺"
        var powerself = new Array()
        powerself.push(this.gettwelfthposition(EightDate[4] + EightDate[1]))
        powerself.push(this.gettwelfthposition(EightDate[4] + EightDate[3]))
        powerself.push(this.gettwelfthposition(EightDate[4] + EightDate[7]))
        powerself.push(buildeight[0])
        powerself.push(buildeight[2])
        //这里没有计算时干支，可以考虑打开
        //powerself.push(buildeight[6])
        var t = powerself.toString()
        var superself = new Array()
        superself.push(buildeight[0])
        superself.push(buildeight[1])
        superself.push(buildeight[2])
        superself.push(buildeight[3])
        superself.push(buildeight[5])
        superself.push(buildeight[7])
        superself.push(buildeight[8])
        var s = superself.toString()
        var ret = ""
        //月令得长生帝旺者得令
        if (-1 != key.indexOf(powerself[1])) {
            ret = ret + "得令"
        } else {
            ret = ret + "失令"
        }

        const getearth = key
        //三合局，三会局的长生属性得地
        if(-1 != getearth.indexOf(powerself[0]) || -1 != getearth.indexOf(powerself[1]) || -1 != getearth.indexOf(powerself[2]))
        {
            ret = ret + "得地"
        }
        //地支其他三支有墓且阳干得地
        else if((-1 != "墓地".indexOf(powerself[0]) || -1 != "墓地".indexOf(powerself[1]) || -1 != "墓地".indexOf(powerself[2])) && -1!="甲丙戊庚壬".indexOf(EightDate[4])){
            ret = ret + "得地"
        }
        else{
            ret = ret + "失地"
        }

        //四柱得印得生
        if (-1 != t.indexOf("印") ) {
            ret = ret + "得生"
        } else {
            ret = ret + "失生"
        }

        //四柱得同我者得助
        if (-1 != t.indexOf("比") || -1 != t.indexOf("劫") || -1 != s.indexOf("比") || -1 != s.indexOf("劫")) {
            ret = ret +"得助"
        } else {
            ret = ret +"失助"
        }

        //var countget = ret.match(/"得"/g)
        var countget = ret.split("得")
        var countget = (countget!=undefined?countget.length-1:0)

        if (-1!=ret.indexOf("得令") && -1!=ret.indexOf("得地") &&  -1!=ret.indexOf("得生") &&  -1!=ret.indexOf("得助") && -1 == s.indexOf("正官") && -1 == s.indexOf("七杀")) {
            ret = "专旺"
        }
        else if(-1!=ret.indexOf("失令") && -1!=ret.indexOf("失地") &&  -1!=ret.indexOf("失生") &&  -1!=ret.indexOf("失助") && -1 == s.indexOf("正官") && -1 == s.indexOf("七杀"))
        {
            ret = "身衰（从儿）"
        }else if(-1!=ret.indexOf("得令") && countget>3)
        {
            ret = "身旺"
        }else if(-1!=ret.indexOf("得令") && countget>=2)
        {
            ret = "身强"
        }else if(-1!=ret.indexOf("得令") && countget>=1)
        {
            ret = "身弱"
        }else if(-1!=ret.indexOf("失令") && countget>=2)
        {
            ret = "身弱"
        }
        else if(-1!=ret.indexOf("失令") )
        {
            ret = "身衰"
        }
        //对身弱身衰做五行百分比矫正
        if(-1!="身弱，身衰".indexOf(ret))
        {
            var test = precent[assistindex]  + precent[index]
            if(test>(264/2))
            {
                ret = "身强"
            }
            else{
                ret = "身弱"
            }
        }

        //大运四支得三合三会，生助日元者旺
        if(-1!=EightDate[4].indexOf("甲") || -1!=EightDate[4].indexOf("乙")||  -1!=EightDate[4].indexOf("丙") || -1!=EightDate[4].indexOf("丁"))
        {
            var s = EightDate[1] + EightDate[3] + EightDate[5] + EightDate[7] + luckyear
            if(-1!=s.indexOf("亥") && -1!=s.indexOf("卯") && -1!=s.indexOf("未"))
            {
                ret = "身旺（木）"
            }
            else if(-1!=s.indexOf("寅") && -1!=s.indexOf("卯") && -1!=s.indexOf("辰"))
            {
                ret = "身旺（木）"
            }
        }
        else if(-1!=EightDate[4].indexOf("丙") || -1!=EightDate[4].indexOf("丁") ||  -1!=EightDate[4].indexOf("戊") || -1!=EightDate[4].indexOf("己"))
        {
            var s = EightDate[1] + EightDate[3] + EightDate[5] + EightDate[7] + luckyear
            if(-1!=s.indexOf("寅") && -1!=s.indexOf("午") && -1!=s.indexOf("戌"))
            {
                ret = "身旺（火）"
            }
            else if(-1!=s.indexOf("巳") && -1!=s.indexOf("午") && -1!=s.indexOf("未"))
            {
                ret = "身旺（火）"
            }
        }else if(-1!=EightDate[4].indexOf("庚") || -1!=EightDate[4].indexOf("辛") || -1!=EightDate[4].indexOf("壬") || -1!=EightDate[4].indexOf("癸"))
        {
            var s = EightDate[1] + EightDate[3] + EightDate[5] + EightDate[7] + luckyear
            if(-1!=s.indexOf("巳") && -1!=s.indexOf("酉") && -1!=s.indexOf("丑"))
            {
                ret = "身旺（金）"
            }
            else if(-1!=s.indexOf("申") && -1!=s.indexOf("酉") && -1!=s.indexOf("戌"))
            {
                ret = "身旺（金）"
            }
        }else if(-1!=EightDate[4].indexOf("壬") || -1!=EightDate[4].indexOf("癸") || -1!=EightDate[4].indexOf("甲") || -1!=EightDate[4].indexOf("乙"))
        {
            var s = EightDate[1] + EightDate[3] + EightDate[5] + EightDate[7] + luckyear
            if(-1!=s.indexOf("申") && -1!=s.indexOf("子") && -1!=s.indexOf("辰"))
            {
                ret = "身旺（水）"
            }
            else if(-1!=s.indexOf("亥") && -1!=s.indexOf("子") && -1!=s.indexOf("丑"))
            {
                ret = "身旺（水）"
            }
        }
        var o = {}
        o.powerself = ret;
        return o
    }

    getyongshen(EightDate,buildeight,luckyear,precent){
        //https://baike.baidu.com/item/喜用神/10646208?fr=aladdin
        /*
        日元先根据十二长生算出衰旺
        然后根据衰旺判断强弱
        强
        有官杀，用官杀 忌：食伤 喜：财 仇：印 后忌：比劫
        无官杀，用食伤 忌：印 喜：财 仇：印 后忌：比劫
        弱
        有印，先用印 忌：财 喜：比劫 仇：食伤 后喜：官
        无印，用比劫 忌：官 喜：印 仇：财 闲：食伤（凶）
甲木日元用忌神取用法
1、甲木日元在寅月喜丙火。和气候为要，丙火为主，次者土，如八字金旺可用水。

2、甲木日元在卯月丙，丁，戊，己为喜用。刃架杀喜食伤和正官，用丙，丁泄秀。

3、甲木日元在辰月喜用丙、丁。庚金必须丁火制之，为伤官制杀。庚用壬。

4、甲木日元在巳月喜火土，戊、己。水则癸水为调候。局气润，辛丁为用。

5、甲木日元在午月喜用土木，戊、己、甲、乙。性虚焦，癸为调候，无癸用丁。

6、甲木日元在未月喜水，癸、丙、丁。旺则喜用水木。

7、甲木日元在申月喜用水木，壬、亥、子。官制煞，用丙调候。

8、甲木日元在酉月喜用水木，丁、丙。丁制然，用丙调候。

9、甲木日元在戌月喜用水木，甲、丙、丁。

10、甲木日元在亥月喜用庚，丁，丙。

11、甲木日元在子月喜丁、丙。性生寒，丙丁调候。

12、甲木日元在丑月喜用丁、丙。火必不可少，地支巳、午、寅为用。

乙木日元用忌神取用法
1、乙木日元寅月丙丁为用。丙火解寒，略取癸水滋润。

2、乙木日元卯月丙、丁为喜用。丙泄秀，不宜见金，庚金另当别论。

3、乙木日元辰月癸、丙，戊。支成水局，取戊为佐。

4、乙木日元巳月甲乙用，专用癸水，调候。

5、乙木日元午月戊己土、丙为喜。者喜水滋润调候。

6、乙木日元未月喜水、丙丁。润土滋木，喜用癸水。

7、乙木日元申月喜用水、次丙丁火。化官杀；丙丁调候，。

8、乙木日元酉月喜水、亥子。喜火制杀为用。

9、乙木日元戌月喜水来滋润，火生财星。

10、乙木日元亥月喜火调候。木向阳，专取丙火。

11、乙木日元子月喜火。木向阳，专取丙火，忌见癸水。

12、乙木日元丑月丙。谷回春，专用丙火。

丙火日元用忌神取用法
1、丙火日元寅月喜金水，壬、庚。水为用，庚金为水之源头。

2、丙火日元卯月喜用土金壬。月木太旺喜抑制。

3、丙火日元辰月喜金水。用壬水，金泄辰土为用。

4、丙火日元巳月水，壬、癸。庚为财星，土泄火气平衡，通关作用。

5、丙火日元午月喜水，羊刃喜官杀制约。土，土化羊刃为喜用。

6、丙火日元未月壬、庚。庚为用。

7、丙火日元申月喜土。帮身为喜用。

8、丙火日元酉月喜木火。者喜土生财。

9、丙火日元戌月喜金水。土晦光，先取木疏土，次用金。

10、丙火日元亥月喜木火。杀喜印星通关。

11、丙火日元子月喜用木火。火调候，用木通关。

12、丙火日元丑月喜木火、金。多不可少木，火需调候。

丁火日元用忌神取用法
1、丁火日元寅月喜金水、命中火旺则选用土。庚金劈甲引丁。

2、丁火日元卯月喜用土金，庚、甲。庚去乙，以甲引丁。

3、丁火日元辰月喜土金，甲、庚。甲木引丁制土，次看庚金。

4、丁火日元巳月喜水金。甲引丁，甲多又取庚为先。

5、丁火日元午月喜土金水，壬、庚、癸。多以庚壬两透为贵。壬用癸，为独煞当权。

6、丁火日元未月喜金水、壬、庚。天需要水调候，庚为财不可缺少。

7、丁火日元申月喜火土，甲木。庚劈甲，无甲用乙。庚甲而用乙者，见丙为枯草引灯。旺用戊。

8、丁火日元酉月喜土金，甲、庚、丙，戊。庚劈甲，无甲用乙。丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。旺用戊。

9、丁火日元戌月喜火土。土无甲，为伤官伤尽。

10、丁火日元亥月喜木火为用。金劈甲引丁，甲木为尊。

11、丁火日元子月喜火土木。寒地冻需火取暖，水生木，木生火，通关为首。

12、丁火日元丑月喜用土金火。天的土需要取火，土才能生金。

戊土日元用忌神取用法
1、戊土日元寅月喜火首要用神。丙照暖，戊土不生，无甲疏劈，戊土不灵。癸滋润，万物不长，先丙，次甲，次癸。

2、戊土日元卯月喜火，次土金。中无水则不吉。

3、戊土日元辰月甲、丙、癸。土司令，先用甲疏，次丙，次癸。

4、戊土日元巳月甲、丙、癸。土建禄，先用甲疏劈，次取丙癸。

5、戊土日元午月壬、甲、丙。候为急，先用壬水，次取甲木，丙火配用。

6、戊土日元未月癸、丙、甲。候为急，癸不可缺，丙火配用。重不能无甲。

7、戊土日元申月丙、癸、甲。气渐增，先用丙火。多，用甲泄之。

8、戊土日元酉月丙、癸。丙照暖，喜水滋润。

9、戊土日元戌月甲、丙，癸。土当权，先用甲木，次取丙火。金，先用癸水，后取丙火。

10、戊土日元亥月甲、丙。甲不灵，非丙不暖。

11、戊土日元子月喜金水，丙，金水不可缺火。

12、戊土日元丑月喜金水首选。

己土日元用忌神取用法
1、己土日元寅月丙、庚，甲。丙解寒，忌见壬水，如水多，须以戊土为佐。多用甲，甲多用庚。

2、己土日元卯月甲、癸，丙。甲忌与己土合化，次用癸水润之。

3、己土日元辰月丙、癸，甲。丙后癸，土暖而润，随用甲疏。

4、己土日元巳月癸、丙。候不能无癸，土润不能无丙。

5、己土日元午月癸、丙。候不能无癸，土润不能无丙。

6、己土日元未月癸、丙。候不能无癸，土润不能无丙。

7、己土日元申月丙、癸。火温土，癸水润土，七月庚金司权，丙能制金，癸以泄金。

8、己土日元酉月丙、癸。辛辅癸。

9、己土日元戌月甲、丙，癸。月土盛，宜甲木疏之，次用丙癸。

10、己土日元亥月丙，甲，戊。冬己土，非丙暖不生。冬壬旺，取戊土制之，土多，取甲木疏之。

11、己土日元子月丙，甲，戊。冬己土非丙暖不生。水太旺，取戊土制之，土多，取甲木疏之。

12、己土日元丑月丙，甲，戊。冬己土非丙暖不生。水太旺，取戊土制之，土多，取甲木疏之。

庚金日元用忌神取用法
1、庚金日元寅月戊，甲，壬，丙，丁。丙煖庚性，虑土厚埋金，须甲疏泄。多用土，支成火局用壬。

2、庚金日元卯月丁，甲，庚，丙。金暗强，专用丁火，借甲引丁，用庚劈甲。丁用丙。

3、庚金日元辰月甲，丁，壬，癸。金宜丁，旺土用甲，不用庚劈。火宜癸，干火宜壬。

4、庚金日元巳月壬，戊，丙，丁。不鎔金，惟喜壬制，次取戊土，丙火为佐。成金局，变弱为强，须用丁火。

5、庚金日元午月壬，癸。用壬水，癸次之，须支见庚辛为助。壬，癸，用戊，己泄火之气。

6、庚金日元未月丁，甲。支会土局，甲先丁后。

7、庚金日元申月丁，甲。用丁火，甲木引丁。

8、庚金日元酉月丁，甲，丙。丁甲煆金，兼用丙火调候。

9、庚金日元戌月甲，壬。厚先用甲疏，次用壬洗。

10、庚金日元亥月丁，丙。冷金寒爱丙丁，甲木辅丁。

11、庚金日元子月丁，甲，丙。取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。丁须临寅巳午未戌支，方为有力。

12、庚金日元丑月喜火土，丙、丁；木为次选。水旺需火暖之乡。

辛金日元用忌神取用法
1、辛金日元寅月己，壬，庚。金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。己并用，人庚为助。

2、辛金日元卯月壬，甲。金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。己并用，人庚为助。

3、辛金日元辰月壬，甲。见丙火合辛，须有癸制丙，支见亥子申，为贵。

4、辛金日元巳月壬，甲，癸。水洗淘，兼有调候之用，更有甲木制戊，一清澈底。

5、辛金日元午月壬，己，癸。无壬不湿，辛无巳不生，故壬，巳并用。壬用癸。

6、辛金日元未月壬，庚，甲。用壬水，取庚为佐，忌戊出，得甲制之，方吉。

7、辛金日元申月壬，甲，戊。水为，甲戊酌用。可用癸水。

8、辛金日元酉月壬，甲。水淘洗，如见戊己，须甲制土，支成金局无壬须用丁火。

9、辛金日元戌月壬，甲。辛金，火土为病，水木为药。

10、辛金日元亥月壬，丙。壬后丙，名金白水清，馀皆酌用。

11、辛金日元子月丙，戊，壬，申。月辛金，不能缺丙火温暖，馀皆酌用。

12、辛金日元丑月丙，壬，戊，己。上，丙先壬后，戊己次之，总之，丙火不可少也。

壬水日元用忌神取用法
1、壬水日元寅月喜木火首选。比劫者，不必用戊，专用庚金。

2、壬水日元卯月戊，辛，庚。春壬水绝地，取庚，辛发水之源。多用戊。

3、壬水日元辰月甲，庚。疏季上，次取庚金发水源，金多预丙制之为妙。

4、壬水日元巳月壬，辛庚，癸。水弱极，取庚，辛为源，壬癸比劫。

5、壬水日元午月癸，庚，辛。庚为源，取癸为佐。庚用辛。

6、壬水日元未月辛，甲。辛金发水源，甲木疏土。

7、壬水日元申月火土，戊，丁。丁火佐戊制庚，戊土通根辰戌，丁火通根午戌，方可为用。

8、壬水日元酉月喜火土。金发水之源，名独水犯庚辛，体全之义。

9、壬水日元戌月甲，丙。甲制戌中戊土。

10、壬水日元亥月戊，丙，庚。甲出制戊，须以庚金为救。

11、壬水日元子月戊，丙。旺宜戊，调候宜丙，丙戊必须兼用。

12、壬水日元丑月丙，丁，甲。半月专用丙火，下半月用丙，甲木为佐。

癸水日元用忌神取用法
1、癸水日元寅月辛，丙。辛生癸水为源，无辛用庚，丙不可少。

2、癸水日元卯月庚，辛。木司令，专用庚金，辛金次之。

3、癸水日元辰月丙，辛，甲。半月专用丙火，下半月虽用丙火，辛甲为佐。

4、癸水日元巳月辛。辛用庚。

5、癸水日元午月庚，辛，壬，癸。辛为生身之本，但丁火司权，金难敌火，宜兼用比劫，方得庚辛之用。

6、癸水日元未月庚，辛，壬，癸。半月金神衰弱，火气炎热，宜比劫帮身，同五月。半月无比劫亦可。

7、癸水日元申月丁。金得禄，必丁火制金为用，丁火以通根午戌未为妙。

8、癸水日元酉月辛，丙。金为用，丙火佐之，名水暖金温，须隔位同透，为妙。

9、癸水日元戌月辛，甲，壬，癸。用辛金，忌戊土，要比劫滋甲，制戊为妙。

10、癸水日元亥月庚，辛，戊，丁。中甲木长生，泄散元神，宜用庚，辛。多用戊，金多用丁。

11、癸水日元子月丙，辛。火解冻，辛金滋扶。

12、癸水日元丑月丙，丁。火解冻，通根寅巳午未戌，方妙，癸巳会党，年透丁火，名雪后灯光，夜生者贵。成火局，又宜用庚辛。
        */
        var ret_powerself = (this.getpowerself(EightDate,buildeight,luckyear,precent)).powerself
        var shishenkey = buildeight.toString()
        var day = EightDate[0]+EightDate[2]+EightDate[6]
        var zhi = EightDate[1]+EightDate[3]+EightDate[5]+EightDate[7]
        
        var o={}
        const daykey = "甲乙丙丁戊己庚辛壬癸"
        const shen = "木火土金水木火土金水"
        var index = Math.floor(daykey.indexOf(EightDate[4])/2)
        var assistindex = (index - 1 + 5)%5
        const testyongshen = "甲乙丙丁戊己庚辛壬癸子丑寅卯辰巳午未申酉戌亥"
        const testyongshenfive = "木木火火土土金金水水水土木木土火火土金金土水"
        var testarray = "木火土金水"
        var retainarray = ""
        for(var ii=0;ii<EightDate.length;ii++){
            var indexx = testyongshen.indexOf(EightDate[ii])
            var five = testyongshenfive[indexx]
            if(-1!=testarray.indexOf(five))
            {
                testarray = testarray.replace(five,"")
                retainarray = retainarray + five
            }
        } 
        if(testarray.length==0)
        {
            //五行全，无通关
        }
        else if(testarray.length==1)
        {
            o.buyongshen = testarray
        }else if(testarray.length==2){

        }else if(testarray.length==3){
            if(retainarray.indexOf("木金") || retainarray.indexOf("金木") )
            {
                o.passyonshen = "水"
            }
            else if(retainarray.indexOf("火金") || retainarray.indexOf("金火") )
            {
                o.passyongshen = "土"
            }
            else if(retainarray.indexOf("土水") || retainarray.indexOf("水土") )
            {
                o.passyongshen = "金"
            }
            else if(retainarray.indexOf("水火") || retainarray.indexOf("火水") )
            {
                o.passyongshen = "木"
            }           
            else if(retainarray.indexOf("土木") || retainarray.indexOf("木土") )
            {
                o.passyongshen = "火"
            }
        }

        var testprecent = precent[assistindex]  + precent[index]
        if(testprecent>(264/2))
        {
            //需要抑制先用官，没有则用食伤
            if(-1!=shishenkey.indexOf("正官")||-1!=shishenkey.indexOf("杀"))
            {
                o.adjustyongshen = shen[(index+3)%5]+"抑"
            }else if(-1!=shishenkey.indexOf("食")||-1!=shishenkey.indexOf("伤")){
                o.adjustyongshen = shen[(index+1)%5]+"抑"
            }else if(-1!=shishenkey.indexOf("财")||-1!=shishenkey.indexOf("才")){
                o.adjustyongshen = shen[(index+2)%5]+"抑"
            }else{
                //这就入旺格了
            }
        }
        else{
            //弱就要扶，先用印，无印用日元
            if(-1!=shishenkey.indexOf("印"))
            {
                o.adjustyongshen =  shen[assistindex]+"扶"
            }
            else if(-1==shishenkey.indexOf("正官") && -1==shishenkey.indexOf("杀") && -1==shishenkey.indexOf("印")){
                //儿童化
                o.adjustyongshen =  shen[index]+"(儿化)"
            }else{
                o.adjustyongshen =  shen[index]+"扶"
            }
        }

        if(-1==ret_powerself.indexOf("旺") && -1==ret_powerself.indexOf("强") )
        {
            if(-1!=shishenkey.indexOf("印"))
            {
                o.yongshen = shen[assistindex]
                o.xishen = shen[index]
                o.xishen2 = ""
                o.xianshen = ""
                o.jishen = shen[(index+2)%5]
                o.jishen2 = ""
                o.choushen = shen[(index+1)%5]
            }else{
                o.yongshen = shen[index]
                o.xishen = shen[assistindex]
                o.xishen2 = ""
                o.xianshen = shen[(index+1)%5]
                o.jishen = shen[(index+3)%5]
                o.jishen2 = ""
                o.choushen = shen[(index+2)%5]
            }

        }else{
            if(-1!=shishenkey.indexOf("正官")||-1!=shishenkey.indexOf("杀"))
            {
                o.yongshen = shen[(index+3)%5]
                o.xishen = shen[(index+2)%5]
                o.xishen2 = ""
                o.xianshen = ""
                o.jishen = shen[(index+1)%5]
                o.jishen2 = shen[index]
                o.choushen = shen[assistindex]
            }else
            {
                o.yongshen = shen[(index+1)%5]
                o.xishen = shen[(index+2)%5] 
                o.xishen2 = shen[(index+3)%5]
                o.xianshen = ""
                o.jishen = shen[index]
                o.jishen2 = ""
                o.choushen = shen[assistindex]
            }
        }

        var test = day+zhi
        //丙火戌月
        if ("丙" == EightDate[4]) {
            if ("戌" == EightDate[3]) {
                //o.jishen = "土"
                if (-1 != test.indexOf("甲") && -1 != test.indexOf("壬") ) {
                    o.yongshen = "木"
                    o.xishen = "水"
                    o.special = "甲壬不能见庚戊"
                } else if (-1 != test.indexOf("甲")) {
                    o.yongshen = "木"
                    o.xishen = "水"
                    o.special = "甲壬不能见庚戊"
                } else if (-1 != test.indexOf("壬")) {
                    o.yongshen = "水"
                    o.xishen = "金"
                    o.special = "壬丙日照山河"
                } else if (-1 != test.indexOf("癸")) {
                    o.yongshen = "水"
                    o.xishen = "金"
                    o.special = "癸水轻贵"
                }else {
                    o.yongshen = "亡"
                    o.xishen = "金"
                    o.special = "用神空亡"
                }
            }
        }
        else if ("丁" == EightDate[4]) {
            
            if ("酉" == EightDate[3]) {
                //8、丁火日元酉月喜土金，甲、庚、丙，戊。庚劈甲，无甲用乙。丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。旺用戊。
                if (-1 != test.indexOf("甲") && -1 != test.indexOf("庚") ) {
                    o.yongshen = "木"
                    o.xishen = "水"
                    o.special = "庚劈甲丙暖金晒甲"
                    o.jishen = "金"
                    o.choushen = "土"
                } else if (-1 == test.indexOf("甲") && -1 != test.indexOf("庚") &&  -1 == test.indexOf("乙") ) {
                    o.yongshen = "木"
                    o.xishen = "水"
                    o.jishen = "金"
                    o.choushen = "土"
                    o.special = "无甲用乙"
                } else if (-1!=ret_powerself.indexOf("旺") && -1 == test.indexOf("戊")) {
                    o.yongshen = "土"
                    o.xishen = "火"
                    o.special = "旺用戊"
                    o.jishen = "木"
                    o.choushen = "水"
                    o.jishen2 = ""
                }
            }
        }
        //特殊的，壬水生于戌月则先甲次丙
        else if ("壬" == EightDate[4]) {
            if ("戌" == EightDate[3]) {
                if (-1 != test.indexOf("甲") && -1 == test.indexOf("戊")) {
                    o.yongshen = "木"
                    o.xishen = "水"
                    o.special = "甲木克戊水辅之"
                    o.jishen = "金"
                    o.jishen2 = ""
                    o.choushen = "土"
                } else if (-1 != test.indexOf("丙")  && -1 != test.indexOf("戊")) {
                    o.yongshen = "火"
                    o.xishen = "木"
                    o.special = "壬丙日照山河"
                    o.jishen = "水"
                    o.jishen2 = ""
                    o.choushen = "金"
                } else {
                    o.yongshen = "火"
                    o.xishen = "木"
                    o.jishen = "土"
                    o.jishen2 = ""
                    o.choushen = "金"
                    o.special = "先甲后丙"
                }
            }
        }


        return o
        /*
        夫妻宫
一.为用神，不受冲合
以命格分析此生在夫妻间契合度有80分，也代表配偶有助力。
二.为用神，被閒神冲
以命格分析此生在夫妻间的契合度约有60分~70分，配偶有时候不是很甘心的帮忙。
三.为用神：被忌神冲
以命格分析此生在夫妻间是(聚少离多，或晚婚)，助力將减弱为60分。
冲忌神(如子用神冲午忌神)
以命格分析此生在夫妻间助力仍大，可得90分，可以早婚。
四.为用神：(一)被合为忌神：以命格分析此生在夫妻间助力减少，仅得60分。(二)被合为用神：以命格分析此生在夫妻间助力增加，可得90分。
五.为閒神：
夫妻间相处状况时好时坏，但以目前社会现象，依您的八字诊断结果还算可以，如果要更好，必须两人一起努力经营婚姻才是。
六.为忌神，不受冲合
以命格分析此生在夫妻间较无助力，请平凡过一生吧。
七.为忌神、受閒神冲
以命格分析此生，显然夫妻间的契合度只有10分，並没有太大的助力。
八.为忌神：(一)被用神冲：以命格分析此生在夫妻间较无助力，但可得20分的助力。(二)冲用神：以命格分析此生配偶无助力，会各自发展事业，夫妻间互动为负80分。
九.为忌神：(一)合为用神：以命格分析此生夫妻间相害力减少，夫妻间仍有助力得50分。(二)合为忌神：以命格分析此生夫妻间相阻力增加，夫妻间互动为负80分。
十.夫妻宫得位(男日支正財、女日支正官)，为用神
以先天命盘分析您的夫妻宫得到正位，以夫妻间的助力会有100分。
十一.夫妻宫得位(男日支正財、女日支正官)，虽为忌神
以先天命盘分析您夫妻宫因得位，故配偶虽无大助力，却可安守本份，兼顾家庭，故有50分。
十二.夫妻宫不喜被爭合如巳日受申月酉时
以先天命盘分析您的婚姻会三心二意，也易有感情纠纷產生。
六神论婚姻
(1)忌官杀多2个以上，日主无气(以女命为主)
→兹因命中注定此生婚姻缘薄，同时容易受夫欺负。
(2)忌印多3个以上，官杀无气(以女命为主)
→一生为女强人，较不得夫缘，丈夫成就平平，若有財生，不在此限。
夫妻间应多多沟通，互相激励共同打拼才对。
(3)忌比劫多，官杀无气(以女命为主)
→一生为女强人，较不得夫缘，若有財生官，不在此限。
(4)忌食伤多，无財生官(以女命为主)
→一生为女强人，较不得夫缘，兹因命中注定，此生难有好婚姻，您难道不能稍微放手吗?
(5)忌財杀官多，日主无气(以女命为主)
→为夫辛劳，夫不感激，若日主有气(有禄刃)，不在此限。
(6)神煞：若八字中有以下三个神煞以上(男、女命同论)
【桃花、华盖、孤辰、寡宿】
兹因命中注定此生难有好婚姻，夫妻间唯有多说好话，多做好事才能改变此一婚姻不美状况。
(1)女命忌庚子日、壬子日、乙卯日、辛酉日
男命忌庚申日
兹因命中注定此生难有好婚姻，有可能会走向离婚的路。
(2)女命忌三透比劫。(天干)
因天生个性使然，不易屈服，算是命中注定此生难有好婚姻。
(3)男女命忌丑戌未三刑於日支
兹因命中注定此生难有好婚姻，因双方都蛮恃势，太自信，欠考虑而种下败因。
(4)男女命忌亡神，劫煞冲於日支
兹因命中注定此生难有好婚姻，因有外力介入，应提防。
(5)男女命忌坐华盖於日支
兹因命中注定此生婚姻因信念不同，而造成婚姻不美。
(6)男女命忌坐孤辰或寡宿於日支
兹因命中注定此生难有好婚姻，是因欠缺沟通而造成，请加强沟通。
(7)女命忌本主同宫。(庚子年、庚子日或甲午年、甲午日)
兹因命中注定此生难有好婚姻，此乃有强出头的情况，需忍耐。
(8)女命忌多合(三合以上)
兹因命中注定此生难有好婚姻，有太多的事绊住了，无自由可言，当然不好。
(9)女命忌月支冲日支
表婚姻不美，在日常生活中，可能无法有琼瑶小说式的浪漫，唯有相互体谅，才能有好的结局。
        */
    }

    in_array(stringToSearch, arrayToSearch) {
        for (var s = 0; s < arrayToSearch.length; s++) {
            var thisEntry = arrayToSearch[s].toString();
            if (thisEntry == stringToSearch) {
                return true;
            }
        }
        return false;
    }

    getlocationself(year, sex) {
        var manlocation = ["坎", "坤", "震", "巽", "坤", "乾", "兑", "艮", "离"]
        var womanlocation = ["坎", "坤", "震", "巽", "艮", "乾", "兑", "艮", "离"]
        var locationself = new Array()
        locationself[0] = new Array()//男
        locationself[1] = new Array()//女
        for (i = 1900; i < 2100; i++) {
            locationself[0][i] = manlocation[(2107 - i) % 9]
            locationself[1][i] = womanlocation[(i + 3) % 9]
            //console.log(locationself[0][i])
            //console.log(locationself[1][i])
        }
        return locationself[sex][year];
    }

    gethouselocation(gua) {
        //这个家宅应该是到2044年的排表
        /*
        八运二十四个山向飞星局 旺山旺向 (旺财旺丁) 
        坐未向丑，坐丑向未，坐亥向巳，坐巳向亥，坐巽向干，坐干向巽。 
        上山下水 (捐财伤丁) 
        坐戌向辰，坐辰向戌，坐申向寅，坐寅向申，坐坤向艮，坐艮向坤。 
        双星到山 (旺丁不旺财) 
        坐壬向丙，坐甲向庚，坐丁向癸，坐酉向卯，坐午向子，坐辛向乙。 
        双星到向 (旺财不旺丁) 
        坐丙向壬，坐庚向甲，坐癸向丁，坐乙向辛，坐卯向酉，坐子向午。 
        */
        var houselocation = new Array()
        houselocation["坎"] = "东四命，坐北向南纳气，正北伏位，正东天医，东南生气，正南延年为吉"
        houselocation["离"] = "东四命，坐南向北纳气，正北延年，正东生气，东南天医，正南伏位为吉"
        houselocation["震"] = "东四命，坐东向西纳气，正北天医，正东伏位，东南延年，正南生气为吉"
        houselocation["巽"] = "东四命，坐东北向西南纳气，正北生气，正东延年，东南伏位，正南天医为吉"
        houselocation["乾"] = "西四命，坐西北向东南纳气，东北天医，西北伏位，正西生气，西南延年为吉"
        houselocation["坤"] = "西四命，坐西南向东北纳气，东北生气，西北延年，正西天医，西南伏位为吉"
        houselocation["艮"] = "西四命，坐东北向西南纳气，东北延年，西北生气，正西伏位，西南天医为吉"
        houselocation["兑"] = "西四命，坐西向东纳气，东北伏位，西北天医，正西延年，西南生气为吉"
        return houselocation[gua]
    }

    parentday(other, self) {
        var map = new Array()
        const daykey = '甲乙丙丁戊己庚辛壬癸'
        var num = daykey.indexOf(other);
        //console.log("parentday",num,self,other)
        map['甲'] = ['比肩', '劫财', '食神', '伤官', '偏财', '正财', '七杀', '正官', '枭印', '正印']
        map['乙'] = ['劫财', '比肩', '伤官', '食神', '正财', '偏财', '正官', '七杀', '正印', '枭印']
        map['丙'] = ['枭印', '正印', '比肩', '劫财', '食神', '伤官', '偏财', '正财', '七杀', '正官']
        map['丁'] = ['正印', '枭印', '劫财', '比肩', '伤官', '食神', '正财', '偏财', '正官', '七杀']
        map['戊'] = ['七杀', '正官', '枭印', '正印', '比肩', '劫财', '食神', '伤官', '偏财', '正财']
        map['己'] = ['正官', '七杀', '正印', '枭印', '劫财', '比肩', '伤官', '食神', '正财', '偏财']
        map['庚'] = ['偏财', '正财', '七杀', '正官', '枭印', '正印', '比肩', '劫财', '食神', '伤官']
        map['辛'] = ['正财', '偏财', '正官', '七杀', '正印', '枭印', '劫财', '比肩', '伤官', '食神']
        map['壬'] = ['食神', '伤官', '偏财', '正财', '七杀', '正官', '枭印', '正印', '比肩', '劫财']
        map['癸'] = ['伤官', '食神', '正财', '偏财', '正官', '七杀', '正印', '枭印', '劫财', '比肩']
        // console.log(map[self][num])
        return map[self][num];

    }

    parentearth(other, self) {
        var map = new Array()
        const daykey = '甲乙丙丁戊己庚辛壬癸'
        var num = daykey.indexOf(self);

        //console.log(num,self,other)
        map['子'] = ['枭印', '正印', '七杀', '正官', '偏财', '正财', '食神', '伤官', '比肩', '劫财']
        map['丑'] = ['正财', '偏财', '伤官', '食神', '劫财', '比肩', '正印', '枭印', '正官', '七杀']
        map['寅'] = ['比肩', '劫财', '枭印', '正印', '七杀', '正官', '偏财', '正财', '食神', '伤官']
        map['卯'] = ['劫财', '比肩', '正印', '枭印', '正官', '七杀', '正财', '偏财', '伤官', '食神']
        map['辰'] = ['偏财', '正财', '食神', '伤官', '比肩', '劫财', '枭印', '正印', '七杀', '正官']
        map['巳'] = ['伤官', '食神', '劫财', '比肩', '正印', '枭印', '正官', '七杀', '正财', '偏财']
        map['午'] = ['食神', '伤官', '比肩', '劫财', '枭印', '正印', '七杀', '正官', '偏财', '正财']
        map['未'] = ['正财', '偏财', '伤官', '食神', '劫财', '比肩', '正印', '枭印', '正官', '七杀']
        map['申'] = ['七杀', '正官', '偏财', '正财', '食神', '伤官', '比肩', '劫财', '枭印', '正印']
        map['酉'] = ['正官', '七杀', '正财', '偏财', '伤官', '食神', '劫财', '比肩', '正印', '枭印']
        map['戌'] = ['偏财', '正财', '食神', '伤官', '比肩', '劫财', '枭印', '正印', '七杀', '正官']
        map['亥'] = ['正印', '枭印', '正官', '七杀', '正财', '偏财', '伤官', '食神', '劫财', '比肩']
        //console.log(map[other][num])
        return map[other][num];

    }

    gethide(key) {
        //console.log("gethide",key)

        var r = "";
        var i = 0;
        //console.log(key)
        while (undefined != hidetable[key][i]) {
            r = r + hidetable[key][i][0]
            i++
        }
        return r

    }
    gethideshishen(other, self) {
        var r = ""
        var i = 0
        //console.log("gethideshishen",other,self)
        while (undefined != other[i]) {
            r = r + this.parentday(other[i], self)
            i++
        }
        return r;
    }

    getfive(key) {
        //console.log(key)
        var p = new Array()
        var q = new Array()
        var i = 0;
        for (i = 0; i < 10; i++) {
            var m = daykey[i]
            p[m] = 0;
            q[i] = 0;
        }

        for (i = 0; i < 8; i = i + 2) {
            var m = key[i]
            p[m] = p[m] + 36
        }
        //console.log(p);
        for (i = 1; i < 8; i = i + 2) {
            var n = 0
            var m = key[i]
            while (undefined != hidetable[m][n]) {
                var t = hidetable[m][n][0]
                var v = Number(hidetable[m][n].slice(2))
                p[t] = p[t] + v;
                n++
            }
        }
        for (i = 1; i <= 5; i++) {
            var m = daykey[i * 2 - 1]
            var n = daykey[i * 2 - 2]
            q[i - 1] = Number(p[m]) + Number(p[n]);
            q[i + 4] = Math.floor(q[i - 1] / 264 * 1000) / 10
        }
        //console.log(q)
        //console.log(p);
        return { p, q }

    }
    getrelationshipcombe(arr) {

        var e = new Array()
        e = e.concat(arr)
        console.log("getrelationshipcombe", e, arr)
        var er = new Array()
        //三会局
        if (true == this.in_array('寅', e) && true == this.in_array('卯', e) && true == this.in_array('辰', e)) {
            er.push( "寅卯辰三会东方木" + " ")
        }
        if (true == this.in_array('巳', e) && true == this.in_array('午', e) && true == this.in_array('未', e)) {
            er.push( "巳午未三会南方火" + " ")
        }
        if (true == this.in_array('申', e) && true == this.in_array('酉', e) && true == this.in_array('戌', e)) {
            er.push(  "申酉戌三会西方金" + " ")
        }
        if (true == this.in_array('亥', e) && true == this.in_array('子', e) && true == this.in_array('丑', e)) {
            er.push( "亥子丑三会北方水" + " ")
        }

        //三合局 申子辰合水 亥卯未合木 寅午戌合火 巳酉丑合金
        if (true == this.in_array('申', e) && true == this.in_array('子', e) && true == this.in_array('辰', e)) {
            er.push( "申子辰三合水" + " ")
        }
        if (true == this.in_array('亥', e) && true == this.in_array('卯', e) && true == this.in_array('未', e)) {
            er.push( "亥卯未三合木" + " ")
        }
        if (true == this.in_array('寅', e) && true == this.in_array('午', e) && true == this.in_array('戌', e)) {
            er.push( "寅午戌三合火" + " ")
        }
        if (true == this.in_array('巳', e) && true == this.in_array('酉', e) && true == this.in_array('丑', e)) {
            er.push( "巳酉丑三合金" + " ")
        }

        //三刑
        if (true == this.in_array('寅', e) && true == this.in_array('巳', e) && true == this.in_array('申', e)) {
            er.push( "地支无恩之刑，无人赏识，易被嫌弃，不得回报" + " ")
        }
        if ((true == this.in_array('寅', e) && true == this.in_array('巳', e)) || (true == this.in_array('申', e) && true == this.in_array('寅', e)) || (true == this.in_array('申', e) && true == this.in_array('巳', e))) {
            er.push( "地支无恩隐刑，无人赏识，易被嫌弃，不得回报" + " ")
        }
        if (true == this.in_array('丑', e) && true == this.in_array('未', e) && true == this.in_array('戌', e)) {
            er.push( "地支恃势之刑，太过自信，固执自负，考虑不周" + " ")
        }
        if ((true == this.in_array('丑', e) && true == this.in_array('未', e)) || (true == this.in_array('丑', e) && true == this.in_array('戌', e)) || (true == this.in_array('未', e) && true == this.in_array('戌', e))) {
            er.push( "地支恃势隐刑，太过自信，固执自负，考虑不周" + " ")
        }
        return er
    }
    getrelationship(key, year, bigyears, sex) {

        var earthrelationship = new Array()
        var earthcombe = new Array
        for (i = 0; i < earthkey.length; i++) {
            var index = earthkey[i]
            earthrelationship[index] = new Array();
            earthcombe[index] = new Array();
        }
        //六合
        earthrelationship['子']['丑'] = '子丑合土，容易沟通，为人顾家'
        earthrelationship['丑']['子'] = earthrelationship['子']['丑']
        earthrelationship['寅']['亥'] = '寅亥合木，热情有礼'
        earthrelationship['亥']['寅'] = earthrelationship['寅']['亥']
        earthrelationship['卯']['戌'] = '卯戌合火，较爱面子，注重外表，外强内柔'
        earthrelationship['戌']['卯'] = earthrelationship['卯']['戌']
        earthrelationship['辰']['酉'] = '辰酉合金，较重义气，但无常性'
        earthrelationship['酉']['辰'] = earthrelationship['辰']['酉']
        earthrelationship['巳']['申'] = '巳申合水，聪明反误'
        earthrelationship['申']['巳'] = earthrelationship['巳']['申']
        earthrelationship['午']['未'] = '午未合火，生性积极，脾气不好，仅凭感觉，有些任性'
        earthrelationship['未']['午'] = earthrelationship['午']['未']
        //六冲 子午相冲、丑未相冲、寅申相冲、卯酉相冲、辰戌相冲、巳亥相冲
        earthrelationship['子']['午'] = '子午相冲，桃花旺象，困惑不解，一身不安'
        earthrelationship['午']['子'] = earthrelationship['子']['午']
        earthrelationship['丑']['未'] = '丑未相冲，固执相持，事多逆阻，职业相冲'
        earthrelationship['未']['未'] = earthrelationship['丑']['未']
        earthrelationship['寅']['申'] = '寅申相冲，车关有害，多情泛滥，好管闲事'
        earthrelationship['申']['寅'] = earthrelationship['寅']['申']
        earthrelationship['卯']['酉'] = '卯酉相冲，桃花旺象，背约失信，色情纠缠'
        earthrelationship['酉']['卯'] = earthrelationship['卯']['酉']
        earthrelationship['辰']['戌'] = '辰戌相冲，克亲伤子，寿短害命，天冲地克'
        earthrelationship['戌']['辰'] = earthrelationship['辰']['戌']
        earthrelationship['巳']['亥'] = '巳亥相冲，机会多多，烦事繁多，喜欢助人'
        earthrelationship['亥']['巳'] = earthrelationship['巳']['亥']
        //六害 子未相害、丑午相害、寅巳相害、卯辰相害、申亥相害、酉戌相害
        earthrelationship['子']['未'] = '子未相害，多犯小人，易早分离'
        earthrelationship['未']['子'] = earthrelationship['子']['未']
        earthrelationship['丑']['午'] = '丑午相害，耐性较少，脾气较差'
        earthrelationship['午']['丑'] = earthrelationship['丑']['午']
        earthrelationship['寅']['巳'] = '寅巳相害，无恩之刑，难安在家'
        earthrelationship['巳']['寅'] = earthrelationship['寅']['巳']
        earthrelationship['卯']['辰'] = '卯辰相害，手足相害'
        earthrelationship['辰']['卯'] = earthrelationship['卯']['辰']
        earthrelationship['申']['亥'] = '申亥相害，是非多多'
        earthrelationship['亥']['申'] = earthrelationship['申']['亥']
        earthrelationship['酉']['戌'] = '酉戌相害，鸡犬不宁'
        earthrelationship['戌']['酉'] = earthrelationship['酉']['戌']
        //自刑 辰午酉亥自相刑
        earthrelationship['辰']['辰'] = '辰辰自刑，达非所愿'
        earthrelationship['亥']['亥'] = '亥亥自刑，无理取闹'
        earthrelationship['午']['午'] = '午午自刑，事与愿违'
        earthrelationship['酉']['酉'] = '酉酉自刑，不的认同'
        earthrelationship['子']['卯'] = earthrelationship['卯']['子'] = '子卯之刑，眼光略高，说话较直，易无礼貌'
        //地支相互破
        earthrelationship['子']['酉'] = '子酉相破，财经不稳'
        earthrelationship['酉']['子'] = earthrelationship['子']['酉']
        earthrelationship['寅']['亥'] = '寅亥相破，优柔寡断、败而复成、六反皆成'
        earthrelationship['亥']['寅'] = earthrelationship['寅']['亥']
        earthrelationship['辰']['丑'] = '辰丑相破，六亲难谐、多见不睦'
        earthrelationship['丑']['辰'] = earthrelationship['辰']['丑']
        earthrelationship['卯']['午'] = '卯午相破，多见纷争、情感为害'
        earthrelationship['午']['卯'] = earthrelationship['卯']['午']
        earthrelationship['巳']['申'] = '巳申相破，仿照力强、办事不定'
        earthrelationship['申']['巳'] = earthrelationship['巳']['申']
        earthrelationship['未']['戌'] = '未戌相破，为人城府'
        earthrelationship['戌']['未'] = earthrelationship['未']['戌']
        //申子、亥卯、寅午、巳酉相合称生地半合。子辰、卯未、午戌、酉丑相合称墓地半合
        earthcombe['申']['子'] = '申子生半合水，思想多变，聪明伶俐，冷漠寡淡'
        earthcombe['子']['申'] = earthcombe['申']['子']
        earthcombe['亥']['卯'] = '亥卯生半合木，不切实际'
        earthcombe['卯']['亥'] = earthcombe['亥']['卯']
        earthcombe['寅']['午'] = '寅午生半合火，事半功倍，执行力好，热情有貌'
        earthcombe['午']['寅'] = earthcombe['寅']['午']
        earthcombe['巳']['酉'] = '巳酉生半合金，爱强出头，血光之灾'
        earthcombe['酉']['巳'] = earthcombe['巳']['酉']
        earthcombe['辰']['子'] = '子辰墓半合水，思想多变，聪明伶俐，冷漠寡淡'
        earthcombe['子']['辰'] = earthcombe['辰']['子']
        earthcombe['卯']['未'] = '卯未墓半合木，不切实际'
        earthcombe['未']['卯'] = earthcombe['卯']['未']
        earthcombe['午']['戌'] = '午戌墓半合火，事半功倍，执行力好，热情有礼'
        earthcombe['戌']['午'] = earthcombe['午']['戌']
        earthcombe['酉']['丑'] = '酉丑墓半合金，爱强出头，血光之灾'
        earthcombe['丑']['酉'] = earthcombe['酉']['丑']
        earthcombe['辰']['申'] = '申辰拱合化水，思想多变，聪明伶俐，冷漠寡淡'
        earthcombe['申']['辰'] = earthcombe['辰']['申']
        earthcombe['亥']['未'] = '亥未拱合化木，不切实际'
        earthcombe['未']['亥'] = earthcombe['亥']['未']
        earthcombe['寅']['戌'] = '寅戌拱合化火，事半功倍，执行力好，热情有礼'
        earthcombe['戌']['寅'] = earthcombe['寅']['戌']
        earthcombe['巳']['丑'] = '巳丑拱合化金，爱强出头，血光之灾'
        earthcombe['丑']['巳'] = earthcombe['巳']['丑']
        //console.log("getrelationship",bigyears)
        var dr = new Array()
        var er = new Array()
        var lr = new Array();
        var br = new Array();
        var d = new Array();
        var e = new Array();
        var bdyear = bigyears[0]
        var bzyear = bigyears[1]
        for (i = 0; i < 4; i++) {
            d[i] = key[i * 2]
            e[i] = key[i * 2 + 1]
        }

        var yy, mm, dd, tt;
        yy = d[0],
            mm = d[1],
            dd = d[2],
            tt = d[3]

        var dayrelationship = new Array();
        for (i = 0; i < daykey.length; i++) {
            var index = daykey[i]
            dayrelationship[index] = new Array();
        }
        dayrelationship['甲']['己'] = '甲己化土，中正之合，安分守己，淳朴敦厚'
        dayrelationship['己']['甲'] = dayrelationship['甲']['己']
        dayrelationship['乙']['庚'] = '乙庚化金，仁义之合，刚柔兼备，重信守义'
        dayrelationship['庚']['乙'] = dayrelationship['乙']['庚']
        dayrelationship['丙']['辛'] = '丙辛化水，威严之合，仪表威严，表现出众'
        dayrelationship['辛']['丙'] = dayrelationship['丙']['辛']
        dayrelationship['丁']['壬'] = '丁壬化木，仁寿之合，心地仁慈，长命多寿'
        dayrelationship['戊']['癸'] = '戊癸化火，无情之合，妩媚多情，薄情寡义'
        dayrelationship['癸']['戊'] = dayrelationship['戊']['癸']

        //丁壬化木需要亥卯未寅月，火旺为妒合，水旺为淫昵之合，木旺
        if (-1  != d.indexOf("丙") && "巳午".indexOf(e[1]) && "壬癸".indexOf(d[2]) && "乾造" == sex) { //男水命火旺
            dayrelationship['丁']['壬'] = '丁壬化木，淫匿之合，贪婪之态，枕欢溺爱'
        }
        else if (-1  != d.indexOf("丙") &&"子亥".indexOf(e[1]) && "丁".indexOf(d[2]) && "坤造" == sex) { //女火命水旺
            dayrelationship['丁']['壬'] = '丁壬化木，淫匿之合，贪婪之态，枕欢溺爱'
        }
        dayrelationship['壬']['丁'] = dayrelationship['丁']['壬']

        if (undefined != dayrelationship[yy][mm] && e) {
            dr.push("年月" + dayrelationship[yy][mm] + " ")
        }

        if (undefined != dayrelationship[yy][dd]) {
            dr.push("年日" + dayrelationship[yy][dd] + " ")
        }
        if (undefined != dayrelationship[yy][tt]) {
            dr.push("年时" + dayrelationship[yy][tt] + " ")
        }

        if (undefined != dayrelationship[mm][dd]) {
            dr.push("月日" + dayrelationship[mm][dd] + " ")
        }

        if (undefined != dayrelationship[mm][tt]) {
            dr.push("月时" + dayrelationship[mm][tt] + " ")
        }

        if (undefined != dayrelationship[dd][tt]) {
            dr.push("时日" + dayrelationship[dd][tt] + " ")
        }


        if (undefined != dayrelationship[bdyear][yy]) {
            dr.push("大运年年" + dayrelationship[bdyear][yy] + " ")
        }
        if (undefined != dayrelationship[bdyear][mm]) {
            dr.push("大运年月" + dayrelationship[bdyear][mm] + " ")
        }

        if (undefined != dayrelationship[bdyear][dd]) {
            dr.push("大运年日" + dayrelationship[bdyear][dd] + " ")
        }
        if (undefined != dayrelationship[bdyear][tt]) {
            dr.push("大运年时" + dayrelationship[bdyear][tt] + " ")
        }
        if ("" == dr) {
            dr.push("八字天干无合")
        }

        yy = e[0],
            mm = e[1],
            dd = e[2],
            tt = e[3]

        //六合，六冲，六害，自刑
        if (undefined != earthrelationship[yy][mm]) {
            er.push("年月" + earthrelationship[yy][mm] + " ")
            if (-1 != earthrelationship[yy][mm].indexOf("冲")) {
                //er.push("年月相冲，离祖别乡" + " ")
            }
        }

        if (undefined != earthrelationship[yy][dd]) {
            er.push("年日" + earthrelationship[yy][dd] + " ")
            if (-1 != earthrelationship[yy][dd].indexOf("冲")) {
                //er.push( "年日相冲, 与亲不和" + " ")
            }
        }
        if (undefined != earthrelationship[yy][tt]) {
            er.push("年时" + earthrelationship[yy][tt] + " ")
            if (-1 != earthrelationship[yy][tt].indexOf("冲")) {
                //er.push("年时相冲, 与子不和" + " ")
            }
        }

        if (undefined != earthrelationship[mm][dd]) {
            er.push("月日" + earthrelationship[mm][dd] + " ")
            if (-1 != earthrelationship[mm][dd].indexOf("冲")) {
                //er.push("日冲月支, 犯父母兄弟" + " ")
            }
        }

        if (undefined != earthrelationship[mm][tt]) {
            er.push("月时" + earthrelationship[mm][tt] + " ")
            if (-1 != earthrelationship[mm][tt].indexOf("冲")) {
                //er.push( "四柱逢冲, 多不居父母家，隔冲冲力减弱" + " ")
            }
        }

        if (undefined != earthrelationship[dd][tt]) {
            er.push("时日" + earthrelationship[dd][tt] + " ")
            if (-1 != earthrelationship[dd][tt].indexOf("冲")) {
                //er.push( "四柱逢冲, 多不居父母家，隔冲冲力减弱" + " ")
            }
        }



        //三合三会半合

        if (undefined != earthcombe[yy][mm]) {
            er.push(earthcombe[yy][mm] + " ")
        }

        if (undefined != earthcombe[yy][dd]) {
            er.push(earthcombe[yy][dd] + " ")
        }
        if (undefined != earthcombe[yy][tt]) {
            er.push(earthcombe[yy][tt] + " ")
        }

        if (undefined != earthcombe[mm][dd]) {
            er.push(earthcombe[mm][dd] + " ")
        }
        if (undefined != earthcombe[mm][tt]) {
            er.push(earthcombe[mm][tt] + " ")
        }
        if (undefined != earthcombe[dd][tt]) {
            er.push(earthcombe[dd][tt] + " ")
        }

        er.concat(this.getrelationshipcombe(e))


        if (undefined != earthrelationship[yy][year]) {
            lr.push("流年" + earthrelationship[yy][year] + " ")
        }

        if (undefined != earthrelationship[dd][year]) {
            lr.push("流年日" + earthrelationship[dd][year] + " ")
            if (-1 != earthrelationship[dd][year].indexOf("冲")) {
                //lr.push("年日相冲, 与亲不和" + " ")
            }
        }
        if (undefined != earthrelationship[tt][year]) {
            lr.push("流年时" + earthrelationship[tt][year] + " ")
            if (-1 != earthrelationship[tt][year].indexOf("冲")) {
                //lr.push("年时相冲, 与子不和" + " ")
            }
        }

        if (undefined != earthrelationship[mm][year]) {
            lr.push("流年月" + earthrelationship[mm][year] + " ")
            if (-1 != earthrelationship[mm][year].indexOf("冲")) {
                //lr.push("年月相冲，离祖别乡" + " ")
            }
        }

        e[4] = year
        lr = lr.concat(this.getrelationshipcombe(e))
        if (null == lr.length) {
            lr.push("流年八字地支无刑冲克害")
        }


        if (undefined != earthrelationship[yy][bzyear]) {
            br.push("大运年年" + earthrelationship[yy][bzyear] + " ")
        }
        if (undefined != earthrelationship[mm][bzyear]) {
            br.push("大运年月" + earthrelationship[mm][bzyear] + " ")
            if (-1 != earthrelationship[mm][bzyear].indexOf("冲")) {
                //br.push("年月相冲，离祖别乡" + " ")
            }
        }
        if (undefined != earthrelationship[dd][bzyear]) {
            br.push("大运年日" + earthrelationship[dd][bzyear] + " ")
            if (-1 != earthrelationship[dd][bzyear].indexOf("冲")) {
                //br.push("年日相冲, 与亲不和" + " ")
            }
        }
        if (undefined != earthrelationship[tt][bzyear]) {
            br.push("大运年时" + earthrelationship[tt][bzyear] + " ")
            if (-1 != earthrelationship[tt][bzyear].indexOf("冲")) {
                //br.push("年时相冲, 与子不和" + " ")
            }
        }
        e[5] = bigyears[1]
        br = br.concat(this.getrelationshipcombe(e))

        if (null == br.length) {
            br.push("大运八字地支无刑冲克害")
        }
        if (null == er.length) {
            er.push("八字地支无刑冲克害")
        }
        return { dr, er, lr, br };
    }

    gettwelfthposition(key) {

        var twelfthposition = new Array();
        twelfthposition["甲亥"] = twelfthposition["乙午"] = twelfthposition["丙寅"] = twelfthposition["丁酉"] = twelfthposition["戊寅"] = "长生"
        twelfthposition["己酉"] = twelfthposition["庚巳"] = twelfthposition["辛子"] = twelfthposition["壬申"] = twelfthposition["癸卯"] = "长生"
        twelfthposition["甲子"] = twelfthposition["乙巳"] = twelfthposition["丙卯"] = twelfthposition["丁申"] = twelfthposition["戊卯"] = "沐浴"
        twelfthposition["己申"] = twelfthposition["庚午"] = twelfthposition["辛亥"] = twelfthposition["壬酉"] = twelfthposition["癸寅"] = "沐浴"
        twelfthposition["甲丑"] = twelfthposition["乙辰"] = twelfthposition["丙辰"] = twelfthposition["丁未"] = twelfthposition["戊辰"] = "冠带"
        twelfthposition["己未"] = twelfthposition["庚未"] = twelfthposition["辛戌"] = twelfthposition["壬戌"] = twelfthposition["癸丑"] = "冠带"
        twelfthposition["甲寅"] = twelfthposition["乙卯"] = twelfthposition["丙巳"] = twelfthposition["丁午"] = twelfthposition["戊巳"] = "建禄"
        twelfthposition["己午"] = twelfthposition["庚申"] = twelfthposition["辛酉"] = twelfthposition["壬亥"] = twelfthposition["癸子"] = "建禄"
        twelfthposition["甲卯"] = twelfthposition["乙寅"] = twelfthposition["丙午"] = twelfthposition["丁巳"] = twelfthposition["戊午"] = "帝旺"
        twelfthposition["己巳"] = twelfthposition["庚酉"] = twelfthposition["辛申"] = twelfthposition["壬子"] = twelfthposition["癸亥"] = "帝旺"
        twelfthposition["甲辰"] = twelfthposition["乙丑"] = twelfthposition["丙未"] = twelfthposition["丁辰"] = twelfthposition["戊未"] = "衰地"
        twelfthposition["己辰"] = twelfthposition["庚戌"] = twelfthposition["辛未"] = twelfthposition["壬丑"] = twelfthposition["癸戌"] = "衰地"
        twelfthposition["甲巳"] = twelfthposition["乙子"] = twelfthposition["丙申"] = twelfthposition["丁卯"] = twelfthposition["戊申"] = "病地"
        twelfthposition["己卯"] = twelfthposition["庚亥"] = twelfthposition["辛午"] = twelfthposition["壬寅"] = twelfthposition["癸酉"] = "病地"
        twelfthposition["甲午"] = twelfthposition["乙亥"] = twelfthposition["丙酉"] = twelfthposition["丁寅"] = twelfthposition["戊酉"] = "死地"
        twelfthposition["己寅"] = twelfthposition["庚子"] = twelfthposition["辛巳"] = twelfthposition["壬卯"] = twelfthposition["癸申"] = "死地"
        twelfthposition["甲未"] = twelfthposition["乙戌"] = twelfthposition["丙戌"] = twelfthposition["丁丑"] = twelfthposition["戊戌"] = "墓地"
        twelfthposition["己丑"] = twelfthposition["庚丑"] = twelfthposition["辛辰"] = twelfthposition["壬辰"] = twelfthposition["癸未"] = "墓地"
        twelfthposition["甲申"] = twelfthposition["乙酉"] = twelfthposition["丙亥"] = twelfthposition["丁子"] = twelfthposition["戊亥"] = "绝地"
        twelfthposition["己子"] = twelfthposition["庚寅"] = twelfthposition["辛卯"] = twelfthposition["壬巳"] = twelfthposition["癸午"] = "绝地"
        twelfthposition["甲酉"] = twelfthposition["乙申"] = twelfthposition["丙子"] = twelfthposition["丁亥"] = twelfthposition["戊子"] = "胎地"
        twelfthposition["己亥"] = twelfthposition["庚卯"] = twelfthposition["辛寅"] = twelfthposition["壬午"] = twelfthposition["癸巳"] = "胎地"
        twelfthposition["甲戌"] = twelfthposition["乙未"] = twelfthposition["丙丑"] = twelfthposition["丁戌"] = twelfthposition["戊丑"] = "养地"
        twelfthposition["己戌"] = twelfthposition["庚辰"] = twelfthposition["辛丑"] = twelfthposition["壬未"] = twelfthposition["癸辰"] = "养地"
        return twelfthposition[key];
    }

    gettwelfth(key) {

        var twelfth = new Array();
        twelfth["甲子"] = twelfth["乙丑"] = "海中金"
        twelfth["丙寅"] = twelfth["丁卯"] = "炉中火"
        twelfth["戊辰"] = twelfth["己巳"] = "大林木"
        twelfth["庚午"] = twelfth["辛未"] = "路旁土"
        twelfth["壬申"] = twelfth["癸酉"] = "剑锋金"
        twelfth["甲戌"] = twelfth["乙亥"] = "山头火"
        twelfth["丙子"] = twelfth["丁丑"] = "涧下水"
        twelfth["戊寅"] = twelfth["己卯"] = "城头土"
        twelfth["庚辰"] = twelfth["辛巳"] = "白蜡金"
        twelfth["壬午"] = twelfth["癸未"] = "杨柳木"
        twelfth["甲申"] = twelfth["乙酉"] = "井泉水"
        twelfth["丙戌"] = twelfth["丁亥"] = "屋上土"
        twelfth["戊子"] = twelfth["己丑"] = "霹雳火"
        twelfth["庚寅"] = twelfth["辛卯"] = "松柏木"
        twelfth["壬辰"] = twelfth["癸巳"] = "长流水"
        twelfth["甲午"] = twelfth["乙未"] = "砂中金"
        twelfth["丙申"] = twelfth["丁酉"] = "山下火"
        twelfth["戊戌"] = twelfth["己亥"] = "平地木"
        twelfth["庚子"] = twelfth["辛丑"] = "璧上土"
        twelfth["壬寅"] = twelfth["癸卯"] = "金箔金"
        twelfth["甲辰"] = twelfth["乙巳"] = "覆灯火"
        twelfth["丙午"] = twelfth["丁未"] = "天河水"
        twelfth["戊申"] = twelfth["己酉"] = "大驿土"
        twelfth["庚戌"] = twelfth["辛亥"] = "钗钏金"
        twelfth["壬子"] = twelfth["癸丑"] = "桑柘木"
        twelfth["甲寅"] = twelfth["乙卯"] = "大溪水"
        twelfth["丙辰"] = twelfth["丁巳"] = "砂中土"
        twelfth["戊午"] = twelfth["己未"] = "天上火"
        twelfth["庚申"] = twelfth["辛酉"] = "石榴木"
        twelfth["壬戌"] = twelfth["癸亥"] = "大海水"
        return twelfth[key];
    }
    getbigluckyear(key, sex) {
        //console.log(key,sex)
        var luckyear = new Array();
        luckyear.push("甲子");
        luckyear.push("乙丑");
        luckyear.push("丙寅")
        luckyear.push("丁卯")
        luckyear.push("戊辰")
        luckyear.push("己巳")
        luckyear.push("庚午")
        luckyear.push("辛未")
        luckyear.push("壬申")
        luckyear.push("癸酉")
        luckyear.push("甲戌")
        luckyear.push("乙亥")
        luckyear.push("丙子")
        luckyear.push("丁丑")
        luckyear.push("戊寅")
        luckyear.push("己卯")
        luckyear.push("庚辰")
        luckyear.push("辛巳")
        luckyear.push("壬午")
        luckyear.push("癸未")
        luckyear.push("甲申")
        luckyear.push("乙酉")
        luckyear.push("丙戌")
        luckyear.push("丁亥")
        luckyear.push("戊子")
        luckyear.push("己丑")
        luckyear.push("庚寅")
        luckyear.push("辛卯")
        luckyear.push("壬辰")
        luckyear.push("癸巳")
        luckyear.push("甲午")
        luckyear.push("乙未")
        luckyear.push("丙申")
        luckyear.push("丁酉")
        luckyear.push("戊戌")
        luckyear.push("己亥")
        luckyear.push("庚子")
        luckyear.push("辛丑")
        luckyear.push("壬寅")
        luckyear.push("癸卯")
        luckyear.push("甲辰")
        luckyear.push("乙巳")
        luckyear.push("丙午")
        luckyear.push("丁未")
        luckyear.push("戊申")
        luckyear.push("己酉")
        luckyear.push("庚戌")
        luckyear.push("辛亥")
        luckyear.push("壬子")
        luckyear.push("癸丑")
        luckyear.push("甲寅")
        luckyear.push("乙卯")
        luckyear.push("丙辰")
        luckyear.push("丁巳")
        luckyear.push("戊午")
        luckyear.push("己未")
        luckyear.push("庚申")
        luckyear.push("辛酉");
        luckyear.push("壬戌");
        luckyear.push("癸亥");

        var pos = "甲丙戊庚壬"
        var neg = "乙丁己辛癸"
        var ord = key[2] + key[3];
        if (pos.indexOf(key[0]) >= 0) {
            //key为年干男顺女逆
            if (sex == "乾造") {
                for (var i = 0; i < 60; i++) {
                    if (ord == luckyear[i]) {

                        var ret = new Array()
                        for (var x = i + 1; x < i + 9; x++) {
                            ret.push(luckyear[(x % 60)]);
                        }
                        return ret;
                    }
                }

            }
            else {
                for (var i = 0; i < 60; i++) {
                    if (ord == luckyear[i]) {

                        var ret = new Array()
                        for (var x = i - 1 + 60; x > i - 9 + 60; x--) {
                            ret.push(luckyear[(x % 60)]);
                        }
                        return ret;
                    }
                }

            }

        }
        else (neg.indexOf(key[0]) >= 0)
        {
            //key为年干女顺男逆
            if (sex == "乾造") {
                for (var i = 0; i < 60; i++) {
                    if (ord == luckyear[i]) {
                        var ret = new Array()
                        for (var x = i - 1 + 60; x > i - 9 + 60; x--) {
                            ret.push(luckyear[(x % 60)]);
                        }
                        return ret;
                    }
                }
            }
            else {
                for (var i = 0; i < 60; i++) {
                    if (ord == luckyear[i]) {
                        var ret = new Array()
                        for (var x = i + 1; x < i + 9; x++) {
                            ret.push(luckyear[(x % 60)]);
                        }
                        return ret;
                    }
                }

            }
        }
    }
    getselfinfo(key) {
        var daydetial = new Array();
        daydetial["甲子"] = ["天德贵人日。坐子、沐浴，逢官临桃花。"
                            ,"沐浴"]
        var dayself = new Array();
        dayself["甲子"] = "上等日柱，得到配偶助益，配偶漂亮，但恐婚姻不利。甲木为栋梁之木，木主仁，坐下正印，为身高体健，慈祥恺悌，相貌俊秀。印为文书，身坐文书，主才学超群，有权柄。印又有生身助学之功，故主人记忆力强，学习成绩优秀。"
        dayself["戊辰"] = "上等日柱，通根身旺，坐财官比肩，但支中比肩财星化火为印，变成官印相生，故主高贵。支内戊癸化火生土，而辰本为湿土，内中有火，温暖中和，能生万物，必然根深叶茂，秀气有成。"
        dayself["庚午"] = "上等日柱，配偶英俊漂亮，利于配偶。身坐正官正印，气质清纯，必主官贵，但金坐火地，须经火炼，千锤百炼，所以仕途坎坷，有大起，也有大落。"
        dayself["丙子"] = "上等日柱，阴阳杀。阴阳差错，配偶英俊漂亮，但婚姻不顺利。为六秀，主人聪明秀气。丙火坐子无根，主人身矮。丙为太阳主光明，而子鼠狡猾，子中癸水阴湿，故主人性格双重。身坐正官，一权在握，往往自以为是，独裁固执。"
        dayself["庚辰"] = "上等日柱，十恶大败。魁罡，身坐正财、伤官、偏印，主人有财禄，聪明有学识，支中伤官带偏印有贵气，而戊癸化火为官杀，变成日坐财官，可做官，但隐含伤官，可能喜开杀戒。"
        dayself["辛巳"] = "上等日柱，十恶大败。利于婚姻。身坐正印正官劫财，辛金柔弱，有正印生身，劫财帮助，由弱转旺，而正官丙火制衡，使干支中和，必主官贵，富于成功。大多有志难伸。"
        dayself["壬午"] = "上等日柱，九鬼妨害，但恐夫妻不睦。坐下财官，无杂气，多主官贵，丁壬合财，主得妻财或因妻制富。但壬午不如癸巳，癸巳财官双美无杂气，又为日贵。另外，壬水盖头有掩火之嫌，故虽有官贵，也难免大起大落。"
        dayself["丁亥"] = "上等日柱，十恶大败，坐下正印官星，官印相生，主聪明超群，丁壬合化印星，坐贵，主官贵，与大贵人有缘。女命丁亥，可嫁贵夫。"
        dayself["戊子"] = "上等日柱，九鬼妨害，又为六秀日，主人聪明秀气，坐正财，得贤妻，因妻制富，干支戊癸化火生身，主高贵。"
        dayself["癸巳"] = "上等日柱，孤鸾煞，阴阳差错，不利婚姻。身坐正官正印正财，财官印连生，循环清正，主高贵富贵或清贵，且身康体健有钱，生活富裕，女名癸巳，可嫁贵夫。"
        dayself["丁酉"] = "上等日柱，日贵。配偶风流。坐长生偏财、夜贵、文昌，主人高贵聪明，见识超群，受人钦敬，另有叛逆创新性格。"
        dayself["己亥"] = "上等日柱，配偶长寿。坐正财正官，为财官双美，主贵。女命己亥，也可嫁贵夫。"
        dayself["癸卯"] = "上等日柱，日贵。配偶风流。坐长生、日贵，食神吐秀，主人聪明有文才。女命癸卯，生子读书有成。"
        dayself["乙巳"] = "上等日柱，十恶大败。孤鸾煞，但恐有些人不利婚姻。乙木向阳，英华外发，主人聪明，但泄气，只利他人，不利己。坐下伤官正财，正官顺生，有钱，富裕，男命乙巳，多晚婚，可得贤妻，但支中伤官见官，过于刚强，不守纪律，武将者，喜开杀戒。"
        dayself["己酉"] = "上等日柱，坐长生、文昌，主人好文学，聪明有文才，且土金相生，主人身体好，但干生支，毕竟泄气，故得失都有。"
        dayself["甲寅"] = "上等日柱，孤鸾煞，不利婚姻。坐禄通根身旺，坐下有伤官生财，主富贵，但比肩夺财，文才差一些。女命甲寅，身强克夫。"
        dayself["乙卯"] = "上等日柱，坐禄通根身旺，坐比肩，无财，清贵不富贵，上下乙木，秀气透出，文才好，人秀气，手脚纤细。"
        dayself["丙辰"] = "上等日柱，日德。身坐魁地，支藏正印、食神、七杀，主人聪明、伶俐，辰为湿土，丙为太阳，阳光普照，万物有成，人命丙辰聪明好动。"
        dayself["庚申"] = "上等日柱，不利婚姻。坐禄通根，身体好，主富贵。丑月庚申，为天月两德，主人一生身健少疾病。女命庚申带天月两德，必生贵子，聪明大器。"
        dayself["辛酉"] = "上等日柱，九鬼妨害，阴阳差错，但恐夫妻不睦。坐禄通根，得助，立于不败之地，聪明有文才，有能力。"
        dayself["壬戌"] = "上等日柱，日德。阴阳差错，但恐夫妻不睦。坐下财生杀，杀生印，杀印相生，主大贵，或武贵，但丁壬化木逢燥土，往往变成小人或坏人。"
        dayself["乙丑"] = "中等日柱，配偶相貌不扬。六秀日，主人秀气漂亮，身坐金库，无根，坐下七杀无制，自信心太过，往往一意孤行。女名乙丑，具有男性风格。"
        dayself["丙寅"] = "中等日柱，丙为太阳，身坐长生，有光彩之象，主人聪明，但坐下枭神夺食，不吉。生于冬至后夏至前，戊土长生于寅，食神旺，主人聪明，吉；生于夏至后冬至前，戊土长生在申，食神弱，稍差。"
        dayself["丁卯"] = "中等日柱，九鬼妨害，但恐夫妻不睦。坐印通根，主人聪明有学问。若四柱出现亥卯未三合局或寅卯辰三会局，为大贵人，但身坐偏印，只能为副职，辅佐他人。"
        dayself["己巳"] = "中等日柱，金神，主人刚毅、聪明，有火则贵，却火则不吉。坐下正印、劫财、伤官，伤官佩印，贵不可言，但伤官遇劫，易遭小人陷害。"
        dayself["辛未"] = "中等日柱，得库通根，身旺，坐下偏财、偏印、七杀，一片顺生，主小贵，吉。女命辛未爱情专一，夺夫权，守家，独裁。"
        dayself["甲戌"] = "中等日柱，婚姻不顺。得库通根身旺，坐下偏财正官、伤官，主人刚强正直，光明正大，为官清廉，但性格过于直爽得罪人，难免受到打击、排挤。"
        dayself["乙亥"] = "中等日柱，十灵日，人聪明。虽处死地，却坐下为正印劫财帮身，故有枯木逢春之象。男命乙亥主得贤妻；女命乙亥主得贵夫，而且对夫忠诚。另外，女命乙亥非常漂亮。"
        dayself["丁丑"] = "中等日柱，阴阳差错，但恐夫妻不睦。丁火坐丑无根，身弱，但丁为星光，无妨。坐下偏财、七杀、食神，食神生偏财，偏财生杀，也一片顺生，吉利。"
        dayself["戊寅"] = "中等日柱，阴阳差错，但恐夫妻不睦。坐长生，身旺。生于春，则坐下七杀太重，一生劳苦，多为人造福。"
        dayself["癸未"] = "中等日柱，十灵日，人聪明。坐下有食神生财、财生杀，因坐偏财、七杀，故男女命逢癸未，重婚较多，但男女均漂亮，爱情专一。"
        dayself["丙戌"] = "中等日柱，坐火库，身旺，火光熠熠，聪明漂亮。"
        dayself["己丑"] = "中等日柱，十恶大败。六秀日，貌美多才。通根，比丁丑好，生于得令时为强，比肩夺财争斗，生于失令时则有兄弟帮忙。"
        dayself["庚寅"] = "中等日柱，十灵日，阴阳差错，但恐夫妻不睦。坐绝地，无根，盖头（干克支），女命克夫再嫁，做偏房可以，男命庚寅不善终，但坐杀印有开拓精神，为官多清廉，支藏偏印宜做副手。"
        dayself["壬辰"] = "中等日柱，阴阳差错，但恐夫妻不睦。坐水库通根身旺，坐下有劫财生食，食神制杀，身旺用杀，主贵。壬辰日为壬骑龙背，亥时生，为龙归大海，主大贵，午时龙死为下等。"
        dayself["甲午"] = "中等日柱，不利婚姻，身坐死地，一生劳苦奔波，干生支，对妻子好，伤官生财，对上辈孝顺。日主泄出丁火，主利他人，故对别人照顾有加，可自己到老，却一无所有。"
        dayself["乙未"] = "中等日柱，坐库通根，财星入库，主富，但爱财小气，再逢命局或大运流年冲库主发财。"
        dayself["丙申"] = "中等日柱，十恶大败。配偶性强主家。身弱无根，妙在丙火太阳，坐下食神生财，财生杀，壬水杀旺，映照太阳光辉，主人聪明灵气。但杀旺攻身，老来孤独，一辈子辛苦，不能坐享其成。"
        dayself["戊戌"] = "中等日柱，十恶大败。坐库通根，土太燥，吉带凶。魁罡主人心直口快，临事果断，也主聪明，文章振发，但不会用阴谋，常得罪人。"
        dayself["辛丑"] = "中等日柱，通根，坐下有印比食神，主人灵秀，女命辛丑身材好，秀气，守家。"
        dayself["壬寅"] = "中等日柱，坐下食神生偏财再生杀，又为壬骑虎背，主富贵双全，干支相生，家庭圆满。"
        dayself["甲辰"] = "中等日柱，十恶大败。不利婚姻，夫妻不睦。得气通根，坐下有偏财破印，缺少贵气，前半生不太好，后半生平安，财禄丰足。"
        dayself["丁未"] = "中等日柱，阴阳差错，但恐夫妻不睦。得库通根，坐下食神旺，主人漂亮，但好吃，女命贤惠。"
        dayself["庚戌"] = "中等日柱，坐库通根身强，魁罡，聪明刚毅，有文才，忠义双全。"
        dayself["辛亥"] = "中等日柱，孤鸾煞，不利婚姻。干支相生，金水相连，文才好（女命稍差），坐沐浴，女命不贞，坐下伤官旺不利夫。男命可得妻财，或漂亮之妻。"
        dayself["癸丑"] = "中等日柱，坐库通根，人秀气，坐下杀印生比肩，利兄弟，吃力不讨好，劳累奔波。"
        dayself["己未"] = "中等日柱，六秀日，貌美多才。坐库通根，身旺，坐下有杀印，主人自我意识强。女命己未身材好。"
        dayself["壬申"] = "下等日柱，十恶大败。配偶风流。身坐长生，太旺，主人好动不拘。纳音剑锋金，男命敢于拼打争斗，不善终。女命重武好斗，具男性风格。"
        dayself["癸酉"] = "下等日柱，坐偏印，金神，外表柔和，内心阴毒。富于心计，会挣钱，但也会花钱。"
        dayself["己卯"] = "下等日柱，九鬼妨害，配偶性暴。坐杀截脚，为最差之日，人命己卯，易残疾、受伤，一生劳苦。年上己卯，祖上伤残，不善终；月上己卯，父母不团圆；日上己卯，青年时期命危；时上己卯，老年不得善终，子女不好。"
        dayself["甲申"] = "下等日柱，夫妻不睦，配偶风流。坐绝地，一辈子辛苦，奔波，但死木逢杀克削，也不失可用。"
        dayself["乙酉"] = "下等日柱，配偶性暴。坐杀截脚，生在春天有救，生在土月助杀攻身，不妙。人命乙酉多不善终或不高寿。女命乙酉漂亮，浪漫，早恋早婚。"
        dayself["辛卯"] = "下等日柱，阴阳差错，但恐夫妻不睦。坐偏财，桃花，男命喜欢女色，女命稍好，但漂亮难禁风流（因既漂亮，又浪漫，对异性富吸引力）。"
        dayself["庚子"] = "下等日柱，坐伤官，女命克夫。干支金水相生，人秀丽聪明，但耿直，讲义气。做官宜公检法部门。"
        dayself["丙午"] = "下等日柱，阴阳差错，孤鸾煞，但恐夫妻不睦。坐羊刃，过刚，人聪明有文才。男命克妻，女命克夫，不论男女生于丙午，容易受伤。"
        dayself["戊申"] = "下等日柱，阴阳差错，孤鸾煞，但恐夫妻不睦。土猴孤独，女命早婚者易离婚，或孤身，男命稍好。不论年月均漂亮，但爱情不专，作风不正。"
        dayself["壬子"] = "下等日柱，九鬼妨害，孤鸾煞。坐刃坐劫财，水太旺，漂亮。女命不会持家，有多少花多少，花心；男命好色，若经商发财，发多少失多少。"
        dayself["丁巳"] = "下等日柱，孤鸾煞，恐夫妻不睦。丁火坐丙火，阳盛阴衰，白日无光。生时丁巳，老年不能高寿。"
        dayself["戊午"] = "下等日柱，孤鸾煞。与丙午类似，坐刃太旺，女命克夫，男命克妻，易受伤灾。戊土太燥，主人性格浮躁。"
        dayself["癸亥"] = "下等日柱，十恶大败。阴阳差错，但恐夫妻不睦。玄武日，坐刃，喜欢独断专行，武将不善终。"
        var self = dayself[key];
        var tip = ""
        if (-1 != key.indexOf("甲")) {
            tip = "甲木喜庚，喜断为用"
        }
        if (-1 != key.indexOf("乙")) {
            tip = "乙木喜金，庚辛喜用"
        }
        if (-1 != key.indexOf("丙") || -1 != key.indexOf("丁")) {
            tip = "火需附燃，以木为用"
        }
        if (-1 != key.indexOf("庚") || -1 != key.indexOf("辛")) {
            tip = "金需明耀，需火强锻"
        }
        if (-1 != key.indexOf("壬") || -1 != key.indexOf("癸")) {
            tip = "水需寻源，需金生水"
        }
        if (-1 != key.indexOf("戊")) {
            tip = "戊需含金，蕴含仓储"
        }
        if (-1 != key.indexOf("己")) {
            tip = "己喜水养，孕育生长"
        }
        tip = tip

        //console.log("tip",tip)
        return { self, tip }
    }
    getminlucky(key, sex, year) {
        console.log("getminlucky", key, sex, year)
        var luckyear = new Array();
        luckyear.push("甲子");
        luckyear.push("乙丑");
        luckyear.push("丙寅")
        luckyear.push("丁卯")
        luckyear.push("戊辰")
        luckyear.push("己巳")
        luckyear.push("庚午")
        luckyear.push("辛未")
        luckyear.push("壬申")
        luckyear.push("癸酉")
        luckyear.push("甲戌")
        luckyear.push("乙亥")
        luckyear.push("丙子")
        luckyear.push("丁丑")
        luckyear.push("戊寅")
        luckyear.push("己卯")
        luckyear.push("庚辰")
        luckyear.push("辛巳")
        luckyear.push("壬午")
        luckyear.push("癸未")
        luckyear.push("甲申")
        luckyear.push("乙酉")
        luckyear.push("丙戌")
        luckyear.push("丁亥")
        luckyear.push("戊子")
        luckyear.push("己丑")
        luckyear.push("庚寅")
        luckyear.push("辛卯")
        luckyear.push("壬辰")
        luckyear.push("癸巳")
        luckyear.push("甲午")
        luckyear.push("乙未")
        luckyear.push("丙申")
        luckyear.push("丁酉")
        luckyear.push("戊戌")
        luckyear.push("己亥")
        luckyear.push("庚子")
        luckyear.push("辛丑")
        luckyear.push("壬寅")
        luckyear.push("癸卯")
        luckyear.push("甲辰")
        luckyear.push("乙巳")
        luckyear.push("丙午")
        luckyear.push("丁未")
        luckyear.push("戊申")
        luckyear.push("己酉")
        luckyear.push("庚戌")
        luckyear.push("辛亥")
        luckyear.push("壬子")
        luckyear.push("癸丑")
        luckyear.push("甲寅")
        luckyear.push("乙卯")
        luckyear.push("丙辰")
        luckyear.push("丁巳")
        luckyear.push("戊午")
        luckyear.push("己未")
        luckyear.push("庚申")
        luckyear.push("辛酉");
        luckyear.push("壬戌");
        luckyear.push("癸亥");
        var ord = key[0] + key[1];
        //console.log("getminlucky",year,ord)
        var curyear = Number(year)


        for (var i = 0; i < 60; i++) {
            if (ord == luckyear[i]) {
                var ret = new Array()
                for (var x = i; x < i + 72; x++) {
                    ret.push(luckyear[(x % 60)] + " " + (curyear++));
                }
                return ret;
            }
        }


    }
    shensha_dayg2earthz(dayg, earthz) {//日干见其他干支
        console.log("shensha_dayg2earthz", dayg, earthz)
        var o = dayg + earthz;
        var map = new Array()
    /* map['甲寅'] = */ map['乙丑'] = map['丙子']  /* = map['丁酉'] */ /* = map['戊申'] */ /* = map['己未'] */ = map['庚午'] = map['辛巳'] = map['壬辰'] /* = map['癸卯'] */ = '福星 '
        map['甲丑'] = map['乙子'] = map['丙亥'] = map['丁亥'] = map['戊丑'] = map['己申'] = map['庚丑'] = map['辛午'] = map['壬卯'] = map['癸卯'] = '天乙 '
        map['甲未'] = map['乙申'] = map['丙酉'] /* = map['丁酉'] */ = map['戊未'] = map['己子'] = map['庚未'] = map['辛寅'] = map['壬巳'] = map['癸巳'] = '天乙 '
        map['甲巳'] = map['乙午'] = map['丙申'] = map['丁酉'] = map['戊申'] = map['己酉'] = map['庚亥'] = map['辛子'] = map['壬寅'] /* = map['癸卯'] */ = '文昌 '
        map['甲亥'] /* =map['乙午'] */ = map['丙未'] /* =map['丁酉'] */ = map['戊寅'] /* =map['己酉'] */ = map['庚巳'] = map['辛子'] = map['壬申'] /* =map['癸卯'] */ = '学堂 '
        map['乙辰'] = map['丁未'] = map['己未'] = map['癸丑'] = map['辛戌'] = '羊刃 '
        map['甲卯'] = map['丙午'] = map['戊午'] = map['庚酉'] = map['壬子'] = '阳刃 '
        map['乙寅'] = map['丁巳'] = map['己巳'] = map['辛申'] = map['癸亥'] = '带刃 '
        map['壬子'] = map['壬子'] + "红艳 "
        map['甲寅'] = map['乙卯'] = map['丙巳'] = map['丁午'] = map['戊巳'] = map['己午'] = map['庚申'] = map['辛酉'] = map['壬亥'] = map['癸子'] = '干禄 '
        map['甲午'] /* =map['乙午'] */ = map['丙寅'] /* = map['丁未'] */ = map['戊辰'] = map['己辰'] /* = map['庚戌']  =map['辛酉'] */= map['申子'] = '红艳 '
        map['甲申'] /* =map['乙申'] */ = '红艳 '
        map['甲辰'] = map['乙巳'] = map['丙未'] = map['丁申']/*  = map['戊未'] = map['己申'] */ = map['庚戌'] = map['辛亥'] = map['壬丑'] = map['癸寅'] = '金舆 '
        map['甲酉'] = map['乙戌'] /* = map['丙未'] */ = map['丁申'] = map['戊巳'] = map['己午'] = map['庚辰'] = map['辛卯'] = map['壬亥'] /* =map['癸寅'] */ = '流霞 '
    /* map['丙子'] =  */map['丁丑'] = map['戊子'] = map['巳丑'] = map['庚卯'] = map['辛辰'] = map['壬午'] = map['癸未'] = '飞刃 '

        return undefined != map[o] ? map[o] : ""
    }
    shensha_yearg2earthz(yearg, earthz) {//年干见其他干支
        console.log("shensha_yearg2earthz", yearg, earthz)
        var o = yearg + earthz;
        var map = new Array()
    /* map['甲寅'] = */ map['乙丑'] = map['丙子']  /* = map['丁酉'] */ /* = map['戊申'] */ /* = map['己未'] */ = map['庚午'] = map['辛巳'] = map['壬辰'] /* = map['癸卯'] */ = '福星 '
        map['甲丑'] = map['乙子'] = map['丙亥'] = map['丁亥'] = map['戊丑'] = map['己申'] = map['庚丑'] = map['辛午'] = map['壬卯'] = map['癸卯'] = '天乙贵人(年) '
        map['甲未'] = map['乙申'] = map['丙酉'] /* = map['丁酉'] */ = map['戊未'] = map['己子'] = map['庚未'] = map['辛寅'] = map['壬巳'] = map['癸巳'] = '天乙贵人(年) '
        map['甲巳'] = map['乙午'] = map['丙申'] = map['丁酉'] = map['戊申'] = map['己酉'] = map['庚亥'] = map['辛子'] = map['壬寅'] /* = map['癸卯'] */ = '文昌(年) '
        map['甲亥'] /* =map['乙午'] */ = map['丙未'] /* =map['丁酉'] */ = map['戊寅'] /* =map['己酉'] */ = map['庚巳'] = map['辛子'] = map['壬申'] /* =map['癸卯'] */ = '学堂(年) '
        map['甲卯'] = map['乙辰'] = map['丙午'] = map['丁未'] = map['戊午'] = map['己未'] = map['庚酉'] = map['辛戌'] = map['壬子'] = map['癸丑'] = '羊刃(年) '
        map['丁巳'] = '羊刃(年丁巳刃) '
        map['壬子'] = map['壬子'] + "红艳(年) "
        map['甲寅'] = map['乙卯'] = map['丙巳'] = map['丁午'] = map['戊巳'] = map['己午'] = map['庚申'] = map['辛酉'] = map['壬亥'] = map['癸子'] = '干禄(年) '
        map['甲午'] /* =map['乙午'] */ = map['丙寅'] /* = map['丁未'] */ = map['戊辰'] = map['己辰'] /* = map['庚戌']  =map['辛酉'] */  = map['申子'] = '红艳(年) '
        map['甲申'] /* =map['乙申'] */ = '红艳(年) '
        map['甲辰'] = map['乙巳'] = map['丙未'] = map['丁申']/*  = map['戊未'] = map['己申'] */ = map['庚戌'] = map['辛亥'] = map['壬丑'] = map['癸寅'] = '金舆(年) '
        map['甲酉'] = map['乙戌'] /* = map['丙未'] */ = map['丁申'] = map['戊巳'] = map['己午'] = map['庚辰'] = map['辛卯'] = map['壬亥'] /* =map['癸寅'] */ = '流霞(年) '
    /* map['丙子'] =  */map['丁丑'] = map['戊子'] = map['巳丑'] = map['庚卯'] = map['辛辰'] = map['壬午'] = map['癸未'] = '飞刃(年) '
        return undefined != map[o] ? map[o] : ""
    }
    shensha_moon_day(moonz, other) {
        var o = moonz + other;
        var map = new Array()
        map['戌丙'] = map['亥乙'] = map['子巳'] = map['丑庚'] = map['寅丁'] = map['卯申'] = map['辰壬'] = map['巳辛'] = map['午亥'] = map['未甲'] = map['申癸'] = map['酉寅'] = '天德 '
        return undefined != map[o] ? map[o] : ""
    }
    shensha_moon_moon(moonz, other) {
        var o = moonz + other;
        var map = new Array()
        map['寅丙'] = map['午丙'] = map['戌丙'] = map['申壬'] = map['子壬'] = map['辰壬'] = map['亥甲'] = map['卯甲'] = map['未甲'] = map['巳庚'] = map['酉庚'] = map['丑庚'] = '月德 '
        return undefined != map[o] ? map[o] : ""
    }

    shensha_moon(moonz, other) {//月支见其他干支
        console.log("shensha_moon", moonz, other)
        if (moonz == other) {
            return ""
        }
        return this.shensha_moon_day(moonz, other) + this.shensha_moon_moon(moonz, other)
    }
    shensha_dayz2earthz(dayz, earthz) {//日支见其他地支
        console.log("shensha_dayz2earthz", dayz, earthz)
        var o = dayz + earthz;
        var map = new Array()
        map['子寅'] = map['丑亥'] = map['寅申'] = map['卯巳'] = map['辰寅'] = map['巳亥'] = map['午申'] = map['未巳'] = map['申寅'] = map['酉亥'] = map['戌申'] = map['亥巳'] = '驿马 '
        map['子辰'] = map['丑丑'] = map['寅戌'] = map['卯未'] = map['辰辰'] = map['巳丑'] = map['午戌'] = map['未未'] = map['申辰'] = map['酉丑'] = map['戌戌'] = map['亥未'] = '华盖 '
        map['子酉'] = map['丑午'] = map['寅卯'] = map['卯子'] = map['辰酉'] = map['巳午'] = map['午卯'] = map['未子'] = map['申酉'] = map['酉午'] = map['戌卯'] = map['亥子'] = '桃花 '
        map['子子'] = map['丑酉'] = map['寅午'] = map['卯卯'] = map['辰子'] = map['巳酉'] = map['午午'] = map['未卯'] = map['申子'] = map['酉酉'] = map['戌午'] = map['亥卯'] = '将星 '

        map['子亥'] = map['丑申'] = map['寅巳'] = map['卯寅'] = map['辰亥'] = map['巳申'] = map['午巳'] = map['未寅'] = map['申亥'] = map['酉申'] = map['戌巳'] = map['亥寅'] = '亡神 '
        return undefined != map[o] ? map[o] : "" + this.shensha_dayz2earthz_guchenguasu(dayz, earthz)
    }
    shensha_yeargz2earthz(years,earthz)
    {
        console.log("shensha_yeargz2earthz", dayz, earthz)
        var o = years + earthz;
        var map = new Array()
        map['甲子戌'] = map['乙丑戌'] = map['丙寅戌'] = map['丁卯戌'] = map['戊辰戌'] = map['己巳戌'] = map['庚午戌'] = map['辛未戌'] = map['壬申戌'] = map['癸酉戌'] = '空亡 '
        map['甲戌申'] = map['乙亥申'] = map['丙子申'] = map['丁丑申'] = map['戊寅申'] = map['己卯申'] = map['庚辰申'] = map['辛巳申'] = map['壬午申'] = map['癸未申'] = '空亡 '
        map['甲申午'] = map['乙酉午'] = map['丙戌午'] = map['丁亥午'] = map['戊子午'] = map['己丑午'] = map['庚寅午'] = map['辛卯午'] = map['壬辰午'] = map['癸巳午'] = '空亡 '
        map['甲午辰'] = map['乙未辰'] = map['丙申辰'] = map['丁酉辰'] = map['戊戌辰'] = map['己亥辰'] = map['庚子辰'] = map['辛丑辰'] = map['壬寅辰'] = map['癸卯辰'] = '空亡 '
        map['甲辰寅'] = map['乙巳寅'] = map['丙午寅'] = map['丁未寅'] = map['戊申寅'] = map['己酉寅'] = map['庚戌寅'] = map['辛亥寅'] = map['壬子寅'] = map['癸丑寅'] = '空亡 '
        map['甲寅子'] = map['乙卯子'] = map['丙辰子'] = map['丁巳子'] = map['戊午子'] = map['己未子'] = map['庚申子'] = map['辛酉子'] = map['壬戌子'] = map['癸亥子'] = '空亡 '

        map['甲子亥'] = map['乙丑亥'] = map['丙寅亥'] = map['丁卯亥'] = map['戊辰亥'] = map['己巳亥'] = map['庚午亥'] = map['辛未亥'] = map['壬申亥'] = map['癸酉亥'] = '驿马 '
        map['甲戌酉'] = map['乙亥酉'] = map['丙子酉'] = map['丁丑酉'] = map['戊寅酉'] = map['己卯酉'] = map['庚辰酉'] = map['辛巳酉'] = map['壬午酉'] = map['癸未酉'] = '华盖 '
        map['甲申未'] = map['乙酉未'] = map['丙戌未'] = map['丁亥未'] = map['戊子未'] = map['己丑未'] = map['庚寅未'] = map['辛卯未'] = map['壬辰未'] = map['癸巳未'] = '桃花 '
        map['甲午巳'] = map['乙未巳'] = map['丙申巳'] = map['丁酉巳'] = map['戊戌巳'] = map['己亥巳'] = map['庚子巳'] = map['辛丑巳'] = map['壬寅巳'] = map['癸卯巳'] = '将星 '
        map['甲辰卯'] = map['乙巳卯'] = map['丙午卯'] = map['丁未卯'] = map['戊申卯'] = map['己酉卯'] = map['庚戌卯'] = map['辛亥卯'] = map['壬子卯'] = map['癸丑卯'] = '将星 '
        map['甲寅丑'] = map['乙卯丑'] = map['丙辰丑'] = map['丁巳丑'] = map['戊午丑'] = map['己未丑'] = map['庚申丑'] = map['辛酉丑'] = map['壬戌丑'] = map['癸亥丑'] = '将星 '
        return undefined != map[o] ? map[o] : ""
    }
    shensha_dayz2earthz_guchenguasu(dayz, earthz){
        console.log("shensha_dayz2earthz_guchenguasu", dayz, earthz)
        var o = dayz + earthz;
        var map = new Array()
        map['子寅'] = map['丑寅'] = map['寅巳'] = map['卯巳'] = map['辰巳'] = map['巳申'] = map['午申'] = map['未申'] = map['申亥'] = map['酉亥'] = map['戌亥'] = map['亥寅'] = '孤辰 '
        map['子戌'] = map['丑戌'] = map['寅丑'] = map['卯丑'] = map['辰丑'] = map['巳辰'] = map['午辰'] = map['未辰'] = map['申未'] = map['酉未'] = map['戌未'] = map['亥戌'] = '寡宿 '
        
        return undefined != map[o] ? map[o] : ""
    }
    shansha_gousha(yearz, earthz) {
        console.log("shansha_gousha", yearz, earthz)
        var o = yearz + earthz;
        var map = new Array()
        map['子卯'] = map['丑辰'] = map['寅巳'] = map['卯午'] = map['辰未'] = map['巳申'] = map['午酉'] = map['未戌'] = map['申亥'] = map['酉子'] = map['戌丑'] = map['亥寅'] = '勾煞 '
        map['子酉'] = map['丑戌'] = map['寅亥'] = map['卯子'] = map['辰丑'] = map['巳寅'] = map['午卯'] = map['未辰'] = map['申巳'] = map['酉午'] = map['戌未'] = map['亥申'] = '绞煞 '
        return undefined != map[o] ? map[o] : ""
    }
    shensha_yearz2earthz(yearz, earthz) {//年支见其他地支
        console.log("shensha_yearz2earthz", yearz, earthz)
        var o = yearz + earthz;
        var map = new Array()
        map['子子'] = map['丑酉'] = map['寅午'] = map['卯卯'] = map['辰子'] = map['巳酉'] = map['午午'] = map['未卯'] = map['申子'] = map['酉酉'] = map['戌午'] = map['亥卯'] = '将星 '
        map['子酉'] = map['丑午'] = map['寅卯'] = map['卯子'] = map['辰酉'] = map['巳午'] = map['午卯'] = map['未子'] = map['申酉'] = map['酉午'] = map['戌卯'] = map['亥子'] = '桃花 '
        map['子寅'] = map['丑寅'] = map['寅巳'] = map['卯巳'] = map['辰巳'] = map['巳申'] = map['午申'] = map['未申'] = map['申亥'] = map['酉亥'] = map['戌亥'] = map['亥寅'] = '孤辰 '
        map['子戌'] = map['丑戌'] = map['寅丑'] = map['卯丑'] = map['辰丑'] = map['巳辰'] = map['午辰'] = map['未辰'] = map['申未'] = map['酉未'] = map['戌未'] = map['亥戌'] = '寡宿 '
        map['子辰'] = map['丑丑'] = map['寅戌'] = map['卯未'] = map['辰辰'] = map['巳丑'] = map['午戌'] = map['未未'] = map['申辰'] = map['酉丑'] = map['戌戌'] = map['亥未'] = '华盖 '

        map['子卯'] /* = map['丑寅']  = map['寅丑'] = map['卯子']*/ = map['辰亥'] = map['巳戌'] = map['午酉'] /* = map['未申'] = map['申未']  = map['酉午'] = map['戌卯']*/ = map['亥辰'] = '红鸾 '

        map['子酉'] = map['丑申'] = map['寅未'] = map['卯午'] = map['辰巳'] /* = map['巳辰']  = map['午卯']*/ = map['未寅'] = map['申丑'] = map['酉子'] = map['戌辰'] = map['亥巳'] = '天喜 '

        return (undefined != map[o] ? map[o] : "") + this.shansha_gousha(yearz, earthz)
    }
    shensha_tianluo(year, earthz) {
        console.log("shensha_tianluo", year, earthz)
        var map = new Array()
        map['戊子'] = map['己丑'] = map['丙寅'] = map['丁卯'] = map['甲辰'] = map['乙巳'] = map['戊午'] = map['己未'] = map['丙申'] = map['丁酉'] = map['甲戌'] = map['乙亥'] = ""
        if (undefined != map[year] && (earthz == '戌' || earthz == '亥')) {
            return '天罗 '
        }
        return ""
    }
    shensha_diwang(year, earthz) {
        console.log("shensha_diwang", year, earthz)
        var map = new Array()
        map['丙子'] = map['丁丑'] = map['甲寅'] = map['乙卯'] = map['壬辰'] = map['癸巳'] = map['丙午'] = map['丁未'] = map['甲申'] = map['乙酉'] = map['壬戌'] = map['癸亥'] = map['庚子'] = map['辛丑'] = map['戊寅'] = map['己卯'] = map['丙辰'] = map['丁巳'] = map['庚午'] = map['辛未'] = map['戊申'] = map['己酉'] = map['丙戌'] = map['丁亥'] = ""

        if (undefined != map[year] && (earthz == '辰' || earthz == '巳')) {
            return '地网 '
        }
        return ""
    }
    isLeapYear(year) { return (year % 4 == 0) && (year % 100 != 0 || year % 400 == 0); }
    formateDayD4(month, day, year) {
        var monthdays = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
        if (this.isLeapYear(year)) {
            monthdays[1] = 29
        }
        var ret = 0
        for (i = 1; i <= month; i++) {
            ret = ret + monthdays[i]
        }
        return Number(ret + day);
    };
    //这里是模拟计算，所以导致大运会有4-8个月的偏差计算不准，需要精确到天的小时才能准确消除掉4个月的问题
    getYearTerm(year) {
        var solarTerm = ['小寒', '大寒', '立春', '雨水', '惊蛰', '春分', '清明', '谷雨', '立夏', '小满', '芒种', '夏至', '小暑', '大暑', '立秋', '处暑', '白露', '秋分', '寒露', '霜降', '立冬', '小雪', '大雪', '冬至'] //二十四节气
        var res = []
        for (i = 0; i < 500; i++) {
            res[i] = 0;
        }
        var month = 0;

        var daydate = LunarCalendar.getTermDate(year - 1, 22);
        var day = LunarCalendar.getTerm(year - 1, 22);
        var key = Number(this.formateDayD4(11, day, year - 1))
        if (this.isLeapYear(year)) {
            key = 366 - key
        }else{
            key = 365 - key
        }
        res[100-key] = solarTerm[22] + "|" + daydate.getDate() + "|" + daydate.getHours();
        /*正式的只要节，不要气
        daydate = LunarCalendar.getTermDate(year - 1, 23);
        day = LunarCalendar.getTerm(year - 1, 23);
        key = Number(this.formateDayD4(11, day, year - 1))
        if (this.isLeapYear(year)) {
            key = 366 - key
        }else{
            key = 365 - key
        }
        res[100-key] = solarTerm[23] + "|" + daydate.getDate() + "|" + daydate.getHours();
        */

        for (var i = 0; i < 24; i++) {
            daydate = LunarCalendar.getTermDate(year, i);
            day = LunarCalendar.getTerm(year, i);
            if (i % 2 == 0) month++
            key = Number(this.formateDayD4(month - 1, day, year)) + 100

            if (i % 2 == 0) res[key] = solarTerm[i] + "|" + daydate.getDate() + "|" + daydate.getHours();
            console.log("getYearTermday", key, res[key], month, day, year)
        }

        var nextdaydate = LunarCalendar.getTermDate(year + 1, 0);
        var nextday = LunarCalendar.getTerm(year + 1, 0);
        var nextyearkey = Number(this.formateDayD4(0, nextday, year + 1))

        if (this.isLeapYear(year)) {
            res[Number(366 + 100 + nextyearkey)] = solarTerm[0] + "|" + nextdaydate.getDate() + "|" + nextdaydate.getHours();
        }
        else {
            res[Number(365 + 100 + nextyearkey)] = solarTerm[0] + "|" + nextdaydate.getDate() + "|" + nextdaydate.getHours();
        }

        return res;
    };
    getbigluckyearbegin(term, birth, key, sex) {
        var mybirth = new Date(birth)
        var pos = "甲丙戊庚壬"
        var neg = "乙丁己辛癸"
        var last = 0
        var next = 0
        var mytime = this.formateDayD4(mybirth.getMonth(), mybirth.getDate(), mybirth.getFullYear()) + 100
        while (0 == term[mytime + next]) {
            next++;
            console.log("next", term[mytime + next], mybirth.getDate())
        }
        var t = term[mytime + next]
        t = t.split("|")
        if (mybirth.getHours() > Number(t[2])) {
            next--
        }

        var l = ""
        if (0 == term[mytime]) {

            while (0 == term[mytime - last]) {
                last++;
            }
        }
        else {
            last = 0
        }
        l = term[mytime - last]
        l = l.split("|")
        if (mybirth.getHours() < Number(l[2])) {
            last++
        }
        console.log("getbigluckyearbegin", mytime, next, last, key, next % 3)
        if (pos.indexOf(key[0]) >= 0) {
            //key为年干男顺女逆
            if (sex == "乾造") {
                return Number(mybirth.getFullYear() + Math.floor(next / 3) + (mybirth.getHours() / 6 / 30 + next % 3 * 4 + mybirth.getMonth()) / 12)
            }
            else {
                return Number(mybirth.getFullYear() + Math.floor(last / 3) + (mybirth.getHours() / 6 / 30 + last % 3 * 4 + mybirth.getMonth()) / 12)
            }
        }
        else (neg.indexOf(key[0]) >= 0)
        {
            //key为年干女顺男逆
            if (sex == "乾造") {
                return Number(mybirth.getFullYear() + Math.floor(last / 3) + (mybirth.getHours() / 6 / 30 + last % 3 * 4 + mybirth.getMonth()) / 12)
            }
            else {
                return Number(mybirth.getFullYear() + Math.floor(next / 3) + (mybirth.getHours() / 6 / 30 + next % 3 * 4 + mybirth.getMonth()) / 12)
            }
        }
    }
    geikeypower(keymonthz) {
        var map = new Array()
        map['寅'] = ['旺', '相', '死', '囚', '休']
        map['卯'] = ['旺', '相', '死', '囚', '休']
        map['辰'] = ['囚', '休', '旺', '相', '死']
        map['巳'] = ['休', '旺', '相', '死', '囚']
        map['午'] = ['休', '旺', '相', '死', '囚']
        map['未'] = ['囚', '休', '旺', '相', '死']
        map['申'] = ['死', '囚', '休', '旺', '相']
        map['酉'] = ['死', '囚', '休', '旺', '相']
        map['戌'] = ['囚', '休', '旺', '相', '死']
        map['亥'] = ['相', '死', '囚', '休', '旺']
        map['子'] = ['相', '死', '囚', '休', '旺']
        map['丑'] = ['囚', '休', '旺', '相', '死']
        return undefined != map[keymonthz] ? map[keymonthz] : [];
    }
    getmarryinfo(eightkey, sex, combe, shishen) {
        console.log(combe)
        var test = new Array()
        test = test.concat(combe.dr)
        test = test.concat(combe.br)
        test = test.concat(combe.lr)
        test = test.concat(combe.er)
        var teststring = test.toString()
        var info =new Array()
        if ("乾造" == sex) {
            if ((eightkey[4] == "甲" || eightkey[4] == "乙") && (eightkey[3] == "寅" || eightkey[3] == "卯")) info.push("官星过旺，财星入墓")
            else if ((eightkey[4] == "丙" || eightkey[4] == "丁") && (eightkey[3] == "巳" || eightkey[3] == "午")) info.push("官星过旺，财星入墓")
            else if ((eightkey[4] == "戊" || eightkey[4] == "己") && (eightkey[3] == "丑" || eightkey[3] == "未" || eightkey[3] == "辰" || eightkey[3] == "戌")) info.push("官星过旺，财星入墓")
            else if ((eightkey[4] == "庚" || eightkey[4] == "辛") && (eightkey[3] == "申" || eightkey[3] == "酉")) info.push("官星过旺，财星入墓")
            else if ((eightkey[4] == "壬" || eightkey[4] == "癸") && (eightkey[3] == "亥" || eightkey[3] == "子")) info.push("官星过旺，财星入墓")
            var count = 0
            for (i = 0; i < shishen.length; i++) {
                if ("正财" == shishen[i] || "偏财" == shishen[i]) count++
            }
            if (0 == count) info.push("命无财星，婚姻难成")
            if (3 <= count) info.push("财星过多，多婚之象")
        }
        else if ("坤造" == sex) {
            if ((eightkey[4] == "甲" || eightkey[4] == "乙") && (eightkey[3] == "丙" || eightkey[3] == "丁")) info.push("木火伤官，官星入墓（易木火通明）")
            else if ((eightkey[4] == "丙" || eightkey[4] == "丁") && (eightkey[3] == "丑" || eightkey[3] == "未" || eightkey[3] == "辰" || eightkey[3] == "戌")) info.push("火土伤官，官星入墓")
            else if ((eightkey[4] == "戊" || eightkey[4] == "己") && (eightkey[3] == "申" || eightkey[3] == "酉")) info.push("金土伤官，官星入墓")
            else if ((eightkey[4] == "庚" || eightkey[4] == "辛") && (eightkey[3] == "亥" || eightkey[3] == "子")) info.push("金水伤官，官星入墓（易金白水清）")
            else if ((eightkey[4] == "壬" || eightkey[4] == "癸") && (eightkey[3] == "寅" || eightkey[3] == "卯")) info.push("水木伤官，官星入墓")
            var count = 0
            for (i = 0; i < shishen.length; i++) {
                if ("正官" == shishen[i] || "七杀" == shishen[i]) count++
            }
            if (0 == count) info.push("命无官星，婚姻难成")
            if (3 <= count) info.push("官星过多，多婚之象")
        }
        var  cc = info.toString()
        var tt = teststring;
        var t = tt.split("辰戌");
        t.forEach((it,index)=>{
            if (index<t.length-1) info.push( "辰戌有冲，易分离")
        })
        tt = teststring;
        t = tt.split("日辰戌");
        t.forEach((it,index)=>{
            if (index<t.length-1) info.push("辰戌冲夫妻宫，易分离")
        })
        if (-1 != cc.indexOf("伤官")) {
            tt = teststring;
            t = tt.split("日冲月支");
            t.forEach((it,index)=>{
                if (index<t.length-1) info.push("入墓逢冲，易分离")
            })
            tt = teststring;
            t = tt.split("日相冲");
            t.forEach((it,index)=>{
                if (index<t.length-1) info.push("入墓逢冲，易分离")
            })
            tt = teststring;
            t = tt.split("半合");
            t.forEach((it,index)=>{
                if (index<t.length-1) info.push("入墓逢合，易分离")
            })
            //if (-1 != teststring.indexOf("日冲月支") || -1 != teststring.indexOf("日冲月支") || -1 != teststring.indexOf("日冲月支") || -1 != teststring.indexOf("日冲月支")) info.push("入墓逢冲，易分离")
            //if (-1 != teststring.indexOf("日相冲") || -1 != teststring.indexOf("日相冲") || -1 != teststring.indexOf("日相冲") || -1 != teststring.indexOf("日相冲")) info.push("入墓逢冲，易分离")
            //if (-1 != teststring.indexOf("年日半合") || -1 != teststring.indexOf("日月半合") || -1 != teststring.indexOf("日时半合")) info.push("入墓逢合，易分离")
        }

        if (-1 != teststring.indexOf("隐刑")) info.push("三刑可解，易分离")
        if (-1 != teststring.indexOf("之刑")) info.push("三刑难解，易分离")
        if (-1 != teststring.indexOf("三会")) info.push("三会成局，易分离")
        if (-1 != teststring.indexOf("三合")) info.push("三合成局，易分离")
        if (-1 != teststring.indexOf("酉戌")) info.push("酉戌有害，需要好好控制情绪")
        if (-1 != teststring.indexOf("子午")) info.push("子午对冲，需要好好控制情绪")
        if (-1 != teststring.indexOf("丑未")) info.push("丑未对冲，需要好好控制情绪")
        if (-1 != teststring.indexOf("寅申")) info.push("寅申对冲，需要好好控制情绪")
        if (-1 != teststring.indexOf("卯酉")) info.push("卯酉对冲，需要好好控制情绪")
        if (-1 != teststring.indexOf("巳亥")) info.push("巳亥对冲，需要好好控制情绪")
        if (-1 != teststring.indexOf("子未")) info.push("子未相害，需要好好控制情绪")
        if (-1 != teststring.indexOf("丑午")) info.push("丑午相害，需要好好控制情绪")
        if (-1 != teststring.indexOf("寅巳")) info.push("寅巳相害，需要好好控制情绪")
        if (-1 != teststring.indexOf("卯辰")) info.push("卯辰相害，需要好好控制情绪")
        if (-1 != teststring.indexOf("申亥")) info.push("申亥相害，需要好好控制情绪")
        if (-1 != teststring.indexOf("子酉")) info.push("子酉相破，需要好好控制情绪")
        if (-1 != teststring.indexOf("寅亥")) info.push("寅亥相破，需要好好控制情绪")
        if (-1 != teststring.indexOf("辰丑")) info.push("辰丑相破，需要好好控制情绪")
        if (-1 != teststring.indexOf("卯午")) info.push("卯午相破，需要好好控制情绪")
        if (-1 != teststring.indexOf("巳申")) info.push("巳申相破，需要好好控制情绪")
        if (-1 != teststring.indexOf("未戌")) info.push("未戌相破，需要好好控制情绪")

        //if (-1 != teststring.indexOf("辰戌")) info.push("辰戌有害，需要好好控制情绪")
        tt = teststring;
        t = tt.split("自刑");
        t.forEach((it,index)=>{
            if (index<t.length-1)  info.push("自刑有害，需要好好控制情绪")
        })
        if (null == info.length) {
            info.push("八字婚姻无大影响")
        }
        return info

    }

    selfgua(year) {
        var stryear = year.toString()
        var str = stryear.split('');
        for (i = str.length - 1; i > -1; i--) {
            total = total + parseInt(str[i])
        }
        return total
    }
    //getlocationself有表代替
    getselfgua(year, sex) {
        var gua = ["坎（东四命）", "坤（西四命）", "震（东四命）", "巽（东四命）", "坤（西四命）", "乾（西四命）", "兑（西四命）", "艮（西四命）", "离（东四命）"]
        if (sex == "乾") {
            var x = 11 - this.selfgua(this.selfgua(this.selfgua(year)))
            return gua[x]
        }
        if (sex == "乾") {
            var x = 4 + this.selfgua(this.selfgua(this.selfgua(year)))
            return gua[x]
        }
        return ""
    }
    tipfire(item)
  { 
    if(-1 != item.indexOf("辰戌") && -1 != item.indexOf("宫"))
    {
      var x = new Array()
      x.push(IconConfig.IconTipFire)
      x.push(IconConfig.IconTipFire)
      x.push(IconConfig.IconTipFire)
      x.push(IconConfig.IconTipFire)
      x.push(IconConfig.IconTipFire)
      return x
    }
    else if (-1 != item.indexOf("辰戌") || -1 != item.indexOf("难解"))
    {
      var x = new Array()
      x.push(IconConfig.IconTipFire)
      x.push(IconConfig.IconTipFire)
      x.push(IconConfig.IconTipFire)
      x.push(IconConfig.IconTipFire)
      return x
    }
    else if (-1 != item.indexOf("伤官") || -1 != item.indexOf("酉戌") || -1 != item.indexOf("子未") || -1 != item.indexOf("子午") || -1 != item.indexOf("自刑")|| -1 != item.indexOf("财星过多")|| -1 != item.indexOf("财星入墓"))
    {
      var x = new Array()
      x.push(IconConfig.IconTipFire)
      x.push(IconConfig.IconTipFire)
      return x
    }
    else if (-1 != item.indexOf("卯辰") || -1 != item.indexOf("无官星") || -1 != item.indexOf("无财星"))
    {
      var x = new Array()
      x.push(IconConfig.IconTipFire)
      x.push(IconConfig.IconTipFire)
      x.push(IconConfig.IconTipFire)
      return x
    }
    else if (-1 != item.indexOf("害") || -1 != item.indexOf("破")|| -1 != item.indexOf("冲")|| -1 != item.indexOf("可解"))
    {
      var x = new Array()
      x.push(IconConfig.IconTipFire)
      return x
    }

  }

}
var e = new EightrandomModule()
module.exports = e;  