
import React, { Component } from 'react';
import { AppRegistry, View, Text } from 'react-native';


var BaiIiaXingPageModule = new Array()
BaiIiaXingPageModule[0] = {
    "index": "百家姓",
    "name": "百家姓",
    "content": [
        "《百家姓》与《三字经》、《千字文》并称为三大蒙学读物。《百家姓》成书于北宋初年，原收集中文姓氏411个，后增补到504个，其中单姓444个，复姓60个。 《百家姓》读来顺口，易学好记。《百家姓》并不依照各姓氏的人口数量排序，“赵钱孙李”成为《百家姓》前四姓是因为百家姓形成于宋代吴越钱塘地区，故而宋朝皇帝赵氏、吴越国国王钱氏、吴越国王钱俶正妃孙氏以及南唐国王李氏成为百家姓前四位。",

    ],
}
BaiIiaXingPageModule[1] = {
    "index": "百家姓",
    "name": "赵",
    "content": [
        "历史来源",
        "　　「赵」姓出自「嬴」姓，据「唐书」记载，上古东夷族首领伯益的第十三世孙造父，在周穆王时传说他曾取良马八骏，献与周穆王，周穆王乘这八匹骏马西巡狩猎。来到昆仑山上，西王母在池设宴招待他，饮酒唱和乐而忘返，为周穆王御车，日趋千里，息徐偃王反叛，其后周穆王封造父于赵城，既今山西省洪洞具北，其后为赵氏。",
        "　　「百家姓」编与宋朝，皇帝的的姓氏是国姓，当然放在第一。",
        "　　「百家姓」的第一句，「赵钱孙李」，「赵」指「权」，「钱」指「金钱」。世间万事权和钱的问题是首要问题。",
        "家族名人",
        "　　赵武灵王",
        "　　赵云 ( ? - 229 )",
        "　　是三国名将，字子龙，三国时常山真定人。初从公孙瓒，后归附刘备。勇敢善战，以忠勇著称。封永昌亭侯，累迁镇军将军，卒谥顺平。",
        "　　赵匡胤",
        "　　赵飞燕　(? ～公元前１）",
        "　　汉成帝皇后。善歌舞，因体轻如燕，故称为飞燕。成帝时入宫，为婕妤，极得成帝宠幸，许后废，被立为皇后，擅宠十余年。哀帝立，尊其为皇太后，平帝初年，废为庶人，遂自杀。",
        "地望分布",
        "　　甘肃天水郡，河南南阳郡，甘肃金城郡，江苏下邳郡，河南颍川郡。",
    ],
}
BaiIiaXingPageModule[2] = {
    "index": "百家姓",
    "name": "钱",
    "content": [
        "历史来源",
        "　　「钱」源与彭姓，是以官职命民的姓氏。周朝有官职名「钱府上士」掌管财政，遂以官为氏。相传为古帝颛顼玄孙彭祖(即籛铿)的后代。",
        "家族名人",
        "　　钱元(887-941)",
        "　　五代十国时，吴越国的国王，颇建勋绩，一生好儒，招纳贤士。有诗千首。",
        "　　钱一本(1539-1610)",
        "　　明朝易学家，江苏常州人，官至征御史，因触怒明神宗被斥为民。他研河洛书，六经，尤精「易」，和顾宪成在东林学院讲席。",
        "地望分布",
        "　　江苏彭城郡(今徐州市)，江苏下邳郡(今江苏西北部)，浙江吴兴郡(今江苏宜兴一带)",
    ]
}
BaiIiaXingPageModule[3] = {
    "index": "百家姓",
    "name": "孙",
    "content": [
        "历史来源",
        "　　「孙」源出有三，?姓，芈姓，田姓。",
        "　　一 ; 春秋时卫武公的儿子惠孙任卫国上卿，他的儿子名乙，字武仲，以祖父的字命氏。",
        "　　二 ; 楚国有贤臣为敖，字孙叔，其支庶(宗族旁支)以祖字为氏。",
        "　　三 ; 齐国卿士书(敬仲的五世孙，字子占)。伐莒有功，齐景公封他到乐安，赐姓孙氏。",
        "家族名人",
        "　　孙武 (生卒不详)",
        "　　兵圣，是春秋末期军事家，齐国人，着兵法「十三章」。孙子被推崇为兵法的鼻祖，「孙子兵法」被奉为兵学圣典。",
        "　　孙权 (182-252)",
        "　　孙中山  (1866-1925)",
        "　　字逸仙，别号中山樵，世称中山先生，广东香山县人。清末，因见国势日衰，民族危亡，乃唤起同志，共组兴中会，为革命救国的团体；后递改为中国国民党，被推为总理。致力革命数十年，艰苦奋斗，百折不挠，终于辛亥一役，推翻满清，建立民国，改国体为民主共和。手创三民主义、五权宪法，手着建国方略、建国大纲，为革命建国的最高原则。民国十四年逝世于北京，二十九年国民政府颁令，尊为中华民国国父。",
        "地望分布",
        "　　山东乐安郡",
    ]
}
BaiIiaXingPageModule[4] = {
    "index": "百家姓",
    "name": "李",
    "content": [
        "历史来源",
        "　　「李」源出有四。",
        "　　一 ; 据《唐书，宰相世系表》所载，出自「嬴」姓。皋陶之后，世为大理(掌管刑法的狱官之长)，以官为姓，春秋时道家学说的创始人老子因祖辈为理官，遂以理「李」为氏，称李耳。",
        "　　二 ; 据「北史」所载，赵郡李氏，为赵将武安君之后，李左车其先也。",
        "　　三 ; 据「魏书」所载，后魏有代北鲜卑族复姓「叱李」氏，后改为汉字单姓「李」氏。",
        "　　四 ; 唐朝皇室姓「李」，「李」遂为国姓。唐初开国元勋诸将徐，邴，安，杜，胡，弘，郭，麻，鲜于，张，阿布，阿跌，舍利，董，罗，朱邪共十六姓(其中五家为复姓)赐与国姓「李」。此外还有许多家族改为李氏，由此李氏人丁大增。",
        "家族名人",
        "　　李耳 (即老子)",
        "　　春秋末期重要的哲学家，他崇尚自然，提出「人法地，地法天，天法道，道法自然」的思想，是中国重要的哲学思想「道家」的创始人。",
        "　　李世民 (599-649)",
        "　　李白 (701-762)",
        "　　中国最伟大的浪漫诗人，祖籍甘肃秦安，他被誉为诗仙。",
        "　　李自成 (1823-1864)",
        "　　明末农民义军领袖，号「闯王」，陕西米脂人。",
        "　　李鸿章 (1823～1901）",
        "　　字少荃，安徽合肥人，清代政治家。平定捻匪及太平天国有功，历任直隶、湖广、两广总督。尤善外交，曾多次代表清廷与外国签订条约。后因积劳呕血而死，晋封一等侯，卒谥文忠。",
        "地望分布",
        "　　甘肃陇西郡，河北赵郡，河南顿丘郡，辽宁渤海郡，河北中山郡，河南襄城，湖北江夏，四川梓潼，河北范阳郡，四川广汉郡，安徽梁国，河南南阳郡",
    ]
}
BaiIiaXingPageModule[5] = {
    "index": "百家姓",
    "name": "周",
    "content": [
        "历史来源",
        "　　「周」源出有四。",
        "　　一：周平王儿子烈封在汝州(今河南省)，当地人称他周家，便以周为姓。",
        "　　二：公元前256年，秦灭东周，将赧王废为庶人，王族亦称为周氏。",
        "　　三：唐玄宗李隆基于712年，因避讳「基」，下诏改天下的?姓为周姓。",
        "　　四：代北复姓贺鲁氏为周氏。",
        "家族名人",
        "　　周文王，周武王",
        "　　周勃(?-前169)",
        "　　西汉开国功臣，江苏沛县人。为人质仆敦厚，为汉高祖刘邦之重臣，和陈平合谋平吕氏之乱，立文帝刘恒，为一代忠臣。",
        "　　周瑜(175-21O)",
        "　　三国东吴大都督，建安十三，联合刘备，火烧赤壁，大破曹操的八十万大军，创造以弱胜的战例。",
        "地望分布",
        "　　河南汝南郡，安徽庐江郡，湖北寻阳郡，江西临川郡，河南陈留，江苏沛郡，山东泰山郡，河南河南郡",
    ]
}
BaiIiaXingPageModule[6] = {
    "index": "百家姓",
    "name": "吴",
    "content": [
        "历史来源",
        "　　「吴」源出有三。",
        "　　一;出自「姬」姓，以国名为氏，古公亶父的长子太伯出奔江南建都于梅里(江苏无锡)号称勾吴，武王灭商后太伯的三世孙周章为诸侯。至前473年为越王勾践所灭。子孙以国名为氏。",
        "　　二;古公之子虞仲的后裔，虞通吴故为姓。",
        "　　三;齐鲁一带的吴姓，多为寿梦第四子吴季礼之后。",
        "家族名人",
        "　　吴起(前440～前381）",
        "　　战国时卫人。仕魏文侯，领兵击秦，拔五城，拜西河守。后被谮奔楚，为楚悼王相，楚日益强盛。因主张废公族之疏远者以养战士，遂招怨贵戚大臣，后被射死。李克亦称起贪而好色，然用兵，司马穰苴不能过。着有「吴子六篇」。",
        "　　吴承恩(？～公元1582）",
        "　　字汝忠，号射阳山人，明淮安山阳人。约生于孝宗弘治十三年。性敏多慧，博极群书，诗文雅丽。嘉靖二十三年贡生，授长兴县丞，隆庆初，归山阳，放浪诗酒。身后诗文多散失，邑人邱正纲编纂成射阳存稿四卷，续稿一卷。复善谐剧，着杂记数种，名震一时，尤以《西游记》一书，为明人四大奇书之一，最为脍炙人口。",
        "　　吴三桂(1612～1678）",
        "　　字长白，明末清初高邮人。崇祯年间，以总兵镇山海关，李自成陷京师，夺三桂爱妾陈圆圆，三桂乃引清兵入关，破自成，清遂入主中国。三桂受封为平西王，镇云南。后叛清，自称周帝，旋病死。",
        "地望分布",
        "　　江苏陵郡",
    ]
}
BaiIiaXingPageModule[7] = {
    "index": "百家姓",
    "name": "郑",
    "content": [
        "历史来源",
"　　「郑」源出 出自「?」姓，以国名为氏，据「通志」记臷，周宣王静分封其母弟于郑国 ( 在今陕西华县以东 ) 是为郑桓公，桓公之后，郑武公迁都于新郑，为春秋时的国。后为韩国所灭。其遗族散居于淮阳，商丘一带，以原国名「郑」为姓。",
"家族名人",
"　　郑庄公",
"　　郑和",
"　　郑成功 (公元1624～1662）",
"　　初名森，字大木，唐王赐姓朱，改名成功，为明末南安人。父平国公郑芝龙降清，成功遁入海岛与父绝。桂王封之为延平郡王招讨大将军，命率师攻闽浙，又大举下江南各地，围南京，祭孝陵，后兵失利，退取台湾作为根据地，仍奉明年号，未几而卒。",
"　　郑燮 （1693～1765）",
"　　字克柔，号板桥，清江苏兴化人。少颖悟，读书富于别解，落拓不羁，有狂士之名。乾隆进士，官山东范县、潍县知县，有循吏之称。晚年躬耕自食，以诗酒自娱，诗、书、画俱佳，着有板桥全集。",
"地望分布",
"　　河南荥阳郡",
"　　字长白，明末清初高邮人。崇祯年间，以总兵镇山海关，李自成陷京师，夺三桂爱妾陈圆圆，三桂乃引清兵入关，破自成，清遂入主中国。三桂受封为平西王，镇云南。后叛清，自称周帝，旋病死。",
"地望分布",
"　　江苏陵郡",
    ]
}
BaiIiaXingPageModule[8] = {
    "index": "百家姓",
    "name": "王",
    "content": [
        "历史来源",
"　　「王」源出有许多，帝王的后裔称王子，王孙，遂为氏。",
"　　一 ; 出于「妫」姓，相传为古帝虞舜之后，子孙在陈国，齐王田和为其后人。",
"　　二 ; 出于「子」姓。商纣时王子比干之后。",
"　　三 ; 出于「?」姓。周文王第十五子毕公高之后 ; 又周灵王太子晋，因直谏被废为庶民，迁居于琅邪 ( 今山东胶南 ) ，世人称其为「王」家，其后亦为「王」氏。",
"　　四 ; 秦灭六国后，各国王族避难散居，至汉朝初年纷纷易姓为「王」氏。",
"　　五 ; 南北朝时，西魏鲜卑族复姓可颇氏。亦改为王氏。",
"　　六 ; 古高丽国君有王氏。",
"　　七 ; 西钳耳族有王氏。",
"　　八 ; 赐姓，如燕王丹的玄孙嘉，在西汉末年王莽当朝时被赐姓「王氏」。",
"　　九 ; 冒姓，如隋末王世充本姓支氏。",
"",
"家族名人",
"　　王子乔",
"　　神话传说中的仙人。汉˙刘向˙列仙传˙卷上˙王子乔：王子乔者，周灵王太子晋也。好吹笙作凤凰鸣，游伊洛之间，道士浮丘公接以上嵩高山。三十余年后，求之于山上，见柏良，曰：告我家，七月七日，待我于缑氏山巅。至时，果乘白鹤驻山头。望之不得到，举手谢时人，数日而去。亦称为王乔、王子晋。",
"　　王翦 (生卒年不详)",
"　　战国时秦的名将，频阳（今陕西富平县东北五十里）人。事秦始皇，曾定赵、燕、蓟诸地，后为李信所谗，谢病归里，后信战败，始皇遂用翦策以平荆。",
"　　王昭君 ( 王嫱 ) (生卒年不详)",
"　　汉秭归人。元帝时选入掖庭，呼韩邪单于入朝，求美人为阏氏，帝以嫱赐之，号宁胡阏氏。晋时避司马昭讳，改称明妃。",
"　　王莽",
"　　王羲之 （321～379）",
"　　字逸少，东晋临沂（今属山东）人，后南迁为会稽人。尝为右军将军，世称王右军。善书法，所写草隶，冠绝古今，以兰亭集序、乐毅论等为最，后人称为书圣。",
"　　王安石 (1021～1086）",
"　　字介甫，号半山老人，宋临川人。博览强记，工书画，尤善诗，而文词简练。神宗时为相，改革政治，锐行新法，因反对者众多，没有成功。封荆国公，卒谥文。着有周官新义、临川集、唐百家诗选等。",
"　　王阳明 (1472～1528）",
"　　字伯安，浙江余姚人。明代大儒，弘治进士。正德时巡抚南赣，定宸濠之乱。嘉靖时封新建伯，总督两广，破断藤峡贼，卒谥文成。其学以知行合一为主，发挥致良知之教，反对朱熹格物穷理之说，讲心学渊源于宋之陆九渊，世称姚江学派。尝筑室于阳明洞，学者称「阳明先生」，有王文成公全书。",
"",
"地望分布",
"　　山西太原郡，山东琅邪郡，山东北海郡，河南陈留郡，山东东海郡，山东高平郡，陕西京兆郡，甘肃天水郡，山东东平郡，河南新蔡郡，河南新野郡，江苏山阳郡，河北中山郡，河北章武郡，山东东莱郡，山西河东郡，甘肃金城郡，四川广汉郡，江苏堂邑郡，河南河南郡，河北河间郡，河南汲郡，陕西冯翊郡，辽宁营州。",
    ]
}
BaiIiaXingPageModule[9] = {
    "index": "百家姓",
    "name": "冯",
    "content": [
        "历史来源",
        "　　「冯」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《通志．氏族略．以国为氏》所载，公元前十一世纪周武王克商后，文王第十五子毕公高，初封于毕，继封与冯城。其后代逐有冯氏。",
        "　　二 ; 春秋时郑国大夫冯简子的后代。",
        "家族名人",
        "　　冯谖",
        "　　战国齐人。孟尝君门下食客，曾以食无鱼﹑出无车，弹铗而歌，孟尝君闻而特加礼遇。后冯驩为孟尝君收债于薛城，召债主焚其券，使薛民皆感孟尝君之德。",
        "　　冯梦龙 （1574～1646）",
        "　　字犹龙，一字子犹。江苏吴县人，明文学家。崇祯贡生，知寿宁县。才情跌宕，工诗文，通经学，着有戏曲数种，尤以小说《警世通言》﹑《喻世明言》﹑《醒世恒言》著名于世，称为「三言」。",
        "　　冯玉祥 （1880～1948）",
        "　　字焕章，安徽省巢县人。清末加入新军，为段祺瑞部下。1921年任河南督军，直奉战争时倒戈倾向奉系，并迅速占领北京，推段祺瑞为总统。次年奉系失败。其后加入中国国民党，曾任西北国民军总司令、河南省主席。抗战胜利后，赴国外，在由苏俄回国时，轮船在黑海上发生火灾而被烧死。",
        "地望分布",
        "　　陕西杜城郡，福建长乐郡，陕西始平郡，河南颖川郡，山西上党郡，陜西京兆郡，河南弘农郡，河北河间郡。",
    ]
}
BaiIiaXingPageModule[10] = {
    "index": "百家姓",
    "name": "陈",
    "content": [
        "历史来源",
        "　　「陈」源出 ;",
        "　　一 ; 出自「妫」姓。公元前十一世纪周武王克商后，找到帝舜的后代胡公满 「妫」姓。封胡于陈国，今河南淮阳县。并将其女嫁给他，伺奉舜祠，其后人以国名为姓。",
        "　　二 ; 鲜卑族改姓，据《魏书》所栽，南北朝时有代北三字姓侯莫陈氏，随魏孝文帝迁都洛阳，改姓陈。",
        "　　三 ; 古代安南 ( 今越南 ) 国王有姓陈。",
        "家族名人",
        "　　陈胜 （前？～前208)",
        "　　字涉，秦阳城（今河南省登封县东）人。秦二世时，与吴广起兵，天下之士苦秦苛政，相率归向。旋自立为楚王，势力颇大，后为其部下庄贾所杀。",
        "　　陈平 (生卒年不详)",
        "　　汉初阳武（今河南省阳武县东南）人。幼嗜读书，容貌俊美，足智多谋，事高祖屡出奇策。惠帝时，官至左丞相。卒谥献。",
        "　　陈寿 （233～297）",
        "　　字承祚，晋安汉（今四川省南充县）人。少举孝廉，除著作郎。撰《三国志》，时人称其善叙事，有古良史之风。",
        "　　陈霸先",
        "　　陈圆圆",
        "　　本姑苏名妓，原姓邢名沅，字畹芬。幼从养姥陈氏姓，有殊色，后为吴三桂妾。李自成破京师，掳圆圆，三桂遂引清军入关，攻破李自成，圆圆复归三桂。后三桂为滇王，圆圆随往，以女道士卒于云南。",
        "地望分布",
        "　　河南颖川郡，河北汝南郡，江苏下邳郡，江苏广陵郡，江苏东海郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[11] = {
    "index": "百家姓",
    "name": "褚",
    "content": [
        "历史来源",
        "　　「褚」源出 ;",
        "　　一 ; 以地为氏。据《后汉书．郡国志》所载，洛阳有褚氏聚。《姓氏寻源》云 : 古有褚地，居者以为氏。",
        "　　二 ; 以官为氏。据《通志．氏族略．以官为氏》云 :  本自殷 (商) 后人宋恭公的公子段食采于褚，其德可师，号曰褚师，因而命氏。「褚师」为掌管市场的官员，又叫「市令」。春秋时期，宋国，卫国，郑国都设置褚师之官。世代为楮师者，以官为氏，省为褚氏。",
        "家族名人",
        "　　褚遂良 （596～658）",
        "　　字登善，唐钱塘（今浙江省杭州）人，初唐书法家。博涉文史，工楷、隶，书学钟繇、王羲之，而成古雅瘦劲之体。太宗时历官谏议大夫兼起居注，后与长孙无忌同受顾命。高宗即位，迁尚书左仆射，封河南郡公，帝将废后立武则天，遂良力谏不纳，乞归田里。累贬爱州刺史，忧愤而卒。",
        "地望分布",
        "　　河南河南郡。",
    ]
}
BaiIiaXingPageModule[12] = {
    "index": "百家姓",
    "name": "卫",
    "content": [
        "历史来源",
        "　　「卫」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《通志．氏族略．以国为氏》和《广韵》云 。周文王的第九子原封于康，称为康叔。周公旦平定武庚之乱后，改封康叔管殷民七族，建立卫国，都治在今河南淇县，后被秦国所灭，遗民以原国名「卫」为氏。",
        "　　二 ; 历史上鲜卑族姓氏。据《后燕录》记载，昌黎 (河北昌黎) 鲜卑族有卫氏。",
        "家族名人",
        "　　卫青   (前？～前106）",
        "　　字仲卿，汉平阳（今山西临汾）人。汉武帝时名将，以大将军伐匈奴，立功，封长平侯，卒谥烈。",
        "　　卫夫人 （272～349）",
        "　　名铄，字茂猗，晋河东安邑（今山西夏县）人。为卫恒从妹（一说从女），汝阴太守李矩之妻，书法入妙，师钟繇，擅隶书及正书，王羲之、王献之尝师之。",
        "地望分布",
        "　　山西河东郡。",
    ]
}
BaiIiaXingPageModule[13] = {
    "index": "百家姓",
    "name": "蒋",
    "content": [
        "　　「蒋」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《新唐书．宰相世系表》及《通志．氏族略．以国为氏》云 。周朝初，周公第三子伯龄受封于蒋国 ( 一说在今湖北省仙居县，一说在今河南省固始县东 ) 后被楚国所灭，遗民以原国名「蒋」为氏。",
        "家族名人",
        "　　蒋琬 (？～246)",
        "　　字公琰，三国蜀汉湘乡（今湖南省湘乡县）人。初随刘备入蜀，后为诸葛亮所重，称其为社稷才。亮卒，代亮执政，官至尚书令，封安阳亭侯。以镇静为治，后诏琬屯军汉中，又命开府，加大司马。卒谥恭。",
        "地望分布",
        "　山东乐安郡。",
    ],
}
BaiIiaXingPageModule[14] = {
    "index": "百家姓",
    "name": "沈",
    "content": [
        "历史来源",
        "　　「沈」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《元和姓纂》云 。周朝初，周文王第十子季载，受封于「沈」(今河南省平舆县北 ) ， 因以国名为氏。",
        "　　二 ; 出自「姒」姓，周朝时又有侯国，沈国，其地在安徽省。此地为另一沈国。",
        "家族名人",
        "　　沈括 （1029～1093）",
        "　　字存中，宋钱塘人（今浙江省杭县）。博学多才，兼通天文、方志、律历、音乐、医药、算数等。尝出使契丹。着有梦溪笔谈、长兴集等书。",
        "　　沈周 （1427～1509）",
        "　　字启南，号石田，又号白石翁，明长洲人（今江苏省吴县）。少从陈孟贤学，及长，博综典籍，诗文俱佳，尤工于画，与唐寅、文征明、仇英并称明之四大家。着有客坐新闻、石田集、石田诗钞等。",
        "地望分布",
        "　　浙江吴兴郡。",
    ],
}
BaiIiaXingPageModule[15] = {
    "index": "百家姓",
    "name": "韩",
    "content": [
        "历史来源",
        "　　「韩」源出 ;",
        "　　一 ; 出自「姬」姓。以邑为氏。据《通志。氏族略》所载，周成王分封其第叔虞于唐邑 (山西翼城 )。因邻晋水，叔虞之子燮( 音 谢 )继位后，称为晋侯。晋穆侯之孙毕万受封于韩原 ( 陜西韩城 )，其后逐有韩氏。",
        "　　二 ; 以国为氏。战国七雄之一有韩国，三家分晋以后，于前403年由周威烈王承认为诸侯，建都阳翟 ( 今河南新郑县 )。前 230 年，韩国被秦国攻灭。国族后人有的以「韩」为氏。",
        "　　三 ; 据《魏书．官氏志》所载，北魏有代北三字姓「出大汗」氏，后改为汉字单姓「韩」氏。",
        "家族名人",
        "　　韩非 （？～前234)",
        "　　战国时韩国的诸公子之一。喜刑名法术之学，而归本于黄老，为人口吃而不能流利地辩说，与李斯同受业于荀卿。曾以书谏韩王而不见用，于是发愤著书五十余篇，号为韩非子。文章峻严峭深，集法家之大成。后秦王攻韩，韩王遣非使秦，为李斯所谮，下狱而死。",
        "　　韩信 (？～前196）",
        "　　淮阴人，年轻时曾忍少年胯下之辱，后助汉高祖伐魏、举赵、降燕、破齐，封为齐王，后徙封楚王，高祖疑其背叛，伪作云梦之会，擒置咸阳，降封淮阴侯，终为吕后所杀。",
        "　　韩愈 （768～824）",
        "　　字退之，唐河阳人。通六经百家之学，崇儒辟佛老，文章自成一家，为后世治古文者所取法。官至吏部侍郎。祖先世居昌黎，因此自称为昌黎韩愈。卒谥文，宋代元丰年间追封为昌黎伯，世称为「韩昌黎」。门人编次其诗文为昌黎先生集。",
        "　　韩湘子",
        "　　唐朝韩愈的侄子。生性放荡不拘，不好读书，世传其学道成仙，为八仙之一。尝于初冬季节令牡丹开花数色，又尝令聚盆覆土，顷刻开花。见唐˙段成式˙酉阳杂俎˙卷十九˙广动植之四。或称为「韩湘」。",
        "　　韩世忠 （1089～1151）",
        "　　字良臣，宋延安人。高宗时，平苗傅、刘正彦之乱，破金兀朮于黄天荡，名重当时，称为中兴第一功臣。后以秦桧主和，罢其兵柄，乃口不谈兵，隐居西湖，自号清凉居士。卒谥忠武，孝宗追封蕲王。",
        "　　韩侂冑 （1151～1207）",
        "　　字节夫，宋安阳人，韩琦的曾孙。宁宗时专权十余年，官至平章军国事。专横恣肆，斥理学为伪学，使朱熹等人均获罪。后欲立功以自固，乃北伐金人，终兵败被斩首。",
        "地望分布",
        "　　江西豫章郡。",
    ]
}
BaiIiaXingPageModule[16] = {
    "index": "百家姓",
    "name": "杨",
    "content": [
        "历史来源",
        "　　「杨」源出;",
        "　　一;出自「姬」姓。以国为氏。据《元和姓纂》云。周武王分封其第叔虞于唐邑(山西翼城)。出公子齐，生伯侨，天子封为杨侯，以国为氏。",
        "　　二;为五胡十六国时氐族姓氏，据《晋书》云;氐有杨氏，世居仇池(甘肃仇池山)。",
        "　　三;据《魏书．官氏志》所载，北魏有代北姓「莫胡芦」氏，后改为汉字单姓「杨」氏。",
        "　　四;出自「扬」姓。以邑为氏。古时有「扬氏邑」。",
        "家族名人",
        "　　杨戬(二郎神)",
        "　　杨坚，杨广",
        "　　杨玉环(杨贵妃)",
        "　　杨行密(852～905)",
        "　　字化源。五代吴国开国君主。庐州合肥人。少为群盗，占据庐州，唐昭宗拜为淮南节度使，封吴王，悉有淮南江东地，在位十五年。后其子溥称帝，追尊为太祖武皇帝。",
        "　　杨业",
        "　　宋朝太原人。初事北汉，骁勇善战，赐姓刘，名继业。北汉亡，归宋，刺代州，积功迁云州观察使，后潘美以忠武军节度使北征，业副之，连拔应、寰、朔各州。会契丹国母萧氏率众南下，复陷寰州，业等在朔州，蔚州刺史王侁等偪业赴敌，既战而败，援兵不至，力竭被擒，不食三日死。后杨氏几代杨延昭，杨文广一直为北宋王朝捍卫疆土，杨家将的忠勇事为后人传诵。",
        "　　杨秀清(？～1856)",
        "　　原名嗣龙，清朝广西桂平人。因与洪秀全约为兄弟，故改名秀清。与秀全同起事，屡败清兵，封东王，太平军号令几全出自秀清，权势颇盛，故世并称洪杨，后为韦昌辉所杀。",
        "地望分布",
        "　　河南弘农郡，甘肃天水郡，河南河内郡。",
    ]
}
BaiIiaXingPageModule[17] = {
    "index": "百家姓",
    "name": "朱",
    "content": [
        "历史来源",
        "　　「朱」源出 ;",
        "　　一 ; 出自「曹」姓。以国为氏。据《元和姓纂》和《通志。氏族略》云 。周武王封曹挟于邾国 (金山东邹县 )。后被楚宣王所灭，其遗族以原国名去邑为「朱」氏。",
        "　　二 ; 据《魏书．官氏志》所载，北魏有鲜卑姓「渴烛浑」氏，「朱可浑」氏，于北魏孝文帝时南迁洛阳，改为汉字单姓「朱」氏。",
        "家族名人",
        "　　朱亥",
        "　　人名。生卒年不详。战国时魏人，以屠为业。时秦围赵邯郸，魏遣晋鄙率军救赵，因惧秦兵，便留军于邺，逗留观望。魏公子无忌得侯嬴献计盗得兵符，侯嬴又荐朱亥与之同行。至魏营，晋鄙疑信陵君有诈，朱亥即出袖中铁椎击杀晋鄙，夺得兵权，破秦师，遂解邯郸之围。",
        "　　朱士行",
        "　　生卒年不详。三国魏颖川（今河南省禹县）人。因感当时所译的般若经文句艰涩，难以理解，决定西行求法，是中国最早西行求法的僧人。",
        "　　朱全忠",
        "　　朱熹 (1130～1200）",
        "　　字符晦，后改字仲晦，晚号晦翁，又号晦庵、紫阳。宋婺源人，侨寓建州。曾讲学于建阳考亭，因号考亭，晚筑草堂于云谷山，又号云谷老人。累官宝文阁待制，卒谥文，后世尊称朱子或朱文公。宝庆中赠太师，追封信国公、徽国公。其学以居敬穷理为主，集宋代理学之大成。编次著述之书甚多，所注四书，明清科举奉为程准。",
        "　　朱元璋",
        "地望分布",
        "　安徽沛郡，安徽丹阳，安徽永城，江苏吴郡，浙江钱塘，河南太康，江苏丹徒，河南河南郡 ( 今洛阳 )。 ",
    ]
}
BaiIiaXingPageModule[18] = {
    "index": "百家姓",
    "name": "秦",
    "content": [
        "历史来源",
        "　　「秦」源出;",
        "　　一;出自「姬」姓。以邑为氏，据《古今姓氏书辨正》所载，周朝周公旦之子伯禽受封鲁国，裔孙以公族大夫者食采于秦邑(今河南省范县北)，以邑名「秦」为氏。",
        "　　二;出自「嬴」姓。以国为氏。据《元和姓纂》云。嬴姓之后，伯益裔孙非子，周孝王封之于秦，陇西秦亭是也。至始皇灭六国，子婴归汉，子孙以国为氏。",
        "　　三;古代大秦(罗马帝国)商人秦论。公元226年由海道抵达吴国，曾谒见孙权，谈及大秦的风土人俗，后归本国。",
        "家族名人",
        "　　秦穆公，秦孝公，秦始皇",
        "　　秦琼(?-628)",
        "　　字叔宝，隋代历城人，事唐太宗于长春宫，骁勇善战，常为先锋，征战屡建奇功，经大小二百余阵，以旌战之功封翼国公，拜左武卫大将军。卒后改封胡国公。图形于凌烟阁(唐代为表章有功的大臣，建凌烟阁，放置功臣像)。",
        "　　秦观(1049～1100）",
        "　　字少游，号太虚，北宋高邮人。官太学博士，累迁国史院编修官。少豪隽慷慨，工诗文，词风柔婉，世称秦淮海。着有淮海集四十卷。",
        "　　秦桧（？～1155）",
        "　　字会之，宋江宁人。性阴险，晚年残忍尤甚。高宗时为相，挟金人以自重，力持和议，阻止恢复，诬杀岳飞等，一时忠臣良将殆尽，和议乃成。卒谥忠献，宁宗改谥缪丑。",
        "　　秦良玉",
        "　　生卒年不详。明石砫宣抚史之妻，忠州人。饶胆智，善骑射，兼通词翰，仪度娴雅。驭下严峻，每行军发令，戎伍肃然，所部号白杆兵，远近所惮。天启崇祯年间，屡立战功，官至总兵，拜都督佥事。",
        "地望分布",
        "　　甘肃天水郡，山西太原郡。",
    ]
}
BaiIiaXingPageModule[19] = {
    "index": "百家姓",
    "name": "尤",
    "content": [
        "历史来源",
        "「尤」源出 ;",
        "一 ; 出自「沈」姓。据《梁溪漫录》所载，五代时，王审之在福建称闽王。闽人为避「审」的嫌名 (「审」和「沈」字同音 ) ，把「沈」字去掉三点水旁，余下半个字改为「尤」。",
        "二 ; 据《后汉书．卷七十七》已有尤利多，尤还。在东汉时已见「尤」氏的记载。",
        "家族名人",
        "尤袤 （1127～1194）",
        "字延之，宋常州无锡人。少颖异，入太学，以词赋冠多士，绍兴十八年擢进士，累官国史侍讲，后除礼部尚书。尝取孙绰遂初赋以自号，光宗曾书匾赐之，年七十而卒，谥文简。着有遂初小稿等，为南宋四大家之一。",
        "尤侗 （1618～1704）",
        "字同人，更字展成，号悔",
    ]
}
BaiIiaXingPageModule[20] = {
    "index": "百家姓",
    "name": "许",
    "content": [
        "历史来源",
        "　　「许」源出 ;",
        "　　一 ; 出自「姜」姓。以国为氏。据《通志．氏族略．以国为氏》所载，公元前十一世纪周武王克商后，封伯夷的后人文叔与许国，称为许文叔。旧址在今河南省许昌市。春秋时为郑，楚等国所逼，前533年迁都叶，前524年迁都白羽 ( 今河南西峡县 )，前524年迁容城 ( 今河南鲁山县 )。战国初为楚国所灭，其后代逐有「许」氏。",
        "　　二 ; 传说帝尧时许由的后代。历史上并无证实记在此人，为神话人物。",
        "家族名人",
        "　　许由",
        "　　字武仲，生卒年不详。上古之高士，阳城槐里人。据传帝尧以天下让之，不受，隐于箕山；尧又欲官之，由谓其言污耳，乃洗耳于颍水之滨。死后，葬于箕山顶，尧号为「箕山公神」，以配食五岳。",
        "　　许慎 （58？～147？)",
        "　　字叔重，汝南召陵（今河南郾城）人。东汉经学家、文字学家。性淳笃，少博学经籍，师事贾逵，专攻古文经学，时人誉为五经无双许叔重，官至太尉、南阁祭酒。着有五经异义，今已亡佚。又着有说文解字十四卷，为中国第一部系统分析字形和考究字原的专著，对后世影响很大。",
        "　　许景澄 （1845～1900）",
        "　　字竹筠，清浙江嘉兴人。同治时进士，授编修。光绪年间出使日、俄、法、德、义、奥等国，庚子时官至吏部侍郎。后因诋斥义和团，触怒慈禧太后，被杀，后得昭雪，追谥文肃。着有外国师船图表等书。",
        "地望分布",
        "　　河北高阳郡，河南汝南郡。",
    ]
}
BaiIiaXingPageModule[21] = {
    "index": "百家姓",
    "name": "何",
    "content": [
        "　　「何」源出 ;",
        "　　一 ; 出自「姬」姓。为「韩」氏音化而成，据《元和姓纂》所载，周成王分封其第叔虞于韩。其孙韩王安，原居韩邑 ( 一说在山西河津县 ) 为秦国所灭。子孙分散于江淮之间。江淮方言，音「韩」变「何」，逐为「何」氏。",
        "　　二 ; 据《五代史》，吐谷浑族有「何」氏。又据《唐书》所载，「何」氏为「昭武九姓」之一。隋唐时期，祁连山北邵武城 ( 今甘肃省临泽县 ) 有康国，后为匈奴击败，迁至中亚，建立了安，曹，何，康，石，米，史，火寻，戊地等九个小国。唐高宗永徽年间，「昭武九姓」先后归附内地，其中有「何」氏。",
        "　　三 ; 汉代有「何」苗，本为「朱」氏，冒姓「何」氏，见于《汉书．五行志》所载，其后子息皆为望族。",
        "　　四 ; 又据《兰州府志》所载，元代有吐蕃宣慰使锁南，其子锁铭，余明代官拜河州卫指挥同知，朱明王朝赐姓何氏。",
        "家族名人",
        "　　何仙姑",
        "　　生卒年不详。相传为唐朝永州（今湖南省零陵县）人。名琼。为八仙之一，以手执荷花为特征。",
        "　　何进（？～189)",
        "　　东汉南阳宛（今河南南阳）人。字遂高。因异母女弟为灵帝后，故得权，拜为大将军，讨黄巾贼，以发贼党奸，封慎侯。何太后临朝，进为太傅，后因谋诛宦官，反为所害。",
        "地望分布",
        "　　安徽卢江郡，江苏东海郡。",
        ]
}
BaiIiaXingPageModule[22] = {
    "index": "百家姓",
    "name": "吕",
    "content": [
        "历史来源",
        "　　「吕」源出 ;",
        "　　一 ; 出自「姜」姓。以国为氏。据《通志．氏族略．以国为氏》所载，夏朝有「吕」国，在河南省南阳市，周宣王时，吕国改为甫国。春秋时，被楚国所灭。其后有吕氏。",
        "　　二 ; 据《魏书．官氏志》所载，北魏有代北姓「比丘」氏，后改为汉字单姓「吕」氏。",
        "家族名人",
        "　　吕洞宾",
        "　　吕尚",
        "　　吕不韦  (前？～ 前235)",
        "　　战国时秦人。本为商贾，因有功于秦庄襄王，而为秦相，后封文信侯。曾以有孕之姬献给庄襄王，生子政，即秦始皇。始皇时尊为仲父，后与太后私通，畏罪自杀。居相位时，曾使门客着「吕氏春秋」一书。",
        "　　吕后",
        "　　吕布",
        "　　字奉先，东汉九原人，勇冠三军，武艺超群。为董卓义子，后因董卓暴虐，与王允连手杀董卓，拥兵割据，最后为曹操所擒杀。",
        "　　吕蒙（178～219）",
        "　　字子明，富陂人。三国时吴国名将，曾计夺荆州、擒关羽，授南郡太守，封孱陵侯。",
        "　　吕光 (337～399）",
        "　　字世明。后凉开国君主，略阳氐人（故治在今陜西省秦安县东南八十里）。初事苻坚，苻坚死后，自称凉州牧，建元太安；后以麟见金泽县，改号麟嘉，称三河王；又七年，改元龙飞，称天王。在位十年，谥号懿武皇帝。",
        "　　吕留良 （1629～1683）",
        "　　字庄生，又名光纶，又字用晦，号晚村，晚号何求老人，清浙江石门县（今崇德县）人，生于明末。著作中含有种族思想，并誓不仕清。死后因牵涉曾静文字，被毁墓戮尸，全家抄斩。",
        "地望分布",
        "　　山西河东郡，山东东平郡。",
    ]
}
BaiIiaXingPageModule[23] = {
    "index": "百家姓",
    "name": "施",
    "content": [
        "历史来源",
        "　　「施」源出 ;",
        "　　一 ; 出自「子」姓，为「殷民七族」之一。据《左传》所载，周初，武王之弟康叔受封为卫侯，分到了「殷民七族」;陶氏，施氏，繁氏，樊氏等。施氏为制旗帜的工匠。",
        "　　二 ; 以国为氏。夏代诸侯国有「施氏」之国，在今湖北省恩施县，其后有「施」氏。",
        "　　三 ; 出自「姬」姓，以王父字为氏。据《通志．氏族略》所载，春秋时鲁惠公之子字施父，其支孙以王父 ( 祖父 ) 之字为氏。",
        "家族名人",
        "　　施之常",
        "　　春秋时鲁国人，为孔门弟子。",
        "　　西施",
        "　　春秋越国美女。生卒年不详。越国苎萝（今浙江诸暨县南）人。本为浣纱女，适越王句践为吴所败，欲献美女以乱其政，乃令范蠡献西施，吴王大悦，果迷惑忘政，后为越所灭。见《汉˙赵晔˙吴越春秋˙卷九˙句践阴谋外传》。亦称为西子、先施。",
        "　　施琅",
        "　　字尊侯，号琢公，清晋江人，生卒年不详。初为明代郑芝龙部将，降清后，平台湾，灭郑氏，封靖海侯，卒谥襄壮。",
        "地望分布",
        "　　江苏吴兴郡。",
    ]
}
BaiIiaXingPageModule[24] = {
    "index": "百家姓",
    "name": "张",
    "content": [
        "历史来源",
        "　　「张」源出 ;",
        "　　一 ; 出自「姬」姓，据《通志．氏族略．以字为氏》所载，张氏，世代仕晋，晋分为三，又世代仕韩，后渐成望族。",
        "　　二 ; 改姓，三国魏张辽原姓「聂」，改姓「张」。又三国蜀诸葛亮赐南蛮酋长龙佑那为「张」氏。",
        "　　三 ; 「张」氏自汉代以后，人数渐多，与当时道教的兴起与流行有关。道教自称源与黄帝，而盛行「黄帝赐姓张氏」的说法，道教领袖如张角，张鲁等。",
        "　　四 ; 据《元和姓纂》云 ﹔「黄帝第五子青阳生挥，为弓正，观孤星，始制弓矢，主祀张星，因姓张氏」。",
        "家族名人",
        "　　张仪 （前？～309）",
        "　　战国时魏人。相秦惠王，以连横之策游说六国，使六国背叛纵约以事秦。惠王卒，六国复合纵以背秦，群臣谗之，乃去秦而为魏相，一年后卒。",
        "　　张良   (前   ? - 前  186)",
        "　　字子房。汉初名臣。本是韩国公子，秦灭韩，良欲为觊齁仇，乃使人击始皇于博浪沙，不中，遂更姓名，隐于下邳，而受太公兵法于圯上老人。后为高祖策画定天下，封留侯，晚好黄老，学辟谷之术。卒谥文成。",
        "　　张道陵  (34～155）",
        "　　道教的真正创教者，本名陵，东汉沛国（今安徽省宿县西北）人。以符水禁咒法惑人，从学者须出五斗米，故世称五斗米道。亦称为张天师。",
        "　　张飞  (？～271）",
        "　　字益德，一作翼德，三国蜀汉涿郡（今河北省涿县）人。少与关羽俱事刘备，号万人敌。官至车骑将军，封西乡侯。刘备伐吴，飞率兵会合，出兵前为部下所杀。谥桓。",
        "　　张丽华",
        "　　南朝陈后主妃，神采艳丽，聪慧强记，后主常抱置膝上，共商军国大事。国亡，与后主俱入井，隋军擒而斩之。后祀奉为十月芙蓉花神。",
        "　　张果老",
        "　　张居正（1525～1582）",
        "　　字叔大，号太岳，明江陵人。穆宗时入阁，神宗时为首辅，综核名实，信赏必罚，整饬纪纲，推行一条鞭法，为相十年，海内称治。卒谥文忠。着有太岳集、帝鉴图说等。",
        "　　张骞 （？～前114)",
        "　　字子文，西汉成固（今陕西省城固县）人。武帝时以军功封博望侯，旋拜中郎将，出使乌孙，分遣副使至大宛、康居、大夏等，自此西北诸国方与汉交通，使汉朝能与中亚交流，并打通前往西域的南北两条通路，引进优良马种、葡萄及苜蓿等。",
        "　　张旭",
        "　　字伯高，唐代吴（今江苏苏州）人，生卒年不详。为著名书法家，以草书最为知名，有草圣之称。其书法逸势奇状，连绵回绕，具有新风格。与李白歌诗、裴旻剑舞并称三绝。相传他往往大醉后呼喊狂走，挥洒落笔，有时以发濡墨而书，故世称为张颠、书颠。",
        "　　张士诚 （1321～1367）",
        "　　小字九四，元朝泰州（今江苏省泰县）人。元末群雄之一。本从事运盐业，后据吴中，自称吴王，后为明将徐达、常遇春所擒，自杀身亡。",
        "　　张三丰",
        "　　生卒年不详。宋武当道士，所创太极拳术，闻名当时，其法传于后世，称内家拳，又称武当派。或作张三峰。(2) 名全，一名君宝，号三丰，明朝辽东懿州（今黑山县境）人，生卒年不详。因其不修边幅，又称张邋遢。史称其辟谷数月不饥，事能前知，太祖、成祖求之，皆不得，英宗时赠为通微显化真人。",
        "地望分布",
        "　　河南青河郡，河南南阳郡，江苏吴郡，甘肃安定郡，甘肃敦煌郡，甘肃武威郡，河北范阳郡。",
    ]
}
BaiIiaXingPageModule[25] = {
    "index": "百家姓",
    "name": "孔",
    "content": [
        "历史来源",
        "　　「孔」源出 ;",
        "　　一 ; 出自「子」姓，以王父为字氏，据《史记．孔子世家》所载 ; 孔子，宋微子之后。宋襄公弗父何，弗父何生宋父周，周生世子胜，胜生正考父，考父生孔父嘉。五世亲尽，别为公族，姓孔氏。孔父嘉生木金父，木金父生睪夷，睪夷生防叔。防叔畏华氏之逼，奔鲁。其叔为叔梁纥，生子孔丘。",
        "　　二 ; 出自「姬」姓，据《姓考》所载，春秋时卫国有孔悝，以王父字为氏，其后有姬姓之孔氏。",
        "　　三 ; 出自「妫」姓，。春秋时陈国有孔宁，王父字为氏，其后有「妫」姓之孔氏。",
        "　　四 ; 又据《左传》所载，春秋时郑穆公之后有孔张，其支孙以王父字为氏，为郑国的姬姓孔氏。",
        "家族名人 ",
        "　　孔子 (前551～前479）",
        "　　名丘，字仲尼，东方文化的代表之一，儒家思想的创始人，春秋鲁人。生有圣德，学无常师，相传曾问礼于老聃 (老子，道家思想的创始人 )，学乐于苌弘，学琴于师襄。初仕鲁，为司寇，摄行相事，鲁国大治。后周游列国十三年，不见用，年六十八，返鲁，晚年致力整理古代经典。有弟子三千，身通六艺者七十二人，开平民教育先河，后世尊为至圣先师。亦称为孔子。可惜他的思想由汉武帝开始，广被中华帝国的统治者所利用，变成统治者用来约束人民思想的有效工具，大大影响了中华帝国的发展。",
        "　　孔融 (153～208）",
        "　　字文举，东汉曲阜人，孔子二十世孙。有俊才，为建安七子之一，汉献帝时为北海相，世称孔北海；立学校，表儒术，后拜大中大夫，为曹操所杀。",
        "　　孔祥熙 (1880～1967）",
        "　　字庸之，山西太谷人。留学美国耶鲁大学。历任国民政府委员、财政部长 ( 为当时中国的首富 )、行政院长、中央银行总裁等职。",
        "地望分布",
        "　　山东鲁郡。",
    ]
}

module.exports = { BaiIiaXingPageModule: BaiIiaXingPageModule }