
import React, { Component } from 'react';
import { AppRegistry, View, Text } from 'react-native';


var BaiIiaXingPageModule = new Array()
BaiIiaXingPageModule[0] = {
    "index": "百家姓",
    "name": "百家姓",
    "content": [
        "《百家姓》与《三字经》、《千字文》并称为三大蒙学读物。《百家姓》成书于北宋初年，原收集中文姓氏411个，后增补到504个，其中单姓444个，复姓60个。 《百家姓》读来顺口，易学好记。《百家姓》并不依照各姓氏的人口数量排序，“赵钱孙李”成为《百家姓》前四姓是因为百家姓形成于宋代吴越钱塘地区，故而宋朝皇帝赵氏、吴越国国王钱氏、吴越国王钱俶正妃孙氏以及南唐国王李氏成为百家姓前四位。",

    ],
}
BaiIiaXingPageModule[1] = {
    "index": "百家姓",
    "name": "赵",
    "content": [
        "历史来源",
        "　　「赵」姓出自「嬴」姓，据「唐书」记载，上古东夷族首领伯益的第十三世孙造父，在周穆王时传说他曾取良马八骏，献与周穆王，周穆王乘这八匹骏马西巡狩猎。来到昆仑山上，西王母在池设宴招待他，饮酒唱和乐而忘返，为周穆王御车，日趋千里，息徐偃王反叛，其后周穆王封造父于赵城，既今山西省洪洞具北，其后为赵氏。",
        "　　「百家姓」编与宋朝，皇帝的的姓氏是国姓，当然放在第一。",
        "　　「百家姓」的第一句，「赵钱孙李」，「赵」指「权」，「钱」指「金钱」。世间万事权和钱的问题是首要问题。",
        "家族名人",
        "　　赵武灵王",
        "　　赵云 ( ? - 229 )",
        "　　是三国名将，字子龙，三国时常山真定人。初从公孙瓒，后归附刘备。勇敢善战，以忠勇著称。封永昌亭侯，累迁镇军将军，卒谥顺平。",
        "　　赵匡胤",
        "　　赵飞燕　(? ～公元前１）",
        "　　汉成帝皇后。善歌舞，因体轻如燕，故称为飞燕。成帝时入宫，为婕妤，极得成帝宠幸，许后废，被立为皇后，擅宠十余年。哀帝立，尊其为皇太后，平帝初年，废为庶人，遂自杀。",
        "地望分布",
        "　　甘肃天水郡，河南南阳郡，甘肃金城郡，江苏下邳郡，河南颍川郡。",
    ],
}
BaiIiaXingPageModule[2] = {
    "index": "百家姓",
    "name": "钱",
    "content": [
        "历史来源",
        "　　「钱」源与彭姓，是以官职命民的姓氏。周朝有官职名「钱府上士」掌管财政，遂以官为氏。相传为古帝颛顼玄孙彭祖(即籛铿)的后代。",
        "家族名人",
        "　　钱元(887-941)",
        "　　五代十国时，吴越国的国王，颇建勋绩，一生好儒，招纳贤士。有诗千首。",
        "　　钱一本(1539-1610)",
        "　　明朝易学家，江苏常州人，官至征御史，因触怒明神宗被斥为民。他研河洛书，六经，尤精「易」，和顾宪成在东林学院讲席。",
        "地望分布",
        "　　江苏彭城郡(今徐州市)，江苏下邳郡(今江苏西北部)，浙江吴兴郡(今江苏宜兴一带)",
    ]
}
BaiIiaXingPageModule[3] = {
    "index": "百家姓",
    "name": "孙",
    "content": [
        "历史来源",
        "　　「孙」源出有三，?姓，芈姓，田姓。",
        "　　一 ; 春秋时卫武公的儿子惠孙任卫国上卿，他的儿子名乙，字武仲，以祖父的字命氏。",
        "　　二 ; 楚国有贤臣为敖，字孙叔，其支庶(宗族旁支)以祖字为氏。",
        "　　三 ; 齐国卿士书(敬仲的五世孙，字子占)。伐莒有功，齐景公封他到乐安，赐姓孙氏。",
        "家族名人",
        "　　孙武 (生卒不详)",
        "　　兵圣，是春秋末期军事家，齐国人，着兵法「十三章」。孙子被推崇为兵法的鼻祖，「孙子兵法」被奉为兵学圣典。",
        "　　孙权 (182-252)",
        "　　孙中山  (1866-1925)",
        "　　字逸仙，别号中山樵，世称中山先生，广东香山县人。清末，因见国势日衰，民族危亡，乃唤起同志，共组兴中会，为革命救国的团体；后递改为中国国民党，被推为总理。致力革命数十年，艰苦奋斗，百折不挠，终于辛亥一役，推翻满清，建立民国，改国体为民主共和。手创三民主义、五权宪法，手着建国方略、建国大纲，为革命建国的最高原则。民国十四年逝世于北京，二十九年国民政府颁令，尊为中华民国国父。",
        "地望分布",
        "　　山东乐安郡",
    ]
}
BaiIiaXingPageModule[4] = {
    "index": "百家姓",
    "name": "李",
    "content": [
        "历史来源",
        "　　「李」源出有四。",
        "　　一 ; 据《唐书，宰相世系表》所载，出自「嬴」姓。皋陶之后，世为大理(掌管刑法的狱官之长)，以官为姓，春秋时道家学说的创始人老子因祖辈为理官，遂以理「李」为氏，称李耳。",
        "　　二 ; 据「北史」所载，赵郡李氏，为赵将武安君之后，李左车其先也。",
        "　　三 ; 据「魏书」所载，后魏有代北鲜卑族复姓「叱李」氏，后改为汉字单姓「李」氏。",
        "　　四 ; 唐朝皇室姓「李」，「李」遂为国姓。唐初开国元勋诸将徐，邴，安，杜，胡，弘，郭，麻，鲜于，张，阿布，阿跌，舍利，董，罗，朱邪共十六姓(其中五家为复姓)赐与国姓「李」。此外还有许多家族改为李氏，由此李氏人丁大增。",
        "家族名人",
        "　　李耳 (即老子)",
        "　　春秋末期重要的哲学家，他崇尚自然，提出「人法地，地法天，天法道，道法自然」的思想，是中国重要的哲学思想「道家」的创始人。",
        "　　李世民 (599-649)",
        "　　李白 (701-762)",
        "　　中国最伟大的浪漫诗人，祖籍甘肃秦安，他被誉为诗仙。",
        "　　李自成 (1823-1864)",
        "　　明末农民义军领袖，号「闯王」，陕西米脂人。",
        "　　李鸿章 (1823～1901）",
        "　　字少荃，安徽合肥人，清代政治家。平定捻匪及太平天国有功，历任直隶、湖广、两广总督。尤善外交，曾多次代表清廷与外国签订条约。后因积劳呕血而死，晋封一等侯，卒谥文忠。",
        "地望分布",
        "　　甘肃陇西郡，河北赵郡，河南顿丘郡，辽宁渤海郡，河北中山郡，河南襄城，湖北江夏，四川梓潼，河北范阳郡，四川广汉郡，安徽梁国，河南南阳郡",
    ]
}
BaiIiaXingPageModule[5] = {
    "index": "百家姓",
    "name": "周",
    "content": [
        "历史来源",
        "　　「周」源出有四。",
        "　　一：周平王儿子烈封在汝州(今河南省)，当地人称他周家，便以周为姓。",
        "　　二：公元前256年，秦灭东周，将赧王废为庶人，王族亦称为周氏。",
        "　　三：唐玄宗李隆基于712年，因避讳「基」，下诏改天下的?姓为周姓。",
        "　　四：代北复姓贺鲁氏为周氏。",
        "家族名人",
        "　　周文王，周武王",
        "　　周勃(?-前169)",
        "　　西汉开国功臣，江苏沛县人。为人质仆敦厚，为汉高祖刘邦之重臣，和陈平合谋平吕氏之乱，立文帝刘恒，为一代忠臣。",
        "　　周瑜(175-21O)",
        "　　三国东吴大都督，建安十三，联合刘备，火烧赤壁，大破曹操的八十万大军，创造以弱胜的战例。",
        "地望分布",
        "　　河南汝南郡，安徽庐江郡，湖北寻阳郡，江西临川郡，河南陈留，江苏沛郡，山东泰山郡，河南河南郡",
    ]
}
BaiIiaXingPageModule[6] = {
    "index": "百家姓",
    "name": "吴",
    "content": [
        "历史来源",
        "　　「吴」源出有三。",
        "　　一;出自「姬」姓，以国名为氏，古公亶父的长子太伯出奔江南建都于梅里(江苏无锡)号称勾吴，武王灭商后太伯的三世孙周章为诸侯。至前473年为越王勾践所灭。子孙以国名为氏。",
        "　　二;古公之子虞仲的后裔，虞通吴故为姓。",
        "　　三;齐鲁一带的吴姓，多为寿梦第四子吴季礼之后。",
        "家族名人",
        "　　吴起(前440～前381）",
        "　　战国时卫人。仕魏文侯，领兵击秦，拔五城，拜西河守。后被谮奔楚，为楚悼王相，楚日益强盛。因主张废公族之疏远者以养战士，遂招怨贵戚大臣，后被射死。李克亦称起贪而好色，然用兵，司马穰苴不能过。着有「吴子六篇」。",
        "　　吴承恩(？～公元1582）",
        "　　字汝忠，号射阳山人，明淮安山阳人。约生于孝宗弘治十三年。性敏多慧，博极群书，诗文雅丽。嘉靖二十三年贡生，授长兴县丞，隆庆初，归山阳，放浪诗酒。身后诗文多散失，邑人邱正纲编纂成射阳存稿四卷，续稿一卷。复善谐剧，着杂记数种，名震一时，尤以《西游记》一书，为明人四大奇书之一，最为脍炙人口。",
        "　　吴三桂(1612～1678）",
        "　　字长白，明末清初高邮人。崇祯年间，以总兵镇山海关，李自成陷京师，夺三桂爱妾陈圆圆，三桂乃引清兵入关，破自成，清遂入主中国。三桂受封为平西王，镇云南。后叛清，自称周帝，旋病死。",
        "地望分布",
        "　　江苏陵郡",
    ]
}
BaiIiaXingPageModule[7] = {
    "index": "百家姓",
    "name": "郑",
    "content": [
        "历史来源",
        "　　「郑」源出 出自「?」姓，以国名为氏，据「通志」记臷，周宣王静分封其母弟于郑国 ( 在今陕西华县以东 ) 是为郑桓公，桓公之后，郑武公迁都于新郑，为春秋时的国。后为韩国所灭。其遗族散居于淮阳，商丘一带，以原国名「郑」为姓。",
        "家族名人",
        "　　郑庄公",
        "　　郑和",
        "　　郑成功 (公元1624～1662）",
        "　　初名森，字大木，唐王赐姓朱，改名成功，为明末南安人。父平国公郑芝龙降清，成功遁入海岛与父绝。桂王封之为延平郡王招讨大将军，命率师攻闽浙，又大举下江南各地，围南京，祭孝陵，后兵失利，退取台湾作为根据地，仍奉明年号，未几而卒。",
        "　　郑燮 （1693～1765）",
        "　　字克柔，号板桥，清江苏兴化人。少颖悟，读书富于别解，落拓不羁，有狂士之名。乾隆进士，官山东范县、潍县知县，有循吏之称。晚年躬耕自食，以诗酒自娱，诗、书、画俱佳，着有板桥全集。",
        "地望分布",
        "　　河南荥阳郡",
        "　　字长白，明末清初高邮人。崇祯年间，以总兵镇山海关，李自成陷京师，夺三桂爱妾陈圆圆，三桂乃引清兵入关，破自成，清遂入主中国。三桂受封为平西王，镇云南。后叛清，自称周帝，旋病死。",
        "地望分布",
        "　　江苏陵郡",
    ]
}
BaiIiaXingPageModule[8] = {
    "index": "百家姓",
    "name": "王",
    "content": [
        "历史来源",
        "　　「王」源出有许多，帝王的后裔称王子，王孙，遂为氏。",
        "　　一 ; 出于「妫」姓，相传为古帝虞舜之后，子孙在陈国，齐王田和为其后人。",
        "　　二 ; 出于「子」姓。商纣时王子比干之后。",
        "　　三 ; 出于「?」姓。周文王第十五子毕公高之后 ; 又周灵王太子晋，因直谏被废为庶民，迁居于琅邪 ( 今山东胶南 ) ，世人称其为「王」家，其后亦为「王」氏。",
        "　　四 ; 秦灭六国后，各国王族避难散居，至汉朝初年纷纷易姓为「王」氏。",
        "　　五 ; 南北朝时，西魏鲜卑族复姓可颇氏。亦改为王氏。",
        "　　六 ; 古高丽国君有王氏。",
        "　　七 ; 西钳耳族有王氏。",
        "　　八 ; 赐姓，如燕王丹的玄孙嘉，在西汉末年王莽当朝时被赐姓「王氏」。",
        "　　九 ; 冒姓，如隋末王世充本姓支氏。",
        "",
        "家族名人",
        "　　王子乔",
        "　　神话传说中的仙人。汉˙刘向˙列仙传˙卷上˙王子乔：王子乔者，周灵王太子晋也。好吹笙作凤凰鸣，游伊洛之间，道士浮丘公接以上嵩高山。三十余年后，求之于山上，见柏良，曰：告我家，七月七日，待我于缑氏山巅。至时，果乘白鹤驻山头。望之不得到，举手谢时人，数日而去。亦称为王乔、王子晋。",
        "　　王翦 (生卒年不详)",
        "　　战国时秦的名将，频阳（今陕西富平县东北五十里）人。事秦始皇，曾定赵、燕、蓟诸地，后为李信所谗，谢病归里，后信战败，始皇遂用翦策以平荆。",
        "　　王昭君 ( 王嫱 ) (生卒年不详)",
        "　　汉秭归人。元帝时选入掖庭，呼韩邪单于入朝，求美人为阏氏，帝以嫱赐之，号宁胡阏氏。晋时避司马昭讳，改称明妃。",
        "　　王莽",
        "　　王羲之 （321～379）",
        "　　字逸少，东晋临沂（今属山东）人，后南迁为会稽人。尝为右军将军，世称王右军。善书法，所写草隶，冠绝古今，以兰亭集序、乐毅论等为最，后人称为书圣。",
        "　　王安石 (1021～1086）",
        "　　字介甫，号半山老人，宋临川人。博览强记，工书画，尤善诗，而文词简练。神宗时为相，改革政治，锐行新法，因反对者众多，没有成功。封荆国公，卒谥文。着有周官新义、临川集、唐百家诗选等。",
        "　　王阳明 (1472～1528）",
        "　　字伯安，浙江余姚人。明代大儒，弘治进士。正德时巡抚南赣，定宸濠之乱。嘉靖时封新建伯，总督两广，破断藤峡贼，卒谥文成。其学以知行合一为主，发挥致良知之教，反对朱熹格物穷理之说，讲心学渊源于宋之陆九渊，世称姚江学派。尝筑室于阳明洞，学者称「阳明先生」，有王文成公全书。",
        "",
        "地望分布",
        "　　山西太原郡，山东琅邪郡，山东北海郡，河南陈留郡，山东东海郡，山东高平郡，陕西京兆郡，甘肃天水郡，山东东平郡，河南新蔡郡，河南新野郡，江苏山阳郡，河北中山郡，河北章武郡，山东东莱郡，山西河东郡，甘肃金城郡，四川广汉郡，江苏堂邑郡，河南河南郡，河北河间郡，河南汲郡，陕西冯翊郡，辽宁营州。",
    ]
}
BaiIiaXingPageModule[9] = {
    "index": "百家姓",
    "name": "冯",
    "content": [
        "历史来源",
        "　　「冯」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《通志．氏族略．以国为氏》所载，公元前十一世纪周武王克商后，文王第十五子毕公高，初封于毕，继封与冯城。其后代逐有冯氏。",
        "　　二 ; 春秋时郑国大夫冯简子的后代。",
        "家族名人",
        "　　冯谖",
        "　　战国齐人。孟尝君门下食客，曾以食无鱼﹑出无车，弹铗而歌，孟尝君闻而特加礼遇。后冯驩为孟尝君收债于薛城，召债主焚其券，使薛民皆感孟尝君之德。",
        "　　冯梦龙 （1574～1646）",
        "　　字犹龙，一字子犹。江苏吴县人，明文学家。崇祯贡生，知寿宁县。才情跌宕，工诗文，通经学，着有戏曲数种，尤以小说《警世通言》﹑《喻世明言》﹑《醒世恒言》著名于世，称为「三言」。",
        "　　冯玉祥 （1880～1948）",
        "　　字焕章，安徽省巢县人。清末加入新军，为段祺瑞部下。1921年任河南督军，直奉战争时倒戈倾向奉系，并迅速占领北京，推段祺瑞为总统。次年奉系失败。其后加入中国国民党，曾任西北国民军总司令、河南省主席。抗战胜利后，赴国外，在由苏俄回国时，轮船在黑海上发生火灾而被烧死。",
        "地望分布",
        "　　陕西杜城郡，福建长乐郡，陕西始平郡，河南颖川郡，山西上党郡，陜西京兆郡，河南弘农郡，河北河间郡。",
    ]
}
BaiIiaXingPageModule[10] = {
    "index": "百家姓",
    "name": "陈",
    "content": [
        "历史来源",
        "　　「陈」源出 ;",
        "　　一 ; 出自「妫」姓。公元前十一世纪周武王克商后，找到帝舜的后代胡公满 「妫」姓。封胡于陈国，今河南淮阳县。并将其女嫁给他，伺奉舜祠，其后人以国名为姓。",
        "　　二 ; 鲜卑族改姓，据《魏书》所栽，南北朝时有代北三字姓侯莫陈氏，随魏孝文帝迁都洛阳，改姓陈。",
        "　　三 ; 古代安南 ( 今越南 ) 国王有姓陈。",
        "家族名人",
        "　　陈胜 （前？～前208)",
        "　　字涉，秦阳城（今河南省登封县东）人。秦二世时，与吴广起兵，天下之士苦秦苛政，相率归向。旋自立为楚王，势力颇大，后为其部下庄贾所杀。",
        "　　陈平 (生卒年不详)",
        "　　汉初阳武（今河南省阳武县东南）人。幼嗜读书，容貌俊美，足智多谋，事高祖屡出奇策。惠帝时，官至左丞相。卒谥献。",
        "　　陈寿 （233～297）",
        "　　字承祚，晋安汉（今四川省南充县）人。少举孝廉，除著作郎。撰《三国志》，时人称其善叙事，有古良史之风。",
        "　　陈霸先",
        "　　陈圆圆",
        "　　本姑苏名妓，原姓邢名沅，字畹芬。幼从养姥陈氏姓，有殊色，后为吴三桂妾。李自成破京师，掳圆圆，三桂遂引清军入关，攻破李自成，圆圆复归三桂。后三桂为滇王，圆圆随往，以女道士卒于云南。",
        "地望分布",
        "　　河南颖川郡，河北汝南郡，江苏下邳郡，江苏广陵郡，江苏东海郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[11] = {
    "index": "百家姓",
    "name": "褚",
    "content": [
        "历史来源",
        "　　「褚」源出 ;",
        "　　一 ; 以地为氏。据《后汉书．郡国志》所载，洛阳有褚氏聚。《姓氏寻源》云 : 古有褚地，居者以为氏。",
        "　　二 ; 以官为氏。据《通志．氏族略．以官为氏》云 :  本自殷 (商) 后人宋恭公的公子段食采于褚，其德可师，号曰褚师，因而命氏。「褚师」为掌管市场的官员，又叫「市令」。春秋时期，宋国，卫国，郑国都设置褚师之官。世代为楮师者，以官为氏，省为褚氏。",
        "家族名人",
        "　　褚遂良 （596～658）",
        "　　字登善，唐钱塘（今浙江省杭州）人，初唐书法家。博涉文史，工楷、隶，书学钟繇、王羲之，而成古雅瘦劲之体。太宗时历官谏议大夫兼起居注，后与长孙无忌同受顾命。高宗即位，迁尚书左仆射，封河南郡公，帝将废后立武则天，遂良力谏不纳，乞归田里。累贬爱州刺史，忧愤而卒。",
        "地望分布",
        "　　河南河南郡。",
    ]
}
BaiIiaXingPageModule[12] = {
    "index": "百家姓",
    "name": "卫",
    "content": [
        "历史来源",
        "　　「卫」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《通志．氏族略．以国为氏》和《广韵》云 。周文王的第九子原封于康，称为康叔。周公旦平定武庚之乱后，改封康叔管殷民七族，建立卫国，都治在今河南淇县，后被秦国所灭，遗民以原国名「卫」为氏。",
        "　　二 ; 历史上鲜卑族姓氏。据《后燕录》记载，昌黎 (河北昌黎) 鲜卑族有卫氏。",
        "家族名人",
        "　　卫青   (前？～前106）",
        "　　字仲卿，汉平阳（今山西临汾）人。汉武帝时名将，以大将军伐匈奴，立功，封长平侯，卒谥烈。",
        "　　卫夫人 （272～349）",
        "　　名铄，字茂猗，晋河东安邑（今山西夏县）人。为卫恒从妹（一说从女），汝阴太守李矩之妻，书法入妙，师钟繇，擅隶书及正书，王羲之、王献之尝师之。",
        "地望分布",
        "　　山西河东郡。",
    ]
}
BaiIiaXingPageModule[13] = {
    "index": "百家姓",
    "name": "蒋",
    "content": [
        "　　「蒋」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《新唐书．宰相世系表》及《通志．氏族略．以国为氏》云 。周朝初，周公第三子伯龄受封于蒋国 ( 一说在今湖北省仙居县，一说在今河南省固始县东 ) 后被楚国所灭，遗民以原国名「蒋」为氏。",
        "家族名人",
        "　　蒋琬 (？～246)",
        "　　字公琰，三国蜀汉湘乡（今湖南省湘乡县）人。初随刘备入蜀，后为诸葛亮所重，称其为社稷才。亮卒，代亮执政，官至尚书令，封安阳亭侯。以镇静为治，后诏琬屯军汉中，又命开府，加大司马。卒谥恭。",
        "地望分布",
        "　山东乐安郡。",
    ],
}
BaiIiaXingPageModule[14] = {
    "index": "百家姓",
    "name": "沈",
    "content": [
        "历史来源",
        "　　「沈」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《元和姓纂》云 。周朝初，周文王第十子季载，受封于「沈」(今河南省平舆县北 ) ， 因以国名为氏。",
        "　　二 ; 出自「姒」姓，周朝时又有侯国，沈国，其地在安徽省。此地为另一沈国。",
        "家族名人",
        "　　沈括 （1029～1093）",
        "　　字存中，宋钱塘人（今浙江省杭县）。博学多才，兼通天文、方志、律历、音乐、医药、算数等。尝出使契丹。着有梦溪笔谈、长兴集等书。",
        "　　沈周 （1427～1509）",
        "　　字启南，号石田，又号白石翁，明长洲人（今江苏省吴县）。少从陈孟贤学，及长，博综典籍，诗文俱佳，尤工于画，与唐寅、文征明、仇英并称明之四大家。着有客坐新闻、石田集、石田诗钞等。",
        "地望分布",
        "　　浙江吴兴郡。",
    ],
}
BaiIiaXingPageModule[15] = {
    "index": "百家姓",
    "name": "韩",
    "content": [
        "历史来源",
        "　　「韩」源出 ;",
        "　　一 ; 出自「姬」姓。以邑为氏。据《通志。氏族略》所载，周成王分封其第叔虞于唐邑 (山西翼城 )。因邻晋水，叔虞之子燮( 音 谢 )继位后，称为晋侯。晋穆侯之孙毕万受封于韩原 ( 陜西韩城 )，其后逐有韩氏。",
        "　　二 ; 以国为氏。战国七雄之一有韩国，三家分晋以后，于前403年由周威烈王承认为诸侯，建都阳翟 ( 今河南新郑县 )。前 230 年，韩国被秦国攻灭。国族后人有的以「韩」为氏。",
        "　　三 ; 据《魏书．官氏志》所载，北魏有代北三字姓「出大汗」氏，后改为汉字单姓「韩」氏。",
        "家族名人",
        "　　韩非 （？～前234)",
        "　　战国时韩国的诸公子之一。喜刑名法术之学，而归本于黄老，为人口吃而不能流利地辩说，与李斯同受业于荀卿。曾以书谏韩王而不见用，于是发愤著书五十余篇，号为韩非子。文章峻严峭深，集法家之大成。后秦王攻韩，韩王遣非使秦，为李斯所谮，下狱而死。",
        "　　韩信 (？～前196）",
        "　　淮阴人，年轻时曾忍少年胯下之辱，后助汉高祖伐魏、举赵、降燕、破齐，封为齐王，后徙封楚王，高祖疑其背叛，伪作云梦之会，擒置咸阳，降封淮阴侯，终为吕后所杀。",
        "　　韩愈 （768～824）",
        "　　字退之，唐河阳人。通六经百家之学，崇儒辟佛老，文章自成一家，为后世治古文者所取法。官至吏部侍郎。祖先世居昌黎，因此自称为昌黎韩愈。卒谥文，宋代元丰年间追封为昌黎伯，世称为「韩昌黎」。门人编次其诗文为昌黎先生集。",
        "　　韩湘子",
        "　　唐朝韩愈的侄子。生性放荡不拘，不好读书，世传其学道成仙，为八仙之一。尝于初冬季节令牡丹开花数色，又尝令聚盆覆土，顷刻开花。见唐˙段成式˙酉阳杂俎˙卷十九˙广动植之四。或称为「韩湘」。",
        "　　韩世忠 （1089～1151）",
        "　　字良臣，宋延安人。高宗时，平苗傅、刘正彦之乱，破金兀朮于黄天荡，名重当时，称为中兴第一功臣。后以秦桧主和，罢其兵柄，乃口不谈兵，隐居西湖，自号清凉居士。卒谥忠武，孝宗追封蕲王。",
        "　　韩侂冑 （1151～1207）",
        "　　字节夫，宋安阳人，韩琦的曾孙。宁宗时专权十余年，官至平章军国事。专横恣肆，斥理学为伪学，使朱熹等人均获罪。后欲立功以自固，乃北伐金人，终兵败被斩首。",
        "地望分布",
        "　　江西豫章郡。",
    ]
}
BaiIiaXingPageModule[16] = {
    "index": "百家姓",
    "name": "杨",
    "content": [
        "历史来源",
        "　　「杨」源出;",
        "　　一;出自「姬」姓。以国为氏。据《元和姓纂》云。周武王分封其第叔虞于唐邑(山西翼城)。出公子齐，生伯侨，天子封为杨侯，以国为氏。",
        "　　二;为五胡十六国时氐族姓氏，据《晋书》云;氐有杨氏，世居仇池(甘肃仇池山)。",
        "　　三;据《魏书．官氏志》所载，北魏有代北姓「莫胡芦」氏，后改为汉字单姓「杨」氏。",
        "　　四;出自「扬」姓。以邑为氏。古时有「扬氏邑」。",
        "家族名人",
        "　　杨戬(二郎神)",
        "　　杨坚，杨广",
        "　　杨玉环(杨贵妃)",
        "　　杨行密(852～905)",
        "　　字化源。五代吴国开国君主。庐州合肥人。少为群盗，占据庐州，唐昭宗拜为淮南节度使，封吴王，悉有淮南江东地，在位十五年。后其子溥称帝，追尊为太祖武皇帝。",
        "　　杨业",
        "　　宋朝太原人。初事北汉，骁勇善战，赐姓刘，名继业。北汉亡，归宋，刺代州，积功迁云州观察使，后潘美以忠武军节度使北征，业副之，连拔应、寰、朔各州。会契丹国母萧氏率众南下，复陷寰州，业等在朔州，蔚州刺史王侁等偪业赴敌，既战而败，援兵不至，力竭被擒，不食三日死。后杨氏几代杨延昭，杨文广一直为北宋王朝捍卫疆土，杨家将的忠勇事为后人传诵。",
        "　　杨秀清(？～1856)",
        "　　原名嗣龙，清朝广西桂平人。因与洪秀全约为兄弟，故改名秀清。与秀全同起事，屡败清兵，封东王，太平军号令几全出自秀清，权势颇盛，故世并称洪杨，后为韦昌辉所杀。",
        "地望分布",
        "　　河南弘农郡，甘肃天水郡，河南河内郡。",
    ]
}
BaiIiaXingPageModule[17] = {
    "index": "百家姓",
    "name": "朱",
    "content": [
        "历史来源",
        "　　「朱」源出 ;",
        "　　一 ; 出自「曹」姓。以国为氏。据《元和姓纂》和《通志。氏族略》云 。周武王封曹挟于邾国 (金山东邹县 )。后被楚宣王所灭，其遗族以原国名去邑为「朱」氏。",
        "　　二 ; 据《魏书．官氏志》所载，北魏有鲜卑姓「渴烛浑」氏，「朱可浑」氏，于北魏孝文帝时南迁洛阳，改为汉字单姓「朱」氏。",
        "家族名人",
        "　　朱亥",
        "　　人名。生卒年不详。战国时魏人，以屠为业。时秦围赵邯郸，魏遣晋鄙率军救赵，因惧秦兵，便留军于邺，逗留观望。魏公子无忌得侯嬴献计盗得兵符，侯嬴又荐朱亥与之同行。至魏营，晋鄙疑信陵君有诈，朱亥即出袖中铁椎击杀晋鄙，夺得兵权，破秦师，遂解邯郸之围。",
        "　　朱士行",
        "　　生卒年不详。三国魏颖川（今河南省禹县）人。因感当时所译的般若经文句艰涩，难以理解，决定西行求法，是中国最早西行求法的僧人。",
        "　　朱全忠",
        "　　朱熹 (1130～1200）",
        "　　字符晦，后改字仲晦，晚号晦翁，又号晦庵、紫阳。宋婺源人，侨寓建州。曾讲学于建阳考亭，因号考亭，晚筑草堂于云谷山，又号云谷老人。累官宝文阁待制，卒谥文，后世尊称朱子或朱文公。宝庆中赠太师，追封信国公、徽国公。其学以居敬穷理为主，集宋代理学之大成。编次著述之书甚多，所注四书，明清科举奉为程准。",
        "　　朱元璋",
        "地望分布",
        "　安徽沛郡，安徽丹阳，安徽永城，江苏吴郡，浙江钱塘，河南太康，江苏丹徒，河南河南郡 ( 今洛阳 )。 ",
    ]
}
BaiIiaXingPageModule[18] = {
    "index": "百家姓",
    "name": "秦",
    "content": [
        "历史来源",
        "　　「秦」源出;",
        "　　一;出自「姬」姓。以邑为氏，据《古今姓氏书辨正》所载，周朝周公旦之子伯禽受封鲁国，裔孙以公族大夫者食采于秦邑(今河南省范县北)，以邑名「秦」为氏。",
        "　　二;出自「嬴」姓。以国为氏。据《元和姓纂》云。嬴姓之后，伯益裔孙非子，周孝王封之于秦，陇西秦亭是也。至始皇灭六国，子婴归汉，子孙以国为氏。",
        "　　三;古代大秦(罗马帝国)商人秦论。公元226年由海道抵达吴国，曾谒见孙权，谈及大秦的风土人俗，后归本国。",
        "家族名人",
        "　　秦穆公，秦孝公，秦始皇",
        "　　秦琼(?-628)",
        "　　字叔宝，隋代历城人，事唐太宗于长春宫，骁勇善战，常为先锋，征战屡建奇功，经大小二百余阵，以旌战之功封翼国公，拜左武卫大将军。卒后改封胡国公。图形于凌烟阁(唐代为表章有功的大臣，建凌烟阁，放置功臣像)。",
        "　　秦观(1049～1100）",
        "　　字少游，号太虚，北宋高邮人。官太学博士，累迁国史院编修官。少豪隽慷慨，工诗文，词风柔婉，世称秦淮海。着有淮海集四十卷。",
        "　　秦桧（？～1155）",
        "　　字会之，宋江宁人。性阴险，晚年残忍尤甚。高宗时为相，挟金人以自重，力持和议，阻止恢复，诬杀岳飞等，一时忠臣良将殆尽，和议乃成。卒谥忠献，宁宗改谥缪丑。",
        "　　秦良玉",
        "　　生卒年不详。明石砫宣抚史之妻，忠州人。饶胆智，善骑射，兼通词翰，仪度娴雅。驭下严峻，每行军发令，戎伍肃然，所部号白杆兵，远近所惮。天启崇祯年间，屡立战功，官至总兵，拜都督佥事。",
        "地望分布",
        "　　甘肃天水郡，山西太原郡。",
    ]
}
BaiIiaXingPageModule[19] = {
    "index": "百家姓",
    "name": "尤",
    "content": [
        "历史来源",
        "「尤」源出 ;",
        "一 ; 出自「沈」姓。据《梁溪漫录》所载，五代时，王审之在福建称闽王。闽人为避「审」的嫌名 (「审」和「沈」字同音 ) ，把「沈」字去掉三点水旁，余下半个字改为「尤」。",
        "二 ; 据《后汉书．卷七十七》已有尤利多，尤还。在东汉时已见「尤」氏的记载。",
        "家族名人",
        "尤袤 （1127～1194）",
        "字延之，宋常州无锡人。少颖异，入太学，以词赋冠多士，绍兴十八年擢进士，累官国史侍讲，后除礼部尚书。尝取孙绰遂初赋以自号，光宗曾书匾赐之，年七十而卒，谥文简。着有遂初小稿等，为南宋四大家之一。",
        "尤侗 （1618～1704）",
        "字同人，更字展成，号悔",
    ]
}
BaiIiaXingPageModule[20] = {
    "index": "百家姓",
    "name": "许",
    "content": [
        "历史来源",
        "　　「许」源出 ;",
        "　　一 ; 出自「姜」姓。以国为氏。据《通志．氏族略．以国为氏》所载，公元前十一世纪周武王克商后，封伯夷的后人文叔与许国，称为许文叔。旧址在今河南省许昌市。春秋时为郑，楚等国所逼，前533年迁都叶，前524年迁都白羽 ( 今河南西峡县 )，前524年迁容城 ( 今河南鲁山县 )。战国初为楚国所灭，其后代逐有「许」氏。",
        "　　二 ; 传说帝尧时许由的后代。历史上并无证实记在此人，为神话人物。",
        "家族名人",
        "　　许由",
        "　　字武仲，生卒年不详。上古之高士，阳城槐里人。据传帝尧以天下让之，不受，隐于箕山；尧又欲官之，由谓其言污耳，乃洗耳于颍水之滨。死后，葬于箕山顶，尧号为「箕山公神」，以配食五岳。",
        "　　许慎 （58？～147？)",
        "　　字叔重，汝南召陵（今河南郾城）人。东汉经学家、文字学家。性淳笃，少博学经籍，师事贾逵，专攻古文经学，时人誉为五经无双许叔重，官至太尉、南阁祭酒。着有五经异义，今已亡佚。又着有说文解字十四卷，为中国第一部系统分析字形和考究字原的专著，对后世影响很大。",
        "　　许景澄 （1845～1900）",
        "　　字竹筠，清浙江嘉兴人。同治时进士，授编修。光绪年间出使日、俄、法、德、义、奥等国，庚子时官至吏部侍郎。后因诋斥义和团，触怒慈禧太后，被杀，后得昭雪，追谥文肃。着有外国师船图表等书。",
        "地望分布",
        "　　河北高阳郡，河南汝南郡。",
    ]
}
BaiIiaXingPageModule[21] = {
    "index": "百家姓",
    "name": "何",
    "content": [
        "　　「何」源出 ;",
        "　　一 ; 出自「姬」姓。为「韩」氏音化而成，据《元和姓纂》所载，周成王分封其第叔虞于韩。其孙韩王安，原居韩邑 ( 一说在山西河津县 ) 为秦国所灭。子孙分散于江淮之间。江淮方言，音「韩」变「何」，逐为「何」氏。",
        "　　二 ; 据《五代史》，吐谷浑族有「何」氏。又据《唐书》所载，「何」氏为「昭武九姓」之一。隋唐时期，祁连山北邵武城 ( 今甘肃省临泽县 ) 有康国，后为匈奴击败，迁至中亚，建立了安，曹，何，康，石，米，史，火寻，戊地等九个小国。唐高宗永徽年间，「昭武九姓」先后归附内地，其中有「何」氏。",
        "　　三 ; 汉代有「何」苗，本为「朱」氏，冒姓「何」氏，见于《汉书．五行志》所载，其后子息皆为望族。",
        "　　四 ; 又据《兰州府志》所载，元代有吐蕃宣慰使锁南，其子锁铭，余明代官拜河州卫指挥同知，朱明王朝赐姓何氏。",
        "家族名人",
        "　　何仙姑",
        "　　生卒年不详。相传为唐朝永州（今湖南省零陵县）人。名琼。为八仙之一，以手执荷花为特征。",
        "　　何进（？～189)",
        "　　东汉南阳宛（今河南南阳）人。字遂高。因异母女弟为灵帝后，故得权，拜为大将军，讨黄巾贼，以发贼党奸，封慎侯。何太后临朝，进为太傅，后因谋诛宦官，反为所害。",
        "地望分布",
        "　　安徽卢江郡，江苏东海郡。",
    ]
}
BaiIiaXingPageModule[22] = {
    "index": "百家姓",
    "name": "吕",
    "content": [
        "历史来源",
        "　　「吕」源出 ;",
        "　　一 ; 出自「姜」姓。以国为氏。据《通志．氏族略．以国为氏》所载，夏朝有「吕」国，在河南省南阳市，周宣王时，吕国改为甫国。春秋时，被楚国所灭。其后有吕氏。",
        "　　二 ; 据《魏书．官氏志》所载，北魏有代北姓「比丘」氏，后改为汉字单姓「吕」氏。",
        "家族名人",
        "　　吕洞宾",
        "　　吕尚",
        "　　吕不韦  (前？～ 前235)",
        "　　战国时秦人。本为商贾，因有功于秦庄襄王，而为秦相，后封文信侯。曾以有孕之姬献给庄襄王，生子政，即秦始皇。始皇时尊为仲父，后与太后私通，畏罪自杀。居相位时，曾使门客着「吕氏春秋」一书。",
        "　　吕后",
        "　　吕布",
        "　　字奉先，东汉九原人，勇冠三军，武艺超群。为董卓义子，后因董卓暴虐，与王允连手杀董卓，拥兵割据，最后为曹操所擒杀。",
        "　　吕蒙（178～219）",
        "　　字子明，富陂人。三国时吴国名将，曾计夺荆州、擒关羽，授南郡太守，封孱陵侯。",
        "　　吕光 (337～399）",
        "　　字世明。后凉开国君主，略阳氐人（故治在今陜西省秦安县东南八十里）。初事苻坚，苻坚死后，自称凉州牧，建元太安；后以麟见金泽县，改号麟嘉，称三河王；又七年，改元龙飞，称天王。在位十年，谥号懿武皇帝。",
        "　　吕留良 （1629～1683）",
        "　　字庄生，又名光纶，又字用晦，号晚村，晚号何求老人，清浙江石门县（今崇德县）人，生于明末。著作中含有种族思想，并誓不仕清。死后因牵涉曾静文字，被毁墓戮尸，全家抄斩。",
        "地望分布",
        "　　山西河东郡，山东东平郡。",
    ]
}
BaiIiaXingPageModule[23] = {
    "index": "百家姓",
    "name": "施",
    "content": [
        "历史来源",
        "　　「施」源出 ;",
        "　　一 ; 出自「子」姓，为「殷民七族」之一。据《左传》所载，周初，武王之弟康叔受封为卫侯，分到了「殷民七族」;陶氏，施氏，繁氏，樊氏等。施氏为制旗帜的工匠。",
        "　　二 ; 以国为氏。夏代诸侯国有「施氏」之国，在今湖北省恩施县，其后有「施」氏。",
        "　　三 ; 出自「姬」姓，以王父字为氏。据《通志．氏族略》所载，春秋时鲁惠公之子字施父，其支孙以王父 ( 祖父 ) 之字为氏。",
        "家族名人",
        "　　施之常",
        "　　春秋时鲁国人，为孔门弟子。",
        "　　西施",
        "　　春秋越国美女。生卒年不详。越国苎萝（今浙江诸暨县南）人。本为浣纱女，适越王句践为吴所败，欲献美女以乱其政，乃令范蠡献西施，吴王大悦，果迷惑忘政，后为越所灭。见《汉˙赵晔˙吴越春秋˙卷九˙句践阴谋外传》。亦称为西子、先施。",
        "　　施琅",
        "　　字尊侯，号琢公，清晋江人，生卒年不详。初为明代郑芝龙部将，降清后，平台湾，灭郑氏，封靖海侯，卒谥襄壮。",
        "地望分布",
        "　　江苏吴兴郡。",
    ]
}
BaiIiaXingPageModule[24] = {
    "index": "百家姓",
    "name": "张",
    "content": [
        "历史来源",
        "　　「张」源出 ;",
        "　　一 ; 出自「姬」姓，据《通志．氏族略．以字为氏》所载，张氏，世代仕晋，晋分为三，又世代仕韩，后渐成望族。",
        "　　二 ; 改姓，三国魏张辽原姓「聂」，改姓「张」。又三国蜀诸葛亮赐南蛮酋长龙佑那为「张」氏。",
        "　　三 ; 「张」氏自汉代以后，人数渐多，与当时道教的兴起与流行有关。道教自称源与黄帝，而盛行「黄帝赐姓张氏」的说法，道教领袖如张角，张鲁等。",
        "　　四 ; 据《元和姓纂》云 ﹔「黄帝第五子青阳生挥，为弓正，观孤星，始制弓矢，主祀张星，因姓张氏」。",
        "家族名人",
        "　　张仪 （前？～309）",
        "　　战国时魏人。相秦惠王，以连横之策游说六国，使六国背叛纵约以事秦。惠王卒，六国复合纵以背秦，群臣谗之，乃去秦而为魏相，一年后卒。",
        "　　张良   (前   ? - 前  186)",
        "　　字子房。汉初名臣。本是韩国公子，秦灭韩，良欲为觊齁仇，乃使人击始皇于博浪沙，不中，遂更姓名，隐于下邳，而受太公兵法于圯上老人。后为高祖策画定天下，封留侯，晚好黄老，学辟谷之术。卒谥文成。",
        "　　张道陵  (34～155）",
        "　　道教的真正创教者，本名陵，东汉沛国（今安徽省宿县西北）人。以符水禁咒法惑人，从学者须出五斗米，故世称五斗米道。亦称为张天师。",
        "　　张飞  (？～271）",
        "　　字益德，一作翼德，三国蜀汉涿郡（今河北省涿县）人。少与关羽俱事刘备，号万人敌。官至车骑将军，封西乡侯。刘备伐吴，飞率兵会合，出兵前为部下所杀。谥桓。",
        "　　张丽华",
        "　　南朝陈后主妃，神采艳丽，聪慧强记，后主常抱置膝上，共商军国大事。国亡，与后主俱入井，隋军擒而斩之。后祀奉为十月芙蓉花神。",
        "　　张果老",
        "　　张居正（1525～1582）",
        "　　字叔大，号太岳，明江陵人。穆宗时入阁，神宗时为首辅，综核名实，信赏必罚，整饬纪纲，推行一条鞭法，为相十年，海内称治。卒谥文忠。着有太岳集、帝鉴图说等。",
        "　　张骞 （？～前114)",
        "　　字子文，西汉成固（今陕西省城固县）人。武帝时以军功封博望侯，旋拜中郎将，出使乌孙，分遣副使至大宛、康居、大夏等，自此西北诸国方与汉交通，使汉朝能与中亚交流，并打通前往西域的南北两条通路，引进优良马种、葡萄及苜蓿等。",
        "　　张旭",
        "　　字伯高，唐代吴（今江苏苏州）人，生卒年不详。为著名书法家，以草书最为知名，有草圣之称。其书法逸势奇状，连绵回绕，具有新风格。与李白歌诗、裴旻剑舞并称三绝。相传他往往大醉后呼喊狂走，挥洒落笔，有时以发濡墨而书，故世称为张颠、书颠。",
        "　　张士诚 （1321～1367）",
        "　　小字九四，元朝泰州（今江苏省泰县）人。元末群雄之一。本从事运盐业，后据吴中，自称吴王，后为明将徐达、常遇春所擒，自杀身亡。",
        "　　张三丰",
        "　　生卒年不详。宋武当道士，所创太极拳术，闻名当时，其法传于后世，称内家拳，又称武当派。或作张三峰。(2) 名全，一名君宝，号三丰，明朝辽东懿州（今黑山县境）人，生卒年不详。因其不修边幅，又称张邋遢。史称其辟谷数月不饥，事能前知，太祖、成祖求之，皆不得，英宗时赠为通微显化真人。",
        "地望分布",
        "　　河南青河郡，河南南阳郡，江苏吴郡，甘肃安定郡，甘肃敦煌郡，甘肃武威郡，河北范阳郡。",
    ]
}
BaiIiaXingPageModule[25] = {
    "index": "百家姓",
    "name": "孔",
    "content": [
        "历史来源",
        "　　「孔」源出 ;",
        "　　一 ; 出自「子」姓，以王父为字氏，据《史记．孔子世家》所载 ; 孔子，宋微子之后。宋襄公弗父何，弗父何生宋父周，周生世子胜，胜生正考父，考父生孔父嘉。五世亲尽，别为公族，姓孔氏。孔父嘉生木金父，木金父生睪夷，睪夷生防叔。防叔畏华氏之逼，奔鲁。其叔为叔梁纥，生子孔丘。",
        "　　二 ; 出自「姬」姓，据《姓考》所载，春秋时卫国有孔悝，以王父字为氏，其后有姬姓之孔氏。",
        "　　三 ; 出自「妫」姓，。春秋时陈国有孔宁，王父字为氏，其后有「妫」姓之孔氏。",
        "　　四 ; 又据《左传》所载，春秋时郑穆公之后有孔张，其支孙以王父字为氏，为郑国的姬姓孔氏。",
        "家族名人 ",
        "　　孔子 (前551～前479）",
        "　　名丘，字仲尼，东方文化的代表之一，儒家思想的创始人，春秋鲁人。生有圣德，学无常师，相传曾问礼于老聃 (老子，道家思想的创始人 )，学乐于苌弘，学琴于师襄。初仕鲁，为司寇，摄行相事，鲁国大治。后周游列国十三年，不见用，年六十八，返鲁，晚年致力整理古代经典。有弟子三千，身通六艺者七十二人，开平民教育先河，后世尊为至圣先师。亦称为孔子。可惜他的思想由汉武帝开始，广被中华帝国的统治者所利用，变成统治者用来约束人民思想的有效工具，大大影响了中华帝国的发展。",
        "　　孔融 (153～208）",
        "　　字文举，东汉曲阜人，孔子二十世孙。有俊才，为建安七子之一，汉献帝时为北海相，世称孔北海；立学校，表儒术，后拜大中大夫，为曹操所杀。",
        "　　孔祥熙 (1880～1967）",
        "　　字庸之，山西太谷人。留学美国耶鲁大学。历任国民政府委员、财政部长 ( 为当时中国的首富 )、行政院长、中央银行总裁等职。",
        "地望分布",
        "　　山东鲁郡。",
    ]
}
BaiIiaXingPageModule[26] = {
    "index": "百家姓",
    "name": "曹",
    "content": [
        "历史来源",
        "　　「曹」源出 ， 曹是为中国最古老的姓氏之一 ;",
        "　　一 ; 古代曹姓的后裔，在公元前十一世纪周武王克商后，受封于邾国 (今山东邹县 ) ，后被楚国所灭，其子孙或为朱氏，或为曹氏。",
        "　　二 ; 出自「姬」姓。以国为氏。文王第十三子叔振铎，受封于陶丘。后被宋国所灭，其国人以「曹」为氏。",
        "　　三 ; 据《新唐书》，为少数民族「昭武九姓」（见「何」氏）之一。隋唐时期，西北突部落建有康居国，其支庶分出小国「曹」国，在今乌孜別克斯坦撤马尔罕东北部。其族人有入中原定居者，于汉族融合，用汉姓「曹」",
        "家族名人",
        "　　曹参 (？～前190）",
        "　　字敬伯，汉初沛人。与萧何同佐高祖定天下，封平阳侯，继萧何为相，一遵萧规。卒谥懿。",
        "　　曹娥 （130～143）",
        "　　东汉上虞人。其父溺死于江中，不得尸骸。娥时年十四，沿江号哭十七昼夜，投江而死。经五日，抱父尸浮出。世传为孝女。",
        "　　曹操",
        "　　曹丕（187～226）",
        "　　字子桓，三国时魏武帝之子。汉建安十六年为五官中郎将，兼副丞相。父卒，嗣为丞相。建安二十五年代汉即帝位，在位七年。性好文学，博闻强识。作有典论及诗赋函札百余篇。卒谥文帝。",
        "　　曹植 （192～232）",
        "　　字子建，三国时魏武帝第三子，文帝之弟。十岁能属文，甚得武帝宠爱。文帝立，忌其才而不重用，封陈王。植才思捷，词藻富丽，尤长于诗。六朝诗人多受其影响，谢灵运尝言：天下才共一石，子建独得八斗。卒谥思，世称为陈思王。着有曹子建集十卷。",
        "　　曹雪芹 （1719～1764）",
        "　　名沾，字梦阮，号芹溪、芹圃，清汉军正白旗人，曹寅之孙。工诗善画。本世家子，后家道中落，因追怀往昔，相传着《红楼梦》八十回，未成病卒。高鹗为续作四十回，合为一百二十回，盛行于世。",
        "　　曹国舅",
        "　　传说中的八仙之一。学道山岩间，遇钟离权、吕洞宾二仙而得道。因相传为宋曹太后之弟，故称为曹国舅。",
        "地望分布",
        "　　安徽焦郡，江苏彭城郡，山东高平郡，山东巨野郡。",
    ]
}
BaiIiaXingPageModule[27] = {
    "index": "百家姓",
    "name": "严",
    "content": [
        "历史来源",
        "　　「严」源出 ， 严是为中国较为晚的姓氏之一 ;",
        "　　避讳改姓。据《元和姓纂》及《通志．氏族略．以谥为氏》所载，严氏本为庄氏。战国时楚王侣，谥号为「庄王」，其支庶子孙逐有庄氏。东汉时，汉明帝为刘庄，为讳避皇帝的名讳，令庄氏改姓「严」氏 ( 「庄」 ，「严」两字同义 )。西汉时的庄光后改为严光。魏晋之际，有复姓本姓「庄」者，故有庄，严二氏之分。",
        "家族名人",
        "　　严嵩 （1481～1568）",
        "　　字惟中，号介溪，明江西分宜人。世宗时为相，揽权贪贿，斥戮异己，后被劾罢官，以子世蕃仍纵恣，籍没，寄食墓舍而死。嵩善书，工诗文，着有钤山堂集。",
        "地望分布",
        "　　甘肃天水郡，陜西冯翔郡，陜西华阴郡。",
    ]
}
BaiIiaXingPageModule[28] = {
    "index": "百家姓",
    "name": "华",
    "content": [
        "历史来源",
        "　　「华」源出  ;",
        "　　出自「子」姓。以邑为氏。据《通志．氏族略．以邑为氏》所载，春秋时期，宋戴公之子考父食邑于华邑 ( 陜西华阴 ) ，其后有华氏。",
        "家族名人",
        "　　华胥",
        "　　古代神话中伏羲的母亲。",
        "　　华佗 （？～207)",
        "　　字符化，东汉谯县（今安徽省亳县）人。为当时名医，擅长外科手术，首用麻醉剂为病人开刀治疗，并创五禽戏之运动以助养生，后因忤曹操而遭杀害。医界或以他为行神。或作华陀、华坨。",
        "　　华衡芳 （1833～1902）",
        "　　字若汀，江苏金匮（今江苏无锡）人，清末数学家。官直隶州知府，精研算理。深通格致之学，蘅芳不仅曾筹划机器制造局，且翻译算学、地质诸书共十二种，一百六十余卷。后讲学二十年，成就甚众。其着译范围甚广，包括代数、三角数理、微积溯源、地学浅识、行素轩算稿、行素轩文存等。",
        "地望分布",
        "　　湖南武陵郡，山东平原郡，安徽沛国。",
    ]
}
BaiIiaXingPageModule[29] = {
    "index": "百家姓",
    "name": "金",
    "content": [
        "历史来源",
        "　　「金」源出;",
        "　　一 ; 为匈奴王后裔。据《前秦录》及《广韵》所载，汉朝时匈奴休屠王太子磾事汉武帝，武帝把太子磾化妆成金色人祭天，并赐姓「金」。",
        "　　二 ; 南北朝时，北方羌族和朝鲜半岛的新罗国皆有「金」氏。据《新唐书》记载 ; 新罗国王姓「金」。",
        "　　三 ; 改姓，《吴越备史》记载 ; 五代十国时，吴越认为避国王「钱镠」之「镠」( 「镠」与「刘」古因相通 ) ，改刘氏为金氏。",
        "家族名人",
        "　　金日磾 (前134～前86)",
        "　　字翁叔，西汉人。本匈奴休屠王太子，武帝时为马监，以功拜车骑将军。武帝崩，与霍光同受遗诏辅政，卒谥敬。相传金日磾为马夫、车夫及骡马商的行神。",
        "地望分布",
        "　　江苏彭城郡。",
    ]
}
BaiIiaXingPageModule[30] = {
    "index": "百家姓",
    "name": "魏",
    "content": [
        "历史来源",
        "　　「魏」源出  ;",
        "　　一 ; 出自「姬」姓，以邑名为氏，据《新唐书．宰相世系表》及《元和姓纂》所载，春秋时，毕公高之裔孙毕万，在晋国为大夫。公元前661年，晋献公封毕万于为邑 (今山西芮城县 ) 。毕万裔孙魏斯，与赵，韩，三家分晋，各自建国。魏斯建魏国，都安邑 ( 山西夏县 ) ，为魏文侯，成为战国七雄之一。公元前225年被秦国所灭，原王族散居各地，以原国名为氏。",
        "　　二 ; 据《史记》记载，秦国穰侯魏冉，奔出自芈姓，后改为魏氏。",
        "家族名人",
        "　　魏文侯",
        "　　魏无忌 （？～前243)",
        "　　战国时魏昭王的幼子、魏安厘王的异母弟。天性仁厚，好养士，有贤名，曾用侯嬴计，却秦救赵；秦伐魏时，率领五国兵归救魏，大破秦兵，声名威振天下。后被谗废用，遂抑郁不乐沉迷于酒色，不久即因饮醇酒多近妇女，病酒而死。与齐孟尝君、赵平原君、楚春君并称为战国四公子。因魏安厘王封其地在信陵，故亦称为信陵君。",
        "　　魏征 （580～643）",
        "　　字玄成，唐曲城（今山东省掖县）人。太宗时拜谏议大夫、检校侍中，谏诤剀切，累官至左光禄大夫，封郑国公。后总修周、隋等史，多所损益，时称良史。以疾卒于官，谥文贞。",
        "地望分布",
        "　　河北巨鹿郡，山东任城郡。",
    ]
}
BaiIiaXingPageModule[31] = {
    "index": "百家姓",
    "name": "陶",
    "content": [
        "历史来源",
        "　　「陶」源出  ;",
        "　　一 ; 以地名为氏。据《姓苑》所载，上古有陶唐氏 ( 尧帝 )，居于陶邑 ( 山东定陶县 ) ，其后有陶氏。",
        "　　二 ; 以官为氏，据《左传》所载，周初，武王弟康叔受封为卫侯，分到「殷民七族」，其中有「陶」氏，即掌管制作陶器的工匠。又据《元和姓纂》所载，周朝初年，虞阏之父虞思为陶正，即掌管陶器制作的官职。其后有陶氏。",
        "家族名人",
        "　　陶侃 (259～334）",
        "　　晋代名臣，浔阳（今湖北省黄梅县北）人，字士行，明帝时拜征西大将军，都督荆襄军事，平定苏峻之乱，初为广州刺史，每日搬运砖块以锻炼体力，为人忠顺勤劳，时人比之诸葛亮。",
        "　　陶弘景 (452～536）",
        "　　南朝秣陵人，字通明。工草隶，好道术；齐高帝时，为诸王侍读，梁时隐于句曲山，自号华阳隐居；武帝时，礼聘不出，然朝廷大事，无不咨询，时称为「山中宰相」；卒赠大中大夫，谥贞白先生。著述甚多，其本草集注一书，是将本草经依药性与种属重新整理而成。",
        "　　陶潜 (365～427）",
        "　　东晋浔阳柴桑人，陶侃的曾孙，一名渊明，字符亮，安贫乐道，尝作五柳先生传以自比，世称靖节先生，诗名尤高，堪称古今隐逸诗人的宗师。",
        "地望分布",
        "　　河南济阳郡，安徽丹阳郡，江西浔阳郡。",
    ]
}
BaiIiaXingPageModule[32] = {
    "index": "百家姓",
    "name": "姜",
    "content": [
        "历史来源",
        "　　「姜」源出  ;",
        "　　姜氏为中华民族最古老的姓之一，炎帝就是姓「姜」。",
        "　　一 ; 以地名为氏。据《说文解字》及《元和姓纂》所载，神农 ( 炎帝 ) 生于姜水，故以为姓。姜太公 ( 姜尚 ) ，封于齐国，后为田和所灭，子孙分散，逐为「姜」氏。",
        "　　二 ; 据《诗经》所载，相传周族始祖后稷之母为「姜嫄」，乃姜姓有邰氏之女。",
        "家族名人",
        "　　姜嫄",
        "　　传为有邰氏之女，「帝喾」妃，周始祖后稷之母。于野外践踏巨人足迹而生稷。见《史记˙卷四˙周本纪》。或作姜原。",
        "　　姜维 (202～264）",
        "　　字伯约，三国蜀汉天水冀县人。本为魏将，后归附蜀，为诸葛亮重用，任征西将军。诸葛亮死后，继领其军。魏军攻蜀，后主刘禅降魏，姜维被迫投降。后欲谋复国，事败被乱军所杀。",
        "　　姜夔 (1155～1221）",
        "　　字尧章，自号白石道人，宋鄱阳人。终生未出仕，常往来于鄂、赣、皖、浙、苏之间，后病死于杭州。姜氏精通音律，常自度曲，工诗，词尤精。夔词以句琢字炼、清丽婉约见胜。在白石道人歌曲六卷中，有十七首词曲均有古工尺字旁谱，为研究词乐的重要资料。宁宗广元三年进大乐议一卷及琴瑟考古图一卷，论评古今的乐制问题，建议整理宫廷音乐，但未被采纳，今已失传。着有白石道人诗集、词集、歌曲等。",
        "地望分布",
        "　　甘肃天水郡。",
    ]
}
BaiIiaXingPageModule[33] = {
    "index": "百家姓",
    "name": "戚",
    "content": [
        "历史来源",
        "　　「戚」源出;",
        "　　一 ; 以邑名为氏。据《姓谱》所载，春秋时卫国大夫孙林父食采邑于戚邑 ( 河南濮阳市 ) ，其后有戚氏。国亡后，子孙逃往东海。",
        "家族名人",
        "　　戚夫人",
        "　　生卒年不详。汉高祖的宠姬，生赵王如意。高祖屡欲立为储君，不果。高祖崩，，吕后酖赵王；杀戚夫人，去其耳目手足，置于厕所中，称为「人彘」。",
        "　　戚继光 (1528～1585？）",
        "　　明代定远人，一说蓬莱人。世袭登州卫指挥佥事，好读书，通经史大义，历官浙江参将、福建总兵官等，平倭寇，功最着，总理苏州、昌平、保定三镇练兵事，节制严明，边备修饬，后改官广东，罢归，卒谥武毅。着有纪效新书、练兵实记、止止堂集等。",
        "地望分布",
        "　　山东东海郡。",
    ]
}
BaiIiaXingPageModule[34] = {
    "index": "百家姓",
    "name": "谢",
    "content": [
        "历史来源",
        "　　「谢」源出;",
        "　　一 ; 以国名为氏。据《元和姓纂》所载，周宣王分封其舅父申伯于谢国，在河南唐河县，后子孙以国为氏。",
        "　　二 ; 据《旧唐书．文苑传》所载 ; 唐代谢偃的祖父孝政，本姓直勒氏，是鲜卑族人，后改姓为「谢」氏。",
        "家族名人",
        "　　谢安 (320～385）",
        "　　字安石，东晋阳夏人。少有重名，征辟皆不就，隐居东山，年四十余，始出为桓州司马。淝水之战任征讨大都督，指导策划，克敌有功，累官至太保，卒赠太傅，故世称谢太傅。",
        "　　谢玄 (343～388）",
        "　　东晋名将，谢安侄子，阳夏人，字幼度，具经国才略，以精锐八千，破前秦苻坚百万大军于淝水，拜前将军，封康乐县公，卒谥献武。",
        "　　谢灵运 (385～433）",
        "　　南朝文学家，谢玄之孙，小名客儿，时称谢客。袭封康乐公，又称谢康乐。少好学，工书画，文章之美与颜延之为江左第一。性好山水，肆意遨游，所至辄为题咏，以致其意。其诗开创山水写实派风格。初为太尉参军，后徙广州，有诗传世。",
        "地望分布",
        "　　河南陈留郡。",
    ]
}
BaiIiaXingPageModule[35] = {
    "index": "百家姓",
    "name": "邹",
    "content": [
        "历史来源",
        "　　「邹」源出;",
        "　　一 ; 以国名为氏。据《说文解字》所载，春秋初期有邾娄国，为鲁国的附庸小国，在山东邹县，战国时鲁穆公将「邾娄」改名为「邹」。后被楚国所灭。其后人以「邹」为氏。",
        "　　二 ; 出自子姓。据《元和姓纂》所载，为春秋时宋愍公之后，正考父食采邑于邹邑，其后亦有「邹」氏。",
        "家族名人",
        "　　邹鲁氏",
        "　　其女为帝喾之妃。黄帝战败蚩尤，千其民于「邹鲁」之地。",
        "　　邹衍 (前305?～前240?）",
        "　　战国时齐人。长于思辩，倡九州岛说、五德终始说，为阴阳家的先驱。著书立说，名重诸侯，燕昭王曾师事之。因其言论迂大而闳辩，齐人称之为「谈天衍」。",
        "地望分布",
        "　　河南范阳郡。",
    ]
}
BaiIiaXingPageModule[36] = {
    "index": "百家姓",
    "name": "喻",
    "content": [
        "历史来源",
        "　　「喻」源出;",
        "　　一 ; 西汉时，苍梧太守谕猛，始改姓为「喻」。东晋时有谕归，本为喻猛之后裔，改姓为「喻」。此后史书无谕姓，晋改为「喻」。",
        "　　二 ; 赐姓，据《宋史．儒林传》所载，南宋时有愈，为梁愈药之后，皇帝赐姓为「喻」。",
        "家族名人",
        "　　喻猛",
        "　　字骄孙，东汉人，和帝 (89-104) 时任苍梧太守，以清白为治，郡人颂之。",
        "地望分布",
        "　　湖北江夏郡，江西南昌郡。",
    ]
}
BaiIiaXingPageModule[37] = {
    "index": "百家姓",
    "name": "柏",
    "content": [
        "历史来源",
        "　　「柏」源出;",
        "　　一 ; 据《姓氏考略》所载，春秋时有柏国 ( 河南西平县 ) ，为楚国所灭，子孙以国名为姓。又据《史记．秦本纪》所载，大费拜受佐舜，调训鸟兽，鸟兽多训服，是为柏翳，舜赐姓为「嬴」。",
        "家族名人",
        "　　柏濩",
        "　　神话传说中的蜀王。《汉˙扬雄˙蜀王本纪》：蜀王之先名蚕丛，后代名曰柏濩，后者名凫，此三代各数百岁，皆神化不死。",
        "　　柏高",
        "　　神话传说中的仙人。《山海经˙海内经》：山青水之东，有山名曰 ; 「肇山」有人名曰柏高，柏高上下于此，至于天。郭璞˙注：「柏子高，仙者也。」",
        "地望分布",
        "　　河南魏郡，山东济阳郡。",
    ]
}
BaiIiaXingPageModule[38] = {
    "index": "百家姓",
    "name": "水",
    "content": [
        "历史来源",
        "　　「水」源出;",
        "　　水是中国历史上比较晚出的姓氏之一，据《姓氏五书》云 ; 水是当指水为氏，如河氏，淮氏，湖氏之类。清代浙江鄞县多水氏。或为水丘氏所改。",
        "家族名人",
        "　　共工氏",
        "　　古代神话中人物，自称水德，相传为水姓之祖。古代水官亦称共工。",
        "地望分布",
        "　　浙江吴兴郡，浙江临安郡。",
    ]
}
BaiIiaXingPageModule[39] = {
    "index": "百家姓",
    "name": "窦",
    "content": [
        "历史来源",
        "　　「窦」源出;",
        "　　「窦」出自「姒」姓。已事为氏，据《风俗演义》及《新唐书．宰相世系表》所载，夏朝夏后氏帝相失国被杀。其妃有仍方怀孕，从「窦」中逃出，奔归娘家有仍 (山东济宁市 )，生有遗腹子少康。后少康中兴，为夏王。二子曰「杼」，曰「龙」，留居有仍，逐为「窦」氏。",
        "　　又 ; 古代氐族 (分布在陜西，甘肃，四川一带)亦有「窦」氏。",
        "家族名人",
        "　　窦太后 (前205 ~ 前135)",
        "　　中华帝国黄老学派的最后一个代表人物，名「漪」，河北清河郡观津人，在吕后时被选入宫。吕后赏赐每个诸侯王宫女五名，窦漪也在被选之列。因家在清河，窦姬请求分配的宦官把她分到离家较近的赵国去。但宦官把事给忘了，她被分配到代国去，就这样她到了代国，但代王刘恒非常喜欢她，和她生了刘启和刘武。窦姬信奉黄老之学(道家学说，「黄」指黄帝，「老」指「老子」。主张无为而治，宽政待民) 在她的影向下，景帝刘启以黄老治国，在以后的日子里黄老思想成为治世的主流思想直到窦太后逝世为止，历经「文，景」二朝，再她逝世前汉武帝也不敢重用儒生。",
        "　　窦宪 (? ～公元92）",
        "　　字伯度，东汉平陵人。窦融之曾孙。和帝时曾出塞三千里，大破匈奴，乃令班固作铭，刻石燕然山上，纪汉功德。还拜大将军，族党满朝，后因专权用事，为和帝赐死。",
        "　　窦建德 (573～621）",
        "　　隋朝漳南人。隋末据河北，自称夏王，为唐太宗擒杀。",
        "地望分布",
        "　　陜西扶风郡，河北观津郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[40] = {
    "index": "百家姓",
    "name": "章",
    "content": [
        "历史来源",
        "　　「章」源出;",
        "　　「章」出自「姜」姓。已国为氏，据《通志．氏族略》所载，齐太公（姜尚）支孙封国于「鄣」（山东章丘县），公元前664年被齐国所灭，子孙去邑旁为章氏。",
        "家族名人",
        "　　章邯",
        "　　生卒年不详。秦代名将，与项羽战于巨鹿及棘原，却因赵高专权，拒却章邯所请，遂降羽，被立为雍王，王咸阳以西，都于废邱；后为汉将韩信所灭。",
        "　　章学诚（1738～1801）",
        "　　字实斋，清会稽（今浙江省绍兴县）人。乾隆进士，官国子监典籍。精于史学，以纂修方志，名重于时。所著有文史通义、校雠通义、史籍考等。",
        "地望分布",
        "　　江西豫章郡。",
    ]
}
BaiIiaXingPageModule[41] = {
    "index": "百家姓",
    "name": "云",
    "content": [
        "历史来源",
        "　　「云」源出;",
        "　　一 ﹕「云」出自「妘」姓。以国名为氏，据《左传》所载，古代「妘」国，亦作「郧」国，故址在湖北郧县，后为楚国所灭，其后有「云」，「芸」，「郧」，「员」氏。",
        "　　二 ﹕ 为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「牒云氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「云」氏。",
        "家族名人",
        "　　云英",
        "　　唐代女子，相传遇裴航于蓝桥驿，遂结为夫妻，后夫妇俱入玉峰，食丹仙去。",
        "地望分布",
        "　　河南河南郡。",
    ],
}
BaiIiaXingPageModule[42] = {
    "index": "百家姓",
    "name": "苏",
    "content": [
        "历史来源",
        "　　「苏」源出  ;",
        "　　一 ﹕「苏」出自「己」姓。以国名为氏，据《元和姓纂》所载，周武王时，司寇忿生，受封于苏国，后迁于温，称为苏忿生，春秋时，苏国被狄族所灭，其子孙以国名为氏。",
        "　　二 ﹕ 为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「拔略氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「苏」氏。",
        "家族名人",
        "　　苏秦 （前？～前317）",
        "　　字季子，洛阳人，战国时纵横家。与张仪同学于鬼谷子。早年曾外出游说，然穷困而归，后佩六国相印，为纵约长，使秦不敢东出函谷关，达十五年之久。后客于齐，被杀。",
        "　　苏武 （前143？～前60）",
        "　　字子卿，西汉杜陵人（今陕西省长安县东南）。武帝时出使匈奴，单于胁降，不屈，被留十九年，仍持汉节。昭帝时，匈奴与汉和亲，始得还，拜典属国。宣帝立，赐爵关内侯，图形麒麟阁。其著作流传于今者，有诗四首、答李陵诗及别李陵等。",
        "　　三苏",
        "　　宋苏洵与二子苏轼、苏辙皆有文名，世称为「三苏」。宋˙苏轼˙次韵子由使契丹至涿州见寄诗四首之三：「毡毳年来亦甚都，时时舌问三苏。」醒世恒言˙卷十一˙苏小妹三难新郎：「老苏生下两个孩儿：大苏﹑小苏。……天下称他兄弟，谓之二苏。称他父子，谓之三苏。」",
        "　　苏轼 （1038～1101）",
        "　　字子瞻，宋眉州眉山人，为苏洵长子。诗、词、文、书、画均有名，为文雄浑奔放，诗亦清疏隽逸，为北派大宗。王安石倡行新法，轼上书痛陈不便，得罪安石，被连贬数州。在黄州时，筑室于东坡，自号东坡居士，后累官至端明殿侍读学士。卒谥文忠。着有东坡集、东坡词等。",
        "地望分布",
        "　　河南河内郡，陜西扶风郡，陜西武功郡。",
    ]
}
BaiIiaXingPageModule[43] = {
    "index": "百家姓",
    "name": "潘",
    "content": [
        "历史来源",
        "　　「潘」源出  ;",
        "　　一 ﹕「潘」出自「姬」姓。以国名为氏，据《广韵》和《元和姓纂》所载，周文王后毕公之子季孙，食邑于「潘」，其子孙以邑名为氏。",
        "　　二 ﹕出自「芈」，以字为氏。据《通志．氏族谱》及《潘岳家谱》载，春秋时楚之公族，潘崇氏也。楚成王时任世子商臣之太师。",
        "　　三 ﹕ 为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「拔略罗氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「潘」氏。",
        "家族名人",
        "　　潘美",
        "　　字仲询，大名人，为宋初名将。从石守信平扬州﹑定金陵﹑北伐太原皆有功，官至忠武军节度使，封韩国公，卒谥武惠。",
        "　　潘安 （？～300)",
        "　　字安仁，西晋中牟（今河南省中牟县东）人。美姿仪，出洛阳道，妇人尝萦绕投果。为文词藻绝丽，尤长于哀诔，有悼亡诗，为世传诵。后孙秀诬以谋反，族诛。亦称为潘河阳﹑潘安。",
        "地望分布",
        "　　河南荥阳郡，河北广宗郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[44] = {
    "index": "百家姓",
    "name": "葛",
    "content": [
        "历史来源",
        "　　「葛」源出;",
        "　　一 ﹕「葛」出自「嬴」姓。以国名为氏，夏代，有诸侯方国「葛」国，在今河南长葛县，《孟子．腾文公》载; 汤居毫，与葛伯为邻。其后有葛氏。",
        "　　二 ﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「贺葛氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「葛」氏。",
        "　　又传说葛氏为「古葛天氏之裔」，或云在伏羲之前。",
        "家族名人",
        "　　葛天氏",
        "　　传说中的上古帝王，其治世不言而信，不化而行，是远古社会理想化的政治领袖人物。晋˙陶渊明˙五柳先生传：「无怀氏之民欤，葛天，鞴坏谢」南朝梁˙刘勰˙文心雕龙˙明诗：「昔葛天騧离膉炕玄鸟在曲；黄帝云门，理不空绮。」",
        "　　葛洪（约250～330）",
        "　　晋句容人，字稚川，自号抱朴子。好神仙导养之法，元帝召为丞相掾，因平贼有功，赐爵关内侯。着抱朴子一书，述炼丹之法，建立长生理论。又相传为油漆工的祖师爷。",
        "地望分布",
        "　　河南顿丘郡，安徽梁国郡，江苏句荣郡。",
    ]
}
BaiIiaXingPageModule[45] = {
    "index": "百家姓",
    "name": "奚",
    "content": [
        "历史来源",
        "　　「奚」源出;",
        "　　一 ﹕「奚」出自「任」姓。据《姓源》载;夏朝奚仲任车正（掌管马车的官），原职于薛（山东滕县）后迁于邳（山东微山县），其后代以「奚」为氏。",
        "　　二 ﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「薄奚氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「葛」氏。",
        "家族名人",
        "　　奚容蒧",
        "　　春秋时卫国人，志气英迈，为孔子三千弟子中七十二贤人之一。",
        "地望分布",
        "　　安徽焦国郡。",
    ]
}
BaiIiaXingPageModule[46] = {
    "index": "百家姓",
    "name": "范",
    "content": [
        "　　「范」源出;",
        "　　以邑为氏，据《元和姓纂》及《通志．氏族略》载，帝尧裔孙刘累之后，在周为唐杜氏，迁于杜邑（陜西西安东南），时称杜伯。周宣王杀杜伯，其子逃奔晋国担任士师。曾孙士会。食邑于范邑（河南范县），世称范武子，子孙逐有范氏。",
        "家族名人",
        "　　范蠡",
        "　　范雎（前？～前225)",
        "　　字叔。战国时策士，魏人，善口辩，以远交近攻的策略游说秦昭王，昭王悦，官拜秦相，封应侯。",
        "　　范增 （前275～前204)",
        "　　秦末巢（今河南省睢县南）人，项羽的谋士，辅项羽称霸诸侯，羽中汉反间而疑范增，遂弃羽而归，疽发于背而卒。亦称为亚父。",
        "　　范仲淹 （989～1052）",
        "　　范成大（ 1126～1193）",
        "　　字致能，号石湖居士。宋江苏省吴县人，有文名，尤工诗，与陆游、杨万里齐名，官至参知政事。着有石湖集、揽辔录、桂海虞衡志等。",
        "地望分布",
        "　　山东高平郡。",
    ]
}
BaiIiaXingPageModule[47] = {
    "index": "百家姓",
    "name": "彭",
    "content": [
        "历史来源",
        "　　「彭」源出;",
        "　　一﹕以国名为氏，据《元和姓纂》所载，大彭为商代的诸侯，大彭国在江苏徐州氏。其后有彭氏。一说大彭即为「彭祖」。",
        "　　二﹕为古代少数民族的姓氏。据《晋书》所载，安定胡水胡有彭氏。又据《姓氏考略》云;西羌，南蛮皆有彭氏。",
        "家族名人",
        "　　彭祖",
        "　　尧的臣子籛铿。陆终氏第三子，帝颛顼之孙，历虞夏至商，相传活了七﹑八百岁。因封于彭城，故称为彭祖。后世用以比喻长寿。",
        "　　彭蒙",
        "　　战国齐的隐士，田骈之师，思想与庄子的齐是非说相近。",
        "　　彭越",
        "　　字仲，昌邑人。为汉初功臣。佐高祖定天下，封梁王。后因人告他谋反而被杀，被刘邦诛杀他的三族。",
        "　　彭绍升",
        "　　字允初，号尺木，又号知归子及二林居士，际清是他受菩萨戒的法名。江苏长洲县人。清代著名的居士。乾隆三十四年进士及第，授县官，辞不就。因结织罗有高与阅读明朝高僧紫柏的全集，受到感动而归心佛法，尤深信净土。他在净土教义上除莲池外，最推重省庵。平日常闭关念佛，发愿回向。着有一行居士集、居士传、阿弥陀经约论、一乘决疑论等。对清代净土信仰的推展有重要的影响。",
        "地望分布",
        "　　甘肃陇西郡，江西宜春郡。",
    ]
}
BaiIiaXingPageModule[48] = {
    "index": "百家姓",
    "name": "郎",
    "content": [
        "历史来源",
        "　　「郎」源出;",
        "　　一﹕出自「姬」姓，以地名为氏，据《元和姓纂》所载，春秋时鲁懿公之孙费伯，筑郎城居之（在山东曲阜），其后有郎氏。",
        "　　二﹕历史上南匈奴的姓氏。",
        "家族名人",
        "　　朗士元",
        "　　字君胄，唐代定州人。天宝年间（744-755）进士，官至郢州刺使。善写诗，与钱起齐名。",
        "　　郎静山 （1892～1995）",
        "　　江苏省人。国际闻名之摄影家。十三岁开始接触摄影，二十五岁成为中国第一名摄影记者。在中国摄影史上，郎氏是首位人体摄影拍摄者，首位摄影课程之教师，首位入选国际摄影沙龙之中国摄影家。以自创集锦摄影闻名于世。",
        "地望分布",
        "　　河北中山郡，山东魏郡。",
    ]
}
BaiIiaXingPageModule[49] = {
    "index": "百家姓",
    "name": "鲁",
    "content": [
        "历史来源",
        "　　「鲁」源出  ;",
        "　　一﹕出自「姬」姓，以国名为氏，据《姓谱》和《元和姓纂》所载，西周初年，周公旦之子伯禽受封于鲁国（山东），传三十四代，九百余年，至鲁顷公时，灭于楚国，迁至下邑，子孙逐以国名为氏。",
        "家族名人",
        "　　鲁仲连",
        "　　战国时齐人。曾游于赵，为赵国解除危难，平原君欲赠与千金却推辞不受。喜替人排难解纷而不肯仕宦任职。后称替人解纷排难的人为鲁仲连。如：他是个古道热肠的鲁仲连，专门替人排解纷争。亦称为鲁连。",
        "　　鲁肃 （173～217)",
        "　　字子敬，东城人（今安徽省定远县东南）。三国时名将，个性方正严谨，富而好施，长于文章，思虑深远，有过人之明。在赤壁之役，建议结合刘备来抵御曹操，并辅佐周瑜大败曹军，为孙权所器重，官拜奋武校尉，转横江将军。",
        "　　鲁迅 （1881～1936）",
        "　　中国现代小说家。浙江省绍兴县人，本名周树人。作品思想深刻，具体反映中国三十年代的社会状况；在艺术上，融冶中外小说的技法而别开新局，好以讽刺的笔法，针砭中国社会的病态与人性弱点。代表作有狂人日记、阿Ｑ正传等，作品编为鲁迅全集二十卷。",
        "地望分布",
        "　　陜西扶风郡，河南新蔡郡。",
    ]
}
BaiIiaXingPageModule[50] = {
    "index": "百家姓",
    "name": "韦",
    "content": [
        "历史来源",
        "　　「韦」源出;",
        "　　一﹕出自「祁」姓，以国名为氏，据《通志．氏族略》所载，在夏朝为御龙氏，在商朝为豕为氏。又《唐书．宰相世系表》所载，豕韦国（河南滑县南）之后有韦氏。",
        "　　二 ﹕据《汉书．西域传》所载，汉代疏勒国亦有韦氏。",
        "　　三 ﹕传说秦汉之际韩信曾藏身于南粤（两广一带）为避仇，以「韩」字的半边「韦」为姓。今广西僮族多韦氏。又传说颛顼孙大彭为夏诸侯，少康封其别孙元哲于豕韦。",
        "家族名人",
        "　　韦昭 （204～273）",
        "　　字弘嗣，三国吴云阳（今江苏省丹阳县）人。好学能文，孙皓时为侍中，领修国史，因持正敢谏为孙皓所杀。所注孝经、论语、国语，均有名于世。",
        "　　韦庄",
        "　　字端己，生卒年不详，前蜀杜陵（今陜西省长安县东南）人。本为唐末进士，后入蜀依附王建，掌书记。及王建据蜀称帝，蜀开国制度皆庄所定，累官吏部尚书，同平章事，谥文靖，工诗词。着有浣花集，所为秦妇吟长诗，尤有名于世。",
        "地望分布",
        "　　陜西京兆郡。",
    ]
}
BaiIiaXingPageModule[51] = {
    "index": "百家姓",
    "name": "昌",
    "content": [
        "历史来源",
        "　　「昌」源出  ;",
        "　　一﹕出自「妊」姓，以国名为氏，据《通志．氏族略》所载，传说上古有昌意，为黄帝之子，「嫘祖」（黄帝的后）所生。",
        "家族名人",
        "　　昌意",
        "　　黄帝二十五子中的其中一位，为嫘祖所生，其后代为「昌」氏。",
        "　　昌容",
        "　　为殷商王之女，修道于常山，食蓬萦根二百余年，颜如二十许。能用紫草来染工，挣德的钱用来给有病的人。",
        "地望分布",
        "　　河南汝南郡，山东东海郡。",
    ],
}
BaiIiaXingPageModule[52] = {
    "index": "百家姓",
    "name": "马",
    "content": [
        "历史来源",
        "　　「马」源出;",
        "　　一﹕出自「嬴」姓，以邑名为氏，据《元和姓纂》所载，赵惠文王二十九年（前270年），赵国大将赵奢因战公，受封于马服（河南邯郸），称为马服君。其后有马服氏，简为马氏。",
        "　　二 ﹕据《金史》所载，西域人马庆祥，入居临洮狄道，逐以马为氏。",
        "　　三 ﹕据《元史》所载，元之月乃和，以祖为金国马步指挥使，因改姓马。名祖常。",
        "　　四 ﹕元明时期，回族依斯兰教徒多用马氏。",
        "家族名人",
        "　　马援　（前14～49）",
        "　　字文渊，东汉茂陵（今陕西省兴平县东北）人。初依隗嚣，后归光武，拜伏波将军，平交趾。援曾有「大丈夫老当益壮」及「男儿要当死于边野，以马革裹尸还葬」等语。世称「马伏波」。",
        "　　马超",
        "　　字孟起，茂陵人。勇冠西凉，乃凉州太守马腾之子，后因其父被曹操杀死，遂起二十万兵伐洛阳报父仇。杀得曹操割须弃袍，事败后投靠张鲁。曾与张飞在葭萌关大战三日三夜，其后加入刘备军，成为五虎将之一。",
        "　　马谡（190～228）",
        "　　三国时蜀臣，马良之弟，才气过人，好论军计，尝谓用兵之道，攻心为上，攻城为下，诸葛亮深加器重，后与魏将张合战于街亭，为合所败，下狱而死，亮为之流涕。",
        "地望分布",
        "　　甘肃扶风郡，山西平阳郡。",
    ]
}
BaiIiaXingPageModule[53] = {
    "index": "百家姓",
    "name": "苗",
    "content": [
        "历史来源",
        "　　「苗」源出;",
        "　　一﹕以邑名为氏，据《风俗通义》及《通志．氏族略．以邑为氏》所载，公元前547年，楚国因若敖之乱，楚大夫伯棼被杀，其子贲皇逃奔国，受封于苗邑（河南济源县），子孙逐以邑名「苗」为氏。",
        "家族名人",
        "　　苗发",
        "　　唐代壶关人。擅长写诗，与卢纶，吉中孚，司空暑，钱起等九人齐名，合称大历十大才子。",
        "地望分布",
        "　　浙江东阳郡。",
    ]
}
BaiIiaXingPageModule[54] = {
    "index": "百家姓",
    "name": "凤",
    "content": [
        "历史来源",
        "　　「凤」源出;",
        "　　一﹕据《左传》云，高辛帝时，凤鸟氏为历正（掌管历法的官），盖以职事为氏。一说，凤氏即为风氏。",
        "家族名人",
        "　　凤鸟氏",
        "　　相传为上古时代高辛氏帝喾时的历正。",
        "　　凤纲",
        "　　西汉渔阳人，相传曾采集百草花制药，服食后成仙而去。",
    ]
}
BaiIiaXingPageModule[55] = {
    "index": "百家姓",
    "name": "花",
    "content": [
        "历史来源",
        "　　「花」源出;",
        "　　是「华」所分出。参见该条。又据《姓苑》云，花氏出自何氏，由音变而成。",
        "家族名人",
        "　　花木兰",
        "　　改易男装代父从军的孝女。古乐府有木兰诗咏其事。姚莹康輶纪行以为北魏人，宋翔凤过庭录以为隋恭帝时人，程大昌演繁露以木兰诗中有可汗大点兵语。则以为非隋即唐之人。姓氏不可考，或以为姓花。",
        "　　花云",
        "　　明初名将，死于陈友凉。",
        "地望分布",
        "　　山东东平郡。",
    ]
}
BaiIiaXingPageModule[56] = {
    "index": "百家姓",
    "name": "方",
    "content": [
        "历史来源",
        "　　「方」源出;",
        "　　出自「姬」姓，以字为氏。周宣王有大臣方叔。见《诗经．小雅．采芑》云﹕「方叔止。」「方叔，卿士也。支孙以王父字「方」为氏。又，《风俗演义》云﹕相传为古帝榆罔之子方雷氏之后。",
        "家族名人",
        "　　方叔",
        "　　西周宣王（前八世纪）时的卿士，征伐古族玁狁有功。",
        "　　方孝孺（1357～1402）",
        "　　字希直，一字希古，明建文帝之忠臣，宁海人。以明王道﹑致太平为己任，工文章，名书室曰正学，官侍讲学士，因拒燕王草即帝位诏之命而被杀，福王时追谥文正。着有侯成集﹑希古堂稿等。",
        "　　方苞 （1668～1749）",
        "　　字凤九，号灵皋，晚号望溪，清安徽桐城人。官至侍郎。论学以宋儒为宗，说经推衍程朱之学，尤致力于春秋三礼。文学韩欧，严于义法，为桐城派之宗主。着有周官辨﹑春秋通论﹑礼记析疑﹑望溪文集等。",
        "地望分布",
        "　　河南河南郡。",
    ]
}
BaiIiaXingPageModule[57] = {
    "index": "百家姓",
    "name": "俞",
    "content": [
        "历史来源",
        "　　「俞」源出;",
        "　　据《通志．氏族略》载，古代有俞跗，善医，为「俞」姓之始。见于《史记》。",
        "家族名人",
        "　　俞伯牙",
        "　　春秋时人，传说以精于琴艺著名，惟知有钟子期完全理解琴意，知其志在高山流水。子期死后，伯牙终身不复鼓琴。",
        "　　俞大猷 （？～1580）",
        "　　字志辅，号虚江，晋江人，为明代名将。读书而知兵法，嘉靖武举，擢广东都司，平交黎，进参将，移浙东，屡破倭寇，升为总兵，复镇两广，剿灭群盗，平定猺乱，威震南服，号称俞家军，卒谥武襄。",
        "地望分布",
        "　　河北河间郡，湖北江陵郡。",
    ]
}
BaiIiaXingPageModule[58] = {
    "index": "百家姓",
    "name": "任",
    "content": [
        "历史来源",
        "　　「任」源出;",
        "　　一﹕「任」（妊）姓为中国最古老的姓之一。《左传正义》云﹕太昊后，谢，章，薛，舒，吕，祝，终，泉，毕，过，此十国皆「任」性也。",
        "　　二﹕出自「风」姓，以国名为氏。据《唐书．宰相世系表》及《通志．氏族略．以国为氏》所载，周代任国，在山东济宁县，其后有「任」氏。",
        "家族名人",
        "　　太任",
        "　　亦作太妊，周文王之母，为「任」姓，史称「太任」。",
        "　　任昉 （460～508）",
        "　　字彦升，南朝梁博昌人（今山东省博兴县南）。武帝时为义兴、新安太守，有政声。见宫中内藏四部古籍篇卷纷杂，于是亲自校雠勘定。着有杂传、地记等书。卒谥敬。",
        "地望分布",
        "　　山东乐安郡。",
    ]
}
BaiIiaXingPageModule[59] = {
    "index": "百家姓",
    "name": "袁",
    "content": [
        "历史来源",
        "　　「袁」源出;",
        "　　出自「妫」姓，据《通志．氏族略．以字为氏》所载，「袁」亦作「辕」，「爰」。陈胡公之裔。十八世孙庄伯生诸，字伯爰。伯爰之孙涛涂，以王父字为氏，称「爰涛涂」。亦作袁涛涂。世代为陈上卿。其后有「袁」氏。",
        "家族名人",
        "　　袁绍 （？～202)",
        "　　字本初，东阳汝阳（今河南省商水县西北）人。曾起兵讨董卓，后据河北，与曹操战于官渡，大败，发病而死。",
        "　　袁崇焕 （？～1630）",
        "　　字元素，明东莞人。有胆略，好谈兵。万历进士，天启间以御清兵着绩，累官至佥都御史，巡抚辽东。崇祯时为兵部尚书兼右副都御史，督师蓟辽，闻警入援京师，遭谗而被磔于市。",
        "　　袁枚 （1716～1797）",
        "　　字子才，号简斋，清钱塘（今浙江省杭县）人。乾隆进士，由翰林为知县，后弃官，筑随园于江宁城西，以吟咏为乐，世称随园先生。论诗主性灵，品评古今，时有新解。着有小仓山房诗文集、随园诗话、随园随笔等。",
        "　　袁世凯（1859～1916）",
        "　　字慰廷，号容庵，河南项城人。清末，为李鸿章所赏识，戊戌政变，因告密而得宠，山东巡抚，进直隶总督，嗣官外务部尚书、军机大臣。辛亥革命事起，以内阁总理大臣，挟北洋兵力，与民军议和，迫清帝退位，孙中山先生力辞大总统让之，遂为民国首任大总统。后谋行帝制，孙中山先生号召全国声讨，忧愤而死。",
        "地望分布",
        "　　河南汝南郡，河南陈郡，江苏彭城郡。",
    ]
}
BaiIiaXingPageModule[60] = {
    "index": "百家姓",
    "name": "柳",
    "content": [
        "历史来源",
        "　　「柳」源出;",
        "　　出自「姬」姓，据《元和姓纂》及《唐书．宰相世系表》所载，春秋时，鲁孝公之后有展禽，曾任鲁国士师（相当于狱官），封邑在柳下。死后缢号为「惠」。其后有「柳」氏。",
        "家族名人",
        "　　柳宗元 （773～819）",
        "　　字子厚，河东（今山西省永济县）人，故亦称为柳河东。唐代文学家。德宗贞元时进士，官至监察御史。后被贬为永州司马，又贬柳州刺史，故亦称为「柳柳州」。为唐代古文运动主将，其诗文擅于刻划山水，反映现实，风格清新峭拔。文集有柳河东集、龙城录等。",
        "　　柳敬亭 （1587～1670？）",
        "　　名逢春，秦州人。明末著名的说书人。本姓曹，为避仇家而流落江湖，休于柳下，改姓柳。曾入左良玉幕府，良玉败，又游松江马提督军中，终不得志。善说书，使人驻足聆听，乐而忘倦。",
        "地望分布",
        "　　山东河东郡。",
    ]
}
BaiIiaXingPageModule[61] = {
    "index": "百家姓",
    "name": "酆",
    "content": [
        "历史来源",
        "　　「酆」源出;",
        "　　出自「姬」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，文王第十七子受封于酆国，称为酆侯，其后以国为氏。",
        "家族名人",
        "　　酆寅初",
        "　　元末明初人，字复出。博学多才，不愿为元朝做官而隐居，洪武年间任国子司业，后弃官，活至105岁。",
        "地望分布",
        "　　陜西京兆郡。",
    ],
}
BaiIiaXingPageModule[62] = {
    "index": "百家姓",
    "name": "鲍",
    "content": [
        "历史来源",
        "　　「鲍」源出;",
        "　　一﹕出自「姒」姓，以国名为氏。据《元和姓纂》和《通志．氏族略》所载，春秋时，夏禹后人，杞国公子敬叔，到齐国出任，食邑于鲍邑。因以鲍为氏。其子鲍叔牙，曾孙鲍国，世代为上卿。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「俟力伐氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「鲍」氏。又代北复姓有「鲍俎」氏。",
        "家族名人",
        "　　鲍叔牙",
        "　　春秋齐大夫，生卒年不详。少与管仲友善，知管仲贤而贫，分财多与；后鲍叔牙事齐桓公，管仲事公子纠，公子纠死，管仲囚，鲍叔牙乃荐管仲于桓公，卒佐桓公成霸业。世多称其知人而笃于友谊。",
        "　　鲍靓 神仙太守",
        "　　鲍姑",
        "地望分布",
        "　　山西上党郡，山东东海郡，山东泰山郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[63] = {
    "index": "百家姓",
    "name": "史",
    "content": [
        "历史来源",
        "　　「史」源出;",
        "　　一﹕以官为氏。据《唐书．宰相世系表》所载，史氏，出自周太史佚之后。。佚亦作「逸」，史乃官名，亦称「作册逸」，「尹佚」主要职责是纪录天子言行。有人将史佚与姜太公，周公，召公并称为「四圣」。其后以史为氏。",
        "　　二﹕为「昭武九姓」之一。（见「何」姓），史国故址在今乌兹别克斯坦，撒马尔罕之南。一度归唐朝管辖，唐高帝永徽年间归附中原，后为史氏。",
        "　　三﹕阿史那氏，居兜牟山，北人呼为突厥窟，历魏晋十代为君长。后属茹茹（蠕蠕），阿史那最为首领。后周末年，逐灭茹茹，霸强北土，盖百余年，至处罗苏尼失等归化，号阿史那，唐开元年间更为史氏。",
        "家族名人",
        "　　史思明（？- 761)",
        "　　本名窣干，唐玄宗赐名思明，为唐朝宁州的夷人，突厥族。骁勇有才略，安禄山起兵造反时，史思明受命攻略河北。后安禄山为其子庆绪所杀，思明则杀庆绪而自立为大燕皇帝，不久亦为其子史朝义所杀。",
        "　　史可法（1601 - 1645）",
        "　　字宪之，一字道邻。明代祥符（今河南省开封县）人。崇祯年间进士，曾任右佥都御史，巡抚皖、豫，后任命为南京兵部尚书。福王立，加武英殿大学士，督师扬州。清多尔衮致书劝降，坚拒，城破被害。清乾隆时追谥为忠正。后人尊称为史阁部。",
        "地望分布",
        "　　陜西京兆郡，安徽宣城郡，湖北武昌郡。",
    ]
}
BaiIiaXingPageModule[64] = {
    "index": "百家姓",
    "name": "唐",
    "content": [
        "历史来源",
        "　　「唐」源出;",
        "　　一﹕出自「祁」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，唐氏，祁姓，亦曰伊祁，尧初陶唐之后。尧初封唐侯，其地中山唐县是也，舜封尧之子丹朱为唐侯。至夏时，丹朱裔孙刘累迁于鲁县，至周朝改为唐公，周成王灭唐，以其地封叔虞，号曰唐叔。然后迁唐公于杜，降爵为伯，今长安杜城是也。故唐氏为尧帝之后。",
        "　　二﹕据《三国志．郭淮传》所载，陇西羌族有唐氏。",
        "家族名人",
        "　　唐尧",
        "　　唐寅",
        "　　（1470～1523）明代画家、文学家，吴县人，字伯虎，一字子畏，号六如居士、桃花庵主等。诗词书画无一不精，文以六朝为宗。诗初多秾丽，中年学刘禹锡、白居易，晚年纵放，不拘成格。擅画山水，多取法南宋李唐、刘松年，兼采元人法，并工画人物、花鸟，笔墨秀润峭利，景物清隽生动，工笔、写意俱佳。与文征明、沈周、仇英合称明朝四大家，又与祝允明、张灵、徐祯卿四人称为吴中四才子。有画谱、诗文集行世，并着有六如居士全集。亦称为唐伯虎。",
        "地望分布",
        "　　山西晋阳郡，山西晋昌郡，山东北海郡，山东鲁国郡。",
    ]
}
BaiIiaXingPageModule[65] = {
    "index": "百家姓",
    "name": "费",
    "content": [
        "历史来源",
        "　　「费」源出;",
        "　　一﹕出自「姒」姓，夏禹之后。",
        "　　二﹕出自「姬」自姓，以邑为氏。据《通志．氏族略》载，春秋时鲁懿公之孙，受封于费邑。（山东费县），其后以邑为氏。",
        "　　三﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「费连氏」（为魏献帝之兄的姓氏）随魏孝文帝南迁洛阳后，定居中原，代为汉姓「费」氏。",
        "家族名人",
        "　　费长房",
        "　　东汉人。据《后汉书．方术传》载，长房学道于壶公，不成，持符而归。相传能治百病，鞭打百鬼，又善变幻捉妖，后丢失符，被鬼所杀。",
        "　　费袆 （? - 253年）",
        "　　三国时江夏人，自文伟。刘备时任舍人，庶子。后主时历任黄门侍郎，昭信校卫，侍中，司马，尚书令，大将军，为诸葛亮所器重，多次出使吴国，终益州刺史，封成乡侯。",
        "地望分布",
        "　　湖北江夏郡。",
    ]
}
BaiIiaXingPageModule[66] = {
    "index": "百家姓",
    "name": "廉",
    "content": [
        "历史来源",
        "　　「廉」源出;",
        "　　一﹕据《元和姓纂》所载，相传为古帝颛顼孙大廉之后，以王父之字为氏。",
        "　　二﹕据《元史》所载，元朝有畏吾尔人布鲁海牙，担任肃政廉防史（简称「廉使」）之际其子希宪适生，逐以官名为「廉」氏，称「廉希宪」。",
        "家族名人",
        "　　廉颇",
        "　　战国赵人，生卒年不详。为赵之名将，屡败齐、魏等国。长平之战，坚壁自守，秦惧不敢加兵，后赵王受秦反间计，以赵括代之，赵遂大败。官拜上卿，与蔺相如为刎颈之交，后又言槉，遂不召用，病死于楚。",
        "　　廉希宪",
        "　　字善甫，元代维吾尔人。元世祖即位时，希宪得以入宫，一日，读《孟子》，用性善与仁义答世祖，被视为廉孟子，官至宰相。",
        "地望分布",
        "　　山西河东郡。",
    ]
}
BaiIiaXingPageModule[67] = {
    "index": "百家姓",
    "name": "岑",
    "content": [
        "历史来源",
        "　　「岑」源出;",
        "　　一 ; 出自「姬」姓，以国名为氏。据《通志．氏族略》引用《吕氏春秋》云 ; 周武王封周文王异母弟耀子渠为岑子，其地处梁国岑亭 ( 陜西韩城县 )。子孙以国为氏。",
        "家族名人",
        "　　岑参 (715～770）",
        "　　唐棘阳人（今河南新野县）。工诗，始佐戎幕，曾至天山一带，故多边塞、战伐之咏。因其属词清尚，用心良苦，故诗调特高。累官补阙起居郎，后出为嘉州刺史，故世称为岑嘉州。着有岑嘉州集。",
        "　　岑毓英 (1829-1889)",
        "　　字彦卿，号匡国，清广西西林人。光绪中法越南之役，击败法兵，官至云贵总督，卒谥襄勤。",
        "地望分布",
        "　　湖北南阳郡，河南棘阳郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[68] = {
    "index": "百家姓",
    "name": "薛",
    "content": [
        "历史来源",
        "　　「薛」源出;",
        "　　一 ; 以国名为氏。据《元和姓纂》，奚仲居于薛（山东滕县），一度迁于邳（山东徽山县）。春秋后期迁到下邳（江苏邳县），后成为齐国的属地。战国时为楚所灭。公子登仕楚。怀王赐沛邑，为大夫，逐以原国名「薛」为氏。",
        "　　二﹕据《吴录》所载，孟尝君受封于薛。秦灭六国而失祀，子孙逐以「薛」为氏，",
        "　　三﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「叱干氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「薛」氏。",
        "家族名人",
        "　　薛仁贵（612～681）",
        "　　名礼，唐绛州龙门人（今山西省河津县西二里）。少贫贱，以田为业。善骑射，贞观年间随太宗征辽东，所向披靡。高宗时屡破高丽、契丹、突厥，而立奇功，官拜本卫大将军，封平阳郡公。永淳二年卒，赠左骁卫大将军、幽州都督。后世据其功勋，编撰杂剧与演义。",
        "　　薛涛（768～831）",
        "　　字洪度。唐长安人，知音律，工诗文，有才情，为一代名妓。晚年居浣花溪，能制松花纸与深红小粉笺，裁书供吟，酬献贤杰，时人称为薛涛笺。着有诗集一卷。",
        "地望分布",
        "　　山西河东郡，河南河南郡，河南新蔡郡，安徽沛郡，山东高平剧。",
    ]
}
BaiIiaXingPageModule[69] = {
    "index": "百家姓",
    "name": "雷",
    "content": [
        "历史来源",
        "　　「雷」源出  ;",
        "　　一 ; 以国名为氏。据《元和姓纂》与《古今姓氏书辨正》所载，古诸侯国有方雷氏，其后分为方氏，雷氏。又神话传说方雷氏之女为黄帝妃。",
        "家族名人",
        "　　雷万春",
        "　　唐代人，安史之乱时，安禄山将令狐潮围雍丘，万春立于成上，面部中六箭，仍巍然不动。成陷不屈而死。",
        "地望分布",
        "　　陜西冯翔郡，江西豫章郡。",
    ]
}
BaiIiaXingPageModule[70] = {
    "index": "百家姓",
    "name": "贺",
    "content": [
        "历史来源",
        "　　「贺」源出  ;",
        "　　一 ; 为「庆」氏所改，据《通志．氏族略》所载，春秋时齐桓公之孙公孙庆克，他的儿子庆封以父名为氏。东汉时有庆纯，任侍中，当时汉安帝之父为清河王刘庆，为毕清河王的名讳，庆纯改姓为「贺」氏（取「贺」与「庆」两字义同）。故东汉永初元年（107年）后方有贺氏。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「贺兰氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「贺」氏。",
        "家族名人",
        "　　贺知章（659～744）",
        "　　字季真，自号四明狂客，唐越州永兴人。是著名的书法家。武则天时进士，官至太子宾客、秘书监，故时称为贺监。擅长草、隶书，亦擅长文辞，其诗风格淡雅而隽永，时出巧思。性旷达，善说笑，嗜酒，与李白、张旭等人交往频繁。后为道士，隐居于镜湖。享年八十八岁。。",
        "地望分布",
        "　　河北广平郡，江苏会稽郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[71] = {
    "index": "百家姓",
    "name": "倪",
    "content": [
        "历史来源",
        "　　「倪」源出  ;",
        "　　一 ; 源出于「曹」氏，以国为氏。周武王封曹挟在邾，郳国亦为小邾国（山东滕县东）。邾文公（一说邾武公）封其子肥于郳。战国时，为楚国所灭，其后为郳氏，去邑旁为儿氏。为避仇。加人字旁为倪氏。",
        "家族名人",
        "　　倪元璐（1593～1644）",
        "　　字玉汝，号鸿宝，浙江上虞人，是明代的忠臣。能诗文，工行草，善画山水竹石。为人正直廉介，不畏强权，官至户部尚书。李自成攻陷京城时，自缢而亡，谥文正，清代时追谥文贞。有倪文贞集传世。",
        "地望分布",
        "　　山东千乘郡。",
    ],
}
BaiIiaXingPageModule[72] = {
    "index": "百家姓",
    "name": "汤",
    "content": [
        "历史来源",
        "　　「汤」源出  ;",
        "　　一 ;据《通志．氏族略．以名为氏》所载，汤氏，子姓。夏商以前未有谥法（谥名如清圣祖即康熙，唐太宗即李世民），尧舜禹汤，皆名也。又，商汤，在金文（仲鼎文）中作「唐」。故汤氏之源并非始自于商汤。",
        "家族名人",
        "　　汤显祖（1550～1617）",
        "　　明江西临川人，字义仍，号海若，又号若士，别署清远道人。万历进士，官至礼部主事，以批评朝政贬官，后罢官归里，专事写作，诗宗香山、眉山，文学南丰、临川，尤精戏曲，其代表作有牡丹亭、邯郸记、南柯记、紫钗记四种，合称玉茗堂四梦或临川四种曲，作品词句典丽生动，排场取材亦颇佳妙，对后世影响甚大。有玉茗堂集传世。",
        "地望分布",
        "　　河北中山郡，北京范阳郡。",
    ]
}
BaiIiaXingPageModule[73] = {
    "index": "百家姓",
    "name": "滕",
    "content": [
        "历史来源",
        "　　「滕」源出;",
        "　　一 ;出自「姬」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，武王克商后，文王第十四子叔秀，受封于滕国（山东滕县）。战国初被越国所灭。不久复国，后又被宋国所灭。其子孙为滕氏。后又有一部份滕氏因避难改为腾氏。",
        "家族名人",
        "　　滕文公",
        "　　战国时滕国的贤君，名宏。曾多次向孟子请教。",
        "地望分布",
        "　　河南南阳郡，河南开封府。",
    ]
}
BaiIiaXingPageModule[74] = {
    "index": "百家姓",
    "name": "殷",
    "content": [
        "历史来源",
        "　　「殷」源出  ;",
        "　　一 ;出自「子」姓，以国名为氏。据《世本》所载，契后。武王克商后，商之子孙四散，以殷为氏。《元和姓纂》载﹕殷姓，成汤国号也，为周所灭，子孙以国名为氏。又《通志．氏族略．以国为氏》云﹕殷氏，契姓，封于商，后世迁于毫。至周为周所灭，子孙以国名为氏。",
        "家族名人",
        "　　殷汤",
        "　　殷浩（？～356）",
        "　　字深源，晋陈郡长平人。识度清远，好老易，负有盛名。初为庾亮记室参军，后起为建武将军。朝廷欲平关河，以浩为中军将军，都督扬、豫、徐、兖、青五州军事，以平定中原为己任。征姚襄兵败，废为庶人，竟日书空，作咄咄怪事四字。",
        "地望分布",
        "　　安徽汝南郡，河南河南府。",
    ]
}
BaiIiaXingPageModule[75] = {
    "index": "百家姓",
    "name": "罗",
    "content": [
        "历史来源",
        "　　「罗」源出  ;",
        "　　一 ;出自「妘」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，周代有罗国，初封宜城（湖北宜城县），徙枝江。春秋时被楚国所灭。周末居长沙，国人以原国名「罗」为氏。",
        "　　二﹕相传古帝祝融的后代。",
        "　　三﹕唐朝西突厥可汗斛瑟罗入中国，其后以斛瑟罗为氏，后改姓「罗」氏。",
        "　　四﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「破多罗」氏，随魏孝文帝南迁洛阳后，定居中原，代为汉姓「罗」氏。",
        "　　五﹕清代皇族爱新觉罗氏中有改姓「罗」，后代亦称罗氏。望族居豫章郡（江西南昌）。",
        "　　六﹕据《后汉书．南蛮传》及《华阳国志》载「板楯七姓」有罗氏。",
        "家族名人",
        "　　罗贯中",
        "　　名本，以字行，号湖海散人，元末太原人。生平事迹不详。工曲，善为通俗小说，著名的有《三国志通俗演义》、《南北史通俗演义》、《隋唐两朝志传》、《说唐》、《残唐五代史演义》、《粉妆楼》、《三遂平妖传》等。",
        "地望分布",
        "　　江西豫章郡，湖南长沙郡。",
    ]
}
BaiIiaXingPageModule[76] = {
    "index": "百家姓",
    "name": "毕",
    "content": [
        "历史来源",
        "　　「毕」源出  ;",
        "　　一 ;出自「姬」姓，据《新唐书．宰相世系表》所载，周文王第十五子被封于毕邑（陜西咸阳市），世称毕公高，其后逐有毕氏。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「出连」氏，随魏孝文帝南迁洛阳后，定居中原，代为汉姓「毕」氏。",
        "家族名人",
        "　　毕升",
        "　　生卒年不详。北宋仁宗庆历时（1041～1048）发明胶泥活字版印刷术的发明家。",
        "地望分布",
        "　　河南河内郡，山东东平郡，山西太原郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[77] = {
    "index": "百家姓",
    "name": "郝",
    "content": [
        "历史来源",
        "　　「郝」源出;",
        "　　一 ;以邑名为氏。据《新唐书．宰相世系表》所载，商王帝乙时，子期受封于郝乡（山西太原），其后以邑名为氏。",
        "　　二﹕少数民族的姓氏。据《旧唐书．南蛮传》所载，唐王朝南方土蛮有郝，杨，刘三大姓。又汉代乌桓有郝氏。",
        "家族名人",
        "　　郝隆",
        "　　字仕治，晋代人，官荆州刺史桓温的南蛮参军。农历七月七日，人们都在晒衣服，唯有郝隆睡在院中，有人问他为甚么，他答道﹕「晒我腹中的书罢了。」",
        "地望分布",
        "　　山西太原郡，陜西京兆郡。",
    ]
}
BaiIiaXingPageModule[78] = {
    "index": "百家姓",
    "name": "邬",
    "content": [
        "历史来源",
        "　　「邬」源出  ;",
        "　　一 ;以邑名为氏。据《通志．氏族略》所载，春秋时晋国有大夫食邑于邬邑，其后有邬氏。邬本为郑国之邑，后入周。晋国强盛时，辖地曾扩大到河南北部，邬邑一度为晋国所有。",
        "　　二﹕据《左传．昭公二十八年》载，晋国司马弥牟为邬郡大夫。邬郡在山西介休县。其后有邬氏。",
        "家族名人",
        "　　邬单",
        "　　春秋时人，孔子弟子。",
        "地望分布",
        "　　山西太原郡，江西南昌郡。",
    ]
}
BaiIiaXingPageModule[79] = {
    "index": "百家姓",
    "name": "安",
    "content": [
        "历史来源",
        "　　「安」源出  ;",
        "　　安氏出自西域少数民族，略有三支﹕",
        "　　一﹕据《新唐书．宰相世系表》所载，汉灵帝时安息国（伊朗东北部）太子安清，潜心佛学，来到当时的京都洛阳定居（见本网的「安世高」段，其后有安氏。南北朝时又有安息世子来到中国定居，亦为安氏。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「安迟」氏，随魏孝文帝南迁洛阳后，定居中原，代为汉姓「安」氏。",
        "　　三﹕为「昭武九姓」之一。（见「何」姓），安国故址在今乌兹别克斯坦布哈拉一带。一度归唐朝管辖，唐高帝永徽年间归附中原，后为安氏。",
        "　　又，唐朝胡人安禄山本姓康氏，冒姓安氏。",
        "家族名人",
        "　　安期生",
        "　　秦琅琊人（今山东省诸城县东南），生卒年不详。受学于河上丈人，于海滨卖药，始皇东游，相谈三昼夜，赐予金帛，皆置之而去，留书以别，谓后千年求我于蓬莱山，始皇遣使入海寻之，遇风浪而还。汉武帝时，李少君言尝游海上，见安期生食巨枣，其大如瓜。",
        "　　安世高",
        "　　安禄山（？～757）",
        "　　唐营州柳城人（今河北省旧永平府境）。胡人，本姓康，初名阿荦山，又作轧荦山。忮忍多智，善臆测人情，通六蕃语。天宝末，以平卢、范阳、河东三镇节度使举兵反，陷洛阳，入长安，称燕帝，寻为其子庆绪所杀。",
        "地望分布",
        "　　宁夏凉州郡，甘肃武威郡，湖北武陵郡。",
    ]
}
BaiIiaXingPageModule[80] = {
    "index": "百家姓",
    "name": "常",
    "content": [
        "历史来源",
        "　　「常」源出  ;",
        "　　一 ;出自「姬」姓，以邑名为氏。据《通志．氏族略》所载，武王克商后，文王子于康国，世称康叔，武庚叛乱被平定后，康叔又被转封于卫国。后来，康叔又分封其子于常邑，其后逐为常氏。",
        "　　二﹕因避讳而改，《世本》载春秋时楚国公族恒惠公之后有恒氏，一度改为常氏。来避宋真宗赵恒的名讳。「恒」和「常」义相同。",
        "　　三﹕又据《路史》云，战国时吴国公族之后亦有常氏。",
        "　　神话中黄帝大臣常先与常曦之后。",
        "家族名人",
        "　　嫦娥",
        "　　后羿的妻子。相传因偷吃不死之药而飞升月宫，成为仙女。汉人为避文帝讳，改姮为嫦。《淮南子˙览冥》：羿请不死之药于西王母，姮娥窃以奔月，怅然有丧，无以续之。明˙刘兑˙金童玉女娇红记：若不是月里姮娥，敢只是花里神仙。亦作常娥、嫦娥。",
        "　　常遇春（1330～1369）",
        "　　字伯仁，明怀远人。貌奇伟，善射，有勇力。辅佐明太祖转战江南，所向皆捷；又率师北征，下元都，逐元帝，平定天下。累官至左副将军，擢为中书、平章军国重事，赠中书右丞相。封鄂国公、开平王。谥忠武。",
        "地望分布",
        "　　山东平原郡。",
    ]
}
BaiIiaXingPageModule[81] = {
    "index": "百家姓",
    "name": "乐",
    "content": [
        "历史来源",
        "　　「乐」源出  ;",
        "　　一 ; 出自「子」姓。以王父自为氏。据《姓氏急就篇》及《唐书．宰相世系表》所载，宋戴公之子，字乐父。生子倾父泽，为公孙泽; 公孙泽之子夷父须，以其祖父之字「乐」为氏，称为乐须。",
        "家族名人",
        "　　乐毅",
        "　　战国时燕国名将，昭王时拜为上将军，率领燕、赵、楚、韩、魏五国兵伐齐，下齐七十余城，封昌国君。昭王死，惠王使骑劫代其职位，毅奔赵，封为望诸君，后卒于赵。",
        "地望分布",
        "　　河南南阳郡。",
    ],
}
BaiIiaXingPageModule[82] = {
    "index": "百家姓",
    "name": "于",
    "content": [
        "历史来源",
        "　　「于」源出  ;",
        "　　一 ; 出自「姬」姓。以国名为氏。据《元和姓纂》和《广韵》所载，周武王第三子受封于邘国，称为邘叔，其后去邑旁为于，有于氏。",
        "　　二﹕为鲜卑族复姓所改。据《路氏》所载，东海于公裔孙随魏孝文帝南迁洛阳后，定居中原，代为汉姓「于」氏。",
        "　　三﹕唐代淳于氏为避唐宪宗李纯之名讳（淳，纯同音）改为于氏。",
        "家族名人",
        "　　于譧（1398-1457）",
        "　　字廷益，明代浙江钱塘人。历任官监察御史，兵部尚书等。正统十四年，土木桥之变，瓦刺首领也先侵扰大同，明英宗被俘，于譧反对放弃北京，拥立英宗弟为景帝，主君务，击退也先军队，接英宗回。英宗复辟后被杀，年六十岁，天下冤之。",
        "　　于成龙（1617-1684）",
        "　　字北溟，清山西永宁人，康熙时，官至两江总督，以清廉著称，时称天下清官第一。",
        "地望分布",
        "　　河南河南郡，山东东海郡。",
    ]
}
BaiIiaXingPageModule[83] = {
    "index": "百家姓",
    "name": "时",
    "content": [
        "历史来源",
        "　　「时」源出  ;",
        "　　一 ; 出自「子」姓。据《世本》所载，春秋时宋国有大夫「来」，受封于时邑。子孙以封邑名「时」为氏。",
        "　　二﹕一曰，时氏为楚国大夫申叔时之后。以王父字为氏。",
        "家族名人",
        "　　时荷",
        "　　晋代人。相传随许真君学道，一起成仙，紫盖府留有遗迹。",
        "地望分布",
        "　　甘肃陇西郡，河南陈留郡。",
    ]
}
BaiIiaXingPageModule[84] = {
    "index": "百家姓",
    "name": "傅",
    "content": [
        "历史来源",
        "　　「傅」源出  ;",
        "　　一 ; 据《通志．氏族略．以地为氏》载，为商朝名相傅说之后。商王武丁在傅岩（山西平陆县）发现了贤者「说」，因筑于傅岩，故称傅说，其后以地为氏。",
        "　　二﹕出自「姬」姓。以邑为氏。据《唐书．宰相世系表》所载，周朝大由受封于傅邑，因以为氏。",
        "家族名人",
        "　　傅说",
        "　　生卒年不详。为商王武丁时的贤相。初隐居于傅岩，武丁梦到他，往访而知其贤，于是举他为相，国家大治。",
        "　　傅恒",
        "　　号春和，清朝满洲镶黄旗人，原姓富察氏。历官尚书，川陜总督，保和殿大学士等。乾隆年间平定金川，准格尔和缅甸，因功封忠勇公，称为「社稷臣」。乾隆二十年，置功臣相于紫光阁，傅恒列为第一。",
        "地望分布",
        "　　山东清河郡，山东临清郡，山东高唐郡，甘肃北地。",
    ]
}
BaiIiaXingPageModule[85] = {
    "index": "百家姓",
    "name": "皮",
    "content": [
        "历史来源",
        "　　「皮」源出  ;",
        "　　出自姬姓。以王子字为氏。据《风俗通义》及《元和姓纂》所载, 鲁献公次子仲山浦, 曾辅佐周宣王中兴, 受封于樊邑, 其后有樊氏。樊侯之后有樊仲皮, 食采于皮氏邑(在今山西河津县一带), 其支孙以王父(祖父)之字皮为氏。",
        "家族名人",
        "　　皮日休（834～883）",
        "　　字袭美，一字逸少，襄阳人，为唐代诗人。性傲诞，尝隐居鹿门山，以文章自负，尤善箴铭。咸通年间中进士，官太常博士，后为黄巢所害，着有《皮子文薮》。",
        "地望分布",
        "　　甘肃天水郡，江苏下邳郡。",
    ]
}
BaiIiaXingPageModule[86] = {
    "index": "百家姓",
    "name": "卞",
    "content": [
        "历史来源",
        "　　「卞」源出  ;",
        "　　一﹕以邑名为氏。据《元和姓纂》所载, 周文王第六子曹叔振的支子(嫡妻第二子以下及妾子皆称为‘支子’) 受封于卞邑(在今山东省兖州, 泗州附近), 称为卞伯, 其后为’卞‘氏。",
        "　　二﹕春秋时鲁国有勇士庄子为卞邑大夫, 称为卞庄子, 又写为弁庄子, 其后亦为卞氏, 亦为   弁氏。",
        "家族名人",
        "　　卞和",
        "　　春秋楚人。于荆山得璞玉献于楚王，两次见疑，左右足遭刖，后楚王乃使玉人琢之，果得宝玉，遂命名为和氏璧。见韩非子˙和氏。",
        "　　卞庄子",
        "　　春秋卞邑大夫，以勇著名，尝刺虎，一举而获两虎，齐人惧之，不敢伐鲁。汉朝时，因避明帝（刘庄）讳，改庄为严。或称为卞严、卞严子、弁严子。",
        "地望分布",
        "　　山东济阴郡，河南济阳郡。",
    ]
}
BaiIiaXingPageModule[87] = {
    "index": "百家姓",
    "name": "齐",
    "content": [
        "历史来源",
        "　　「齐」源出  ;",
        "　　一﹕出自姜姓, 以国为氏。据《元和姓纂》所载, 西周初年, 太公望姜子牙受封于营丘(在今（山东省临淄市) 建立齐国, 至齐恒公时成为春秋五霸之首。后田氏代齐, 原王氏乃为齐氏。",
        "　　二﹕出自姬姓, 以王父字为氏。据《通志氏族略》所载, 春秋时卫国有大夫字齐子, 其支孙以王父(祖父)之字为齐氏。",
        "　　三﹕西北少数民族姓氏。据《晋书》所载, 武都氐族人有齐姓, 如齐万年。",
        "家族名人",
        "　　齐桓公",
        "　　齐白石（1863～1957）",
        "　　名璜，字苹生，号白石山人，湖南湘潭人。初习木工雕刻，从胡沁园、陈少蕃、王湘绮学诗画，苦读古文诗词，临摹名家字画，其艺大进。曾任北平艺术专院教席，诗、书、画、篆刻，彪炳艺坛。",
        "地望分布",
        "　　河南汝南郡，河北高阳郡，河北中山郡。",
    ]
}
BaiIiaXingPageModule[88] = {
    "index": "百家姓",
    "name": "康",
    "content": [
        "历史来源",
        "　　「康」源出  ;",
        "　　一﹕出自姬姓。 以谥号为氏。据《元和姓纂》及《姓苑》所载, 周朝初年, 文王第七子康叔, 受封于卫国, 其后以祖之谥(生谥, 即生前就有的谥号)「康」为氏。",
        "　　二﹕以国为氏．出自西域康居国（约在今巴尔喀什湖与咸海之间）的使者，以及从康居来中国者，有的就以「康」为氏．如汉代的康孟详。",
        "　　三「昭武九姓」之一．隋唐时代康国（在今乌兹别克斯坦，撒马尔罕一带）人来中国者，有的以“康”为氏，如唐代有康谦。",
        "　　四﹕宋代为避宋太祖赵匡胤的名讳，匡氏改为慷氏．",
        "家族名人",
        "　　康有为（1858～1927）",
        "　　字长素，改字更生，晚年又字更甡，清学者及政治家，南海人。治经以今文为宗，旁采当时流行的西洋学术思想，自成一家言。光绪二十四年，以工部主事赞德宗行新政，失败后亡命日本，组织保皇党；民国成立后，谋复辟，迄无成。着有孔子改制考、新学伪经考、大同书、春秋董氏学、春秋笔削大义微言考、孟子微等多种。",
        "地望分布",
        "　　陜西西安市。",
    ]
}
BaiIiaXingPageModule[89] = {
    "index": "百家姓",
    "name": "伍",
    "content": [
        "历史来源",
        "　　「伍」源出  ;",
        "　　出自芈姓，以名为氏．据《通志．氏族略．以名为氏》所载：春秋时楚国大夫伍参之后也．伍子胥奔吴，　其子又为王孙氏适齐．",
        "家族名人",
        "　　伍员（子胥）（？～前664）",
        "　　字子胥，春秋楚人。与父兄俱仕楚，后楚王听谗言杀其父兄，员逃亡吴国佐吴伐楚报仇，并辅吴称。吴王夫差灭越后，欲释越王句践回国，不听员谏，因信谗杀之。伍员死前预言越必灭吴，后九年越果灭吴。",
        "　　伍廷芳（1842～1922）",
        "　　字文爵，号秩庸，广东新会人。创中外新报，为中国有日报之始。留英习法律，为清修律大臣，草民刑律，开中国法律新纪元。武昌起义，首倡清帝退位之议，民军推为议和代表。后历任司法总长、代国务总理、外交总长等。陈明叛变，忧愤而卒。",
        "地望分布",
        "　　甘肃省安定郡，湖南省武陵郡。",
    ]
}
BaiIiaXingPageModule[90] = {
    "index": "百家姓",
    "name": "余",
    "content": [
        "历史来源",
        "　　「余」源出  ;",
        "　　 据《风俗通义》所载，余为春秋时秦国相由余之后。由余本为晋国人，后入秦。其子孙以袓名“余”为氏。世居歙州，为新安（在今安徽省歙县）大族。",
        "家族名人",
        "　　余秋雨",
        "　　当代著名作家。",
        "地望分布",
        "　　江苏省下邳郡，浙江省吴兴郡。",
    ]
}
BaiIiaXingPageModule[91] = {
    "index": "百家姓",
    "name": "元",
    "content": [
        "历史来源",
        "　　「元」源出  ;",
        "　　一﹕以邑名为氏．据《韵会》所载，春秋年代，卫国有大夫元恒, 受封于元城(在今河北省大名县东),其后有元恒氏元氏。",
        "　　二﹕ 据《风俗通义》所载，战国时卫武之子公子元,食邑亦在元城,其后有元氏.",
        "　　三﹕为鲜卑族复姓拓跋氏所改。据《新唐书-宰相世系表》所载,，北魏皇族本姓拓跋氏, 至孝文帝迁都洛阳进入中原后, 改为元氏.又据《魏书-官氏志》所载, 北魏代北复姓纥骨氏,是云氏,皆改为元氏。",
        "家族名人",
        "　　元好问（1190～1257）",
        "　　字裕之，号遗山，金秀容（今山西省忻县）人。系出元魏，七岁能诗，兴定三年进士，官至尚书省左司员外郎，金亡不仕。古文继承韩柳，结构严密。诗主风骨，反对浮艳。其论诗绝句三十首在文学批评史上颇有地位。编有中州集。着有遗山集﹑续夷坚志。金庸小说中的「问世间，情是何物」正是出自他的词「摸鱼儿」",
        "　　元稹（779～831）",
        "　　字微之，唐河南（今河南省洛阳县）人。穆宗时拜相。其诗平易近人，与白居易齐名，世称「元白」。着有《元氏长庆集》。",
        "地望分布",
        "　　河南洛阳，山西太原郡。",
    ],
}
BaiIiaXingPageModule[92] = {
    "index": "百家姓",
    "name": "卜",
    "content": [
        "历史来源",
        "　　「卜」源出  ;",
        "　　一﹕ 据《风俗通义》及《潜夫论》云: 氏于职者,巫卜陶匠是也.殷周时代有专门从事占卜职务者,称为卜人. 世代任卜人者,遂为卜氏. 《潜夫论》云:　夏　后有卜氏，又叔锈后有卜氏．《元和姓纂》云：周礼有卜人氏．以官命氏．晋卜偃.秦卜徒父.鲁卜楚丘，皆为卜筮官，其后遂以为氏。",
        "　　二﹕据《史记》载，古代匈奴部族四大姓之一有须卜氏，其后改为卜氏。",
        "家族名人",
        "　　卜式",
        "　　汉河南人，以牧羊致富，武帝时上书，愿捐一半家财以助边防军需，又助济贫民，受赐为御史大夫，后因不善文章，贬为太子太傅。",
        "地望分布",
        "　　山西省西河郡，湖南省溆浦县。",
    ]
}
BaiIiaXingPageModule[93] = {
    "index": "百家姓",
    "name": "顾",
    "content": [
        "历史来源",
        "　　「顾」源出  ;",
        "　　一﹕ 出自妃姓, 以国为氏. 据《元和姓纂》所载, 夏朝有附庸小国, 在今河南省范县东南. 商汤起兵攻伐夏桀时,先灭顾国,韦国. 其国人以原国名”顾”为氏。",
        "　　二﹕ 越王勾践的七世鬊吮孙为闽君摇, 在汉代受分封于东哦瓯(在今浙江省永嘉县西南).摇之子受封为顾余侯,世居于会稽(在今浙江省绍兴市)",
        "家族名人",
        "　　顾恺之（341～402）",
        "　　字长康，小字虎头，晋无锡人。博学有才气，善绘画，有才绝、艺绝、痴绝三绝之称。多作人物肖像及神仙、佛像、动物、山水等。画人注重点睛。着有画论、魏晋胜流画赞、画云台山记等。存世作品中以女史箴图最有名。其所作维摩诘像，为最早出现于壁画上的佛像。",
        "　　顾炎武（1613～1681）",
        "　　初名绛，字宁人，号亭林，自署蒋山佣，学者称亭林先生。明末清初学者。江苏昆山居林镇人。性耿介，曾参加抗清活动。晚年治经侧重考证，开清代朴学之风。考订古音、离析唐韵，分古韵为十部，于分析音学源流与古韵部目上，居承先启后之功。着有日知录、天下郡国利病书等。",
        "地望分布",
        "　　湖南省溆浦县南。",
    ]
}
BaiIiaXingPageModule[94] = {
    "index": "百家姓",
    "name": "孟",
    "content": [
        "历史来源",
        "　　「孟」源出  ;",
        "　　以次为氏. 古代兄弟排行次序为: 伯(孟), 仲, 叔, 季. 伯为嫡长子, 孟为庶长子. 据<<通志-氏族略>>所载, 春秋时鲁国有孟孙氏, 盖为鲁恒公之子庆父共仲之后. 本为”仲孙”氏, 因弒君之罪, 更为孟氏. 又, 春秋时卫襄公之子, 字孟公, 其支孙以王父字”孟”为氏.",
        "家族名人",
        "　　孟母",
        "　　孟子的母亲。仉姓。曾经三次迁移其居，以激励孟子勤奋学习。后世奉为贤母的典范。",
        "　　孟子（前372～前 289）",
        "　　名轲，字子舆，战国时邹人，生于周烈王四年，卒于周赧王二十六年。受学于子思弟子。提倡王道﹑重仁义﹑轻功利﹑创性善之说，后世尊称为亚圣。着有孟子七篇。亦称为孟子。",
        "　　孟浩然（689～740）",
        "　　字浩然。唐代诗人，襄阳人。少好节义，隐居鹿门山。曾于太学赋诗，一坐叹服，其诗属于自然一派，有孟浩然集。",
        "地望分布",
        "　　山东省历城县东，山东省曲阜县东南，甘肃省汉置郡。",
    ]
}
BaiIiaXingPageModule[95] = {
    "index": "百家姓",
    "name": "平",
    "content": [
        "历史来源",
        "　　「平」源出  ;",
        "　　姬姓。 以邑名为氏。 据<<通志-氏族略-以邑为氏>>所载, 战国时韩哀侯的少子, 受封于平邑(在今山西省临汾市附近)。 公元前230年, 韩国被秦国所灭, 韩哀侯的后代由平邑迁往下邑(在今安徽省砀山县), 以原邑名「平」为氏。",
        "家族名人",
        "　　平当",
        "　　字子思，汉朝时平陵人。对于大禹治水的情况很有研究，汉成帝封他为骑都尉，负责开河筑堤，防治水患。汉哀帝即位后，升他为宰相，赐官内侯，到了第二年，又要升官加薪，他因为生病，拒绝了。他说﹕「我的官位已经够高了，薪俸已经够了，给子孙留的财产太多会使他们过奢侈的生活的。",
        "地望分布",
        "　　河南省洛阳市，河南省武陟县",
    ]
}
BaiIiaXingPageModule[96] = {
    "index": "百家姓",
    "name": "黄",
    "content": [
        "历史来源",
        "　　「黄」源出  ;",
        "　　一 ; 出自「嬴」姓。以国为氏。据《诸暨孝义黄氏族谱》所载，黄氏为嬴姓十四氏之一。古代黄国在今河南潢川。后被楚国所灭，子孙散居四方，以国名为氏。",
        "　　二 ; 古代南方蛮族有黄姓。在广西南宁一带。",
        "家族名人",
        "　　黄歇",
        "　　游学博闻，楚考烈王以之为相，封为春申君。相楚二十余年，食客三千多人。娶李园之妹，知其有孕，纳于考烈王，生幽王。后李园用事，忌春申君，遂伏死士于棘门刺杀之。",
        "　　黄初平（黄大仙）",
        "　　黄霸 (前？～前51）",
        "　　字次公，西汉淮阳阳夏人。少学律令，武帝末，补侍郎谒者，历河南太守丞，时吏尚严酷，而霸为政宽和。尝从经学家夏庚胜治尚书。官至丞相，封建成侯，卒谥定。",
        "　　黄庭坚 (1045～1105）",
        "　　字鲁直，号山谷道人，又号涪翁，宋分宁（今江西修水县）人。与张耒、晁补之、秦观合称苏门四学士。工诗，为江西诗派的开创人，并擅行、草书。着有山谷内集、外集、别集、词等。",
        "　　黄巢 (？～884)",
        "　　唐曹州人。出身盐商，积财聚众，尤好收留亡命之徒。唐懿宗以来，因皇室奢侈过度，赋税沉重，加上连年发生水﹑旱灾，遂致民不聊生，盗匪群起。僖宗干符元年（公元874)，王仙芝率盗匪起事，翌年黄巢起兵响应，干符五年王仙芝败死于湖北，黄巢被推举为冲天大将军，率众攻掠江﹑浙﹑闽﹑粤等地，广明元年（公元880)陷洛阳、长安，僖宗逃奔成都，巢自号为帝，国号大齐。唐以官爵笼络李克用相援，大败黄巢，巢自刎身亡，为害十年的黄巢之乱始告结束，史称为黄巢之乱。",
        "　　黄道婆",
        "　　元朝时擅于纺织技术的女工艺家。曾随崖州黎族学习纺织技术，学成后返乡从事纺织工作，促成棉纺织业的进步，使元明以后的松江细布闻名于四方。纺织业者遂立祠祭之，以感其功。亦称为黄婆。",
        "地望分布",
        "　　湖北江夏郡，陜西栎阳郡，宁夏安定郡，湖北房陵郡，湖北汉东郡，河北上谷郡，安徽焦郡。",
    ]
}
BaiIiaXingPageModule[97] = {
    "index": "百家姓",
    "name": "和",
    "content": [
        "历史来源",
        "　　「和」源出  ;",
        "　　一﹕ 传说为尧时掌管天文律法的羲和之后. 据<<元和姓纂>>所载:”羲和, 尧时掌管天地之官, 和仲. 和叔因以为氏.” 此为后人依神话附会之辞.",
        "　　二﹕ 春秋时期, 楚国有卞和, 曾找到一块玉璞(没有经过雕琢的玉石), 两次献给楚王都被认为是假的, 以欺君之罪, 先后被砍去两脚. 楚文王即位后, 卞和抱着玉璞在荆山之下痛哭. 楚文王派人取来玉璞, 经雕琢果然得到宝玉, 称为”和氏璧”. 卞和之后有和氏.",
        "　　三﹕为鲜卑族复姓所改. 据<<通志-氏族略>>所载, 南北朝时, 北魏有代北复姓「素和氏」, 为鲜卑族檀石槐的支裔, 以其本为白部, 故号”素和”,进入中原以后改为汉姓和氏.",
        "家族名人",
        "　　和峤",
        "　　晋朝西平人。少有盛名。晋武帝时为黄门侍郎，迁中书令。",
        "地望分布",
        "　　河南省汝南郡，浙江省萧山县。",
    ]
}
BaiIiaXingPageModule[98] = {
    "index": "百家姓",
    "name": "穆",
    "content": [
        "历史来源",
"　　「穆」源出  ;",
"　　一﹕ 出自子姓. 以谥号为氏. 据<<元和姓纂>>所载, 春秋时, 宋宣公之弟名和. 继承兄位, 在位九年, 死前将爵位传给宣文公之子夷, 让自己的儿子离开宋国到郑国居住. 为褒奖其品德, 死后谥号为”穆”. 其支庶子孙遂有穆氏。",
"　　二﹕北方鲜卑族复姓所改. 据<<魏书-官氏志>>所载, 南北朝时, 北魏”代北八族”之首为丘穆陵氏, 隋魏孝文帝迁都洛阳, 定居中原以后, 改为汉字单姓穆氏.",
"家族名人",
"　　穆宁",
"　　唐朝人。官至秘书监。为官刚直，奉公守法。安史之乱时，以著名的颜真卿起兵共拒安禄山。",
"地望分布",
"　　河南汝南郡，河南洛阳。",
    ]
}
BaiIiaXingPageModule[99] = {
    "index": "百家姓",
    "name": "萧",
    "content": [
        "历史来源",
        "　　「萧」源出  ;",
        "　　一﹕ 出自子姓, 以国为名氏. 据<<风俗通义>>及<<元和姓纂>>所载, 周代宋国微子之后, 乐叔大心有功, 封于萧, 成为宋的附庸小国. 故址在今安徽省萧县西北, 公元前597年被楚国所破. 子孙以国为氏, 西汉相国萧何即为其后.",
        "　　二﹕古代嬴姓部落首领柏翳之后孟亏, 作士于萧, 其后人遂以萧为氏.",
        "家族名人",
        "　　萧史",
        "　　传说中春秋时的人物。善吹箫，作凤鸣。秦穆公以女弄玉妻之，作凤楼，教弄玉吹箫，感凤来集，弄玉乘凤、萧史乘龙，夫妇同仙去。见《汉˙刘向˙列仙传˙卷上˙萧史》。",
        "　　萧何（？～前193)",
        "　　汉初沛人，佐高祖定天下，论功第一，封酇侯。汉初律令多出其手。卒谥文终。",
        "　　萧道成",
        "　　萧衍",
        "地望分布",
        "　　山东枣庄市，江苏常州市，山东巷山县。",
    ]
}
BaiIiaXingPageModule[100] = {
    "index": "百家姓",
    "name": "尹",
    "content": [
        "历史来源",
        "　　「尹」源出  ;",
        "　　一﹕ 以官为氏. 据《风俗通义》云: 师尹, 三公官也. 师即太师, 尹即尹氏, 职同太师.",
        "　　二﹕ 以邑名为氏. 据《通志．氏族略．以邑为氏》所载, 尹氏, 少旱之子封于尹城, 因以为氏. 子孙世为周卿士, 食采于尹. 故址在今河南省新安县东南, 周代为畿内国; 一说在今山西省隰县东北. 其后亦有尹氏.",
        "家族名人",
        "　　尹喜",
        "　　字公度，战国时秦人，生卒年不详。为函谷关尹，老子西游，喜望见紫气，知有真人当过。老子至，授《道德经》五千言而去。其自著书称关尹子。",
        "　　尹文",
        "　　战国齐宣王至愍王时人，生卒年不详。庄子天下篇将他与宋钘并称，汉书艺文志列入名家。着有尹文子二篇。",
        "地望分布",
        "　　甘肃天水郡，河北河间县。",
    ]
}

BaiIiaXingPageModule[101] = {
    "index": "百家姓",
    "name": "姚",
    "content": [
        "历史来源",
        "　　「姚」源出  ;",
        "　　姚姓是中国最早的姓(不是氏)之一. 据《说文解字》所载, 虞舜居姚虚, 因以为姓. 姚虚在今山东省濮县南.",
        "家族名人",
        "　　姚重华",
        "　　姚兴（366～416）",
        "　　一﹕字子略，姚苌长子，后秦主。嗣立后，攻败前秦、西秦、又灭后凉，势甚盛，后伐夏败还，降号称王，在位二十二年。谥文桓帝。",
        "　　二﹕宋相州（今河南省安阳县）人，生卒年不详。宋靖康中，以武功累迁荆湖南路兵马副都监，金兵渝盟渡淮，王权遣与拒之，以四百骑力战金兵八十万，阵亡。谥忠毅。",
        "　　姚苌（330～393）",
        "　　字景茂，南安赤亭（今甘肃省陇西县西）羌人，为后秦主。初事前秦苻坚，坚自晋败还，慕容泓起兵攻坚，苌接战而败，乃奔渭北称秦王；既而攻坚，杀之，入长安称帝，国号大秦，在位八年。谥号武昭帝。",
        "　　姚广孝",
        "地望分布",
        "　　浙江吴兴县，甘肃陇西渭水。",
    ],
}
BaiIiaXingPageModule[102] = {
    "index": "百家姓",
    "name": "邵",
    "content": [
        "历史来源",
        "　　「邵」源出  ;",
        "　　出自姬姓. 以邑名为氏. 公元前十一世纪, 周文王之庶子奭受封于召邑(在今陜西省岐山西南)世称召公. 后又转封于蓟(在今北京一带), 成为燕国始祖. 其后有召氏.",
        "家族名人",
        "　　邵雍（1011～1077）",
        "　　字尧夫，宋范阳（今河北省涿县人）。精先天象数之学。寓洛四十年，称所居为安乐窝，卒谥康节。着有《先天图》、《皇极经世》、《渔樵问答》、《伊川击壤集》等。",
        "地望分布",
        "　　河北蠡县南",
    ]
}
BaiIiaXingPageModule[103] = {
    "index": "百家姓",
    "name": "湛",
    "content": [
        "历史来源",
        "　　「湛」源出  ;",
        "　　以地名为氏，《左传-襄公十六年》载有湛阪,在今河南省平顶山市北. 据《路史》云: 河阳轵有湛水, 傍有湛城. 湛水有二: 一在河南省济源县西南: 一源出河南宝丰县东南, 至襄城县境入北汝河. 以地名为氏的湛姓出自多处. 一说出自夏同姓诸侯湛灌氏, 此系牵强附会, 不可信.",
        "地望分布",
        "　　江西南昌",
    ]
}
BaiIiaXingPageModule[104] = {
    "index": "百家姓",
    "name": "汪",
    "content": [
        "历史来源",
        "　　「汪」源出  ;",
        "　　一﹕ 为汪芒氏所改. 据《通志-氏族略-以名为氏》所载, 防风氏在商朝为汪芒国, 故址在今浙江省武康县东. 其后简为汪氏。",
        "　　二﹕出自姬姓. 以邑名为氏. 春秋时鲁桓公庶子名满, 食采于汪(在今山东省) 其后以邑”汪”为氏. 一云, 鲁成公庶子受封于汪邑, 其后亦有汪氏.",
        "家族名人",
        "　　汪踦",
        "　　生卒年不详，春秋时代鲁国的儿童。哀公十一年齐国伐鲁，汪踦挺身保卫国家而战死，所以鲁人特别破例，以成人之礼来埋葬他。或作「汪锜」。",
        "　　汪元量",
        "　　生卒年不详，字大有，号水云子，宋末钱塘（今浙江省杭州）人。以善琴供奉内庭，宋亡，跟从被俘的后妃前往燕京，时慰文天祥于囚所，天祥死，元量去为道士，放浪江湖以终。着有水云词、湖山类稿等。",
        "　　汪兆铭（883～1944）",
        "　　字精卫，广东番禺人，留学日本。早岁入同盟会，致力革命。曾谋炸清室摄政王未成，被捕系狱，辛亥光复后得释。民国成立，历任中国国民党中央执行委员、国民政府主席、行政院长、国民参政会议长。1938年，对日抗战期间，潜离重庆，至南京附日，组织伪政府，为国人所不齿，抗战胜利前病死。",
        "地望分布",
        "　　山西临汾县",
    ]
}
BaiIiaXingPageModule[105] = {
    "index": "百家姓",
    "name": "祁",
    "content": [
        "历史来源",
        "　　「祁」源出  ;",
        "　　一﹕  出自姬姓. 以邑名为氏. 据<<元和姓纂>>所载, 春秋时晋献侯四世孙名奚, 为大夫, 食采于祁奚(在今山西省祁县), 世称祁邑, 其后有祁氏. 春秋时晋国多祁氏, 晋隰叔后有祁成氏, 又有祈夜(祈射)氏, 皆为祁氏分支。",
        "　　二﹕ 以官职为氏，《周礼》官制中有祁父, 是掌管兵甲的司马. 世代任祁父者, 为祁氏。",
        "家族名人",
        "　　祁奚",
        "　　春秋时晋国大夫，告老还家，晋侯问谁可继任其职，祁奚先推举其仇家解狐，后又推荐其子祁午。典出《左传˙襄公三年》。",
        "地望分布",
        "　　山西太原市，陜西长安县。",
    ]
}
BaiIiaXingPageModule[106] = {
    "index": "百家姓",
    "name": "毛",
    "content": [
        "历史来源",
        "　　「毛」源出  ;",
        "　　一﹕出自姬姓. 以国名为氏. 据<<广韶>>所载, 西周初年,周文王庶子叔郑, 受封于毛国(在今陜西省岐县, 扶风一带), 世称毛公, 其后有毛氏. “毛公鼎” 即为此毛国遗物, 为现存铭文最长的青铜器。",
        "　　二﹕亦出自姬姓, 以邑名为氏. 据<<通志. 氏族略>>所载, 周文王之子明受封于毛邑(在今河南省宜阳一带), 世称(伯明), 在周王室世代为卿士, 任司空. 其后亦为毛氏。",
        "　　三﹕有代北之族, 世为酋长. 据《前秦彔》云：氏酋有毛氏。",
        "家族名人",
        "　　毛遂",
        "　　生卒年不详。战国时赵平原君的食客，初无表现，秦兵围攻赵国，平原君至楚求救，毛遂自荐前往，并说服楚王同意赵楚合纵。《典出史记˙卷七十六˙平原君虞卿传》。",
        "地望分布",
        "　　山西西河郡，河北平乡",
    ]
}
BaiIiaXingPageModule[107] = {
    "index": "百家姓",
    "name": "禹",
    "content": [
        "历史来源",
        "　　「禹」源出  ;",
        "　　出自妘姓. 以国名为氏. 据《广韶》及《姓考》所载, 妘姓之裔, 封于鄅, 即春秋鄅国(在今山东省临沂县北十五里), 后去邑旁为禹氏.",
        "家族名人",
        "　　夏禹",
        "地望分布",
        "　　甘肃东乡，山东临沂",
    ]
}
BaiIiaXingPageModule[108] = {
    "index": "百家姓",
    "name": "狄",
    "content": [
        "历史来源",
        "　　「狄」源出  ;",
        "　　一﹕以国为氏. 据《广韶》载, 周文王之舅父为孝伯, 又称为考伯, 本为姜姓参卢氏. 成王;分封孝伯于狄国.(在今山东省高青县东南, 一说在今河北省正定县。）",
        "　　二﹕为古代西北少数民族姓氏, 高车族有一部为狄氏. <<北史>>载, 唐昭宗时曾俘获契丹人惕隐, 赐其姓名为狄怀忠, 其后亦为狄氏.",
        "家族名人",
        "　　狄仁杰",
        "　　字怀英。唐朝太原人。为武则天时名相。力劝武则天力唐嗣。以举贤为意，凡举之臣，皆为唐朝中兴之臣。",
        "　　狄青",
        "　　字汉臣。宋朝人。善骑射。为延州指使，勇而善谋，经略尹株，范仲淹待之甚厚。仲淹授以《左氏春秋》。狄青因折节读书，精通兵法。以功升枢密副使。平生前后25战，以皇佑四年（1052）上元夜袭昆仑关最著名。",
        "地望分布",
        "　　甘肃天水郡，山西太原郡。",
    ]
}
BaiIiaXingPageModule[109] = {
    "index": "百家姓",
    "name": "米",
    "content": [
        "历史来源",
        "　　「米」源出  ;",
        "　　为历史上的北方少数民族姓氏「昭武九姓」之一。据《通志-氏族略》所载, 本为西域胡人, 为汉代康居支庶, 原居于昭武城(在今甘肃省境内), 为匈奴所败, 迁居于中亚阿姆, 锡尔俩河流域, 建立康. 安. 曹. 石. 米. 何. 史. 火寻. 戊地九姓政权. 米国故址在今乌兹别克斯坦, 撒马尔罕的西南部, 一度属唐朝管辖. 有进入中原者, 称米氏.",
        "家族名人",
        "　　米芾（1051～1107）",
        "　　字符章，号海岳外史，又号鹿门居士。宋襄阳人，世称为米襄阳。倜傥不羁，举止颠狂，故世称为米颠。为文奇险，妙于翰墨，画山水人物，亦自成一家，爱金石古器，尤爱奇山，世有元章拜石之语。官至礼部员外郎，或称为米南宫。着有宝晋英光集﹑书史﹑画史﹑砚史等书。",
        "地望分布",
        "　　陜西西安市，甘肃东乡，山东巨野县。",
    ]
}
BaiIiaXingPageModule[110] = {
    "index": "百家姓",
    "name": "贝",
    "content": [
        "历史来源",
        "　　「贝」源出  ;",
        "　　一﹕据<<姓苑>>云: “贝氏, 出清河贝丘. “盖以地名为氏. 今吴越多此姓. 贝丘在今山东省博兴县东南。",
        "　　二﹕出自姬姓. 周文王庶子召公移封于蓟, 其支庶子食采于郥(在今河北省巨鹿县), 郥国为燕国附庸, 其子孙遂以国名贝为氏. 后去邑旁为贝氏.",
        "家族名人",
        "　　贝钦世",
        "　　宋朝人。江阴知县。重视农业水利，县有运河水久已湮没，贝钦世计划峻治，组织村民出钱出力，不逾月而成。",
        "地望分布",
        "　　河北清河县",
    ]
}
BaiIiaXingPageModule[111] = {
    "index": "百家姓",
    "name": "明",
    "content": [
        "历史来源",
        "　　「明」源出  ;",
        "　　一﹕出自姬姓. 以王父字为氏. 据《通志-氏族略．以字为氏》所载, 晋献公攻灭虞国, 俘获虞公及百里奚. 后百里奚为秦国大夫, 生子视, 字孟明. 其支孙以王父(祖父)的字”明”为氏。",
        "　　二﹕为古代鲜卑族复姓所改. 据《魏书.官氏志》所载, 南北朝时, 北魏有代北三字姓壹斗眷氏, 隋魏孝文帝迁都洛阳, 进入中原后, 改为汉字单姓”明”氏.",
        "家族名人",
        "　　明玉珍",
        "　　元朝随州人。元末农民大起义，率众投红巾军徐寿辉与元将战，飞矢中右目，目逐眇。后攻重庆，陷成都，定全蜀，陈友凉杀寿辉，玉珍以兵塞瞿塘，绝不与通。称帝，国号大夏，建元天统。在位5年卒。",
        "地望分布",
        "　　浙江吴兴县，山东平原县，河南洛阳市。",
    ]
}
BaiIiaXingPageModule[112] = {
    "index": "百家姓",
    "name": "臧",
    "content": [
        "历史来源",
        "　　「臧」源出  ;",
        "　　一﹕出自姬姓. 以邑名为氏. 据《通志．氏族略．以邑为氏》所载, 春秋时, 鲁孝公的儿子彄受封于臧邑(在今山东省境内), 其后有臧氏。",
        "　　二﹕ 以王父字为氏. 鲁惠公之子名欣, 字子臧, 其支孙以祖父的字为氏, 见于《姓苑》所载.",
        "家族名人",
        "　　臧获",
        "　　相传为春秋时代鲁国人，不善于驾马。《韩非子˙显学》：授车就驾，而观其末涂，则臧获不疑驽良。淮南子˙主术：虽有骐骥騄駬之良，臧获御之，则马反自恣，而人弗能制。",
        "地望分布",
        "　　江苏东海县，山东沂水县。",
    ]
}
BaiIiaXingPageModule[113] = {
    "index": "百家姓",
    "name": "计",
    "content": [
        "历史来源",
        "　　「计」源出  ;",
        "　　以地名为氏. 周文王分封少吴之后于莒国, 建都于计斤, 即为《左传》中所说的「介根」. 其后以「计」为氏。",
        "家族名人",
        "　　计然",
        "　　春秋时人辛研，字文子，葵丘濮上人，生卒年不详。因精通计算，故称为计然。尝仕越，陈察好尚、贵流通、尚平均、戒滞停等十策，越用其五策而争霸中原。范蠡师之，殖产至巨万。",
        "地望分布",
        "　　陜西西安市，山东临淄郡。",
    ],
}
BaiIiaXingPageModule[114] = {
    "index": "百家姓",
    "name": "伏",
    "content": [
        "历史来源",
        "　　「伏」源出  ;",
        "　　一﹕出自风姓。 为春秋时孔门弟子伏子贱之后, 参看”宓”氏条。",
        "　　二﹕据《万姓统谱》所载, 南北朝时鲜卑族三字姓俟伏斤氏, 进入中原后亦改为伏氏",
        "家族名人",
        "　　伏羲",
        "　　上古一位皇帝。教民佃渔畜牧，始画八卦，造书契。《史记˙卷一三○˙太史公自序》：伏羲至纯厚，作易八卦。《文选˙潘岳˙为贾谧作赠陆机诗》：粤有生民，伏羲始君。亦作庖羲、庖牺、伏羲氏、伏牺、伏牺氏、宓羲、宓戏、羲皇。",
        "地望分布",
        "　　山西太原",
    ],
}
BaiIiaXingPageModule[115] = {
    "index": "百家姓",
    "name": "成",
    "content": [
        "历史来源",
        "　　「成」源出  ;",
        "　　一：出自姬姓， 以国为氏. 据《通志-氏族略-以国为氏》所载, 公元前十一世纪, 周武王封其弟, 文王第五子叔武于郕国(在今山东省宁阳县东北), 其后有郕氏, 或去邑旁为成氏.",
        "　　二：周代, 有季戴受封于成邑(在今河南范县西濮城北), 其后以邑为氏, 亦为成氏.",
        "　　三：出自芈姓. 春秋时楚国君主若敖有公子字成虎, 其支孙以王父(祖父)之字为氏, 即成嘉 . 成熊 . 成得臣之辈。",
        "　　四：据《北京彔》所载, 古匈奴部落屠各族亦有成氏。",
        "　　五：据《宋书．夷蛮传》, 古代南方少数民族亦有成氏。",
        "家族名人",
        "　　成公",
        "　　汉朝的学者。自己隐去姓名，常诵经，不交势利，时人称为成公。汉成帝出游，遇见成公，成公不行礼，成帝说：「朕能富贵人，能杀人，子何逆贼 ? 」成公说：「陛下能贵人，臣不能做陛下之官;陛下能富人，臣不受陛下之禄;陛下能杀人，臣不犯陛下之法。」帝不能屈。",
        "地望分布",
        "　　河南灵宝县，河北杯来县",
    ]
}
BaiIiaXingPageModule[116] = {
    "index": "百家姓",
    "name": "戴",
    "content": [
        "历史来源",
        "　　「戴」源出;",
        "　　一：出自子姓. 以谥号为氏. 据《元和姓纂》所载, 春秋时宋国戴公(公元前799-前766年在位) 死后, 宋武公司空继位. 其支子(非嫡长子) 以王父(祖) 的谥号‘戴’为氏。",
        "　　二：以国为氏. 春秋时有戴国, 在今河南省兰考县, 隐公十年(公元前713年)亡于郑国. 其族人以原国名’戴‘为氏. 见于《左传》及《通志-氏族略》所载.",
        "家族名人",
        "　　戴逵  (325～396)",
        "　　字安道，谯郡（今安徽宿县）人，后徙会稽之剡县（今浙江新昌）。为东晋雕塑家、画家、学者。善弹琴，人品很高，反对佛教的因果报应说。尤善画宗教人物，兼擅山水风俗、畜兽等体。雕塑艺术上，相传曾为会稽山阴灵宝寺作木雕无量寿佛及侍菩萨时，隐于幕后，听取意见，反复修改，三年始成。他为瓦棺寺所塑的五世佛，和顾恺之的维摩诘像壁画，狮子国（斯里兰卡）送来的玉佛，在当时并称为三绝。着有释疑论，与名僧慧远等辩论。",
        "地望分布",
        "　　安徽亳县，江苏扬州市，河北清河郡",
    ]
}
BaiIiaXingPageModule[117] = {
    "index": "百家姓",
    "name": "谈",
    "content": [
        "历史来源",
        "　　「谈」源出;",
        "　　一：据《姓苑》所载, 西周史宋微子启之后有受封于谈者. 谈国为郯国. 春秋时郯子朝鲁, 其后亡国. 郯国旧址在今山东省郯城北, 战国初年为越国所灭.",
        "　　二：周朝有大夫籍谈, 其后亦有谈氏. 历史有谈氏改为谭氏。",
        "家族名人",
        "　　谈迁",
        "　　自孺木。清海宁人。好审古今治乱，由熟历代典故。",
        "地望分布",
        "　　河南永年县，河南商丘县",
    ]
}
BaiIiaXingPageModule[118] = {
    "index": "百家姓",
    "name": "宋",
    "content": [
        "历史来源",
        "　　「宋」源出;",
        "　　以国为氏. 出自子姓. 据《唐书-宰相世系表》所载, 公元前十世纪周公平定了武康叛乱之后, 商纣王的庶兄微子启受封于宋国, 建都商丘(在今河南省商丘县南). 公元前286年, 宋国被齐国所灭. 其子孙以原国名‘宋’为氏.",
        "家族名人",
        "　　宋玉",
        "　　战国时楚人，约生于周赧王二十五年，卒于楚亡之年。因曾任兰台令，故亦称为兰台公子。善辞赋，作九辩、招魂。与屈原并称为屈宋。",
        "　　宋璟（663～737）",
        "　　唐南和人。玄宗时的名相。耿介有节，守法持正，与姚崇并称为唐代贤相。累封至广平郡公，进尚书右丞。性喜梅花，所作梅花赋，世所称誉。卒谥文真。",
        "　　宋之问（656～712）",
        "　　字延清，一名少连，唐汾州（今山西省汾阳县）人。武后时官尚方监丞左奉宸内供奉，工诗，其诗与沈佺期齐名，称为沈宋。以媚附张易之而被贬官，后流岭南赐死。",
        "　　宋江",
        "　　生卒年不详，宋郓城人。徽宗时为盗，侯蒙知亳州，上疏请招抚之，未成而侯蒙先卒。后张叔夜擒其副魁，江乃降。",
        "地望分布",
        "　　陜西西安市，陜西西河郡",
    ]
}
BaiIiaXingPageModule[119] = {
    "index": "百家姓",
    "name": "茅",
    "content": [
        "历史来源",
        "　　「茅」源出;",
        "　　以国为氏. 出自「姬姓」. 西周时期，周文王之子周公旦的第三个儿子茅叔受封于茅（今山东金乡县西南），建立茅国，后来茅国为邹国 攻灭，茅国公族后代子孙就以“茅”为姓，以纪念故国。",
        "家族名人",
        "　　茅焦",
        "　　秦代官吏，对秦始皇直言敢谏，官拜上卿。",
        "　　茅盈",
        "　　汉代著名隐士，于其弟茅固，茅衷一起隐居在东山，世称「三茅」。",
        "地望分布",
        "　　陜西西安市，陜西西河郡",
    ]
}
BaiIiaXingPageModule[120] = {
    "index": "百家姓",
    "name": "庞",
    "content": [
        "历史来源",
        "　　「庞」源出;",
        "　　出自姬姓,以地名为氏。 据《通志．氏族略》所在载，周文王子毕公高之后，其支庶受封于庞乡, 因以为氏。",
        "家族名人",
        "　　庞涓",
        "　　战国时魏将，与孙膑同学兵法于鬼谷子，因嫉膑之能而刖其足。后魏﹑齐交战，膑为齐将，困涓于马陵，涓智穷自刭而死。（并不是给孙膑射死的）《史记．孙子．吴起列传》",
        "　　庞统（179～214）",
        "　　三国时襄阳人，字士元，德公之侄。少时朴顿，未有识者，往见司马徽，徽甚异之，称为南州士之冠冕，由是渐显。刘备召以为治中从事，与诸葛亮并为军师中郎将，佐刘备取蜀。后因围雒县，攻城时中流矢而卒，时年三十六。",
        "地望分布",
        "　　陜西户县，安徽亳县",
    ]
}
BaiIiaXingPageModule[121] = {
    "index": "百家姓",
    "name": "熊",
    "content": [
        "历史来源",
        "　　「熊」源出;",
        "　　出自芈姓. 据《世本》所载, 周成王(一说康王)封熊铎于楚国, 建都于丹阳（今湖北省秭归县东南）子孙以熊为氏。",
        "家族名人",
        "　　熊延弼",
        "　　字飞百，明万历年渐进士，授御史。被派到辽东，颇有作为，后遭奸臣陷害，下狱三年后被斩。明末崇祯帝时得到平反。",
        "地望分布",
        "　　湖北江陵",
    ]
}
BaiIiaXingPageModule[122] = {
    "index": "百家姓",
    "name": "纪",
    "content": [
        "历史来源",
        "　　「纪」源出;",
        "　　以国为氏，出自「姜姓」,据《元和姓纂》，《通志．氏族略-以国为氏》所载，西周初年，相传炎帝的后代受封于纪国（今山东省寿光县纪台县). 春秋时, 纪国被齐国所灭, 其 后以国名‘纪’为氏.",
        "家族名人",
        "",
        "　　纪钧（1724～1805）",
        "　　字晓岚，一字春帆，晚号石云，直隶献县（今属河北）人。清名臣﹑目录学家及文学家。乾隆进士，官至礼部尚书、协办大学士。乾隆间任《四库全书》总纂官，并主持写定《四库全书》总目提要及《四库全书》简明目录。卒谥文达。着有《阅微草堂笔记》、《纪文达公遗集》。",
        "　　纪信",
        "　　楚汉相争时，刘邦部将，在一次楚汉交锋中，为掩护刘邦逃跑，假扮刘邦，后来被项羽生擒斩首。",
        "地望分布",
        "　　山东临汾县 河北高阳郡",
    ]
}
BaiIiaXingPageModule[123] = {
    "index": "百家姓",
    "name": "舒",
    "content": [
        "历史来源",
        "　　「舒」源出;",
        "　　以国为氏，出自「偃姓」.据《左传》所载，周朝, 皋陶的后代被封于舒国(在今安徽省庐江县西). 公元前657年, 舒子平被徐国所灭. 后又复国, 称为舒鸠国。公元前552年， 又被楚国所灭. 子孙以‘舒’为氏。",
        "家族名人",
        "　　舒翁",
        "　　南宋制瓷名家。",
        "地望分布",
        "　　陜西西安市，河北平乡县",
    ]
}
BaiIiaXingPageModule[124] = {
    "index": "百家姓",
    "name": "屈",
    "content": [
        "历史来源",
        "　　「屈」源出;",
        "　　一：出自芈姓. 以邑名为氏. 据《楚辞注》及《通志.氏族略.以邑为氏》所载, 春秋 时楚武王之子瑕. 其后又屈氏;",
        "　　二：为古代鲜卑族复姓所改. 据《魏书.官氏志》所载, 南北朝时, 北魏有代北复姓屈 突氏, 魏孝文帝令改为屈氏.",
        "家族名人",
        "",
        "　　屈原 （公元前343～？)",
        "　　屈大均（1603～？）",
        "　　初名绍隆，字翁山，又字介子，明末番禺人。以诗文著名于世，与陈恭尹、梁兰佩并称岭南三大家。着有成仁录、广东新语、四书补注、翁山诗略、文外、诗外等书。",
        "地望分布",
        "　　浙江象山港 河南洛阳市",
    ]
}
BaiIiaXingPageModule[125] = {
    "index": "百家姓",
    "name": "项",
    "content": [
        "历史来源",
        "　　「项」源出;",
        "　　一：出自芈姓。一说出自姬姓。以国为氏。春秋时, 楚国公子燕, 被封于项国(在今河南省项城), 公元前647年灭亡。《左传》谓项国被鲁僖公所灭, 《公羊传》,《谷梁传》则云被齐恒公所灭。子孙以原国为氏。楚霸王项羽就是项国贵族之后。",
        "家族名人",
        "　　项羽",
        "地望分布",
        "　　河北省乐亭，辽宁省大凌河",
    ]
}
BaiIiaXingPageModule[126] = {
    "index": "百家姓",
    "name": "祝",
    "content": [
        "历史来源",
        "　　「祝」源出;",
        "　　一。 以官为氏。 据《元和姓纂》所载, 古有巫, 史, 祝之官, 其子孙因以为氏。 祝史之官, 为掌管祭礼时祝祷词的官职。",
        "　　二。 以地名为氏。 据<<唐书。宰相世系表>>所载, 西周时「祝」地在今山东省长清县东北, 居者有祝氏。",
        "家族名人",
        "　　祝允明  (1460～1526）",
        "　　字希哲，号枝山、枝指生，明代江苏长洲人。诗文有奇气，尤工书，官至应天通判，与唐寅、徐祯卿、文征明并称为吴中四才子。着有怀星堂集、兴宁县志等。",
        "地望分布",
        "　　山西省太原市",
    ]
}
BaiIiaXingPageModule[127] = {
    "index": "百家姓",
    "name": "董",
    "content": [
        "历史来源",
        "　　「董」源出;",
        "　　出自姬姓, 以职为姓. 据《姓氏急就篇》云：周朝大夫辛, 有二子, 派往晋国为太史, 董督(管理)晋国的史书典册. 故以「董」为氏。 董狐即为其后. 又据《通志．氏族略》云： 相传古帝虞舜时有董父, 为董氏之祖. 此为神话传说.",
        "家族名人",
        "　　董狐",
        "　　春秋时晋国史官，生卒年不详。晋灵公无道，正卿赵盾屡次劝谏，灵公不听，反欲杀之，赵盾于是逃亡国外。其后族人赵穿弒灵公，盾还晋国，而不讨穿。董狐乃书曰：赵盾弒其君。孔子因称：董狐，古之良史也，书法不隐。",
        "　　董仲舒 （前179～前104）",
        "　　西汉名儒，广川（河北省枣强县东）人。少治春秋，孝景时为博士，下帷讲诵，三年不窥园。提倡独尊儒术。着有春秋繁露等书。",
        "　　董卓 （?- 192)",
        "　　字仲颖，汉临洮（今甘肃省岷县）人。桓帝时，官羽林郎；灵帝时，为前将军。灵帝崩，引兵至京师，诛宦官，废少帝，立献帝，弒太后，自为太师，淫乱凶暴。袁绍等因而起兵讨伐，后为吕布所杀。",
        "　　董其昌 （1555～1636）",
        "　　字玄宰，号思白、香光居士。明书画家，华亭（今上海市松江县）人。万历进士，官至南京礼部尚书，卒谥文敏。性和易，通禅理，诗文俱佳，书法卓然成家，画极潇洒生动。着有画禅室随笔﹑容台文集、画旨、画眼等书。",
        "地望分布",
        "　　甘肃省临洮县，山东省定陶县",
    ]
}
BaiIiaXingPageModule[128] = {
    "index": "百家姓",
    "name": "梁",
    "content": [
        "历史来源",
        "　　「梁」源出;",
        "　　一：出自赢姓，以国为氏。 据《通志．氏族略．以国为氏》所载，周平王时。秦仲讨伐西戎有功，其少子康，受封于夏阳梁山(在今陜西省韩城县南)。春秋时， 梁国亡于秦国，其后有梁氏。",
        "　　二：以邑为氏。春秋时，晋国有解梁城(在今山西省临猗西南)，高梁，曲梁之地，公元前645年，晋惠公以解梁等五城贿于秦国，居其地者以「梁」为氏。",
        "　　三：古代鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏代北三字姓「拔列兰」氏，随魏孝文帝移都洛阳，定居于中原，改为汉字为单姓梁氏。",
        "家族名人",
        "　　梁红玉",
        "　　宋代名将韩世忠妻，本为京口名妓。生卒年不详。高宗建炎四年，世忠与金兀朮战于黄天荡，红玉亲自击鼓助战，兵将士气大振，金兵遂不得渡江侵宋。为女中豪杰。后封安国夫人，又改杨国夫人，世称梁夫人。",
        "　　梁启超（1876～1929）",
        "　　字卓如，号任公，别号饮冰室主人。广东新会人。近代政治家、文学家。康有为弟子。师生二人于清末同倡变法维新，人称康梁。曾主办时务报、清议报、新民丛报等，大力宣传改革主义。戊戌政变后，亡命日本。民国初年，曾任司法、财政总长等职。晚年不谈政治，专以著述讲学为务。着有饮冰室文集、先秦政治思想史、中国历史研究法等。",
        "地望分布",
        "　　甘肃省平凉，甘肃省天水，河南省洛阳",
    ]
}
BaiIiaXingPageModule[129] = {
    "index": "百家姓",
    "name": "杜",
    "content": [
        "历史来源",
        "　　「杜」源出;",
        "　　一：出自祁姓，以邑为氏。周成王将唐杜氏移于杜城（在今陜西省西安市东南），居者以地名「杜」为氏，据《通志．氏族略》云：杜氏亦日唐杜氏，祁姓。帝尧之后。 建国于刘，为陶唐氏，裔孙刘累能扰龙，事孔甲。故在夏为御龙氏。在周为唐杜氏，成王灭唐。而封虞，乃迁唐氏于杜，是为杜伯。居杜城者为杜氏。",
        "　　二：为南北朝时鲜卑族姓氏所改。据《魏书．官氏志》所载，北魏有代北三字姓独孤浑氏，随孝文帝迁都洛阳， 改为汉字单姓杜氏。",
        "家族名人",
        "　　杜康",
        "　　相传是周代善于酿酒的人。《汉．曹操．短歌行》：「何以解忧，唯有杜康。」",
        "　　杜甫",
        "　　杜牧 （803～852）",
        "　　字牧之，号樊川，唐代诗人，京兆万年人。为人刚直有奇节，曾指时弊，深忧藩镇、吐番的骄纵，后果言中。其诗风骨遒上，豪迈不羁，文尤纵横奥衍，多切经世之务，在晚唐成就颇高，时人称其为小杜，以别于杜甫。着有樊川集，代表作品有《阿房宫赋》、《泊秦淮》等。",
        "　　杜秋娘",
        "　　唐代金陵人。原为镇海节度使李锜之妾。锜谋叛被杀后入宫，善诗词及唱金缕衣曲，受唐宪宗宠爱，后赐归乡，穷老无依。因此古代以杜秋娘泛指年老色衰的妇女。",
        "地望分布",
        "　　陜西省西安，湖北省汉阳，河南省洛阳",
    ]
}
BaiIiaXingPageModule[130] = {
    "index": "百家姓",
    "name": "阮",
    "content": [
        "历史来源",
        "　　「阮」源出  ;",
        "　　以国名爲氏。据《姓谱》及《通志．氏族略》记载，阮氏，爲商代诸侯小国，在岐山，渭水之间（山西泾川县）。子孙以国名「阮」爲氏。 　",
        "家族名人",
        "　　阮瑀（？～212）",
        "　　字符瑜，三国魏陈留人（今河南省陈留县）。善于章表书记，与陈琳齐名，军国书檄，多出自二人之手，爲建安七子之一。",
        "　　阮籍 （210～263）",
        "　　字嗣宗，阮瑀之子，三国时魏尉氏人，爲竹林七贤之一。有隽才，性放诞，好老庄而嗜酒，反名教，旷达不拘礼俗。因遭时多忌，故藉酒自废，以避祸患。官至兵部校尉，人称爲阮步兵。因有贤名，世称爲大阮，与其侄阮咸齐名。着有咏怀诗八十余篇、达庄论、大人先生传等。",
        "　　阮咸",
        "　　字仲容，生卒年不详，三国时魏国陈留尉氏（今河南开封东南）人，阮籍之侄。性任达不拘，长于音律。唐代流行的琴曲三峡流泉相传爲他的作品。擅长弹奏直项琵琶。爲竹林七贤之一。",
        "地望分布",
        "　　河南陈留郡。",
    ]
}
BaiIiaXingPageModule[131] = {
    "index": "百家姓",
    "name": "蓝",
    "content": [
        "历史来源",
        "　　「蓝」源出;",
        "　　一：以地名为氏，据《竹书纪年》云：梁惠王三年，秦子向命为蓝君，封邑在蓝田（今陜西省蓝田县），其后以蓝为氏。",
        "　　二：春秋时楚国楚眧王时，有蓝伊大夫。其后亦有蓝氏。",
        "家族名人",
        "　　蓝采和",
        "地望分布",
        "　　河北省正定，山东省沂水，河南省上蔡",
    ]
}
BaiIiaXingPageModule[132] = {
    "index": "百家姓",
    "name": "闵",
    "content": [
        "历史来源",
        "　　「闵」源出：",
        "　　出自姬姓，据《左传》所载，春秋时，鲁庄公死后，其子继位，不到两年，被庆父杀害。号为「闵」，鲁闵公后有闵氏。",
        "家族名人",
        "　　闵子骞（前536 ～ 前487）",
        "　　名损，字子骞，春秋鲁人。孔子弟子，以孝友闻，和颜渊以德行并称。",
        "地望分布",
        "　　甘肃省东乡，山东省泗水，山西省太原",
    ]
}
BaiIiaXingPageModule[133] = {
    "index": "百家姓",
    "name": "席",
    "content": [
        "历史来源",
        "　　「席」源出：",
        "　　避讳改姓。 据《广韵》所载，春秋时晋国大夫籍谈，其先世代管理晋国典籍，故以籍为氏。 至秦汉之际，籍氏后人为避楚霸王项羽(名籍)的名讳，改为音近的「席」氏。",
        "家族名人",
        "　　席豫",
        "　　字建侯，唐代襄阳人，进士出身，清直无欲，不为权贵所撼。唐玄宗曾登朝元阁赋诗。群臣中帝以豫诗最佳,称诗人冠冕。天宝年间（公元742-755年）官至礼部尚书。",
        "地望分布",
        "　　甘肃平凉",
    ]
}
BaiIiaXingPageModule[134] = {
    "index": "百家姓",
    "name": "季",
    "content": [
        "历史来源",
        "　　「季」源出：",
        "　　以次为氏，古代同一辈份的排行为「伯、仲、叔、季」，季者少子也，据《元和姓纂》所载：「陆终氏之子季连之后」。《通志．氏族略．以次为氏》云：「春秋时鲁桓公的小儿子季子友之后为季孙氏，亦日季氏。",
        "家族名人",
        "　　季布",
        "　　生卒年不详。楚人。楚汉相争，初为项羽部将，数围刘邦。及项羽灭，被刘邦追捕，后由朱家透过汝阴侯滕公，乃得赦免，并官郎中、中郎将及河东守等。其人为气任侠，重然诺，当时人称「得黄金百斤，不如得季布一诺」。",
        "　　季札",
        "　　生卒年不详。春秋吴王寿梦的第四子。寿梦见其贤而欲立为王，不受；后封于延陵，号延陵季子，简称为季子。曾出使鲁国，并从观乐中，听出各国的兴衰。他与徐君间重友谊、守信用的故事，亦为世人传诵。",
        "地望分布",
        "　　山东曲阜，安徽寿县",
    ]
}
BaiIiaXingPageModule[135] = {
    "index": "百家姓",
    "name": "麻",
    "content": [
        "历史来源",
        "　　「麻」源出：",
        "　　一：以邑为氏。据《姓考》所载，春秋时有楚国大夫食采于麻邑，以邑名「1麻」为氏。",
        "　　二：据《风俗通义》所载，春秋时齐国大夫麻婴之后。",
        "家族名人",
        "　　麻秋",
        "　　后赵太原胡人，仕石虎，官征东将军，性暴戾残忍。百姓如有孩子啼哭，母恐吓日：「麻胡来了。」啼声立止。",
        "地望分布",
        "　　河北怀来",
    ]
}
BaiIiaXingPageModule[136] = {
    "index": "百家姓",
    "name": "强",
    "content": [
        "历史来源",
        "　　「强」源出：",
        "　　一：据《姓苑》所载，为春秋时郑国大夫强钽之后。",
        "　　二：古代氏族姓氏，据《十六国春秋》所载，略阳氏族多强姓，即蜀汉时强端之后。",
        "家族名人",
        "　　强循",
        "　　字季先，唐代凤州人，官雍州司户参军。华原无泉，人畜多渴死。强循教以引渠水浸田，共三渠，一方利之，号强公渠。",
        "地望分布",
        "　　甘肃天水 安徽宣城",
    ]
}
BaiIiaXingPageModule[137] = {
    "index": "百家姓",
    "name": "贾",
    "content": [
        "历史来源",
        "　　「贾」源出：",
        "　　一：出自姬姓，以国为氏。据《姓苑》所载，周康王把唐叔虞的小儿子公明封于贾国，称为贾伯，为附庸小国。后来贾国被晋国所灭，贾伯公明的后代以原国名「贾」为氏。",
        "　　二：以邑名为氏。 晋国灭贾后，成为一个城邑，称为贾季。其后以邑名为氏。晋惠帝的皇后，即为其后人。",
        "家族名人",
        "　　贾谊（前200～前168）",
        "　　西汉洛阳人，为文学家兼政论家。文帝召为博士，超迁至太中大夫，所论列多见施行，因遭毁忌，出为长沙王太傅，迁为梁怀王太傅，后怀王堕马死，谊自伤为傅无状，年余亦卒，世人称为贾太傅、贾长沙，又称为贾生。其往长沙就任时，渡湘水作吊屈原赋以抒发哀怨；而于长沙王太傅时，见鸮鸟飞入屋内，以为不祥，而作鵩鸟赋，是楚辞到汉赋之间重要的辞赋家。着有陈政事疏、过秦论等著名的政论文章。",
        "　　贾南风",
        "　　晋惠帝后。（256～300）名南风，贾充之女。性妒忌，多权诈，荒淫放恣，帝畏而惑之。窃弄权柄，杀杨骏、卫瓘、汝南王亮、楚王玮等，后为赵王伦所废，矫诏赐死。",
        "　　贾似道（1213～1275）",
        "　　字师宪，号秋壑，南宋台州（今浙江省临海县）人。理宗时，以姊为贵妃，累官至左丞相，兼枢密使。为人好游乐，淫奢专权。后元兵迫建康，宋军屡败，贾似道被劾贬逐，押解至漳州木绵庵，为押解人郑虎臣所杀。",
        "地望分布",
        "　　甘肃民勤",
    ]
}
BaiIiaXingPageModule[138] = {
    "index": "百家姓",
    "name": "路",
    "content": [
        "历史来源",
        "　　「路」源出：",
        "　　一：出自姬姓，以国为氏。据《唐书．宰相世系表》云：帝挚子玄元， 尧时于中路。夏代为侯国，子孙以国为「路」氏。",
        "　　二：出自姜姓。据《元和姓纂》所载，春秋时有潞子国，在今（唐代）上党潞县，子孙以路为氏。参看「潞」氏条。又《姓氏急就篇注》云：「路」，水名（即今山西浊漳河），因以为县（即潞县），居者氏焉。",
        "　　三：为古代鲜卑族复姓所改。据《魏书．官氏志》云：南北朝时，北魏有代北三字姓「没路真」氏，进入中原后改为路氏。",
        "家族名人",
        "　　路振",
        "　　字子发，宋代湘潭人。淳化年间（公元990 - 994年）进士，历官太常博士，左司谏等。振文词秀美，尤善词，多警句。科举时，宋太宗试《卮言日出赋》，应试者数百，名人亦有难色。时振尚不知名，然其赋典故尤丰，太宗十分赞许。",
        "　　路博德",
        "　　西汉西河郡平州人。任右北平太守，随霍去病出征有功，封符离侯。后封伏波将军，伐破南粤。",
        "地望分布",
        "　　河北大名县，河南襄城县，河南开封，河南洛阳市",
    ]
}
BaiIiaXingPageModule[139] = {
    "index": "百家姓",
    "name": "娄",
    "content": [
        "历史来源",
        "　　「娄」源出：",
        "　　一：以国为氏，《风俗通义》载，春秋时邾娄国子孙，或以娄为氏。邾娄国，在今山东省邹县一带。",
        "　　二：出自姒姓，以邑名为氏。周武王克商后，东楼公受封于杞国。春秋时， 杞国被楚国吞并，东楼公的子孙又食采于娄邑，遂为娄氏。",
        "　　三：为古代鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「匹娄」氏，「乙那娄」氏，随魏孝文帝迁都洛阳后，定居中原，改为娄氏。",
        "家族名人",
        "　　娄师德（630～699）",
        "　　字宗仁，唐郑州原武人。武后时的宰相，掌理朝政，恭勤朴忠，统领边塞要地共三十年，有容人的雅量，以能用人见称。卒谥贞。",
        "　　娄僧",
        "　　宋代承天寺僧人，中指有七节。时仁宗赵祯刚出世，啼哭不止，知娄僧有奇术，遂召入宫。僧按幼主头顶，曰：「莫叫，莫叫，何以当初莫笑。」 哭声乃止。",
        "　　娄妃",
        "　　明代上饶人娄谅之女，嫁宁王朱宸濠为妃，有贤德。宁王起兵谋反， 娄妃屡谏不听。兵败被杀。临终前叹曰：「昔商纣听妇人之言而亡，吾不听 妇人之言而死。后悔晚矣!」清代人蒋士铨写《一片石》，《第二碑》两传奇， 哀悼此妃。",
        "地望分布",
        "　　安徽亳县",
    ]
}
BaiIiaXingPageModule[140] = {
    "index": "百家姓",
    "name": "危",
    "content": [
        "历史来源",
        "　　「危」源出：",
        "　　一：以地为氏，《潜夫论》云：危氏，三苗之后。《舜典．传》云：三苗，国 名，缙云氏之后。按，上古三苗族原住在今河南省南部至洞庭湖，及江西省鄱阳湖一代。传说在古帝虞舜时被迁至三危，其后有危氏。",
        "　　二：明初文学家危素之祖本姓黄，后冒姓危氏。",
        "家族名人",
        "　　危应宗",
        "　　明代光泽人。国变荒乱，家族中幼孤无依者，应宗皆收养之，曰：「 与其独饱，无宁同饥。今幸我存，若令若属失所乎 ?」梓里，故乡。",
        "地望分布",
        "　　河南上蔡县 江西抚州市",
    ]
}
BaiIiaXingPageModule[141] = {
    "index": "百家姓",
    "name": "江",
    "content": [
        "历史来源",
        "　　「江」源出：",
        "　　一：出自嬴姓，以国为氏。《通志．氏族略．以国为氏》所载，周朝将伯盖之后 分封于江国。春秋时被楚国所灭，子孙以国名为氏。",
        "　　二：又据《姓谱》所载，系出嬴姓，伯益之后，封江陵，子孙以国为氏。",
        "家族名人",
        "　　江总（519～594）",
        "　　字总持，南北朝考城人。工文辞，长于艳诗。初仕南朝梁，后入南朝陈为仆射尚书令，故世称为江令。后为陈后主宠爱，君臣日夜游宴，不理政务，以至于国家灭亡。后入隋，拜上开府。卒于江都。",
        "　　江氏（梅妃）",
        "　　江氏，唐玄宗李隆基妃，酷爱梅花，号梅妃。失宠后，玄宗赠一斛明珠，江氏拒而不纳，还诗一首，其中有「何必明珠慰寂寥」之句。",
        "地望分布",
        "　　河南兰考县",
    ],
}
BaiIiaXingPageModule[142] = {
    "index": "百家姓",
    "name": "童",
    "content": [
        "历史来源",
        "　　「童」源出：",
        "　　据《通志．氏族略》所载，春秋时晋国有大夫胥童，其后有童氏。又《元和姓纂》云，上古颛顼氏生考童，其后为童氏。此为神化传说附会之辞，不足为凭。",
        "家族名人",
        "　　童参",
        "　　宋代瓯宁人，性淳朴，隐于耕。仁宗初年寿高一百零二岁，赐敕「慰劳」， 授承务郎。",
        "　　童恢",
        "　　字汉宗，东汉姑幕人。任不其令，耕织种收，皆有条章，执法廉平，一 境清静。官终丹阳太守。入《循吏传》。",
        "　　童贯（1054～1126）",
        "　　字道辅，开封（今河南开封）人。性巧媚，能言善道。为北宋宦官，与蔡京互相勾结，在西北监军，掌兵权二十年。徽宗时因平方腊有功，晋升为太师，故时人称之为「媪相」。",
        "地望分布",
        "　　山西代县，江西南城县，辽宁渤海",
    ]
}
BaiIiaXingPageModule[143] = {
    "index": "百家姓",
    "name": "颜",
    "content": [
        "历史来源",
        "　　「颜」源出：",
        "　　一：出自姬姓。以邑名为氏，据《姓谱》及《通志．氏族略》所载，西周时周公旦长子伯禽受封于鲁国，其庶子食采于颜邑，其后有颜氏。",
        "　　二：出自曹姓。以王父字为氏，周代邾国邾武公名夷父，字颜，称为颜公，其后亦有颜氏。",
        "家族名人",
        "　　颜回（前521～前490）",
        "　　字子渊，春秋鲁人，孔子弟子。天资明睿，贫而好学，于弟子中最贤，孔子称其不迁怒，不贰过。后世称为复圣，列于孔门德行科。亦作颜子渊、颜渊。",
        "　　颜真卿（709-785年)",
        "　　字清臣，唐代临沂人，累官监察御史，太元太守。安史之乱，真卿与从兄杲卿共起兵。封鲁郡公，后李希烈陷汝州，受命前往劝谕，持节不屈，被害。",
        "地望分布",
        "　　山东曲阜， 山东诸城",
    ]
}
BaiIiaXingPageModule[144] = {
    "index": "百家姓",
    "name": "郭",
    "content": [
        "历史来源",
        "　　「郭」源出：",
        "　　一：据《潜夫论》及《风俗通义》所载：氏于居者城、郭、园、池是也。「郭」是古代都城外面的护卫墙。",
        "　　二：据《元和姓纂》所载，周文王季弟虢叔受封于虢国。或曰「郭公」（古代虢，郭二字同音）因以为氏。又据《唐书．宰相世系表》所载，周文王封文王之弟虢叔于西虢，封虢仲于东虢。「虢」谓之「郭」，声之转也，因以为氏。虢国，即郭国。东郭国在今河南省蒙阳县一带，公元前765年被郑国所灭，西国又名「城国」，在今陜西省宝鸡市东部，西周灭亡后，支族乃留原地称为「小郭」， 公元前687年被秦国兼并。北郭建都于上阳（在今河南省陜省东南部）占据今河南省三门峡和山西省平陆县一带，公元前655年被晋国所灭。几处之后子孙，皆为郭氏。",
        "　　三：唐代回纥定居中原后，改姓「郭」，以从「郭子仪」之姓。",
        "家族名人",
        "　　郭解",
        "　　字翁伯，生卒年不详，汉朝轵（今河南省济源县）人。为人精悍、节俭、勇猛任侠，常以德报怨，厚施而薄望，所以人们争相与他交往。若朋友有难或遭怨，必亲自助其报仇；若不愿复仇者，则捐钱使其安居。武帝时被杀。",
        "　　郭璞（276～324）",
        "　　字景纯，河东闻喜人。东晋文学家与思想家。博学高才，好古文诗赋，富文釆。又精通阴阳历算五行卜筮之术，后因卦筮违逆王敦，被杀。曾为尔雅、山海经、方言、楚辞等书作注。",
        "　　郭子仪（697～781）",
        "　　唐朝名将，华州（今陕西华县）人。曾平安史之乱，并联回纥，征吐蕃。官至太尉、中书令，时称为郭令公。因封汾阳郡王，世称为郭汾阳。一生历事玄宗、肃宗、代宗、德宗四朝，以一身而系天下之安危二十年。享年八十五岁，卒谥忠武。",
        "地望分布",
        "　　山西太原市，陜西华阴县，陜西大荔县",
    ]
}
BaiIiaXingPageModule[145] = {
    "index": "百家姓",
    "name": "梅",
    "content": [
        "历史来源",
        "　　「梅」源出：",
        "　　出自子姓. 以地名为氏. 据《新唐书．宰相世系表》及宋濂《梅府君墓志铭》所 载，商王太丁封其弟于梅，称梅伯。为殷纣王所废。周武王克商后，又封梅伯 的后裔于黄梅，其后有梅氏。",
        "家族名人",
        "　　梅询",
        "　　字昌言，宋代宣城人。进士出身，官至许州知州。喜焚香两炉，用公服罩住，灌满袖，就坐后打开，满屋浓香，人称梅香。",
        "　　梅兰芳（1893～1961）",
        "　　名澜，字畹华，江苏泰兴人，当代平剧名伶。生于北平梨园世家，早期从吴菱仙、秦稚芬习青衣旦角，以天赋特优，技艺绝伦，驰名全国。尔后对旦角唱腔、念白、音乐、服饰、舞蹈等进行革新创造，为旦角表演艺术另辟新路，在平剧史上具有承先启后的作用。曾三度出国，前往日、美、前苏联及欧洲各地表演，美国洛杉矶波摩拿学院及南加州大学均赠予文学博士荣衔。",
        "地望分布",
        "　　河南中部偏南 安徽淮河以北",
    ]
}
BaiIiaXingPageModule[146] = {
    "index": "百家姓",
    "name": "盛",
    "content": [
        "历史来源",
        "　　「盛」源出：",
        "　　出自姬姓，以国名为氏。据《后汉书》及《万姓统谱》所载，西周初年，召公奭建立燕国，其支子受封于盛（在今河南省境内）为燕国附庸。《穆天子传》云：盛，姬之国。后被齐国所灭，子孙为奭氏。至汉代，为避汉元帝刘奭之名讳，改姓为盛氏，复以祖先封国名为氏。",
        "家族名人",
        "　　盛吉",
        "　　字君达，东汉会稽郡人。官廷尉，每至冬节，囚犯当断，妻夜秉烛，吉持册笔。夫妻相向垂泣而决断。视事二十年，天下称有恩无怨。",
        "　　盛彦师",
        "　　唐代虞城人。因功封葛国公，授武卫将军，后为宋州总管。徐圆朗反，战败被执，令作书招其弟举虞城叛，不从。",
        "地望分布",
        "　　河南中部偏南 河南上蔡县",
    ]
}
BaiIiaXingPageModule[147] = {
    "index": "百家姓",
    "name": "林",
    "content": [
        "历史来源",
        "　　「林」源出  ;",
        "　　一 ; 出自「子」姓。殷商王朝的太师「比干」因谏商纣而死，其子坚逃与长林，周武王克商后，赐姓「林」，食采博陵，散居于周，鲁，齐，卫国等地。",
        "　　二 ; 据《通志．氏族略》所载 ; 林氏，姬姓，周平王庶子林开之后，因此以林为氏。",
        "家族名人",
        "　　林则徐 （1785～1850）",
        "　　林语堂 （1895～1976）",
        "　　福建龙溪人，为二十世纪享誉中外的著名学者及作家。学识渊博，精通英文，才智杰出，著作等身，望重士林，誉满国际。着有《开明英文文法》、《生活的艺术》、《京华烟云》、《中国与印度的智慧》、《无所不谈合集》等。",
        "　　妈祖",
        "地望分布",
        "　　山西西河郡，福建南安郡，江苏下邳郡。",
    ]
}
BaiIiaXingPageModule[148] = {
    "index": "百家姓",
    "name": "刁",
    "content": [
        "历史来源",
        "　　源流一",
        "　　源于姬姓，出自周朝时期的诸侯国雕国，属于以国名为氏。据史籍《姓苑》记载：“刁，弘农郡，系出姬姓。文王同姓有雕国，后更为刁氏。齐有竖貂，晋有刁协。”古雕国，故址在今陕西省延安市甘泉县道镇兰家川一带，在商王朝时期原地多为鬼方民族所居。至商帝武丁(商高宗)执政时期，曾在延安地区发动了大规模的讨伐鬼方民族的战争，其在典籍《周易·既济》中有记载：“高宗伐鬼方，三年克之。”周文王时期，亦大举攻伐周边地区，因延安地区盛有鹘雕(鹗鸟)，因称为“雕”。周武王灭商纣之后(公元前1106～前1104年待考)，将兄弟之一封于雕，建有姬姓雕国，其时该地区仍为鬼方民族所占据。",
        "　　战国初期，延安地区以南属魏国之域，以北为赵国领土。秦惠文王嬴驷八年(公元前330年)，秦国的大良造公孙衍率军大败魏军于雕，斩魏军八万余，并俘魏军大将龙贾。因为雕之地在泰昌山以北，因此称作“雕阴”，史称这次战役为“雕阴之战”。这一战役使魏国在军事上开始走下坡路，其后，魏国被迫将黄河以西之地献于秦国，延安地区始属秦国。",
        "　　源流二",
        "　　源于职业，出自古代考工雕人之后，属于以职业称谓为氏。据史籍《汉书》记载：“雕姓，考工雕人之后。”考工，是西周至秦汉之际对所有技工的统称，包括了六类三十个基本工种。",
        "　　在雕人的后裔子孙中，有以先祖的职业称谓为姓氏者，称雕人氏，后大多省文简化为单姓雕氏，亦有取同音字简笔为刁氏者，世代相传至今。",
        "　　源流三",
        "　　源于姬姓，出自春秋时期孔子门生漆雕开之后裔，属于以先祖名字为氏。在典籍《论语》中记载有：“子使漆雕开仕。”漆雕开，公元前540～？年待考，春秋末期鲁国人，字子开，又字子若、子修，是孔子的学生，在孔门中以德行著称，是漆雕氏之儒的创始人。他曾经因无罪受刑而致身残，但他不气馁，投入孔子门下专攻《尚书》。史称，漆雕开具有“勇者不惧”的美德，主持正义，刚正不阿，主张色不屈于人，目不避其敌。著有《漆雕子》十三篇。",
        "　　在漆雕开的后裔子孙中，有以先祖名字为姓氏者，称漆雕氏，后省文简化为单姓漆氏、雕氏、刁氏。",
        "　　源流四",
        "　　源于姜姓，出自春秋时期齐国君主齐桓公近臣竖貂的后裔，属于以先祖名字为氏。春秋时期的周庄王姬佗十二年(公元前685年)，齐桓公姜小白在执政后一心想富民强国，在诸侯列国中成为霸主，所以也就必然要选拔一批有“经天纬地之才，济世匡时之略”的人才来辅佐他实现这个远大目标。管仲、隰朋、鲍叔牙等一大批杰出人物正是在这样的背景下脱颖而出的。齐桓公死后，五个公子争相求立，竖貂与易牙等杀群吏，逐齐孝公姜昭，立齐中废公姜无诡，内讧从此扩大，竖貂也在这场政变中丧生。直到周襄王二十年(公元前632年)齐昭公姜潘即位，才彻底平息了竖貂引发的这场内乱，但齐国因此也丧失了春秋霸主的地位。",
        "　　竖貂在自宫之前，生育有两子一女。后来竖貂的孙子以祖父的名字为姓氏，称貂氏，此后遂有貂氏一族。但后裔子孙们为了避先祖之恶名，便改取“貂”的同音“刁”、“雕”作为姓氏，称刁氏、雕氏，在唐朝时期有改为丁氏者。",
        "　　源流五",
        "　　为貂姓所改。据《风俗通》所载，春秋时齐国有貂勃，后姓貂氏。古代雕、貂二姓，后来皆改为刁姓。 另据《日知录》、《复古篇》载，古代刁、雕、貂三字声同宗异，后统为刁姓。",
        "　　源流六",
        "　　源于百濮族，出自周王朝时期的百濮雕题国，属于以国名为氏。在史籍《山海经·海内南经》中记载：“伯虑国、离耳国、雕题国、北胊国皆在郁水南。郁水出湘陵南海。一曰相虑。”而明朝时期的广东香山石岐仁厚里人、儒学大家黄佐在《广东通志·图经》中记载：“海南古有雕题国”。古郁水，即今广西右江、郁江、浔江以及广东西江。今广西东部、广东西部的西江中游南岸有“郁南县”，因古郁水而得名。西江由西北往东南流人珠江三角洲入南海，“郁水南”的“雕题国”，有学者认为应在西江下游的珠江三角洲地区，也有学者认为雕题国是指今台湾省，或指今海南省。秦朝以后，随着中原汉族人的大批南迁，蜑人逐渐失去了陆上营地，被迫长年漂泊海上，大部分蜑人被汉人同化，逐渐上岸开垦沙田种地，成为农民。仍有一部分蜑民不愿放弃传统的生产、生活方式，坚守“以舟楫为家，捕鱼为生”的古老传统，因此在历史上曾被南下汉人视为低贱的“蜑民”。",
        "　　蜑人被汉族同化之后，有以先国之名为姓氏者，称雕题氏，后有省文简化为单姓雕氏者，为古老的姓氏之一，亦有取同音字简笔为刁氏者，世代相传至今。余者多为巴氏、樊氏、晖氏、相氏、郑氏这五大著姓。",
        "　　源流七",
        "　　源于职业，出自秦、汉之际刁工，属于以职业称谓为氏。刁，为秦、汉时期的一种军用品，是一种有柄的小斗(带把小铜锅)，白天可供一人煮饭，夜间则用来敲击以巡更，为军旅必备器具。这种“刁”一直沿用至今，不过将其柄巧妙一点可折叠，改称为“军用饭盒”罢了。制作“刁”的工匠，就称为刁工。秦始皇曾将收缴的六国兵器“冶以为刁”，毁灭六国遗民能锻兵造反的工具，来装备军队自己的战士。",
        "　　在刁工的后裔子孙中，有以先祖职业称谓为姓氏者，称刁氏，世代相传至今。",
        "　　源流八",
        "　　源于匈奴族，出自汉朝时期匈奴复株累若鞮单于雕陶莫皋的后裔，属于以先祖名字汉化为氏。",
        "　　在复株累若鞮单于的后裔子孙中，有随南匈奴逐渐融入汉族者，以先祖名字为汉化姓氏，称雕陶氏，后省文简化为单姓雕氏、刁氏、陶氏、单氏等。",
        "　　源流九",
        "　　源于官位，出自汉朝时期武官冠饰，属于以官职称谓为氏。汉朝时期，所有的五品以上武将的冠帽上皆有貂尾为饰，是一种身份象征。",
        "　　在汉朝武将的后裔子孙中，有以先祖具有“貂尾冠”而荣，因有称貂氏者，后多简改同音字“刁”为姓氏，称刁氏。",
        "　　源流十",
        "　　源于突厥族，出自唐朝时期西突厥阿史那部鼠尼施部落，属于以部落图腾崇拜为氏。在文献《新编千家姓》和史籍《新唐书》中皆记载：“唐有鼠尼施。”",
        "　　到武则天执政后期，下令将鹰娑川鼠尼施部内迁，鼠尼施部族人反抗而自迁川黔之地，在三国蜀汉时期逐渐与当地故西羌部落融合，相对集中分布于滇西遂久(今云南丽江)、澜沧江流域金州(今贵州黔西南布依族苗族自治州贞丰、册亨、望谟一带)，成为后来西南夷的先民之一，族人多以部落名称为姓氏，称鼠氏；亦有以部族图腾“大鼠”即貂为姓氏者，称貂氏，后有简改同音字“刁”为姓氏，称刁氏。",
        "　　源流十一",
        "　　源于傣族，属于汉化改姓为氏。明朝时期，云南傣族刀氏土司世家后裔，有改姓氏为刁氏者。到了清朝时期，云南建水州慢车乡土舍、镇沅土府、四川建昌道红卜苴土百户等均有刁氏。傣族，古代时没有姓氏，只有名字，后吸取汉文化逐渐采用了姓氏。在史籍《希姓录》中记载：“王骥平麓川，赐夷人怕、刀、剁三姓，后染华风，改为刁氏。”",
        "　　其中的刀氏族人世为傣族土司，在稳定云南地区民族团结和促进经济发展中作出了巨大贡献，之中，刀氏族人中有易改为刁氏者，世代相传至今。",
        "　　源流十二",
        "　　源于满族，属于汉化改姓为氏。据史籍《清朝通志·氏族略·满洲八旗姓》记载：",
        "　　⑴.满族刁落氏，亦称多啰氏、啁噜噜氏，满语为Dolo Hala，汉义“内”，世居叶赫(今吉林梨树)、东海(今俄罗斯滨海地区)，所冠汉姓为刁氏、高氏、赵氏等。",
        "　　⑵.满族多兴氏，满语为Dohing Hala，世居讷殷(今吉林抚松松花江上游流域)，所冠汉姓中有刁氏。",
        "家族名人",
        "　　刁 闲",
        "　　西汉初齐（治今山东淄博市临淄）人。大工商业主。今学者将其列为中国古代23巨商之一。刁间致富之道很特别。齐国人一向瞧不起奴婢，但刁间特别善待他们，用他们去做鱼盐买卖并经营商业，以此致富，家产数千万，成为巨富。【《史记．货殖列传》齐俗贱奴虏，而刁闲独爱贵之。桀黠奴，人之所患也，唯刁闲收取，使之逐渔盐 ... 最後富至千金。",
        "　　刁 韪",
        "　　彭城（今江苏省徐州）人，东汉大臣。桓帝时为侍御史，与陈蕃相重，被陷以朋党禁锢。后复拜议郎，迁尚书，出为鲁、东海二郡相。性耿直，有明略，所在称神。",
        "　　刁 协",
        "　　渤海饶安人，东晋大臣。东晋初建，任尚书左仆射、尚书令，参与制订朝廷典章制度，为元帝心腹，竭力拥护帝室，与王氏势力相抗衡。后王敦起兵反晋，他于出逃途中被杀。",
        "　　刁 彝",
        "　　协子，东晋大臣。王敦乱平后，他斩仇人党为父报仇。历尚书吏部郎，累迁北中郎将、徐衮二州刺史、假节，镇广陵。",
        "　　刁 逵",
        "　　刁彝子，东晋官吏，土族地主。安帝时，任广州刺史，领平越中郎将。与其弟刁畅、刁弘等皆不重名节，喜殖财货。后随桓玄叛晋，被刘裕所灭。",
        "　　刁 雍",
        "　　刁畅子，北魏官吏。刘裕执政，逃至后秦，后归北魏，任建义将军，与刘宋军频繁交战，迁徐豫二州刺史等职。尚文好学，著有诗、赋、论、颂、杂文百余篇。又笃信佛教，著有《教戒》。",
        "　　刁 整",
        "　　刁雍孙，北魏大臣。颇涉书史，解音律。轻财好施，交结名流，然贪而好色，为议者所贬。历安南将军、光禄大夫等职，官终卫大将军。",
        "　　刁 通",
        "　　山阴（今江苏省淮安）人，元代将领。弱冠授从征冯翊校尉。世祖至元中，从丞相伯颜作战，武艺绝伦，功居多。阿术元帅及选通领都下军，克樊城，定镇江、淮南一带。升征东招讨使，佩金符，移镇扬州，命世袭其职。",
        "　　刁 代",
        "　　元代本路总管，是时洞蛟为孽，代挟利剑入洞，代与蛟俱死。",
        "　　刁 包",
        "　　祁州（今河北省深泽）人，明末清初学者。明天启间举人，学术专宗义理。明末倡众守城拒农民起义军。有《易酌》、《用六集》等。",
        "　　刁光胤",
        "　　长安人，唐代画家，天复中避乱入蜀。性情高洁，交游不杂，善画湖石、花卉、帽兔、鸟雀，工花水，有“孔类升堂，黄得入室”之赞。孔嵩、黄筌皆师其笔。",
        "　　刁彦能",
        "　　上蔡人，五代时后唐大臣。少孤，事母至孝。官至抚州节度使，颇有治称。",
        "　　刁国器",
        "　　平阳路（今山西省临汾）人，元代将领。以勋阀为征西帅，临乱决战以果毅称。",
        "　　刁再濂",
        "　　清代学者，性清介，不苟取。临卒，犹以居官致富戒其子孙。",
        "　　刁戴高",
        "　　浙江慈溪人，清代学者。诸生。少即以能书工诗名，后多病，足不能行，惟吟诗作字不断。尤善大字，兼通音韵。",
        "地望分布",
        "　　刁氏是一个典型的多民族、多源流姓氏，在当今姓氏排行榜上名列第二百四十五位，人口约三十六万九千余，占全国人口总数的0.023%左右。",
        "　　战国时齐襄王有处士貂勃，有的古籍也写作刁勃，汉时有齐之商贾刁间，这几位名载史册之人物，都是当时的齐人，即现在的山东人，再结合竖刁，可见刁姓的最早发源地是山东。新莽时期有义军首领、东海（今山东省郯城）人刁子都，东汉有彭城（今江苏省徐州）人刁韪见诸史册，徐州毗邻山东，以前又曾归属过山东管辖，所以刁姓起源于山东应无疑义。汉末三国魏晋时，刁姓在渤海郡和弘农郡繁衍得十分兴旺，成为此两郡之名门大族，其中以刁姓渤海郡望最为兴旺，表现十分抢眼。五胡十六国时期，中原板荡，晋室被迫南渡，渤海饶安（今河北省孟村）人刁协亦避难南渡，为当朝尚书令，后被奸臣所杀，但其子孙显贵于当朝，其孙刁逵兄弟三人俱经商发家，仅刁逵一人就置田产数万顷，奴婢至数千人，后刘裕诛刁民，刁姓有回归北方者，但有刁姓血脉留居江南。北魏时，刁协五世孙刁整因河北丧乱，遂奉母客齐州（今山东省济南）。隋唐两代，刁姓繁衍之主流依旧在北方，但在江浙皖鄂的南方诸省均有刁姓人家入居。唐昭宗天复中，长安（今陕西省西安）人刁光胤避地入蜀（今四川省）。唐末五代时，河南上蔡人刁彦能因仕宦南唐而落籍升州（今江苏省南京），其有子徙居润州丹徒（今江苏省镇江）。除此以外，刁姓由于避乱亦有进入湖南、江西者。宋元两代，今福建、广东、广西、云南、贵州均有刁姓人入迁。元末明初，有刁清自福建宁化石壁迁广东潮州揭阳。生子四，分迁兴宁、长乐、海阳。续衍潮阳龙川、新界以及广西。山西刁姓作为明初洪洞大槐树迁民姓氏之一，被分迁于河北、东北、甘肃、天津等地。历清，刁姓分布之地愈广。",
        "　　如今，刁姓在全国分布较广，尤以贵州、湖南多此姓，二省汉族刁姓约占全国汉族刁姓人口的百分之六十四。刁姓是当今中国姓氏排行第二百零四位的姓氏，人口较多，约占全国汉族人口的百分之零点零四。",
    ]
}
BaiIiaXingPageModule[149] = {
    "index": "百家姓",
    "name": "钟",
    "content": [
        "历史来源",
        "　　「钟」源出  ;",
        "　　一：以地名为氏。据《通志．氏族略．以邑为氏》所载，春秋时宋桓公之曾孙伯宗在晋国做官， 生州黎， 逃奔楚国， 食采于钟离(在今安徽省凤阳市， 一说在今湖北省汉川县东五里处)。其后有钟氏， 钟离氏。",
        "　　二：为钟离氏所改。据《姓氏急就篇》所载，楚汉之际， 钟离昧为项羽部将， 其次子接， 居颍川长社(故城在今河南省长葛县西)， 其后为钟氏。",
        "家族名人",
        "　　钟繇   (公元151-230)",
        "　　字符常， 三国时魏颍川郡人。 汉末官至侍中， 尚书仆 射， 入魏升太傅。 善书法， 从师刘德升。其书若飞鸿戏海， 舞鹤游天。",
        "　　钟馗",
        "　　钟离权",
        "地望分布",
        "　　河南许昌",
    ]
}
BaiIiaXingPageModule[150] = {
    "index": "百家姓",
    "name": "徐",
    "content": [
        "历史来源",
        "　　「徐」源出  ;",
        "　　一：以国为氏。徐戎，亦称徐夷或徐方，为东夷之一。夏代至周代，分布在今淮河中下游（今江苏省西北部和安徽省东北部）。周初，以今江苏省泗洪县一带为中心，建立徐国，在东夷中最为强大，春秋时为楚国所败，周敬王八年(公元前512年)被吴国吞并。据《元和姓纂》及《通志.氏族略》所载，徐氏为颛顼，皋陶之后。夏禹时封伯益之子若木于徐国。从若木至徐偃王共三十二世。徐偃王攻周，被周穆王及造父击败。后又封徐偃王子宗为徐子。春秋时，徐国被吴灭后，徐子的遗族以原国名「徐」为氏。",
        "　　二：清代满族姓氏舒穆禄氏改为徐氏，如徐元梦，为满洲正白旗人。",
        "家族名人",
        "　　徐偃王",
        "　　周穆王时徐国之子爵诸侯，以仁义治国，因得朱弓矢，以为天瑞，遂自称徐偃王。江淮诸侯，从之者三十六国，穆王令楚伐之，偃王爱民不战，遂为楚败。",
        "　　徐福",
        "　　秦时方士，字君房。生卒年不详。始皇闻东海祖洲有不死之药，遣福乘楼船，载童男女各三千人往求之，去而不返。或作「徐市」。",
        "　　徐敬业",
        "　　唐徐绩之孙，有勇名，屡从绩征伐，袭英国公爵，坐事贬柳州司马。后与骆宾王等共讨武后，兵败，为其部下所杀。",
        "　　徐达（1332～1385）",
        "　　字天德，明代濠州人。助朱元璋起兵，屡立战功，率兵北定中原，入燕京，为开国功臣，官至中书右丞相，封魏国公。死后追封中山王。",
        "　　徐悲鸿（1892～1952）",
        "　　原名寿康，江苏宜兴人。法国巴黎国立美术学校毕业。历任北京艺术学院、中国美术学院院长等职。曾携中国近代绘画作品赴法、德、比、义等国展览。以改良国画，发扬中华艺术为终身事业。工西画，善写动物，国画以马为最驰名，笔法简练明快，富有生气，能够融合中西技法而自成面貌。着有中国画改良论、美与艺及画集。",
        "　　徐志摩（1896～1931）",
        "　　原名章垿，以字行。浙江海宁县人。曾留学英美，以新诗、语体散文著名，风格瑰丽。历任北京、东吴、中国各大学教授，为北京晨报诗刊及新月月刊主编。因飞机失事而遇难。着有志摩的诗、自剖、巴黎鳞爪、翡冷翠的一夜等。",
        "地望分布",
        "　　江苏海县 山东巨野县、沂水、临沂 河南濮阳",
    ]
}
BaiIiaXingPageModule[151] = {
    "index": "百家姓",
    "name": "邱",
    "content": [
        "历史来源",
        "　　「邱」源出  ;",
        "　　一：以丘亦作邱。《说文通训定声》引东汉应劭《汉书．楚元王传注》云:邱，姓也。后世为避孔子（名丘）的名讳，将丘加邑旁改写为邱字。",
        "　　二：以地为氏，据《风俗通义》所载，周代姜太公受封于齐国，建都营丘(在今山东省临淄县)，其后有丘氏。",
        "　　三：据《后汉书．乌桓传》所载，东汉时，东胡别支乌桓部落亦有丘氏。",
        "　　四：为南北朝时鲜卑族复姓所改。据《魏书．官氏志》所载，北魏献文帝七分国人，以次弟豆真析为丘敦氏，魏孝文帝时改为丘氏。",
        "家族名人",
        "　　邱处机",
        "　　丘迟（464～508）",
        "　　字希范，南朝齐梁间乌程（今浙江省吴兴县）人。八岁能属文。梁武帝尝任之为中书郎，待诏文德殿。帝尝着连珠，群臣继作者数十人，丘迟所撰，词采丽逸，为一时之冠。",
        "　　邱行恭",
        "　　唐代洛阳人。 善骑射。 贞观年间（627～649）讨高昌有功，诏斫石为人马，立像于昭陵阙前以旌之。 官至冀，陜二州刺史。",
        "地望分布",
        "　　河南洛阳 浙江吴兴县",
    ],
}
BaiIiaXingPageModule[152] = {
    "index": "百家姓",
    "name": "骆",
    "content": [
        "历史来源",
        "　　「骆」源出  ;",
        "　　一 ; 出自姜姓。以王父为氏。据《元和姓纂》所载，周代姜太公之后有公子骆，其支孙以王父（祖父）之字「骆」为氏。",
        "　　二 ; 商末周初, 飞廉之子恶来，其后有恶来革。据《史记》所载，恶来革之玄孙日大骆，建大骆国，周历王时灭于西戎。其后亦有骆氏。",
        "　　三 ; 古鲜卑族所改，《魏书．官氏志》云：南北朝时，北魏有代北三字姓他骆拔氏，随魏孝文帝迁都洛阳，定居中原后，改为骆氏。",
        "家族名人",
        "　　骆宾王（公元640-?年）",
        "　　初唐婺州义乌人。官长安主簿。擅长诗文，与王勃，杨 炯，卢照邻齐名，世称四杰。",
        "　　骆牙",
        "　　字旗门，南朝陈临安人。文帝陈蒨任吴兴太守时，拜为将帅，从平杜龛、张彪，勇冠三军。官至散骑常侍。",
        "地望分布",
        "　　河南北部 江苏苏州",
    ]
}
BaiIiaXingPageModule[153] = {
    "index": "百家姓",
    "name": "高",
    "content": [
        "历史来源",
        "　　「高」源出  ;",
        "　　一 ; 出自姜姓，以邑为氏。春秋时，姜太公六世孙齐文公吕赤之子受封于高邑（在今河南省禹县）称为公子高。其孙傒，以祖封邑为名氏，称高傒，其后有高氏。",
        "　　二：据《通志．氏族略》所载，齐惠公吕元之子为公子祁，字子高。其支孙以王父字「高」为氏。",
        "　　三 ; 改姓，据《北齐书》云，北齐文宣帝姓高名洋，当时有鲜卑族人元景安，元文遥因有功，被赐姓高。北齐时高隆之，本姓徐氏，因其父为高欢所养，改姓高。《魏书》载，后燕皇帝慕容云，本鲜卑族，自称高阳氏后代，改姓高，称高云。",
        "家族名人",
        "　　高洋",
        "　　高力士（684～762）",
        "　　唐代的宦官。个性谨慎细心而聪敏，深受玄宗宠信，累官至骠骑大将军、进开府仪同三司，擅权弄政。肃宗时，被弹劾流放至巫州，宝应时被赦还，病死途中。",
        "　　高崇文",
        "　　唐代幽州人。贞元年间（公元785~805）跟随韩全义镇守长武城，管理军队很有成绩。吐蕃侵犯宁州时，他率兵前往营救，大获全胜，封渤海郡王。剑南西川节度使谋反，高崇文被推荐为左神策行营节度使，领兵征讨，八战皆胜，刻石记功，封南平郡王。铭功：刻文字于石头上记载功绩。",
        "地望分布",
        "　　河北，辽宁渤海湾 北京密云 辽宁大凌河以东 江苏阳州 河南洛阳",
    ]
}
BaiIiaXingPageModule[154] = {
    "index": "百家姓",
    "name": "夏",
    "content": [
        "历史来源",
        "　　「夏」源出  ;",
        "　　一 ; 出自姒行，据《姓谱》所载，周王朝封夏后氏之后东楼公于杞，其余有不得封邑者，以原国名「夏」为氏。",
        "　　二：为夏侯氏所简化，今甘肃庆阳夏氏即是。",
        "　　三：出自妫姓，以王父字为氏。据《通志．氏族略》所载，春秋时陈宣公之子少西，字子夏。其子孙征舒，以王父的字「夏」为氏，称为夏征舒。是为陈国之夏氏。",
        "家族名人",
        "　　夏竦(984~1050年)",
        "　　字子乔，宋代德安人。官至参知政事，封英国公。文章典雅藻丽，为政有绩，治军尤严。时人以为真宰相器。",
        "地望分布",
        "　　江苏苏州，甘肃庆阳",
    ]
}
BaiIiaXingPageModule[155] = {
    "index": "百家姓",
    "name": "蔡",
    "content": [
        "历史来源",
        "　　「蔡」源出  ;",
        "　　出自姬姓, 以国名为氏。据《元和姓纂》及《通志．氏族略．以国为氏》所载，公元前 十一世纪武王克纣以后，周文王第五子叔度分封于蔡国（在今河南省上蔡县西南），称为 蔡叔度。武王死后，蔡叔度参与武庚叛乱，事败被放逐。叔度之子胡，率德驯善，周公旦举荐为鲁国卿士，后又复封于蔡，称为蔡仲胡。至蔡平侯时，迁于新蔡，昭侯迁于州来（寿州）。春秋后相承二十六世，公元前447年为楚国所灭。子孙以国名「蔡」为氏。南北朝时，后周赐蔡氏改姓大利稽（鲜卑族复姓）, 至隋代复旧。",
        "家族名人",
        "　　蔡伦",
        "　　东汉桂阳人，字敬仲，颇有才学。汉和时为中常侍。和帝时为中常侍。据说他利用树皮、麻头、破布、鱼网等制造纸张，称为蔡侯纸。后因事下狱，自杀身亡。",
        "　　蔡邕（132～192）",
        "　　字伯喈，东汉陈留人。博学，工辞章，天文、术数、书画、琴艺皆精，创飞白书，熹平四年，奏定六经文字，以隶书四十六碑立于太学门外，是为熹平石经。后董卓专政，累迁为左中郎将，故亦称为蔡中郎。卓死，被王允所捕，死于狱中。着有独断、蔡中郎集。",
        "　　蔡锷（1882～1916）",
        "　　原名艮寅，字松坡，湖南邵阳人。日本陆军士官学校骑兵科毕业。辛亥革命时为云南都督，后解兵权，居住京师，袁世凯称帝时，潜赴云南，首先起兵宣布独立，称护国军，各省响应，袁氏之谋遂败。黎元洪继任总统，任蔡锷为四川省督军，兼民政长，后因病殁于日本东京。编有曾胡治兵语录。后人辑其作为蔡松坡先生遗集。",
        "地望分布",
        "　　河南兰考县",
    ]
}
BaiIiaXingPageModule[156] = {
    "index": "百家姓",
    "name": "田",
    "content": [
        "历史来源",
        "　　「田」源出  ;",
        "　　春秋战国时期，田氏即为陈氏。如春秋时齐国大臣田成子即为陈成子。后来田和取代「姜」 氏政权，历史上称为「田氏代齐」。又，战国时哲学家田骈，亦称陈骈。据《史记.田完世家》 及《新唐书.宰相世系表》所载，周初胡公满受封于陈国（在今河南省淮阳县），十世孙陈历公，生子名完，字敬仲。当时太子御寇被陈宣公所杀,敬仲畏惧祸及自身，遂逃奔到齐国，食釆于田，改称田氏。",
        "家族名人",
        "　　田单",
        "　　战国时齐国临淄人。燕攻齐, 下七十余城, 惟莒, 即墨二城未下。即墨守将军, 又反间计, 使燕撤换名将乐毅, 用火牛突阵大破燕军, 收复齐七十余城, 因功封安平君。",
        "　　田横（？～前202)",
        "　　秦末狄县人。本齐王田氏族。韩信破齐，横自立为齐王，高登基后，横率领从属五百人逃至海岛，汉高祖派人招降，横不愿北面臣事之，遂自杀，余五百人闻横死，亦皆自杀。",
        "地望分布",
        "　　山西代县 河北卢龙县",
    ]
}
BaiIiaXingPageModule[157] = {
    "index": "百家姓",
    "name": "樊",
    "content": [
        "历史来源",
        "　　「樊」源出  ;",
        "　　一：出自子姓。据《左传》所载，商汤后裔，在殷商中期以后，形成了陶，施，樊，锜，几 和终葵等七大族，称为‘殷民七族‘。公元前十一世纪周朝初年分封诸侯，「分康叔......以 殷民七族」，建立卫国。孔们弟子樊迟即为其后。",
        "　　二：出自姬姓。以邑命氏。见《通志．氏族略．以邑为氏》所载。周文王之子虞仲之支孙仲 山浦，食釆于樊邑，称之樊侯。其后有樊氏。",
        "家族名人",
        "　　樊哙（?~前189)",
        "　　西汉沛县人。少年时以杀狗为业。随刘邦起义，鸿门宴上，项羽欲杀刘邦，樊哙面斥项羽，官至左丞相，因军功封舞阳侯。",
        "　　樊于期",
        "　　生卒年不详。战国时秦将，避罪于燕，得燕太子丹之庇护，后因荆轲欲替太子丹杀秦王，愿得其首级以入秦，遂自刎而死。",
        "地望分布",
        "　　山西长子县 河南南阳市",
    ]
}
BaiIiaXingPageModule[158] = {
    "index": "百家姓",
    "name": "胡",
    "content": [
        "历史来源",
        "　　「凌」源出  ;",
        "　　出自姬姓， 以官为氏。据《通志．氏族略．以官为氏》所载，周代设‘凌人’之职， 为周礼天 官之属，掌贮藏冰凌。同武王之弟康叔有支庶子世代担任‘凌人’一职，其后有凌氏。",
        "家族名人",
        "　　凌统",
        "　　三国时吴国有凌统，字公绩，余杭人，事孙权为偏将军。亲贤接士，轻财重义，有国士 之风。人称江表虎臣，江表指长江以南地区。",
        "地望分布",
        "　　河北河间县，辽宁渤海湾沿岸。",
    ]
}
BaiIiaXingPageModule[159] = {
    "index": "百家姓",
    "name": "凌",
    "content": [
        "历史来源",
        "　　「胡」源出  ;",
        "　　一 ; 出自「妫」姓，以人名为氏。据《元和姓纂》所载，西周初年，舜的后裔胡公满受封于陈国（河南淮阳）后被楚国所灭。其公族四散，有的以先公之名「胡」为氏。",
        "　　二 ; 出自「归」姓。以国名为氏。周代有异姓诸侯「胡」国，在安徽阜阳县。被楚国所灭。其国人有的以「胡」为氏。",
        "　　三 ; 为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「胡骨氏」（为魏献帝之兄的姓氏）随魏孝文帝南迁洛阳后，定居中原，代为汉姓「胡」氏。",
        "　　四﹕据《周书．李远传》所载，敕勒有胡姓。",
        "家族名人",
        "　　胡安国 （1074～1138）",
        "　　字康侯，建宁崇安人，宋经学家。官至中书舍人兼侍讲。王安石废弃春秋，安国以为其乃先圣传心之要典，故仍潜心研究二十年。谥文定。着有春秋传、资治通鉴举要补遗等。",
        "地望分布",
        "　　甘肃安定郡，河南新蔡郡。",
    ]
}
BaiIiaXingPageModule[160] = {
    "index": "百家姓",
    "name": "霍",
    "content": [
        "历史来源",
        "　　「霍」源出  ;",
        "　　出自姬姓， 以国名为氏。据《元和姓纂》及《广韵》所载，公元前十一世纪，周朝初年，文王第六子叔处，受封于霍国(在今山西省霍县)。其时霍叔与管叔. 蔡叔共同监管殷商遗民，称为‘三监’ 。周成王时，武庚伙同霍叔等叛乱，平息以后，霍叔降为庶人。霍国后裔，以国名‘霍‘为氏。",
        "家族名人",
        "　　霍去病 (公元前140-前117年)",
        "　　为一代名将。十八岁任侍中。六次出击匈奴，穿沙漠，远征至狼居胥山。官至骠骑将军，封冠军侯。",
        "霍元甲",
        "　　地望分布",
        "　　山西太原，四川成都 。",
    ]
}
BaiIiaXingPageModule[161] = {
    "index": "百家姓",
    "name": "虞",
    "content": [
        "历史来源",
        "　　「虞」源出  ;",
        "　　一 ; 出自妫姓。以国名为氏。据《广韵》所载，传说舜子商均受封于虞国(在今河南省虞城县)，其 后有虞氏。",
        "　　二 ; 出自姬姓，以国名为氏。西周初年，周武王封仲雍的庶孙于虞国(在今山西省平陆县北)，春秋时虞国被晋国所灭。其后亦有虞氏。",
        "家族名人",
        "　　虞姬",
        "地望分布",
        "　　河南开封，江苏苏州 ，河南兰考。",
    ],
}
BaiIiaXingPageModule[162] = {
    "index": "百家姓",
    "name": "万",
    "content": [
        "历史来源",
        "　　「万」源出：",
        "　　一、出白姬姓。以王父字为氏。据《万姓统谱，所载，西周初年，芮伯受封于芮(在今山西省芮城县)，其后有芮伯万，支孙以王父(祖父)之字·万”为氏。",
        "　　亦出自姬姓。以王父字为氏。春秋时晋国大夫毕万，为毕公高之后，魏国始祖。其支孙以王父字“万”为氏。",
        "　　南北朝时，鲜卑族复姓所改。代北复姓吐万氏。万纽于氏，改为汉姓万氏。",
        "家族名人",
        "　　万修",
        "　　字君游。东汉茂陵人。更始年间(公元23--25年)任信都令，迎光武帝，拜偏将军。平河北，因功封槐里侯，为云台二十八将之一。",
        "　　万文胜",
        "　　宋代宁国人，倜傥有大志，累官至福州观察使总殿前诸军。宋理宗(公元1225-1264年在位)以飞白体书写“忠实”二字赐之。",
        "地望分布",
        "　　陕西省长安  河南省洛阳市",
    ]
}
BaiIiaXingPageModule[163] = {
    "index": "百家姓",
    "name": "支",
    "content": [
        "历史来源",
        "　　「支」源出：",
        "　　据《古今姓氏书辨证》云：其先月支胡人，后为氏。汉代月支即为月氏，后分为大月氏与小月氏。古代月支国人来中国定居，有的就以支为氏。",
        "家族名人",
        "　　支叔才",
        "　　唐代定州人。隋末荒馑，夜丐食野中，母为贼执，叔才告以情，贼悯其孝，为解缚。",
        "　　支立",
        "　　明代嘉兴人，性至孝，官翰林孔目，注重根本，精于经学，人称支五经。",
        "　　支遁",
        "　　(公元314—366年)，字道林，晋代陈留郡人。家世事佛，隐居余杭山，深思道行，世称支公、林公。",
        "　　支谦",
        "　　字恭明，汉末高僧，月支国人，通汉语梵语。孙权重其才，拜为博士。谦受业于支亮，亮受业于支谶，人称天下博者，不出三支。",
        "地望分布",
        "　　山东省东南部诸城、临沂、胶南一带   陕西省合阳县。",
    ]
}
BaiIiaXingPageModule[164] = {
    "index": "百家姓",
    "name": "柯",
    "content": [
        "历史来源",
        "　　「柯」源出：",
        "　　一、出自姬姓。以名为氏。据《广韵》所载，春秋时吴国有公子名柯卢，其后遂有柯氏。",
        "　　二、古代北方少数民族羌族和鲜卑族皆有柯氏。据《魏书·官氏志》所载，南北朝时北魏有复姓柯拔氏，进入中原后改为汉姓柯氏。",
        "家族名人",
        "　　柯萼",
        "　　宋代南安人。进士出身，官员外郎。太平兴国年间(公元976—983年)遇一僧人，同往万岁山，僧人指一古松，掘得一石篆，乃宝公记述帝王之位的文章，缠绵悠长。",
        "　　柯崇",
        "　　唐朝人。光化年间(公元898—900年)进士，同榜有曹松等五人，皆年高七十余，时号“五老榜”。",
        "　　柯应烈",
        "　　宋代人，有孝行。龚吏部欲强迫其做官，其母曰：“我家世代靠学问而发迹，为何旁求另有所为呢?”遂回绝。",
        "地望分布",
        "　　河南省兰考县　浙江省杭州市　山东省临淄",
    ]
}
BaiIiaXingPageModule[165] = {
    "index": "百家姓",
    "name": "昝",
    "content": [
        "历史来源",
        "　　「昝」源出：",
        "　　一、出自姬姓。以名为氏。据《广韵》所载，春秋时吴国有公子名柯卢，其后遂有柯氏。",
        "　　二、古代北方少数民族羌族和鲜卑族皆有柯氏。据《魏书·官氏志》所载，南北朝时北魏有复姓柯拔氏，进入中原后改为汉姓柯氏。",
        "家族名人",
        "　　柯萼",
        "　　宋代南安人。进士出身，官员外郎。太平兴国年间(公元976—983年)遇一僧人，同往万岁山，僧人指一古松，掘得一石篆，乃宝公记述帝王之位的文章，缠绵悠长。",
        "　　柯崇",
        "　　唐朝人。光化年间(公元898—900年)进士，同榜有曹松等五人，皆年高七十余，时号“五老榜”。",
        "　　柯应烈",
        "　　宋代人，有孝行。龚吏部欲强迫其做官，其母曰：“我家世代靠学问而发迹，为何旁求另有所为呢?”遂回绝。",
        "地望分布",
        "　　河南省兰考县　浙江省杭州市　山东省临淄",
    ]
}
BaiIiaXingPageModule[166] = {
    "index": "百家姓",
    "name": "管",
    "content": [
        "历史来源",
        "　　「管」源出：",
        "　　一、出自姬姓。以名为氏。据《广韵》所载，春秋时吴国有公子名柯卢，其后遂有柯氏。",
        "　　二、古代北方少数民族羌族和鲜卑族皆有柯氏。据《魏书·官氏志》所载，南北朝时北魏有复姓柯拔氏，进入中原后改为汉姓柯氏。",
        "家族名人",
        "　　柯萼",
        "　　宋代南安人。进士出身，官员外郎。太平兴国年间(公元976—983年)遇一僧人，同往万岁山，僧人指一古松，掘得一石篆，乃宝公记述帝王之位的文章，缠绵悠长。",
        "　　柯崇",
        "　　唐朝人。光化年间(公元898—900年)进士，同榜有曹松等五人，皆年高七十余，时号“五老榜”。",
        "　　柯应烈",
        "　　宋代人，有孝行。龚吏部欲强迫其做官，其母曰：“我家世代靠学问而发迹，为何旁求另有所为呢?”遂回绝。",
        "地望分布",
        "　　河南省兰考县　浙江省杭州市　山东省临淄",
    ]
}
BaiIiaXingPageModule[167] = {
    "index": "百家姓",
    "name": "卢",
    "content": [
        "历史来源",
        "　　「卢」源出  ;",
        "　　一 ; 出自「姜」姓，以邑名为氏。春秋时期齐国文公子名高，食采于卢邑 ( 山东长清县 ) ，其后人以「卢」为氏。",
        "　　二 ; 以国为氏。据《风俗通义》所载，古庐子国，后有庐氏。《通志．氏族略．以国为氏》所载，庐氏，亦作「卢」，庐子戢黎之后。",
        "　　三 ; 为南北朝时鲜卑族复姓所改。《魏书．官氏志》云 ; 北魏莫庐氏改为「芦」氏，后去草头改为「卢」氏; 吐伏卢氏亦改为卢氏。",
        "家族名人",
        "　　卢植 ( ? ~ 192 )",
        "　　字子干，汉末涿郡人。通古今之学，好学而不墨守成规，备称谓海内大儒。",
        "　　卢照邻  ( 636～695）",
        "　　初唐范阳人，字升之。博学能文，与王勃、杨擳、骆宾王齐名，世称「初唐四杰」。着有卢升之集。",
        "地望分布",
        "　　河北范阳郡，河南顾丘郡。",
    ]
}
BaiIiaXingPageModule[168] = {
    "index": "百家姓",
    "name": "莫",
    "content": [
        "历史来源",
        "　　源流一",
        "　　颛顼号称高阳氏，后分衍有八个氏族，活动中心在帝丘一带(今河南濮阳)，曾在夺权斗争中击败共工氏。颛顼重视人事治理，努力发展农业，曾命南正重、火正黎“绝天地通”，实行人神分职，标志着原始宗教向神权的过渡。",
        "　　据史籍《三郡记》和《姓氏考略》记载，上古帝颛顼造鄚阳城(今河北任丘、平乡一带)，其支庶子孙定居于鄚阳城，后人去“邑”为“莫”，以地名为姓氏，世代称莫氏至今，史称莫氏正宗。莫氏族人皆奉颛顼为莫氏的得姓始祖。",
        "　　源流二",
        "　　源于芈姓，出自春秋时期楚国莫敖之官职，属于以官职称谓为氏。芈姓为祝融八姓之一，亦出自颛顼。其后裔在西周初期建有芈姓大国，即荆国，后改称楚国。据宋真宗大中祥符元年(公元1008年)由陈彭年、丘雍等奉旨在前代韵书的基础上编修而成的典籍《大宋重修广韵》中记载，春秋时期，楚国有莫敖之职，亦称莫嚣，是与令尹地位相同的官职，并行执掌楚国之国政。在史籍《淮南子·修务训》中则称“莫敖”为“莫嚣”，指出其原为楚国最高行政官职，军、政两事一把抓。到楚武王熊通开始称王时，莫敖之职仍然存在，后来楚武王嫌其官位太重，改以令尹为重臣，与莫敖相互制约。在史籍《左传》的记载中，以令尹与莫敖并提，当处于同等地位。楚武王以后的出国历代君主，将莫敖废置不常，后来在史籍《左传·襄公十五年》中记叙楚国封官之事时，列莫敖于令尹、右尹、大司马、右司马、左司马之后，说明莫敖的地位逐渐降低。今学者杨伯峻在《春秋左传注》中称莫敖本相当于大司马，后降至左司马之下。",
        "　　其后世子孙中有以官职称谓为姓氏者，称莫氏，世代相传至今。著名的屈原家族便世居此官职，故莫氏也有一部分是由屈氏的分支改姓而形成的。",
        "　　源流三",
        "　　源于妫姓，出自上古圣君虞舜之祖幕，属于避难改姓为氏。据史籍《通志·氏族略》记载，莫字即幕字的省文，望出钜鹿郡、江陵郡。",
        "　　幕，乃是上古圣君虞舜之祖。莫氏和幕氏同宗同源，该支莫氏只是幕氏的简笔形式，后族人有为避战乱之难去“巾”取谐音字“莫”为氏，世代相传至今。",
        "　　源流四",
        "　　源于鄚姓，属于以居邑名称简笔为氏。该支莫氏，起源于汉朝时期河北鄚州。鄚氏出周宣王姬静，将其次子姬望封赐于鄚州(今河北平乡、任县、晋县一带)，其后裔子孙因地为姓氏，称鄚氏。",
        "　　姬望的后裔传至第二十一世孙鄚振扬(姬振扬)，因功在汉室，于汉高祖刘邦七年(公元前200年)授其为执戈郎，汉高祖还特赐改其姓为莫，此后称莫振扬，成为该支莫氏始祖。",
        "　　源流五",
        "　　源于匈奴族，出自南北朝时期匈奴贺兰部莫何弗，属于以官职称谓汉化为氏。匈奴贺兰部首领称谓中有莫何弗。“莫何弗”，乃古匈奴语“副酋”之称，这在《隋书·室韦传》中有记载“每部置莫何弗以贰之。”莫何弗有世袭的惯例。",
        "　　在莫何弗的后裔子孙中，有以先祖官职称谓为姓氏者，称莫何弗氏，后汉化省文为单姓莫氏，逐渐融合于汉族，世代相传至今。",
        "　　源流六",
        "　　源于党项族，属于汉化改姓为氏。",
        "　　唐五代之后建立西夏王朝的党顼族，其中有以单字汉姓莫为氏者，后融入汉族，世代相传至今。",
        "　　源流七",
        "　　源于鲜卑族，出自南北朝时期鲜卑拓拔部，属于汉化改姓为氏。",
        "　　据史籍《魏书·官氏志》记载：南北朝时期，北魏孝文帝拓拔宏(元宏)在太和十九～二十年(公元495～496年)迁都洛阳之后，大力深化推行汉化改革政策，将鲜卑拓拔部中原复姓邢莫氏、莫那娄氏、莫折氏等部落，均改汉姓为莫氏，其后东胡分支中的蠕蠕民族(丁零、铁勒)中亦有改汉姓为莫氏者。",
        "　　源流八",
        "　　源于库莫奚族，出自金国时期库莫奚部族，属于汉化改姓为氏。据《姓觽》中特别说明：“库莫奚族有莫氏。”库莫奚族这一名称始见于北魏登国三年(公元388年)，这一称号的出现，实际上是在公元四世纪中叶鲜卑宇文部被慕容皝攻破后不久，自此以后，史书对库莫奚族就有了不间断的记载，直到公元十三世纪以后才不见其名，前后存在近千年。“库莫奚”一词是鲜卑语音译，汉役“沙、沙粒、沙漠”。从含义揣测，这一族称当因其境内多沙漠而得名。公元六世纪下半叶的隋朝时期，省去库莫，单称“奚”，此后单一的“奚”字成了族称。",
        "　　在金国末期居住东北地区的，又有相当一部分族人融入了蒙古族、满族、锡伯族等少数民族中。其中满族的穆齐氏即库莫奚氏族后裔，满语为MukiHala，世居鄂漠和索罗，后多冠汉姓为莫氏、穆氏等。",
        "　　源流九",
        "　　源于蒙古族，出自辽国时期的契丹乃蛮部，属于汉化改姓为氏。据史籍《清朝通志·氏族略·蒙古八旗姓》记载：",
        "　　蒙古族奈曼氏，亦称那莫氏，满语为Naiman Hala，源于辽国时期契丹乃蛮部，以部为氏，后在元朝初期融为内扎萨克蒙古奈曼部，世居敖汉(今内蒙古赤峰敖汉旗)、乌鲁特(今内蒙古东南部兴安盟地区)，所冠汉姓即为莫氏。",
        "　　源流十",
        "　　源于满族，属于汉化改姓为氏。据史籍《清朝通志·氏族略·满洲八旗姓》记载：",
        "　　⑴.满族图们氏，亦称图莫图氏，满语为Tumen Hala，汉义“万”，满族最古老的姓氏，源于唐朝末期女真“通用三十姓”之一的陀幔，以及金国旧部“驼满”，以部为氏，世居乌喇(今吉林永吉)，后多冠汉姓为万氏、图氏、门氏、莫氏等。",
        "　　⑵.满族莽果氏，满语为Manggo Hala，姓氏，亦称蒙棍氏，世居乌喇(今吉林永吉)，所冠汉姓为莫氏、白氏。",
        "　　⑶.满族莫勒特氏，满语为More Hala，亦称墨哷氏，世居叶赫(今吉林梨树)。后改汉姓为莫氏、梅氏、墨氏。",
        "　　⑷.满族舒穆哩氏，亦称苏某力氏，满语为Sumuri Hala，世居海兰木(今黑龙江瑗珲黑河镇对岸海兰泡)、萨尔碧图(今内蒙古莫力达瓦达斡尔族自治旗与鄂伦春自治旗交界处诺敏河中游)，后多冠汉姓为莫氏、舒氏。",
        "　　源流十一",
        "　　源于达斡尔族，属于汉化改姓为氏。据史籍《黑龙江志稿》、《清朝通志·氏族略·满洲八旗姓》记载：",
        "　　⑴.达斡尔族莫尔登氏，亦称孟尔丁氏、孟尔的音氏、墨尔丹氏、莫塔哈利氏，满语为Mordin Hala，世居黑龙江布特哈地方(今嫩江流域和大小兴安岭)，后多冠汉姓为莫氏、孟氏、苍氏。",
        "　　⑵.达斡尔族墨勒哲哷氏，亦称莫尔哲勒氏，满语为Moljere Hala，汉义“用刀复仇”，世居松花江、黑龙江、巴林(今黑龙江伯力、俄罗斯哈布罗夫斯克)、白石(今黑龙江牡丹江镜泊湖)、阿穆达(今黑龙江哈尔滨山彦倭和)等地，后多冠汉姓为孟氏、曹氏、莫氏等。",
        "　　源流十二",
        "　　源于布依族，属于汉化改姓为氏。在西南地区的少数民族布依族中，有以莫为姓氏者。贵州独山人莫与俦、莫友芝、莫庭芝三父子皆为布依族人，该莫氏族人所建立的“影山文化学派”对西南地区影响深远。",
        "　　近代民族学家、姓氏学家多认为：西南少数民族是上古三苗族的后裔，也就是上古姜姓蚩尤部族的后裔，因此，西南少数民族原居中原地区，后逐渐分播至西北、西南地区，与中原各大姓氏实是同根。",
        "家族名人",
        "　　莫 邪",
        "　　本为春秋人名，后来比喻锋利精美的剑。吴王命令干将铸剑，铁汁不下，于是妻子莫邪问：“铁汁不下，怎么办？”干将回答说：“ 古时候的铸剑大师欧冶铸剑，铁汁不下，于是让女人担任炉神，很快就成功了。”莫邪听到这，立即窜入火中，铁汁流出，于是铸成两把利剑。雄的叫干将，雌的叫莫邪。",
        "　　莫 含",
        "　　东汉左将军，穆帝很赏识他的才能，经常让他参与讨论军事机密、国家大事。后来被封为关中侯。",
        "　　莫 愁",
        "　　南北朝时期，河南洛阳人，十五岁嫁为卢家妇。或将石城误为石头城（今江苏南京），今其地有莫愁湖。典出南朝梁.萧衍《河中之水歌》：“河中之水向东流，洛阳女儿名莫愁。……十五嫁为卢家妇，十六生儿字阿侯。”南朝梁武帝萧衍诗《莫愁歌》中人物，洛阳美女，心灵手巧，十五嫁入富室卢家，十六生儿阿侯，在卢家富贵终老。著名的诗人李商隐有一首诗是写她的：“如何四纪为天子，不及卢家有莫愁。”诗人笔下的“莫愁”，真正是位“解语花”。",
        "　　莫含孙",
        "　　莫云弟，道武帝时以功赐爵东宛侯。因侍宴不敬获罪，黜为济阳太守。后令其监造平城。因久而懈怠，赐死。",
        "　　莫 琮",
        "　　宋代的官吏，字叔方。仁和人。历经明、福两州官。他的品行相当高尚，并且教子有方。他有五个儿子元忠、若晦、似之、若拙、若冲俱登科。当时人们把他们比作是“燕山五宝”。",
        "　　莫 蒙",
        "　　湖州人，宋代官吏、学者。在太学读书时，以文鸣京师。就特科出仕，由县丞累官至通化军知府。工诗，词尤婉丽。有《卧驼集》。",
        "　　莫 胜",
        "　　松江府华亭（今属上海）人，明代书画家。曾任虎贲左卫经历。工书画，善绘鱼。",
        "　　莫 藏",
        "　　浙江海盐人，字用行，号素轩，明代学者、书画家。其博涉经史，能诗，工书画。有《素轩稿》、《五音字书辨讹》等。",
        "　　莫 骏",
        "　　广西省平乐人，明代官吏。举人出身，官至南京户部员外郎。做官二十余年，人称廉洁。",
        "　　莫 矜",
        "　　广西省融水永乐人。1938年加入中国共产党，后来任中共融县支部书记，融县特支副书记，抗日挺进队政治指导员，中共桂黔边区工委书记，桂黔边区人民保卫团政委兼司令员，中国人民解放军柳北总队政委兼司令员。中华人民共和国成立以后，历任柳州专署副专员、自治区统战部副部长、自治区冶金局副局长等职务。",
        "　　莫修符",
        "　　唐朝文人。光化二年任融州刺使。他所写的《桂林风土记》，很有文化价值，文才也很好。世传的佳作。",
        "　　莫宣卿",
        "　　字仲节，号片玉。广东省封开人。广东的第一个状元。幼年时他的生父病逝，遂与母亲随继父生活。由于继父的家境较富裕，他得以入学堂读书。相传莫七岁时已学会吟诗写对联，12岁时即参加科举考试并中秀才，被乡人称誉为“神童”。唐大中五年（851年），17岁的莫宣卿赴京城参加廷试获中制科状元，从而成为广东历史上科举考试的第一个状元，并是始隋唐以科举取士以来年龄最小的状元。莫宣卿考取状元后，被任为翰林书院修撰。其后他还乡省亲，因母亲不愿随其北上定居，莫遂上书朝廷请求改委他在南方任职以奉养母亲。唐文宗允准，改委他浙江台州别驾（刺史的副职）。他即奉母携眷往台州上任，但未到台州却病逝于途中。莫宣卿的生平业迹不显，存世的诗作也仅三首半，但由于是广东历史上的第一个状元，他的传奇式事迹及影响仍在岭南文化史上占有不容忽略的地位，为后人所尊崇。",
        "　　莫君陈",
        "　　湖州归安（今浙江省湖州）人，北宋官吏。仁宗时进士。神宗熙宁年间新置**科，中首选，为王安石所倚重。有《月河所闻集》。",
        "　　莫伯镕",
        "　　湖州归安（今浙江省湖州）人，少有超乎世俗之志，年五十即归休，请名师教诲其子。子三人皆登科，时号“三莫”。长子莫济后又中博学鸿词科，居官给事中时，因反对外戚张说被罢职，后仕至司农少卿。次子莫汲曾为国子监正，因得罪秦桧被贬化州知府。三子莫冲亦曾中博学鸿词科，官任明州长史，以循良称。",
        "　　莫如忠",
        "　　松江府华亭人，明代官吏、学者。嘉靖年间进士，累官浙江布政使。善草书、诗文有体要。有《崇兰馆集》。",
        "　　莫如足",
        "　　广州府新会人，明代大臣。嘉靖年间进士。由庶吉士擢御史，曾经弹劾仇鸾，有直声。官至大理左丞，数伸冤狱。",
        "　　莫友芝",
        "　　清朝时期道光举人，独山人。少年时期就很喜欢读书精通苍雅故训六艺名物制度，旁及金石目录家言。工于诗，他的书法也很好，在当时与遵义的郑珍齐名，当时号称“郑莫”。著作有：《声韵考略》、《遵义府制》、《过庭碎》、《唐本说文木部芊异》。",
        "　　莫是龙",
        "　　明代画家，字云卿，华亭人。后来更字廷韩，号秋水，又号后明。十岁就能写诗作对。擅长于书画，著有《石秀斋集》、《画说》等。",
        "　　莫洛",
        "　　清初大臣。莫洛初授刑部理事官，康熙六年，擢左副都御史。七年，出为山西陕西总督，后累迁工部郎中。谥忠愍，授世职拜他喇布勒哈番兼拖沙喇哈番。子常安，袭。",
        "　　莫我愚",
        "　　湖南省善化（今长沙）人，清代书画家。工诗，不喜为时文。于真、行、草书、指头书、筋头书，皆不学而能。工法山水，尤善写照，所绘莫不神态毕肖。",
        "　　莫与俦",
        "　　贵州省独山人，清代官吏、学者。嘉庆四年进士，曾任盐源知县，后改遵义府学教授。有《贞定先生遗集》。",
        "　　莫仕睽",
        "　　清朝广西平南人。参加太平军，清咸丰六年为刑部尚书。咸丰十一年升迁为开朝王宗殿前忠诚伍天将，任藩镇统官。曾处理外交事务，后来封为补王。同治三年发觉李秀成的妻舅宋永祺在天京阴谋叛乱，与浙江的巡抚曾国荃暗中勾结，于是他当面指责李秀成，并带领军队将宋永祺从忠王府中抓获逮捕。天京陷落以后，他回家乡平南。逝世的时候有70岁。",
        "　　莫桂兰",
        "　　（1892-1982），广东高州人，自幼得家传跌打医术和莫家功夫，为黄飞鸿第四任夫人，随夫学得一身武艺，曾出任福军拳术教练和邓芳“义勇堂”助教。黄飞鸿去世后，她先后创办“黄飞鸿国术社”和“黄飞鸿健身学院”，将黄飞鸿的武艺发扬光大。",
        "地望分布",
        "　　广东省肇庆市，广东省高要市",
    ]
}
BaiIiaXingPageModule[169] = {
    "index": "百家姓",
    "name": "经",
    "content": [
        "历史来源",
        "　　源流一",
        "　　源于姬姓，出自春秋时期周王室大夫经侯，属于以先祖名字为氏。据有关史料记载，春秋时期的周王室有个卿士被封于经邑，因此史称经侯。古经邑之所在，就是今河南省的洛阳市一带，著名东汉科学家张衡在《东京赋》描写洛阳的天文气候特征时就说：“洛阳，昔先王之经邑也。其掩观九隩，靡地不营；土圭测景，不缩不盈，总风雨之所交，然后以建王城。”春秋末期一度地处魏国。不过也有学者说经邑在今河北省的大城县，这有待进一步考证。",
        "　　在经侯的后裔子孙中，有以先祖名字为姓氏者，称经氏，世代相传至今。",
        "　　源流二",
        "　　源于姬姓，出自郑武公小儿子共叔段的封地京，属于避难改姓为氏。春秋时期，姬叔段被封于京(今河南荥阳)，简称京叔段，他的子孙中有以封邑名称为姓氏者，称京氏。姬叔段是郑武公姬滑突的次子，其母武姜厌恶长子姬寤生，多次请求郑武公立姬叔段为太子，郑武公未同意。",
        "　　在京叔段的京氏后裔子孙中，有因此事件避难改以同音字“经”为姓氏者，世代称经氏至今。",
        "　　源流三",
        "　　源于嬴姓，出自汉朝时期易学大师京房，属于避难改姓为氏。汉朝时期，有一个著名的易学、音律学者叫李京房，他崇尚易学，自称精通五行天地之律，因此“推律自定为京”，遂以“京”为姓氏，充分表明了他对易学的赤诚迷恋。在汉元帝刘奭执政时期(公元前48～前33年)，京房以《易》干政，他把灾异与政治相联系，试图以这种方式向汉元帝刘奭推行自己的政治主张，结果得罪了当朝权臣石显，被中书令石显罗织了一大堆罪名，投入监狱，后在狱中凄惨死去。",
        "　　京房的后裔子孙及族人为了避免灾祸而纷纷迁逃，遂取“京”的同音字“经”作为姓氏，改京氏为经氏，世代相传至今。",
        "　　源流四",
        "　　源于芈姓，出自东汉光武帝刘秀的族父刘歙，属于以先祖名字为氏。",
        "　　东汉时期，汉光武帝刘秀的族父(叔叔)之字叫经孙，在东汉王朝建立后，被汉光武帝敕封为泗水王，封地在泗(今安徽濉溪)，他的后裔子孙中有以先祖之字号为姓氏者，称经孙氏，后来随着历史的演变，多省文简化为单姓经氏、孙氏，世代相传至今。",
        "　　源流五",
        "　　源于鄂温克族，属于汉化改姓为氏。据史籍《黑龙江志稿·氏族》记载：鄂温克族布喇穆氏，亦称博拉木氏、比渣穆氏、卜拉木氏，世居黑龙江汉古河(今黑龙江中下游)、布特哈(今嫩江流域和大小兴安岭)、呼伦贝尔(今内蒙古呼伦贝尔)等地。后有鄂伦春族、满族引为姓氏者，满语为Bulamu Hala。",
        "　　清朝中叶以后，鄂温克族、鄂伦春族、满族布喇穆氏多冠汉姓为经氏、卜氏、蔡氏等。",
        "家族名人",
        "　　经承辅",
        "　　字兰谷，明朝江都人。明朝文士，个性温文稿儒雅，品格高尚，孝行很好。少年时父丧，为孝敬母亲，一辈子不做官。隐居于平山之麓，与世隔绝，以田园自居，栽梅种竹，耕读教育孩子，并抚养弟弟长大成人，年七十无疾而终。",
        "　　经文岱",
        "　　清朝将领，清末咸丰年间带兵打仗而载入史册。",
        "　　经元善",
        "　　号莲珊。清朝时期人。家中很富裕，性情善良，喜欢施舍别人。光绪八、九年的时候，直隶发生水灾。他从上海来到天津从事救济活动，募款达几百万。先后获得清朝奖励十几次。胜宣怀督班电报的时候，他加入30万两股。不久就被任命为上海电报局总办。中日甲午战争以后在上海首先创办了女学堂。光绪二十六年1月，慈禧太后想废黜光绪帝，遭到各地地方巡抚的反对。经元善以候选知府的身份联合维新人士蔡元培、黄炎培等人，一共1231人签名上书总理衙门，要求清朝放弃这种打算。清朝廷于是按以“叛逆”的罪名，下令将其逮捕。他逃亡澳门，请政府于是向澳门总督交涉，要求引渡。葡萄牙总督于是将他软禁于澳门大炮台。因为各方的反对而罢休。义和团失败后，他返回上海，存世的著作有《居易初集》。",
        "　　经亨颐",
        "　　浙江省上虞人，经元善之侄，教育家、社会活动家和金石家。创办春晖中学并长期从事教育事业，参加国民革命，为国民党左派元老，著有《经颐渊金石诗书画合集》。 经承辅：字兰谷，明朝江都人。明朝文士，个性温文稿儒雅，品格高尚，孝行很好。少年时父丧，为孝敬母亲，一辈子不做官。隐居于平山之麓，与世隔绝，以田园自居，栽梅种竹，耕读教育孩子，并抚养弟弟长大成人，年七十无疾而终。",
        "地望分布",
        "　　江省的绍兴市上虞县、金华市，安徽省的合肥市，江苏省的扬州市宝应县、江都市、句容县、徐州市、溧水县、镇江市宝埝镇，广西壮族自治区的桂林市全州县、永福县，柳州的鹿寨县、来宾市兴宾区，上海市，北京市，吉林省的四平市，四川省的成都市，吉林省的吉林市，河北省的辛集，河南省的开封市等地。",
    ]
}
BaiIiaXingPageModule[170] = {
    "index": "百家姓",
    "name": "房",
    "content": [
        "历史来源",
        "　　「房」源出：",
        "　　一、出自姬姓。以名为氏。据《广韵》所载，春秋时吴国有公子名柯卢，其后遂有柯氏。",
        "　　二、古代北方少数民族羌族和鲜卑族皆有柯氏。据《魏书·官氏志》所载，南北朝时北魏有复姓柯拔氏，进入中原后改为汉姓柯氏。",
        "家族名人",
        "　　柯萼",
        "　　宋代南安人。进士出身，官员外郎。太平兴国年间(公元976—983年)遇一僧人，同往万岁山，僧人指一古松，掘得一石篆，乃宝公记述帝王之位的文章，缠绵悠长。",
        "　　柯崇",
        "　　唐朝人。光化年间(公元898—900年)进士，同榜有曹松等五人，皆年高七十余，时号“五老榜”。",
        "　　柯应烈",
        "　　宋代人，有孝行。龚吏部欲强迫其做官，其母曰：“我家世代靠学问而发迹，为何旁求另有所为呢?”遂回绝。",
        "地望分布",
        "　　河南省兰考县，浙江省杭州市，山东省临淄",
    ]
}
BaiIiaXingPageModule[171] = {
    "index": "百家姓",
    "name": "裘",
    "content": [
        "历史来源",
        "　　「经」源出：",
        "　　一、出自嬴姓。以谥号为氏。据《元和姓纂》及《通志·氏族略·以谥为氏》所载，春秋时期，秦穆公称霸希荣，谥号为“缪”（同“母”）。读音为“妙”。",
        "家族名人",
        "　　缪瑜",
        "　　宋代江西人。官进贤令，擅长写诗，着《崆峒集》。",
        "　　缪恭",
        "　　明代天台县人。弘治初年(公元1488年)，孝宗下诏书求吏民直言，恭上书陈六事：保神器、崇正学、绍绝属、怀旧勋、革冗员，皆人所不敢言者。",
        "　　缪元德",
        "　　宋代人。知抚州，宽厚爱民，建米仓祟米，活饥民，掩遗骸，皆出己俸。",
        "地望分布",
        "　　山东省枣庄及藤县东南",
    ],
}
BaiIiaXingPageModule[172] = {
    "index": "百家姓",
    "name": "缪",
    "content": [
        "历史来源",
        "　　「经」源出：",
        "　　一、出自嬴姓。以谥号为氏。据《元和姓纂》及《通志·氏族略·以谥为氏》所载，春秋时期，秦穆公称霸希荣，谥号为“缪”（同“母”）。读音为“妙”。",
        "家族名人",
        "　　缪瑜",
        "　　宋代江西人。官进贤令，擅长写诗，着《崆峒集》。",
        "　　缪恭",
        "　　明代天台县人。弘治初年(公元1488年)，孝宗下诏书求吏民直言，恭上书陈六事：保神器、崇正学、绍绝属、怀旧勋、革冗员，皆人所不敢言者。",
        "　　缪元德",
        "　　宋代人。知抚州，宽厚爱民，建米仓祟米，活饥民，掩遗骸，皆出己俸。",
        "地望分布",
        "　　山东省枣庄及藤县东南",
    ],
}
BaiIiaXingPageModule[173] = {
    "index": "百家姓",
    "name": "干",
    "content": [
        "历史来源",
        "　　「干」源出：",
        "　　一、出自子姓。春秋时宋国大夫干犨之后，以王父字为氏。",
        "　　二、以地为氏。战国时有干隧之邑（今江苏省吴县境内），居其地者以“干”为氏。",
        "　　三、据《魏书·官氏志》记载，南北朝时北魏鲜卑族姓氏由干氏改为汉姓干氏。",
        "家族名人",
        "　　干宝",
        "　　晋代人。少时勤奋好学，博览群书。所撰《搜神记》为魏、晋志怪小说的代表作。",
        "　　干吉",
        "　　三国时代人。相传从一仙翁那儿学得道家经典，能治疗百病，祈神求雨。",
        "　　干桂",
        "　　明代顺天人，正德年间中进士，官至督御史，政治严明，所官之处，豪强不敢妄为，威风收敛。",
        "地望分布",
        "　　河南省郑州及许昌一带",
    ]
}
BaiIiaXingPageModule[174] = {
    "index": "百家姓",
    "name": "解",
    "content": [
        "历史来源",
        "　　「应」源出：",
        "　　出自姬姓．以国名为氏．据《广韵》所载，公元前十一世纪武王克商后，封其第四子于应（在今河南省鲁山县境内），其子孙以国名为氏。",
        "家族名人",
        "　　应劭",
        "　　汉末汝南郡南顿人。字仲远，官泰山太守。博学多识，着《汉官仪》、《风俗通义》等十一种。",
        "　　应夷节",
        "　　唐代人。游天台山，栖真道元院，相传尸解成仙。栖真，保其根本，养其元神。",
        "　　应旸",
        "　　汉末汝南郡人。（公元？-217年），字德琏，曹操征为丞相掾属，后为武官将文学，与孔融、陈琳等齐名，称建安七子。。",
        "　　应舜臣",
        "　　宋代婺州人。字仁伯，少卓荦不羁，及长，笃志向学，庆历年间（公元1041-1048年）进士。官至洪州知府。",
        "地望分布",
        "　　河南省中部偏南、安徽省淮河以北、河南省许昌市",
    ]
}
BaiIiaXingPageModule[175] = {
    "index": "百家姓",
    "name": "应",
    "content": [
        "历史来源",
        "　　「殷」源出  ;",
        "　　一 ;出自「子」姓，以国名为氏。据《世本》所载，契后。武王克商后，商之子孙四散，以殷为氏。《元和姓纂》载﹕殷姓，成汤国号也，为周所灭，子孙以国名为氏。又《通志．氏族略．以国为氏》云﹕殷氏，契姓，封于商，后世迁于毫。至周为周所灭，子孙以国名为氏。",
        "家族名人",
        "　　殷汤",
        "　　殷浩（？～356）",
        "　　字深源，晋陈郡长平人。识度清远，好老易，负有盛名。初为庾亮记室参军，后起为建武将军。朝廷欲平关河，以浩为中军将军，都督扬、豫、徐、兖、青五州军事，以平定中原为己任。征姚襄兵败，废为庶人，竟日书空，作咄咄怪事四字。",
        "地望分布",
        "　　安徽汝南郡，河南河南府。",
    ]
}
BaiIiaXingPageModule[176] = {
    "index": "百家姓",
    "name": "宗",
    "content": [
        "历史来源",
        "　　「宗」源出：",
        "　　一、以官为氏。据《元和姓纂》所载，周代有宗伯之官职，掌邦国祭祀典礼之事，亦称太宗、上宗，其后有宗伯氏、宗氏。",
        "　　二、出自子姓。据《通志·氏族略》所载，春秋时，宋襄公母弟敖，在鲁国做官，其孙宗伯被杀；宗伯之子州犁逃奔楚国，其少子迁家于南阳，遂以王父（祖父）之子“宗”为氏。",
        "家族名人",
        "　　宗悫",
        "　　南宋南阳郡涅阳人，字符干（公元？-465年）。少时，叔父宗炳问其志愿，答曰：‘原乘长风破万里浪。’历封镇武将军、左卫将军。管至豫州刺史，封洮阳侯。",
        "　　宗泽",
        "　　宋代义乌人。字汝霖（公元1059-1128年）。知磁州，募集义勇，抗击金兵，后入援京师，忍东京太守，团结两河、太行义兵，以岳飞为将，屡败金兵，声威甚着，有‘宗爷’或’宗父‘之称。屡上书收复失地，不纳，忧愤而死。",
        "　　宗连",
        "　　隋代长安人。仕周官三原令，家产千金，有小女慧而有色，欲求贤婿。时赵元淑有才，不拘小节。宗连以女妻之，给奴婢二十，马十余匹及布匹金银珠玩。元淑后因功封葛公。",
        "　　宗氏",
        "　　晋代介休令贾浑之妻，有姿色。浑为刘聪将乔晞所杀，晞欲纳宗氏，宗氏骂曰：‘屠贩奴，何不促杀我。’因仰天大哭，遂遇害，年二十余。",
        "地望分布",
        "　　陕西省西安市至华县一带、山西省黄河以东夏县一带",
    ]
}
BaiIiaXingPageModule[177] = {
    "index": "百家姓",
    "name": "丁",
    "content": [
        "历史来源",
        "　　「丁」源出：",
        "　　一、出自姜姓。以谥号为氏。据《通志·氏族略》云：公元前十一世纪，西周分封诸侯，姜太公望受封于齐。其子伎，死后谥号为“丁公”。其后遂以“丁”为氏。",
        "　　二、 据《三国志·孙匡传注》云：三国吴时，孙权因其孙匡烧损茅芒，以乏军用。别其族为丁氏。",
        "　　三、出自西域回族姓。伊斯兰教穆斯林本无姓氏。元朝末年，有人名丁鹤年，其曾祖名阿考丁，祖父名苦思丁，父名职马禄丁，从兄名吉雅谟丁。其后汉化，遂以‘丁’为氏。",
        "家族名人",
        "　　丁密",
        "　　东汉岑溪人，字靖公，以孝顺而知名，父母亡故，在坟边筑屋守三年，相传有双凫（野鸭）飞抵屋旁小池，见人而驯伏，时人以为是其孝行所感应。",
        "　　丁令威",
        "　　西汉辽东人，传说曾学道于灵虚山，后化作仙鹤归辽东，停在城门华表柱上，有少年欲射之，仙鹤徘徊于空中，曰：‘有鸟有鸟丁令威，去家千岁今来归，城郭如故人民非，何不学仙冢累累？’遂冲天直上而去。",
        "　　丁复",
        "　　汉初人，随高祖刘邦举兵于薛，后助高祖平定三秦，破项羽将龙且于彭城，官大司马，封阳都侯。",
        "　　丁允元",
        "　　南宋常州人，字叔中，淳熙（公元1174-1189年）间任少卿，后因忠谏贬官潮州太守，拨田租兴学养士，筑桥利民，百姓‘名宦祠’祀之。",
        "　　丁兰",
        "　　东汉河内郡人，少年母逝，用木头雕母像，每日服侍如活人。邻居张叔，酒醉骂木像，用手杖击像头。丁兰怒而打张叔，被捕。传说告别木像时，像为他落泪。",
        "地望分布",
        "　　河南省兰考县一带、山东省定陶县一带",
    ]
}
BaiIiaXingPageModule[178] = {
    "index": "百家姓",
    "name": "宣",
    "content": [
        "历史来源",
        "　　「宣」源出：",
        "　　一、出自姬姓，以谥号为氏。据《风俗通义》载，周厉王之子静，继位后为王四十六年，死后谥号为‘宣’，称为周宣王。其支氏子孙有以‘宣’为氏者。",
        "　　二、出自子姓。以谥号为氏。春秋时宋国君主名力，在位十六年，死后谥号为‘宣’，其后亦有宣氏。",
        "　　三、据《通志·氏族略·以谥为氏》所载，为春秋时鲁国大夫叔孙侨如之后。侨如谥‘宣伯’，其支孙以谥为氏。",
        "家族名人",
        "　　宣秉",
        "　　东汉云阳人，字巨公。少修高节。王莽篡位，征之不至。光武帝（公元25-57年在位）时历官御史中丞、大司徒。性俭约，帝叹曰：‘楚国二龚（龚舍、龚胜），不如云阳宣巨公。’",
        "　　宣明",
        "　　宋代长汀人。字南仲。浩然有归志，筑屋隐居于成南五里岩洞，郡守谢稠题曰‘宣岩’。",
        "　　宣缯",
        "　　宋代庆元府人。嘉定年间（公元1208-1224年）拜参知政事，官至观文殿大学士，以才知名，卒谥忠靖。",
        "地望分布",
        "　　陕西省咸阳、户县一带，河南省濮阳县、滑县一带",
    ]
}
BaiIiaXingPageModule[179] = {
    "index": "百家姓",
    "name": "贲",
    "content": [
        "历史来源",
        "　　「贲」源出：",
        "　　贲氏有两支，一支音（奔），另一支音（肥）。据《元和姓纂》所载，贲（奔）氏为春秋时鲁国县贲父之后，以祖字为氏。一说春秋时晋国大夫苗贲父之后。此一支起源与贲（肥）氏不同。",
        "家族名人",
        "　　贲生",
        "　　汉代淮南人。秉性纯厚谦和，汉景帝（公元前157-前87年在位）时曾从学于常山太傅韩婴。",
        "　　贲蒿",
        "　　汉代汝南郡人，以操守清高纯洁而知名。",
        "　　贲亨",
        "　　元代人。初承袭行军千户，从元军渡江攻打湖北有功，至元年间（公元1335-1340年）为山东诸翼军总管。江南平定后，因功升为宣武将军，任处州路管军万户。",
        "地望分布",
        "　　安徽省东南部",
    ]
}
BaiIiaXingPageModule[180] = {
    "index": "百家姓",
    "name": "邓",
    "content": [
        "历史来源",
        "　　「邓」源出：",
        "　　出自子姓。据《元和姓纂》及《广韵》所载，商王武丁分封其叔父曼季于邓国（今河南省邓州），称邓侯。春秋时有邓侯吾离期，朝鲁国。后邓国被楚国所灭，子孙以国为氏。因邓氏为曼季后裔，故又云出自曼姓。又据《安化邓氏谱序》所载，五代南唐后主李煜第八子李从镒，受封为邓王。南唐亡国后，李从镒之子李天和逃匿，以其父曾封邓王之故，改姓邓氏。",
        "家族名人",
        "　　邓禹",
        "　　东汉南阳郡新野县人。字仲华（公元2-58年）。幼年游学于长安，与刘秀（光武帝）相友善。在刘秀推翻王莽，恢复汉朝过程中，邓禹功不可灭。东汉建立后，禹累官大司徒、右将军、太傅，封高密侯。邓氏遂极盛一时。为南阳郡之大族。",
        "　　邓润甫",
        "　　宋代建昌人，字温伯。皇裕（公元1034-1037年）进士。初为上饶尉、武昌令，后知（主持）谏院，历任翰林学士、礼部尚书、兵部尚书、尚书左丞等。",
        "　　邓训",
        "　　东汉邓禹第六子，字平叔。少年有大志，明帝初（公元58年）任郎中，谦虚宽容，礼贤下士，士大夫多归之。历官乌桓校尉，张掖太守，护羌校尉。",
        "　　邓曼",
        "　　春秋时楚武王夫人。武王子屈瑕讨伐罗国，邓曼知屈瑕必败。武王讨伐隋国心重，邓曼叹曰?;王禄尽矣！盈而荡，天之道也。‘后来，武王果然死于横木之下。人言：邓曼知天道。’",
        "地望分布",
        "　　一、 河南省南阳市一带",
        "　　二、 山西省临汾县西南",
        "　　三、 甘肃省平凉地区及宁夏西部",
        "　　四、 山西省襄汾县",
        "　　五、 湖南省部分地区",
        "　　六、 河南省周口地区淮阳县一带",
    ]
}
BaiIiaXingPageModule[181] = {
    "index": "百家姓",
    "name": "郁",
    "content": [
        "历史来源",
        "　　「郁」源出：",
        "　　一、以国名为氏。据《姓考》云，古有郁国，春秋时为吴国大夫采邑。胶东有郁秩县（在今山东省平度县），或以地名为氏。",
        "　　二、据《元和姓纂》所载，春秋时，鲁国有郁黄（一名郁贡）为相，其后亦有郁氏。",
        "家族名人",
        "　　郁新",
        "　　明代临淮人。字敦本。洪武年间（公元1368-1398年）以人才征，官至户部尚书，长于综理，规划甚备。",
        "　　郁继善",
        "　　宋代人。深于医术，为时所重。",
        "地望分布",
        "　　河南省中部浚县一带",
    ]
}
BaiIiaXingPageModule[181] = {
    "index": "百家姓",
    "name": "单",
    "content": [
        "历史来源",
        "　　「单」源出：",
        "　　一、出自姬姓。以邑名为氏。据《元和姓纂》所载，周成王封少子臻于单邑（在今河南省孟津县东南），为甸内侯，因氏焉。于周襄公、穆公、靖公二十余代为周卿氏。又据《通志·氏族略》云：成王封蔑于单邑，故为单氏。",
        "　　二、北方少数民族复姓所改。据《魏书·官氏志》所载，南北朝时，北魏有代北复姓阿单氏、纥单氏，皆改为汉姓单氏。",
        "家族名人",
        "　　单雄信",
        "　　唐代济阴郡人，为李密将，能马上用枪，军中号'飞将'。",
        "　　单父",
        "　　宋代人。字仲儒。种牡丹，能变易千种，人呼为'花师'。",
        "　　单仲升",
        "　　元代增城人。养母至孝。母卒，蔬时水饮，不事家业，庐墓三年，人称孝子。",
        "地望分布",
        "　　甘肃省陇西渭水流域",
        "　　河南省洛阳市一带",
    ],
}
BaiIiaXingPageModule[182] = {
    "index": "百家姓",
    "name": "杭",
    "content": [
        "历史来源",
        "　　「杭」源出：",
        "　　一、杭氏出于抗氏、伉氏。《元和姓纂》云：三伉氏，春秋时卫邑也。抗氏，魏国三伉大夫之后，后有抗喜为汉中太守。后转写为杭氏。",
        "　　二、 以地为氏。传说大禹治水后，封有余航国，即余杭。其后人即为杭氏。",
        "家族名人",
        "　　杭徐",
        "　　东汉丹阳人。字伯徐。初任宣城长，政绩卓著，境内无盗贼。后升为中郎将，攻破泰山守敌，封东乡侯。官至长沙太守。",
        "　　杭景",
        "　　汉代人，祖孙都注意修养身心，谨慎行事，爱帮助孤寡贫穷的人。后来杭景的儿子杭华官至睢阳太守，世人都认为是他们善行的报答。",
        "　　杭世骏",
        "　　清代浙江仁和人。公元1696-1773年，字大宗。博览群书，擅长诗文，乾隆元年（公元1736年）举博学鸿词，授编修，官至御史。曾校勘武英殿《十三经》、《二十四史》，纂修《三礼义疏》。着有《石经考异》、《史记考异》、《汉书疏证》、《道古堂诗文集》等。",
        "地望分布",
        "　　浙江省余杭县",
        "　　安徽省宣城地区",
    ]
}
BaiIiaXingPageModule[183] = {
    "index": "百家姓",
    "name": "洪",
    "content": [
        "历史来源",
        "　　「洪」源出：",
        "　　一、为避仇而改姓。据《元和姓纂》所载，本姓共氏。西周时有太叔受封于共国（在今河南省辉县），称为共伯。春秋时，共国被卫国所灭，其后有共氏。在唐朝以前，部分‘共’氏家族因避仇逃难而改为‘洪’氏。",
        "　　二、为避讳而改姓。据《通志·氏族略·以国为氏》所载，豫章有弘氏（一说宏氏）因避宋朝讳而改为同音的‘洪’氏。又，曲阿（今江苏省丹阳县）弘氏也因避讳改姓洪氏。",
        "家族名人",
        "　　洪觉范",
        "　　宋代新昌人。以其书而出奇，同县人邹元佐以其命而出奇，彭渊材以其音乐而出奇，人称新昌三奇。",
        "　　洪兴祖",
        "　　南宋丹阳人。公元1090-1155年，字庆善。与孔端明、张炳、周林同时被召赴翰林院考试，名列第一，官秘书省正字。",
        "　　洪适",
        "　　南宋鄱阳人。字景伯。与其弟遵、迈先后考中词科，从此三洪文章名满天下。",
        "　　洪皓",
        "　　南宋鄱阳人。公元1088-1115年，字光弼。曾出使金国，被扣十五年，始终不屈，时人将其与苏武相比。初官宁海主簿，代行县令事，减赋税，抚恤贫民，深得人心。",
        "　　洪亮吉",
        "　　清代江苏阳湖人。公元1746-1809年，字君直。进士出身，官编修。精研经史、音韵及舆地学，诗文亦佳，著作颇丰。幼丧父，靠教书养母。曾绘《机声灯影图》，怀念母亲的辛劳与教诲。",
        "地望分布",
        "　　甘肃省河西走廊一带",
        "　　安徽省宣城",
        "　　江西省南昌、九江一带",
    ]
}
BaiIiaXingPageModule[184] = {
    "index": "百家姓",
    "name": "包",
    "content": [
        "历史来源",
        "　　「包」源出：",
        "　　一、 出自芈（音米）姓。据《通志·氏族略·以字为氏》所载，包氏为战国时期楚国大夫申包胥之后，以王父字'包'为氏。亦作'苞'、'雹'等。又《路史》云：包牺氏后有包氏，此为神话附会之辞，不可信。",
        "　　二、为鲍氏所改。",
        "家族名人",
        "　　包整",
        "　　北宋泾县人。少时好学仗义，义聚八十余年，其书屋曾产灵芝，名曰'芝堂'，因家著书万卷，故又称'万卷堂'。",
        "　　包拯（公元999-1062年）",
        "　　北宋名臣，庐州合肥人，天圣五年（公元1027年）进士，累官监察御史、天章阁待制、龙图阁直学士、枢密副史。为官刚直不阿，以廉洁著称，人称'包青天'。知开封服时，执法尤严，民称'关节不到，有阎罗老包。'有人赠诗云：'秀干终成栋，精铜不作钩。'死后谥号'孝肃'。",
        "　　包咸（公元前6-公元65年）",
        "　　东汉会稽人，少年从师于博士右师细君，学习鲁诗、《论语》。官郎中，入宫教授太子《论语》，官至大鸿胪。",
        "　　包融",
        "　　唐代吴兴人，由殿试登第，官至集贤殿学士，有才华与名声，跟贺知章、张旭、张若虚合称'吴中四士'。",
        "地望分布",
        "　　安徽省宣城县",
        "　　山西省沁水以东地区",
    ]
}
BaiIiaXingPageModule[185] = {
    "index": "百家姓",
    "name": "诸",
    "content": [
        "历史来源",
        "　　「诸」源出：",
        "　　一、 以邑名为氏。据《姓氏考略》云：春秋时鲁国有诸邑，大夫食采其地者，子孙以为氏。鲁诸邑故址在今山东省诸城县西南。",
        "　　二、以祖名为氏。据《姓考》所载，汉高祖以故粤王无诸为闽越王，其后以'无诸'中的'诸'字为氏。",
        "家族名人",
        "　　诸燮",
        "　　字子相，明代余姚人，嘉靖年间（公元1522--1566年）进士。历官兵部主事、邵武同知，俱有惠政。曾守山海关，忠贞为国。精理学，一洗陈言。",
        "　　诸御己",
        "　　春秋时楚国之耕者。庄王筑屋台，垒土千重，大臣因谏而死者七十二人。御己弃耕入谏，楚王遂解层台而罢民役。楚人歌之曰：'薪乎莱乎？无诸御己，讫无人乎！莱乎薪乎？无诸御己，讫无人乎！'此处将复姓诸御氏并入单姓诸氏。",
        "　　诸稽郢",
        "　　春秋时越国大夫，吴王夫差伐越，越王勾践使诸稽郢行成于吴，得以喘息，吴终为越所灭。此处将复姓诸稽氏并入单姓诸氏。",
        "地望分布",
        "　　山东省诸城、临沂、胶南县一带",
    ]
}
BaiIiaXingPageModule[186] = {
    "index": "百家姓",
    "name": "左",
    "content": [
        "历史来源",
        "　　「左」源出：",
        "　　以官名为氏。左史，原为周代史官。周穆王时有左史戎父，春秋时楚灵王有左史倚相，其后皆有左氏。",
        "家族名人",
        "　　左丘明",
        "　　春秋时鲁国人，曾任鲁太史，为春秋作传，成《春秋左氏传》，省称《左传》。",
        "　　左雄（公元？-138年）",
        "　　字伯豪，东汉南郡涅阳人。举孝廉，迁冀州刺史。州内多豪富，雄揭发贪猾，无所顾忌。顺帝朝，掌纳言，屡切谏。尚书仆射虞诩称其为‘蹇蹇王臣’。雄官至尚书。",
        "　　左光斗（公元1575-1625年）",
        "　　字遗直，明代桐城人。累官左佥御史。刚直敢言，与左副都御史杨琏同为阉党侧目，并称杨左。二人力陈魏忠贤罪状数十条，被害死于狱中。谥号忠毅。",
        "　　左宗棠",
        "　　字季高，清代湘阴人，道光年间（公元1821-1850年）举人。官至总督，拜东阁大学士，封恪靖侯，卒谥文襄。",
        "　　左庆延",
        "　　宋代永新人，年十七登第，秦桧欲以女妻之，庆延固辞，于是十年不给升迁。终官太学博士。",
        "　　左思",
        "　　字太冲，晋代临淄人。博学能文，官秘书郎。曾作《三都赋》，十年乃成。豪贵之家，竟相传写，洛阳为之纸贵。其妹左芬，亦能文，以德见称。",
        "地望分布",
        "　　河南省兰考县一带",
    ]
}
BaiIiaXingPageModule[187] = {
    "index": "百家姓",
    "name": "石",
    "content": [
        "历史来源",
        "　　「石」源出：",
        "　　一、出自姬姓。据《元和姓纂》所载，为春秋时卫国大夫石碏之后。又《春秋公子谱》云，其后有石骀仲。",
        "　　二、据《唐书》所载，为‘昭武九姓’之一。当时祁连山北昭武城（在今甘肃省临泽县境内）有康居国，后为匈奴击败，迁至中亚阿姆、锡尔两河流域，成立了康、安、曹、石、米、何、史、火、寻、戊地等九个小国，称为‘昭武九姓’。唐高宗永徽年间，九姓先后归附内地。其中有石氏。石国故地在今乌兹别克斯坦塔什干一带。",
        "　　三、 南北朝时鲜卑族复姓所改。据《魏书·官氏志》载，北魏有代北三字姓乌石兰氏，进入中原后改为单姓石氏。又据《后赵录》载有冉闵改姓石氏为石闵。《北史》载，娄氏有改姓石氏者。",
        "家族名人",
        "　　石碏",
        "　　春秋时卫国大夫。其子石厚与公子州吁合谋杀桓公，石碏诱州吁及其子往陈国杀之，迎立公子晋为国君。《春秋》赞美其大义灭亲，称为纯臣。",
        "　　石介（公元1005-1045年）",
        "　　字守道，天圣八年进士，官国子监直讲。着文指摘时政，无所忌讳。曾作《庆历圣德诗》。",
        "　　石延年（公元994-1041年）",
        "　　字曼卿，北宋宋城人。工诗善画，为文劲健。官至太子中允。身后，好事者传为芙蓉城主。芙蓉城乃神仙居住之所。",
        "　　石崇（公元249-300年）",
        "　　字季伦，晋代南皮人，历官散骑常侍、荆州刺史等。劫商致富。于河阳置金谷园，又名梓泽园。奢靡成风。",
        "　　石富",
        "　　明代嘉祥人，端谨忠厚。晨行宅后，见青蛇入土中变而为钱，告官搭得钱数百万，官以数万给之，富辞不受，风为世事。",
        "　　石介",
        "　　宋代兖州奉苻人。笃学有志向，乐善疾恶，遇事敢为。常以师道自居，学者称徂徕先生。",
        "　　石奋（公元前？-前124年）",
        "　　西汉河内郡温县人，雷官至太子太傅，其子建、庆等四人，皆官至二千石，景帝号石奋为‘万石君’。其姐善鼓瑟，被高祖召为美人。",
        "　　石景略",
        "　　宋代人，官奉议郎，赠特进。其母刘氏封清濂郡太夫人，其妻虞氏封毕原郡夫人。",
        "地望分布",
        "　　甘肃省黄河以西、武威以东地区",
        "　　河北省、辽宁省的渤海湾沿岸",
    ]
}
BaiIiaXingPageModule[188] = {
    "index": "百家姓",
    "name": "崔",
    "content": [
        "历史来源",
        "　　「崔」源出：",
        "　　出自姜姓。以邑为氏。据《唐书·宰相世系表》所载，春秋时齐丁公伋的嫡长子季子，把国位继承权让给叔乙，自己食采于崔邑，（在今山东省章丘县西北），其后遂为崔氏。",
        "家族名人",
        "　　崔豳",
        "　　唐代武城人，兄弟六人皆官至三品。四世同灶，和睦相处。唐玄宗谓‘一门孝友，可为士族法。’",
        "　　崔灵恩",
        "　　南朝梁东武城人，遍读五经，尤精三《礼》、三《传》，初为北魏太常博士，后归梁，累任步兵校尉，兼国子博士，官至贵州刺史。常聚徒讲学，着有《毛诗注》、《周礼集注》、《三礼义宗》。",
        "　　崔广",
        "　　汉初人，字少通，号夏黄公。与东园公、绮里季、甪里先生同隐居商山（今陕西省山县东），四人须眉皆白，故称四皓。",
        "　　崔琳",
        "　　唐代武城人。政事开明，开元（公元713-729年）间为中书舍人，累官太子少保。为唐玄宗器重，曾书其名，以金瓯覆盖之。",
        "　　崔挺",
        "　　北魏京师人，字双根，少好学，孝文帝（公元471-499年在位）时任光州刺史，大行开化之风，累官本州岛大中正、北海王司马。为官清廉，有人曾赠以玉璧，被挺推却，曰‘昔无杨震之金，今岂有崔挺之璧？’",
        "　　崔玄暐",
        "　　唐代博陵人。长安初（公元701年）为天官侍郎，历任凤阁侍郎、中书令，封博陵郡王。其弟崔升，官至尚书左丞；其子崔琚，颇以文学知名，历官中书舍人、礼部侍郎；其孙崔涣，官至御史大夫；曾孙崔郢，自商州防御史兼殿中侍御史，升监察于史。后人称五龙。",
        "地望分布",
        "　　河北省清河至山东省临清一带地区",
        "　　河北省蠡县南",
    ]
}
BaiIiaXingPageModule[189] = {
    "index": "百家姓",
    "name": "吉",
    "content": [
        "历史来源",
        "　　「吉」源出：",
        "　　一、即为‘姞’姓，是中国最古老的‘姓’之一。据《唐书·宰相世系表》所载，南燕国为姞姓，其地亦即燕县是也（在今河南省延津县东北），后改为吉。",
        "　　二、出自姬姓，以王父字为氏。据《元和姓纂》所载，周宣王时有功臣尹吉甫，其之孙以祖父的字‘吉’为氏。",
        "家族名人",
        "　　吉",
        "　　唐代人。官至御尉卿，享年八十八岁，为九老会成员之一。",
        "　　吉中孚",
        "　　唐代鄱阳人。官至户部侍郎，大历十才子之一。",
        "　　吉翂",
        "　　字彦霄，梁代莲勺人。天监初年（公元502年），其父被人诬陷，盼死刑。翂时年十五，击登闻鼓，愿代父死。梁武帝萧衍疑有人唆使，令廷尉追查，翂始终不屈，其父遂得赦免。",
        "地望分布",
        "　　陕西省韩城以南、白水以东、渭河以北一带地区",
        "　　河南省洛阳市",
    ]
}
BaiIiaXingPageModule[190] = {
    "index": "百家姓",
    "name": "钮",
    "content": [
        "历史来源",
        "　　「余」源出  ;",
        "　　 据《风俗通义》所载，余为春秋时秦国相由余之后。由余本为晋国人，后入秦。其子孙以袓名“余”为氏。世居歙州，为新安（在今安徽省歙县）大族。",
        "家族名人",
        "　　余秋雨",
        "　　当代著名作家。",
        "地望分布",
        "　　江苏省下邳郡，浙江省吴兴郡。",
    ]
}
BaiIiaXingPageModule[191] = {
    "index": "百家姓",
    "name": "龚",
    "content": [
        "历史来源",
        "　　「龚」源出：",
        "　　一、为共氏所改。据《古今姓氏书辨证》所载：其先共氏，避难，加龙为龚。其时约在战国末年秦汉之际。",
        "　　二、唐《元和姓纂》云：共工后有共、龚二氏。此为神话传说附会之辞，不足为凭。",
        "家族名人",
        "　　龚祈",
        "　　字孟道，南朝宋汉寿县人，风度翩翩，英俊潇洒，中书郎范述见了，说：‘此荆楚之仙人也。’",
        "　　龚遂",
        "　　字少卿，西汉南平阳县（今山东邹县）人。初任昌邑王刘贺的郎中令。刘贺行为多有不端，龚遂引经据典，陈述福祸，谏争忘己。宣帝（公元前73-前49年在位）时任渤海太守，正逢饥荒，龚遂单车到渤海郡，开仓济贫，劝民务农。百姓纷纷卖剑买牛，郡内治安大为好转。",
        "　　龚郯",
        "　　字昙伯，南宋宁德人，拜朱熹为师，很注重身体力行。晚年与杨复辩论理与气先后之学，尤其有造诣。自号南峰居士。",
        "　　龚胜（公元前68-前11年）",
        "　　字君宾，西汉彭城人。哀帝时征召为谏议大夫，多次上书，论议朝政。后任渤海太守。王莽篡政后，他隐居乡里。王莽数次派人征召，拜他为上卿，坚持不受，对门人高晖等说：‘早晚是要入土的，怎么能一身给两个姓的人当官呢！’绝食十四日而死。",
        "　　龚鼎孳",
        "　　字孝升，明末安徽合肥人，崇祯七年进士，官兵科给事中。清军入京后，历任左都御史、刑部尚书，为人旷达不拘礼俗，博学多闻，能诗善文，与吴伟业、钱谦益齐名，称清初江左三大家。他的侍妾顾横波善画墨兰，别具一格。",
        "地望分布",
        "　　湖南省溆浦县南",
    ],
}
BaiIiaXingPageModule[192] = {
    "index": "百家姓",
    "name": "程",
    "content": [
        "历史来源",
        "　　「程」源出：",
        "　　一、以国名为氏。据《通志·氏族略·以国为氏》所载，为重黎（火正）之后裔。周宣王时，休父入为大司马，受封于程国。洛阳上有程聚，即其地也（在今河南省洛阳市东）。时称程伯休父，其子孙遂以封国’程‘为氏。",
        "　　二、以邑为氏。据《左传·杜预注》云：春秋时晋国有中行荀氏之子食采于程邑，其后以邑名’程‘为氏。",
        "家族名人",
        "　　程婴",
        "　　春秋时晋国（约公元前六世纪）人，与晋卿赵盾子赵朔友善，司寇屠岸贾杀赵氏全家，追捕孤儿赵武。赵氏门客程婴与公孙杵臼设计救孤，抚养成人，终报仇雪恨。",
        "　　程本",
        "　　春秋时晋国人，博学，善出主意，名闻于诸侯。曾与孔子相遇于途，倾盖与语。",
        "　　程洵",
        "　　字允夫，南宋婺源人。进士出身，历官衡阳主簿、庐陵录参，与朱熹交往甚密。",
        "　　程秉",
        "　　字德枢，三国时吴国南顿人。曾事经学家郑玄，博通五经，官至太子太傅。时吴太子孙登（孙权长子）聘周瑜女为妻。程秉谓孙登曰：‘婚姻人伦之始，王教之基……愿太子尊礼教于闺房，存《周南》之所咏，则道化隆于上，颂声作于下矣?",
        "　　程颐",
        "　　南宋理学家，与弟程颢齐名。其母侯氏，宽厚待人，治家有法，有仁恕之道。",
        "地望分布",
        "　　河北省南部永年县一带",
        "　　甘肃省平凉地区一部及宁夏西部",
    ]
}
BaiIiaXingPageModule[193] = {
    "index": "百家姓",
    "name": "嵇",
    "content": [
        "历史来源",
        "　　「嵇」源出：",
        "　　一、由稽氏而来。据《元和姓纂》所载，夏王少康封其子季杼于会稽，此后有稽氏。至汉代初年，稽氏家族迁往谯郡的嵇山定居，遂改为‘嵇’氏。又《文章叙录》载，嵇康原姓奚氏，由会稽迁往谯郡铚县，取稽字上半部为‘嵇’氏。",
        "　　二、由鲜卑族复姓改得。据《魏书·官氏志》云，南北朝时北魏有代北复姓统嵇氏，进入中原后改为汉姓嵇氏。",
        "家族名人",
        "　　嵇康（公元233-262年）",
        "　　字叔夜，三国时魏国谯郡人。博学多才，风度翩翩，如孤松独立。官拜中散大夫，与阮籍、山涛等常同游于竹林，世称‘竹林七贤’。",
        "　　嵇绍",
        "　　字延祖，晋代谯郡铚县人，嵇康子。官至侍中。有人言：绍‘昂昂然如野鹤之在鸡群’，使其‘为吏部尚书，可使天下无复遗才’。",
        "　　季抒",
        "　　相传为夏代少康帝子，封于会稽，西汉初年迁至谯郡嵇山，改姓‘嵇’。",
        "　　嵇颖",
        "　　字公实，宋代应天府宋城人。天圣年间（公元1023-1031年）进士，时王曾、张知白相继任南京留守，见颖谨厚笃学，乃谓子弟曰：‘若曹（你们）师表也。’官至翰林学士。",
        "　　嵇璜",
        "　　字尚佐，清代江宁人。乾隆年间（公元1736-1795年），官至文渊阁大学士。幼年读《禹贡》，曰：‘禹治水皆自下而上。盖下游宣通，水自顺流而下。’长老皆惊异，后治河果多有功绩。",
        "地望分布",
        "　　河南省洛阳市一带",
        "　　安徽、河南二省之间地区",
    ]
}
BaiIiaXingPageModule[194] = {
    "index": "百家姓",
    "name": "邢",
    "content": [
        "历史来源",
        "　　「邢」源出：",
        "　　一、出自姬姓。以国名为氏。据《元和姓纂》所载，周公旦第四子受封于邢国（今河北省邢台市）。公元前662年，邢国被魏国攻占，公族子弟以原国名为氏。",
        "　　二、以邑名为氏。据《姓考》所载，春秋时，晋国大夫韩宣子之族食采于邢邑（在今河南省温县东）其后亦有邢氏。",
        "家族名人",
        "　　邢昺（公元932-1010年）",
        "　　字叔明，宋代济阴郡人。太宗时擢九经及第，累官金部郎中，至礼部尚书。真宗初，设翰林侍讲学士，昺任此职，帝命昺坐讲《春秋》于殿上，并参与校定三《礼》、三《传》等。",
        "　　邢峦",
        "　　字洪宾，北魏鄚县人。博览书史，有文才干略，累官散骑常侍，兼尚书。与梁国作战有功，官至殿中尚书。多次奉诏持节讨叛敌，参预机密。",
        "地望分布",
        "　　河北省中部河间县一带",
    ]
}
BaiIiaXingPageModule[195] = {
    "index": "百家姓",
    "name": "滑",
    "content": [
        "历史来源",
        "　　「滑」源出：",
        "　　出自姬姓。据《英贤传》云：周公族后有滑氏。据《通志·氏族略·以国为氏》云，滑国是周朝分封的同姓小国，国都故址在今河南睢县西北，后来迁到费（在今河南省偃师县氏缑镇西南）故又称为费滑。后被晋国所灭，子孙以国名‘滑’为氏。",
        "地望分布",
        "　　江苏省西北地区",
        "　　陕西省西安至华县一带",
        "　　湖北省安陆县地",
    ]
}
BaiIiaXingPageModule[196] = {
    "index": "百家姓",
    "name": "裴",
    "content": [
        "历史来源",
        "　　「裴」源出：",
        "　　一、据《名贤氏族言行类稿》载：裴氏，嬴姓，伯益之后。秦非子子孙封裴乡侯，因氏焉。今闻喜裴城是也。",
        "　　二、据《通志·氏族略》所载，春秋时晋平公把颛顼的后代封于裴中（今陕西省岐山县北），号裴君。其后亦有裴氏。",
        "家族名人",
        "　　裴楷（公元237-291年）",
        "　　字叔则，西晋河东郡闻喜人。仪容俊爽，如行玉山上，光彩照人，时称‘玉人’，博涉群书，尤精《老子》、《易经》。官至中书令。",
        "　　裴行俭（公元619-682年）",
        "　　字守约，唐代降州闻喜人，官至定襄道行军大总管。善知人，所典选偏裨，类为世名将。",
        "　　裴坦",
        "　　唐代闻喜人。官至同中书门下平章事。性简俭。子娶杨牧女，陪嫁多饰金玉，坦命撤去，曰：‘乱我家法。’居太平里，时称‘太平宰相’。",
        "　　裴航",
        "　　唐代长庆年间（公元821-824年）秀才。途经蓝桥驿，甚渴，有美女云英以水浆饮之，甘如玉液，欲娶之。家中老妪曰：‘昨有神仙与药一刀圭，须得玉杵臼捣之。欲娶此女，必以此为聘。’遂遍访玉杵臼为聘。婚后夫妻偕入山仙去。",
        "　　裴度（公元765-839年）",
        "　　字中立，官至门下侍郎平章事，因功封晋国公。曾微服出访，遇参军黄娥，言州官夺其未婚妻，献给裴公。度返查实，遣所献女还之。",
        "地望分布",
        "　　山西省黄河以东夏县一带",
    ]
}
BaiIiaXingPageModule[197] = {
    "index": "百家姓",
    "name": "陆",
    "content": [
        "历史来源",
        "　　「陆」源出：",
        "　　一、出自妫姓。据《新唐书·宰相世系表》所载，田完之裔孙、齐宣王少子通（一说为季逵、季达，皆为字讹）受封于平原般县陆乡，其后遂有陆氏。",
        "　　二、为古代鲜卑族复姓所改。据《魏书·官氏志》所载，南北朝时，北魏有代北三字姓步陆孤氏，进入中原后改为汉字单姓陆氏。",
        "　　三、据《陈留风俗传》所载，春秋时有陆浑国（戎族，在今河南省嵩县东北），其后亦为陆氏。",
        "家族名人",
        "　　陆景、陆机、陆晔",
        "　　陆景，字士仁，晋代吴郡吴县人。与其弟陆机、堂弟陆晔皆以才能、品德著名，文章超群，身居高官，声望极高，时称河北三虎。",
        "　　陆游（公元1125-1210年）",
        "　　号放翁，字务官，宋代越州山阴县人。历官枢密院编修等。才华横溢，尤长于诗，一生写诗近万首，题材广泛，多清新之作，为南宋一大家。着有《剑南氏稿》等。",
        "　　陆陇其（公元1630-1692年）",
        "　　字稼书，清代平湖人。进士出身，历官嘉定、灵寿二知县，政绩显著，升为御史。",
        "　　陆九龄（公元1132-1180年）",
        "　　字子寿，宋代抚州金溪县人。进士出身，官兴国军教授。与其弟九渊讲学于鹅湖，史称鹅湖学派。",
        "　　陆修静（公元406-477年）",
        "　　字符德，南朝宋吴兴郡东迁人。与僧人慧远、慧永及陶潜等十八人结社于庐山东林寺，同修静土之法，号曰白莲社。",
        "　　陆龟蒙（公元？-881年）",
        "　　字鲁望，唐代长洲人。隐居松江甫里，时称甫里先生。论著颇丰，好放游江湖，自号江湖散人，或号随天子。与皮日休友善，常唱和。朝廷曾以高士名征召，不赴。",
        "　　陆羽（公元733-804年）",
        "　　字渐鸿，第一个为茶叶著书，有《茶经》三篇，后被民间尊为茶神。上元初年，隐居苕溪，自称桑泞翁。",
        "　　陆凯",
        "　　字敬风，三国时吴国吴郡人。黄武初年，（公元222年）任永兴、诸暨长，多政绩；继任建武尉，虽统领军队，仍手不释卷。宝鼎初年（公元266年）升为左丞相。时政事多错误，凯上书直言，封嘉兴侯。凯一宗有二相五侯，将军十余人在朝，吴主孙皓曰：‘盛矣！’凯曰：‘君贤臣忠，国之盛也；父慈子孝，家之盛也。今政荒民弊，覆亡是惧，臣何敢言盛。’",
        "地望分布",
        "　　河南省洛阳市一带",
        "　　山东省西北部平原县一带",
        "　　河南省境内黄河北岸武陟县一带",
        "　　江苏省苏州市一带",
    ]
}
BaiIiaXingPageModule[198] = {
    "index": "百家姓",
    "name": "穆",
    "content": [
        "历史来源",
"　　「穆」源出  ;",
"　　一﹕ 出自子姓. 以谥号为氏. 据<<元和姓纂>>所载, 春秋时, 宋宣公之弟名和. 继承兄位, 在位九年, 死前将爵位传给宣文公之子夷, 让自己的儿子离开宋国到郑国居住. 为褒奖其品德, 死后谥号为”穆”. 其支庶子孙遂有穆氏。",
"　　二﹕北方鲜卑族复姓所改. 据<<魏书-官氏志>>所载, 南北朝时, 北魏”代北八族”之首为丘穆陵氏, 隋魏孝文帝迁都洛阳, 定居中原以后, 改为汉字单姓穆氏.",
"家族名人",
"　　穆宁",
"　　唐朝人。官至秘书监。为官刚直，奉公守法。安史之乱时，以著名的颜真卿起兵共拒安禄山。",
"地望分布",
"　　河南汝南郡，河南洛阳。",
    ]
}
BaiIiaXingPageModule[199] = {
    "index": "百家姓",
    "name": "荣",
    "content": [
        "历史来源",
        "　　「荣」源出：",
        "　　一、以邑名为氏。据《风俗通义》所载，为周成王的卿士荣伯之后，受封于荣邑（在今陕西省户县西），其后有荣氏。",
        "　　二、据《通志·氏族略·以邑为氏》所载，周大夫荣夷公，其先食邑为荣（在今河南省巩县西），其后亦有荣氏。",
        "　　三、又春秋时鲁国亦有荣氏。孔子有弟子荣旗。",
        "家族名人",
        "　　荣成伯",
        "　　即荣驾鹅，又名栾。春秋鲁国大夫，公孙婴齐之子。据《左传》载：鲁襄工自楚国返，闻季武子袭击卞（鲁庄子食邑），欲不入，荣成伯赋《式微》，襄公乃归。又，季孙氏嫉恨昭公。昭公死，理应葬在鲁群公墓所在地阚（今山东汶上县西南），季孙欲隔绝昭公墓，不使与先君同。成伯曰：‘生不能事，死又离之，以自旌也。纵子忍之，后必或耻之。’季孙又欲为恶谥。成伯曰：‘生弗能事，死又恶之，以自信也。将焉用之？’季孙乃止。",
        "　　荣广",
        "　　字王孙，汉代鲁国人。从瑕丘江公受《谷梁春秋》及《诗》，尽能传其所学。",
        "　　荣启期",
        "　　春秋时隐士。传说曾行于郕之野，鹿裘带索，鼓琴而歌，语孔子，以德为人，又为男子，又行年九十，为三乐。",
        "　　荣毗",
        "　　字子谌，遂代无终人，刚鲠有局量，官至侍御史，立朝侃然正色，百僚惮之。",
        "地望分布",
        "　　山东省高青、博兴、广饶一带",
        "　　河北省西北部",
    ]
}
BaiIiaXingPageModule[200] = {
    "index": "百家姓",
    "name": "翁",
    "content": [
        "历史来源",
        "　　「翁」源出：",
        "　　出自姬姓。以地名为氏。据《元和姓纂》所载，周昭王庶子食采于翁山（在今浙江省定海县东；一说在今广东省翁源县东，恐非也）。其子孙以邑名‘翁’为氏。",
        "家族名人",
        "　　翁方纲（公元1733-1818年）",
        "　　字正三，清代大兴县人，进士出身，官至内阁学士。精金石考据之学，亦擅长词章、书法。曾任鸿胪寺卿，预千叟宴。",
        "　　翁肃",
        "　　字彦恭，宋代崇安人，官至朝散大夫，与翁彦约、翁彦深、翁彦国三兄弟及翁延庆、翁蒙之同姓同乡同朝，皆居高官，时称六桂同芳。",
        "　　翁承赞",
        "　　字文尧，唐代福清县人，干宁年间（公元894-898年）进士。五代后梁时官至左散骑常侍、御史大夫。曾咏梅花诗：‘忆德当年随计吏，马蹄终日为君忙。’",
        "　　翁德广",
        "　　宋代人。淳熙年间（公元1174-1189年）任溪县知县。朱熹曾奏荐之，称其‘不务赫赫可喜之名，而有肯肯爱民之实。’",
        "地望分布",
        "　　江西省抚州至南城一带",
        "　　浙江省杭州市",
    ]
}
BaiIiaXingPageModule[201] = {
    "index": "百家姓",
    "name": "荀",
    "content": [
        "历史来源",
        "　　「荀」源出：",
        "　　一、出自姬姓。以国为氏。据《姓苑》所载，公元前十一世纪，周文王之子受封于郇国，在今山西省临猗县（一说在今山西省新绛县），晋武公灭郇国，以赐大夫原氏，是为郇叔。后代将‘郇’字去邑旁加草头，遂为荀氏。",
        "　　二、出自姬姓。以邑名为氏。据《通志·氏族略》所载：荀氏，晋之公族也。隰叔之后。荀邑在降州正平西十五里，本侯国，姬姓。晋灭之以为邑。",
        "家族名人",
        "　　荀淑（公元83-149年）",
        "　　字季和，东汉颍川郡颍阴人。桓帝时为朗陵侯相，莅事明理，有‘神君’之称。有八子（俭、绲、靖、焘、汪、爽、肃、敷），并有才名，时谓八龙。",
        "　　荀雍",
        "　　南朝宋国人，与谢惠连、何长瑜、羊璇之等四人跟谢灵运以文章赏会，作山泽之游，时人谓之四友。",
        "　　荀蕤、荀羡",
        "　　荀蕤，字令远，其弟荀羡，字令则，兄弟二人为晋代颍川郡颍阴人。荀蕤有仪操风望，雅为简文帝为重。官至建威将军、吴国内史。荀羡少有大志，后尚公主，拜驸马都督，至徐州刺史，累立战功，抚纳降附，甚得众心。时称二玉。",
        "　　荀粲",
        "　　字奉倩，三国时魏国颍阴人。独好道。曹洪女有美色，粲聘之，专房欢宴历年。后妇得热病，粲取冷熨其身，不愈而亡。粲痛悼不能已，岁余亦卒，时年二十九。",
        "　　荀菘",
        "　　字景猷，晋代颍阴人。志操清纯，雅好文学。官襄城太守，被社会所围。其女荀灌，率勇士数十人突围，乞师求援，平南将军石览至，遂解围。太宁年间（公元323-325年）荀菘任右光禄大夫。",
        "地望分布",
        "　　河南省洛阳市",
    ],
}
BaiIiaXingPageModule[202] = {
    "index": "百家姓",
    "name": "羊",
    "content": [
        "历史来源",
        "　　第一个渊源",
        "　　源于姬姓，出自黄帝的臣子於则，属于以先祖名字为氏。",
        "　　据史籍《世本》记载，黄帝时有臣子名於则，发明了用麻编织的鞋子履，结束了古人光脚行路的历史，因功大被封于於（今河南内乡），称为於则。",
        "　　在於则的后裔子孙中，有以先祖封邑名称为姓氏者，称於氏，世代相传至今。通常认为，於则是於氏的始祖。",
        "　　第二个渊源",
        "　　源于姬姓，出自西周时期官吏於官，属于以官职称谓为氏。",
        "　　於官，亦称囿人、圉人，是西周时期设置的官位，是一种专职负责掌管在禁宫之内饲养畜禽的官吏，以供王族食用或祭祀之用。於官隶属于地官府司管辖，下属有中士、史、饲人、以及役若干人。",
        "　　这在典籍《周礼》中有明确记载：“囿人掌囿园之兽禁，牧百兽。祭祀、表记、宾客、供其生兽死兽之物。”",
        "　　到了东周时期，於官与圉人职能分开，於官仍然负责饲养畜禽，圉人则专职负责皇家宫廷、园林的花木栽培和管理。",
        "　　此后，该官类称一直被历朝历代沿用，直至清朝末期，在京都的天坛、地坛、日坛、月坛这四大皇家祭祀坛园中，以及皇家八大园林如颐和园、圆明园、清花园、蔚秀园、畅春园、勺园、清华园、西苑、南苑等，和各大行宫如承德行宫、沈阳行宫等，皆有於官、圉官之职，官秩为正八品。",
        "　　在於官的后裔子孙中，有以先祖官职称谓为姓氏者，称於氏、或圉氏，世代相传至今。",
        "　　第三个渊源",
        "　　源于地名，出自春秋时期齐国於丘，属于以居邑名称为氏。",
        "　　於丘，是春秋初、中期齐国的一个邑名，位置在今山东省潍坊市南部，其居地住民有以居邑名称为姓氏者，称於丘氏，这在史籍《万姓统谱》中有记载：“於丘，其先家於丘，因氏。”",
        "　　於丘氏族人后大多省文简化为单姓於氏、丘氏两支，世代相传至今。",
        "　　该支於氏、丘氏、於丘氏同宗同源。",
        "　　第四个渊源",
        "　　源于妫姓，出自战国时期齐国陈仲子，属于以居邑名称为氏。",
        "　　在史籍《风俗通》中记载：“陈仲子居於陵，因氏。”",
        "　　战国时期，齐国有一个以廉洁闻名的学士，他就是陈仲。陈仲，本名陈定，又作田仲，是田齐政权的贵族子弟。他是一位饱学之士，荀子曾把他列为春秋战国六大家代表人物之一，孟子称之为“齐之世擘”。汉《列女传》、晋《列士传》以及司马迁、陶渊明、张说等曾将他的清廉事迹写入史书或诗歌中，使他的清名流传至今。",
        "　　陈仲对人欲横流的浊世深恶痛绝，他提醒人们不要为世俗所迷惑，提倡从自身廉洁做起，整顿世风，纯洁社会，他的主张在当时影响很大；更感人的是他能身体力行，留下了许多清廉佳话。",
        "　　在陈仲子的后裔子孙中，有以先祖居邑名称为姓氏者，称於陵氏，后省文简化为单姓於氏，世代相传至今。",
        "家族名人",
        "　　於 琳：（生卒年待考），宋朝人。著名宋朝大臣。为本州防城保甲，尽忠职守。宋建炎初期，陈通叛乱，於琳随浙东安抚使讨伐陈通，战败被俘，陈通欲刺面降之，於琳骂不绝口，宁死不屈而遭杀害。",
        "　　於 敖：（生卒年待考），字伯度，岷州人。著名明朝大臣。明正德年间进士。明嘉靖年间驻汾州，分守冀南。当时强宗内乱，胡虏外侵，军民慌乱不安，莫知所措。於敖指挥军民赶筑外城及四方堡垒，加强防御，盗贼不敢犯。官至巡抚都御史。",
        "　　於清言：（生卒年待考），晋陵人（今江苏武进）。著名南宋画家。宋嘉定年间（公元1208～1224年）专画荷花草虫，独步一郡，谥号“荷”。宋宁宗一朝（公元1195～1224年）以荷花障进，特旨授承节郎，浙西安抚司、计议官。按图绘宝鉴作于清年，一作青年，似为同一人，待考。著有《图绘宝鉴》、《毗陵志》、《画史会要》、《历化画史传》等。",
        "　　於竹屋：（生卒年待考），著名明朝画家。他以擅长画墨竹而闻名于世。著有《画史会要》、《明画录》。　於 伦：（生卒年待考），字敦之，黄冈人。著名明朝大臣。明朝时期的右通政，曾辑上古至明朝用智之事为一书，名曰《智品》。",
        "　　於 坦：（生卒年待考），著名明朝大臣。为官清廉而有善政，相传时遇大旱，曾徒步祈雨，果然天降甘霖。　於仲完：黄岩人。著名明朝官吏。明朝洪武年间的永新知县，那时南乡龙仁和为乱，带兵的将军要把南乡人杀光，好报他的战功。於仲完坚决反对。南乡人很感激他，生了男孩多用“仲完”为儿子起名，以示感其恩德，永远记念。",
        "地望分布",
        "　　河南省",
        "　　南阳市内乡县西庙岗乡於家营、南阳市内乡县西庙岗乡彭沟村於家沟组、南阳市内乡县赵店乡、南阳市内乡县师岗镇杏树崖、南阳市新野县新甸铺镇於庙村、南阳市南阳镇南丰村、南阳市南阳镇横蓬村、淅川县、郑州市中牟县官渡镇前於村、郑州市中牟县官渡镇后於村、驻马店市正阳县汝南埠镇於庄、河南省正阳县皮店乡於庄、台前县城关镇於庙村、河南与湖北交界处的鸡公山",
        "　　河北省",
        "　　张家口市万全县高庙堡乡於家梁村；唐山市乐亭县（乐亭县100人）；邯郸市、承德市兴隆县北水泉乡二道河村、安国市祁州药市街道於村；石家庄市中华北大街；秦皇岛市昌黎县",
        "　　北京市",
        "　　门头沟区雁翅镇田庄乡高台公社於白村、八达岭於发洞、密云县新城子镇曹家路村、於于同（北京生京试验学校旁）",
        "　　天津市",
        "　　天津红桥区新红桥西於庄、天津市河西区",
        "　　浙江省",
        "　　杭州市：西湖区三墩镇於村、萧山区浦阳镇於家村、萧山区於家浦、萧山区瓜沥镇於家楼居委会、萧山区宁围镇宁新村、萧山区瓜沥镇义桥、萧山区施家桥闸口、余杭区运河镇、余杭区乔司镇朝阳村、杭州市淳安县石林镇考坑村、淳安县里商乡武源村於家村、淳安县石林镇棠高村（淳安300多人）、临安市太湖源镇於头村、临安市横路乡於塘村、临安市於潜镇於潜居委会",
        "　　舟山市：普陀区沈家门街道、普陀区登步乡、普陀区六横镇山坑渔业村、普陀区六横镇苍洞村、普陀区桃花镇公前村万寿弄、岱山县高亭镇大岙一村、岱山县高亭镇大岙二村、岱山县高亭镇大岙於家、岱山县高亭镇闸口、岱山县高亭镇蓬莱弄、岱山县石马岙社区、岱山县岱东镇、岱山县岱西镇（岱山4000人）、嵊泗县菜园镇",
        "　　台州市（路桥区蓬街镇於家桥村、路桥区路北街道下宅於村、路桥区路北街道松塘村、路桥区路北街道洋叶村、路桥区路北街道马铺居、路桥区路北街道蔡於居、路桥区路北街道管前村、路桥区桐屿街道坐应村、路桥区桐屿街道山羊居、路桥区桐屿镇新保村、路桥区桐屿镇岙后村、路桥区路桥街道蔡於新村、路桥区路桥街道路桥后於、路桥区路桥街道后蔡居、路桥区路桥街道良二村、路桥区路桥街道河西街居、路桥区横街镇横街居、路桥区路东乡洋叶村、黄岩区院桥镇沙门於村、黄岩区院桥镇沙门店村、黄岩区院桥镇洋岙村、黄岩区院桥镇埭东村、黄岩区南城吉岙村、黄岩区院桥镇鸡山村、路桥区螺洋街道向北屋村、玉环县珠港镇东门村、玉环县城关镇广陵路与东城路、温岭市大溪",
        "　　宁波市：江北区洪塘镇洪塘村於家村、镇海镇海区、北仑区新矸街道、北仑区大矸河南村、亚浦街道镇东村已经拆迁大约五六百人口住进规划小区（北仑区3000人）、象山县鹤浦镇高坎头村、余姚市（余姚已经是第4代了）、绍兴上虞30人",
        "　　湖州市：南浔区和孚镇重兆枉港钱家埭、南浔区和孚镇重兆枉港陆家湾、南浔区和孚镇重兆枉港本横港、南浔区和孚镇重兆枉港张家埭、南浔区和孚镇重兆枉港於家湾、南浔区和孚镇重兆横港钱介埭、南浔区和孚镇重兆横港钟家埭（南浔5000多人）、湖州市孝丰镇溪南村、湖州市菱湖镇东河村、双林镇邢窑村於家埭、德清县武康镇三桥、吴兴区。",
        "　　嘉兴市：嘉兴市秀洲区油车港镇栖真村、海盐县秦山镇杨柳山村、海宁市盐官镇郭店村於家逮（2000多人）、海宁市丁桥镇海星村於家亭、海宁市梅园三里。",
        "　　绍兴市：绍兴县钱清镇劳动村於家埭、上虞市。",
        "　　衢州市：江山市风林镇西溪於村、开化马金镇大於村、龙游县。",
        "　　温州市：乐清市雁荡镇泽前村。",
        "　　丽水市：丽水市莲都区秋塘、丽水市莲都区岩泉街道青林村、丽水市城关镇丽东新村。",
        "　　金华市：万苍乡潘界村。",
        "　　上海市",
        "　　南汇区万祥镇新路村（621号）、南汇区老港镇、浦东新区高桥镇、浦东新区三林镇同济村、青浦区徐泾镇（徐泾镇於姓祖籍江苏苏州）、普陀区清峪路、普陀区真如镇於一堂社区（南石四路114号）、金山区、宝山区、松江区、奉贤区柘林镇於家宅",
        "　　江苏省",
        "　　盐城市：大丰市大中镇和瑞村、滨海县天场乡天场村（1000人）、滨海县天场乡马套村、滨海县樊集乡（滨海县2000人）、建湖县庆丰镇庆丰居委会二组、建湖县永丰镇於家舍、建湖县上冈镇、射阳县、阜宁县。",
        "　　南通市：海安县胡集镇於庄村、海安县青萍乡於庄村、海安县雅周镇於陈村、通州市平潮镇团圆村、如东县大豫镇杨於村、如东县洋口镇古坳村於家荡、如东县丰利镇家庙桥村於家家庙桥、於家营；如东县丰利镇陈葛庄村於家观音堂、如东县洋口镇蓬树村（江苏南通於姓祖先於清言，擅画荷花）。",
        "　　镇江市：丹徒区辛丰镇北於村、丹徒区辛丰镇南於村、丹徒区辛丰镇黄墟村；丹阳市经济技术开发区大泊后湾、润州区七里甸镇。",
        "　　常州市：常州市新北区青龙乡高土村於家湾（100人）、新北区春江镇四堡村委於家村、新北区春江镇绿南村委於巷里、新北区春江镇绿南村委野田里、罗溪镇灯塔村、天宁区、溧阳市社渚镇於坝村、溧阳市南渡镇朱於村、武进区洛阳镇於村、武进区洛阳镇洛东村於家村、武进区礼嘉镇於家村、武进区湖塘镇武宜路。钟楼区",
        "　　扬州市：仪征市、高邮市。",
        "　　淮安市：清河区长西街道长西社区、金湖县涂沟镇於沟、金湖县金南镇车塘村、金湖县金南镇南望村、金湖县卞塘镇新卞村、盱眙县马坝镇马坝村维桥於家湖、於老庄（盱眙县4000人）。",
        "　　苏州市：张家港市经济开发区杨舍镇河头村、吴江市平望镇瑞市村於家湾、吴江市平望镇小於村、吴江市平望镇溪港村、昆山市锦溪镇袁甸村田肚里、北联村於家湾、长云村。",
        "　　南京市：浦口区星甸镇小陶村小於自然村、浦口区乌江镇大於自然村、浦口区於桥、江浦县龙山乡中窦村、江宁区、玄武区、建邺区沙洲街道。",
        "　　无锡市：宜兴市高塍镇李家村於家村、宜兴市徐舍镇长福村（原长圩村）约1000人（繁衍至今已七代），江阴市顾山镇北国村李家桥村（从宜兴迁来，有几十户於姓人家，200人）、江阴市夏港镇三元村於王村。无锡市孙蒋新村",
        "　　泰州市：泰州市於尖、兴化市周庄镇夏泊村（1000人）、姜堰市娄庄镇红庙村。",
        "　　宿迁市：泗阳县高渡镇南大滩村於庄（260人）、泗阳县於沟村、泗阳农场三大队、泗阳城厢社区小圩居委会、沭阳县龙庙乡联合村。",
        "　　连云港市：灌云县四队镇街西村（河南迁徙而来）",
        "　　江西省",
        "　　抚州市南丰县、九江市都昌县汪墩乡万户古岭於家村、九江市都昌县汪墩乡万户古岭塘美村、九江仙人洞、上饶市前程乡里於家、上饶市外於家、上饶市广丰县洋口镇、上饶市广丰县霞峰镇三里村、鹰潭市、赣北有零星分布。",
        "　　山东省",
        "　　济南市、青岛市城阳区流亭镇於家村、济宁市微山县欢城镇於村、袁楼、房庄、微山县夏镇三里庄、周岭，盐当村，纸坊、昭阳三孔桥、南庄、付村镇、樊村，（济宁市微山县800多户3200人）、枣庄市滕州市东郭镇西坞沟村（西坞沟村10000多人）、张汪、大宗村、狄庄、鲁寨、荆沟、辛庄、东沙河、小宫山、城头寨子、江时村、圪针园，薛城埠岭，滨州市无棣县信阳乡於家村、招远市金岭镇河西於家村、烟台市莱阳市谭格庄镇小於家村、潍坊市临朐县石家河乡於家庄村",
        "　　安徽省",
        "　　淮南市：潘集区古沟乡於湖村、潘集区田集街道吴湖村於程王、潘集区祁集乡黄岗村於拐孜、潘集区架河乡先锋村任王、潘集区芦集西清明孤堆（潘集区2000人）、谢家集区孙庙乡范嘴村於大郢（400多人）、凤台县杨村乡邵集村（凤台县100人）",
        "　　蚌埠市：蚌山区燕山乡铅山村於家（蚌山区200人）、怀远县朱疃桥",
        "　　滁洲市：天长市张铺镇天王村草屋组、天长市新街镇勤东村於庄、天长市铜城镇龙岗社区湖庄组，明光市管店镇罗岭村、明光市三和集镇大於、定远县藕塘镇永宁乡陈苇、北於、南於三村、三和集镇农科村、全椒县程家市乡西石村大於村、全椒县程家市乡小於村、程家市乡浦北村栗於、全椒县古河镇蔡集村上於自然村、全椒县古河镇华严村下於自然村（古河镇70户人家，300口人）、全椒县草庵乡白酒村、全椒县二郎镇西石村余庄组、凤阳县武店镇於陆村於家湖、凤阳县刘府镇时圩村於家队、凤阳县红心镇蒋庄村小於（凤阳县600人）、来安县新安镇。",
        "　　六安市：六安、金寨县、霍山县佛子岭、霍邱县於子楼、寿县张李乡塘北村、寿县迎河镇於郢（寿县於姓从淮南来，老祖叫於老方，200多人）。",
        "　　芜湖市：芜湖市裕西口、南陵县许镇镇马仁村於村自然村、繁昌。",
        "　　安庆市：安庆市迎江区工人新村、安庆市雷池路於家炮、安庆市杨家山街，安庆市十里铺乡於家炮、安庆市新建村於垀、安庆市於船形、怀宁县凉亭乡、怀宁县安铜街道於家冲、。",
        "　　巢湖市：居巢区拓皋镇大於村、居巢区拓皋镇驷马於山头、居巢区拓皋镇驷马大於村、居巢区栏杆集镇牛头地村（牛头地村30人）、巢湖市峏山乡大於自然村、巢湖市於赵、巢湖市苏家湾乡小王村、和县香泉乡秋於自然村、和县香泉乡小於村、和县沈巷三墩、和县沈巷双河村委会三东村。",
        "　　阜阳市：颍州区清河办事处、阜南县",
        "　　合肥市：肥东县二十埠於家湾、肥东县张集乡小於户、肥东县龙山乡小於家",
        "　　淮北市、毫洲市蒙城县顺河集、宿洲市砀山县、马鞍山市、池州市东至（东至300人，於胜军提供）",
        "　　山西省",
        "　　太原市（约30人，於明珂一家）、宁武县",
        "　　甘肃省",
        "　　兰州市、定西市岷县秦许乡中堡村（於敖的后人3000人，於军强提供）、岷县岷阳镇、平凉市锦屏镇於家湾。",
        "　　湖北省",
        "　　黄冈市：黄梅县五祖镇渡河桥村於大屋、黄梅县五祖镇白羊岭村、黄梅县苦竹乡尖於、黄梅县孔垅镇马坊村、黄梅县杉木乡於岭村（於岭村10000左右）、黄梅县独山镇周材村（男丁120左右）、黄梅县濯港镇南街、黄梅县大河镇王枫乡於婆祖村、黄梅县大河镇戢畈村、黄梅县大河镇天门村、黄梅县大河镇江畈、螺蛳墩、於家聿、於三房、於家楼、河畔、大路岸、罗垸、黄梅县於天绿、於正益、於元吉、於上屋、於大屋、於窑、团风县团风镇江宇（於）庙村於家咀、团风县上巴河镇黄泥岗村於家湾、团风县於家墩、杜皮乡於阳岗村（有祠堂）、杜皮乡於家垸；罗田县胜利镇翁家湾村十组；蕲春县狮子镇於冲村、花圆镇狮子岭於家村（男丁360左右）、琥祖后裔分布于黄梅县、蕲春县等地男丁人口5000左右等，蕲春县向桥乡柳堰村於油铺人口100左右。",
        "　　荆州市：洪湖市於家桥、江陵县秦市乡谭市一组、",
        "　　仙桃市：郭河镇官伟村於家渡（10000多人）",
        "　　鄂州市：鄂城区汀祖镇泉塘吴垴村於家湾、鄂城区汀祖镇岳石洪村大坳庄（有祠堂），鄂城市徐王於、鄂城市於谈庄",
        "　　黄石市：大冶市城北经济开发区下冯村、大冶市桥北开发区（原大冶市下黄村於家湾）胭脂庄（原蛤蟆墩於家）、大冶市东岳路街道办事处永胜村三组（有祠堂）（季麻海庄）、大冶市东风路街道白象林庄、大冶市东风路五星村沙子垴庄、大冶市罗桥乡徐家铺村牛角山庄、大冶市金湖街道大学庄、八十步庄。",
        "　　武汉市、宜昌市水月寺滩於河村、十堰、鄂东及大别山余脉有零分布",
        "　　湖南省",
        "　　衡阳市衡东县草市镇，祁阳大忠桥、常德市澧县於家湾",
        "　　云南省",
        "　　昆明市、德宏州瑞丽市、姚安县於家海子",
        "　　贵州省",
        "　　贵阳市、遵义市",
        "　　广东省",
        "　　深圳市、韶关市新华北路，广东信宜天后街於雨",
        "　　广西区",
        "　　北海市合蒲县山口镇竹莞村、桂林市灌阳县新街乡永富村、灌阳县西山瑶族乡李家村、桂林市灌阳县新圩乡、灌阳县灌阳镇雷坪村、桂林市灌阳县灌阳镇仁义村新屋村、仁义村下新屋、仁义村炭塘屯、仁义村黄泥屯、仁义村龙王庙（从湖北黄冈来，老祖叫友正公，已14代，仁义村5000人）、柳州市柳北区",
        "　　四川省",
        "　　广元市、彭州市、自贡市（宁波迁徙的）",
        "　　重庆市",
        "　　开县、巴南区龙岗乡花厅村第4村民小组、巴南区安澜镇弥陀村、巴南区龙岗乡、巴南区一品镇乐遥村、綦江县石壕镇石壕村六队、十一队，长寿县凤城镇上东街",
        "　　台湾省",
        "　　台北市北投区秀山段三段、高雄市立鼓山、新竹市高峰路、桃园县龟山乡",
        "　　内蒙古",
        "　　包头市东河区（老家山西宁武县，已6代人，1000人）、乌兰察布市凉城县沙胡子乡、林县、凉城县",
        "　　吉林省",
        "　　长春市双阳区云山街道办事处於家村、九台市沐石河镇於家村、松原市、通化市、延边州、榆树市秀水镇大於村",
        "　　辽宁省",
        "　　分布在辽宁省沈阳市苏家屯区十里河镇十里河村（800人），苏家屯区十里河镇三洪庄村（500人）、苏家屯区十里河镇新庄村（500人），苏家屯区十里河镇板桥铺村（100人），苏家屯区十里河镇灰菜泡村（100人），沈阳市苏家屯区大沟乡大范大队小范屯村（300人）、灯塔市大河南镇小河南村（100人），辽阳市灯塔市大河南镇小山东村（1000人）、沈阳市苏家屯区林盛堡镇沙河站村、沈阳市大东区东於站、大连市",
        "　　黑龙江省",
        "　　五常市安家镇绿南村委於巷里、五常市百丈镇四堡村委於家村、五常市圩塘镇前圩村委於家村、佳木斯市富锦市长安镇於家村、七台河市等",
        "　　新疆",
        "　　乌鲁木齐",
    ]
}
BaiIiaXingPageModule[203] = {
    "index": "百家姓",
    "name": "惠",
    "content": [
        "历史来源",
        "　　「惠」源出：",
        "　　出自姬姓。以谥号为氏。周朝有君王名阆，于公元前676-前652年在位，死后谥号为‘惠’，史称周惠王。其支庶孙以其谥‘惠’为氏。",
        "家族名人",
        "　　惠施",
        "　　战国时宋国人，与庄周为友，是名家代表之一。主张‘合同异’说，认为一切差别、对立是相对的。庄子称’惠施多方，其书五车‘，着有《惠子》一篇。",
        "　　惠士奇（公元1671-1741年）",
        "　　字仲儒，清代江苏吴县人。家有红豆斋，人称红豆先生，官至侍读学士，继承其父惠周惕之学，专攻经史，着有《易说》、《礼说》、《春秋说》等书。次子惠栋承继家学，对诸经多所探究，著作颇丰，有《易汉学》、《古文尚书考》、《九经古义》、《松崖文抄》等。",
        "　　惠直",
        "　　字子温，宋代当涂人，崇宁年间（公元1102-1106年）进士，历任德化主簿、歙州推官、太常博士。最初名叫直方，后去’方‘留’直‘，改姓名为惠直，意在保留正直之名。",
        "　　惠希孟",
        "　　字秋崖，元代江阴人，天资聪慧，博涉群书，着有《易象钩玄》、《杂礼纂要》、《家范》等书。其兄惠希颜，弟惠希点无子嗣，希孟奉兄抚弟，相爱无间。",
        "地望分布",
        "　　山东省东南部诸城、胶南一带",
        "　　陕西省长安县西",
    ]
}
BaiIiaXingPageModule[204] = {
    "index": "百家姓",
    "name": "甄",
    "content": [
        "历史来源",
        "　　「甄」源出：",
        "　　一、以技为氏。古代的甄工，就是制作陶器的工匠。因以为氏。《通志·氏族略》载，舜陶甄河滨，其后为氏。又《元和姓纂》云：皋陶次子仲甄之后。但关于舜及皋陶的传说皆为附会之辞，不是信史。",
        "　　二、南北朝时鲜卑族姓氏所改。据《魏书·官氏志》所载，北魏有代北三字姓郁都甄氏，进入中原后改为甄氏。",
        "家族名人",
        "　　甄济",
        "　　自孟成，唐代定州无极人。少孤好学，以文雅称，居青岩山十余年，远近服其仁，环山樵夫不敢伐木。官至侍御史。",
        "　　甄彬",
        "　　梁代中山人。有操行，乡里称善。曾以苎麻抵押于人，赎苎麻时，从中得金五两，如数奉还。梁武帝布衣时闻之，即位后官以益州录事参军，兼郫县令。",
        "　　甄宇",
        "　　字长文，东汉北海郡安丘人。清静少欲，习严氏《春秋》。建武年间（公元25-56年）征拜博士。官终太子少傅。",
        "　　甄后（公元？-221年）",
        "　　三国时中山郡无极人，汉太保甄邯后裔，本袁绍次子熙之妻，姿貌绝伦。曹操破绍，曹丕纳为妇。丕称帝，失宠赐死，追谥文照皇后。相传每晓妆，有一绿蛇盘成髻形于后，后仿为之，号灵蛇髻。",
        "地望分布",
        "　　河北省北部地区",
    ]
}
BaiIiaXingPageModule[205] = {
    "index": "百家姓",
    "name": "曲",
    "content": [
        "历史来源",
        "　　「曲」源出：",
        "　　以地名为氏。据《风俗通义》所载，春秋时晋穆侯封其少子成师于曲沃（在今山西省闻喜县东北）成师的支孙遂有曲氏。",
        "家族名人",
        "　　曲端",
        "　　字正甫，宋代镇戎人。知书善属文，长于兵略。治兵汀原，道不拾遗。历汀原路将、宣州观察使，知渭州。",
        "　　曲环",
        "　　唐代安邑人。善兵法，善骑射。天宝年间（公元742-756年）授果毅别将。安禄山反，守邓州，平河北，败吐蕃，威名大震。后任陈许节度使，宽赋税，简条教，不三年乃五谷丰登。",
        "地望分布",
        "　　山西省代县一带",
    ]
}
BaiIiaXingPageModule[206] = {
    "index": "百家姓",
    "name": "家",
    "content": [
        "历史来源",
        "　　「家」源出：",
        "　　一、出自姬姓。周幽王时，整日游逸，不理朝政，大夫家父作《节南山》诗，以讽刺幽王。见于《诗经·小雅》。家父死后，遂以‘家’为氏。",
        "　　二、以王父子为氏。春秋时期，鲁庄公之孙，字子家，其后亦有‘家’氏。见《姓苑》所载。",
        "家族名人",
        "　　家横",
        "　　字仲本，宋代人。擅长经学，名列上庠之首。兄弟二人宫廷面试皆中甲科，棣萼相映，名噪一时。",
        "　　家退翁",
        "　　宋代人。元丰年间（公元1078-1085年）知怀安军，与苏轼为同年好友，轼赠诗云：‘退翁守清约，霜菊凄余馨。’",
        "　　家愿",
        "　　字处厚，宋代眉山人。弱冠游京师，以广文馆进士登第，官乐至令。屡上书极论时政，多次遭贬。苏轼曾谓‘愿少年能不为进取计异，时当以直道闻。’",
        "　　家羡",
        "　　汉代人。官北海郡剧县令，有名声。",
        "地望分布",
        "　　甘肃省的陇西渭水流域",
        "　　陕西省西安市",
    ]
}
BaiIiaXingPageModule[207] = {
    "index": "百家姓",
    "name": "封",
    "content": [
        "历史来源",
        "　　「封」源出：",
        "　　一、出自姜姓。以地名为氏。据《姓苑》所载，夏商时代有封父国（在今河南省封丘县）。周代，封父国灭，其国人为封父氏、封氏。",
        "　　二、据《魏书·官氏志》所载，南北朝时，北魏有鲜卑族代北复姓是贲氏，南迁中原后改为封氏。",
        "家族名人",
        "　　封孚",
        "　　字处道，南燕渤海郡蓨县人。后燕慕容宝（公元396-397年在位）时任吏部尚书，后入南燕，参与内外机密要事，职位很高，但谦虚待人，广听意见，甚有大臣之体（大臣的风度）。慕容超即位后，朝政日益衰败，封孚骂他是‘桀纣之主’，面不改色。",
        "　　封延伯",
        "　　字仲琏，南齐东海郡人，颇有学问与操行，有高士（超世俗的人）风度。官至梁郡太守。",
        "　　封隆之",
        "　　字祖裔，北魏渤海郡人，曾经历五个皇帝，四次任侍中，两次为吏部尚书，一次官仆射，四任冀州刺史，都保持好的名声，人称‘博大长者’。",
        "　　封家姨",
        "　　即风神。据唐代人段成氏《酉阳杂俎》记载，一个名叫崔之徽的人，在家夜坐，见来了几个美女，其中一个叫封家姨。不一会都走开了，只留下一红衣少女，求崔之徽立一杆红色大旗。立旗那天，东风刮地，只有花园中鲜花不动。他才明白封姨便是风神。",
        "　　封德彝",
        "　　名伦，渤海郡人。最初在遂朝任内史舍人，被重臣杨素所器重，常跟他议论天下事。一日，杨素摸着他的床说：‘封郎终居此坐。’便把从女（兄弟的女儿）嫁给了他。唐太宗（公元629-649年在位）时官至尚书右仆射。",
        "地望分布",
        "　　河北省、辽宁省的渤海湾沿岸一带",
    ]
}
BaiIiaXingPageModule[208] = {
    "index": "百家姓",
    "name": "芮",
    "content": [
        "历史来源",
        "　　「芮」源出：",
        "　　出自姬姓。以国名为氏。公元前十一世纪，周武王封其卿士良夫于芮邑（在今山西省芮城县，一说在今陕西省朝邑县南有芮城），周成王时改做诸侯国，称芮伯。在周王室任司徒。春秋时，芮国被晋国所灭。其后以原国名‘芮’为氏。",
        "家族名人",
        "　　芮晔",
        "　　宋代人，与芮晖兄弟二人，潜心于学，同科登第，雍容儒雅，时称二芮。",
        "　　芮及言",
        "　　字子及，宋代霅川人。嘉泰年间（公元1201-1204年）任上高知县。莅政经勤，号为小监司。曾在所作屏之后书曰：‘少饮酒，饱餐饭，勤出厅，公事办。’在位三载，始终如一。",
        "地望分布",
        "　　山东省西北部平原县一带",
        "　　陕西省长安县西",
    ]
}
BaiIiaXingPageModule[209] = {
    "index": "百家姓",
    "name": "羿",
    "content": [
        "历史来源",
        "　　「羿」源出：",
        "　　始祖为夏代的后羿氏",
        "家族名人",
        "　　羿忠",
        "　　明代湘阴人，洪武（公元1368-1398年）初年为遂宁知县，有异政。",
        "　　后羿",
        "　　相传为唐尧时人，善射。时时日并出，草木枯焦，羿射落九日。后得西王母长生不老之药，其妻嫦娥窃吞之，奔月为月神。传说羿姓乃后羿之后。",
        "地望分布",
        "　　河南省兰考县一带",
        "　　山东省临淄县一带",
    ]
}
BaiIiaXingPageModule[210] = {
    "index": "百家姓",
    "name": "储",
    "content": [
        "历史来源",
        "　　「储」源出：",
        "　　以王父子为氏。春秋时期，齐国有大夫字储子，曾与孟子相交。储子之支孙以祖字‘储’为氏。",
        "家族名人",
        "　　储敦叙",
        "　　北宋晋江人，字彦伦。崇宁（公元1102-1106年）间进士，历任龙溪县丞、宁德县令，皆有惠政，民为其立生祠。后为贺州通判。着有《玉泉集》。",
        "　　储光羲",
        "　　唐代兖州人，开元（公元674-741年）间进士，任汜水尉，官至监察御史。工诗文，有正论、诗集、文集流传于世。",
        "地望分布",
        "　　山西省夏县一带",
    ]
}
BaiIiaXingPageModule[211] = {
    "index": "百家姓",
    "name": "靳",
    "content": [
        "历史来源",
        "　　「靳」源出：",
        "　　一、出自芈姓。据《古今姓氏书辩证》云：春秋时楚国有大夫靳尚，食采于靳，以邑名为氏。",
        "　　二、五胡十六国时，匈奴族有靳氏。有靳淮自立为王。",
        "家族名人",
        "　　靳辅（公元1633-1692年）",
        "　　字紫垣，清代辽阳人，顺治九年以官学生考授国史院编修，后升为内阁学士，河道总督。当时黄河决堤，不复归海；靳辅因势利导，筑堤束水，使河水重归故道。着有《治河书》、《靳文襄奏疏》等。",
        "　　靳义",
        "　　字原礼，明代淇县人。由太学生入仕，累官监察御史。永乐初年（公元1403年）巡行畿辅，承办贪官，纠正冤案，每日只吃素食，无取于民，皇太子赐给他鱼米，以表彰他的廉洁。官至湖广按查副使。",
        "　　靳裁之",
        "　　宋代颍川郡人，精通儒家学说，曾为南宋经学家胡安国的老师。",
        "　　靳歙",
        "　　西汉人，初为刘邦的侍从官，刘邦自立为汉王后，因战功赐靳歙为建武侯，官骑都尉；随刘邦定三秦，败赵将贲郝于朝歌，破相籍于陈，封信武侯，功韩信于平城，有功，升为车骑将军。高后五年（公元前183年）死，谥号肃侯。",
        "地望分布",
        "　　山西、陕西两省之间黄河沿岸一带",
    ]
}
BaiIiaXingPageModule[212] = {
    "index": "百家姓",
    "name": "汲",
    "content": [
        "历史来源",
        "　　「汲」源出：",
        "　　出自姬姓。以邑名为氏。春秋时魏宣公太子曾居于汲邑（在今河南省卫辉市）时称太子汲。其支孙遂以‘汲’为氏。",
        "家族名人",
        "　　汲黯（公元前？-前112年）",
        "　　字长儒，西汉濮阳人。好游侠，有气节。任东海太守，安抚百姓，东海大治。后召为主爵都尉。敢于面折廷诤，为武帝敬重。",
        "　　汲固",
        "　　北魏梁城人。孝文帝（公元471-499年在位）时任兖州从事。兖州刺史李式因事入狱，时式子宪刚满月，式谓众曰：‘今无程婴、许臼此类人也？’固曰：‘古今岂殊？’遂藏宪。搜捕时，汲以婢子代之，自抱宪逃往他乡，获赦后方归。兖州刺史为表彰其节义，任其为主簿。",
        "地望分布",
        "　　山东省濮州县",
        "　　河北省清河至山东省临清一带",
        "　　山西、陕西两省之间黄河沿岸一带",
    ]
}
BaiIiaXingPageModule[213] = {
    "index": "百家姓",
    "name": "邴",
    "content": [
        "历史来源",
        "　　「邴」源出：",
        "　　一、据《通志·氏族略·以邑为氏》所载，春秋时晋大夫邴豫，食邑于邴，因以为氏。",
        "　　二、又，‘邴’亦作‘枋’，为泰山下邑，居此者以为氏。齐国亦有邴邑，而亦有邴氏。《左传》载齐国大夫邴意兹，《史记》作‘秉意兹’，可见‘邴’氏与‘秉’氏相通。《路史》载：楚公族有秉氏。《通志·氏族略》载：汉有秉宽。",
        "家族名人",
        "　　邴原",
        "　　东汉朱虚人。少时与管宁俱以高尚情操而著称，勇敢而有谋略。居乡里，游学之士，教授之声不绝。后归附曹操，官至武官将长史。少孤家贫，曾过学馆而泣，师问其故，答：无资求学。师曰：苟欲学，不须资。乃发愤读书，成为名士。",
        "　　邴郁",
        "　　晋代城阳人，邴原之曾孙。洁身自好，与高密人刘鲕，并有高名。晋成帝司马衍广求异行之士，以博士征召，邴郁以有病推却不赴。",
        "　　邴汉",
        "　　汉代琅琊人，因品行高洁被征用，官至京兆尹，后升为太中大夫。王莽篡权后，告老还乡，不愿同流合污。",
        "　　邴辅",
        "　　后赵栎阳人，好学而多才，善于构思。后赵国都襄国（今河北省邢台县）的宫殿台榭皆为其所营造，被后赵统治者石勒封为材官将军。",
        "地望分布",
        "　　山东省曲阜、泗水一带",
        "　　山西省临汾县西南",
    ],
}
BaiIiaXingPageModule[214] = {
    "index": "百家姓",
    "name": "糜",
    "content": [
        "家族名人",
        "　　夏朝诸侯有糜氏的后代。三国吴有乐平太守糜信，着有《春秋说要》等。",
    ],
}
BaiIiaXingPageModule[215] = {
    "index": "百家姓",
    "name": "松",
    "content": [
        "历史来源",
        "　　「松」源出：",
        "　　据《元和姓纂》所载，秦始皇遇雨避松下，封松为五大夫。后人氏焉。",
        "家族名人",
        "　　松氏",
        "　　相传为秦始皇所封。秦始皇避雨松树下，封松为五大夫，当地人乃以松为姓。",
        "　　松赟",
        "　　遂代北海县人。性刚烈，重名义，为石门府队正。死于杨厚之难，城中皆流涕，锐意倍增。",
        "地望分布",
        "　　山东省沂水一带",
    ]
}
BaiIiaXingPageModule[216] = {
    "index": "百家姓",
    "name": "井",
    "content": [
        "历史来源",
        "　　「井」源出：",
        "　　出自姜姓。以邑名为氏。据《姓源》所载，周代姜尚（太公望）受封于齐国。其后有出仕虞国者，为大夫，受封于井邑，称为井伯，其子孙遂为井氏。后晋国灭虞国，井伯之后井奚逃亡到秦国，即为百里奚。",
        "家族名人",
        "　　井丹",
        "　　字大春，东汉郿地人，年轻时学习于太学，通五经，善谈论，京师人都议论说：‘五经纷纶井大春。’",
        "　　井田",
        "　　字九畴，明代邢台人，永乐年间（公元1403-1424年）任户部刑三科给事中，为大理评事，非常识大体，以贤德著称。",
        "地望分布",
        "　　陕西省长安县西部地区",
        "　　河南省南阳一带",
    ]
}
BaiIiaXingPageModule[217] = {
    "index": "百家姓",
    "name": "段",
    "content": [
        "历史来源",
        "　　「段」源出：",
        "　　一、出自姬姓。据《新唐书·宰相世系表》及《通志·氏族略·以名为氏》所载，春秋时，郑国武公的小儿子叫共叔段，其支孙以王父（祖父）的名‘段’为氏。",
        "　　二、又段氏有出辽西者，本鲜卑檀石槐之后，晋将段匹碲是也。",
        "家族名人",
        "　　段干木",
        "　　战国时魏国人，求学于子夏。后隐居魏国，屡给官禄不受。魏文侯亲临其门，干木逾墙避之；文侯每乘车过其门，必伏轼致敬。",
        "　　段秀实（公元719-783年）",
        "　　字成公，唐代人。官至司农卿。公元783年，原卢龙节度使叛乱，秀实表面与其合作。一日与其议事，忽夺象笏击其额，遂被害。",
        "　　段成式",
        "　　字柯古，唐代临淄人。官至太常少卿。博学强记，多奇篇秘籍，着《酉阳杂俎》。",
        "　　段颎（公元？-179年）",
        "　　字纪明，东汉人。少时习弓，崇尚游侠，戌边十余年，屡破羌敌。官至太尉。",
        "　　段少连",
        "　　字希逸，累知州、县，皆有政绩，不为权贵所屈。相传出生时其母梦凤凰集于庭院。官至龙图阁直学士。",
        "地望分布",
        "　　甘肃省黄河以西、武威以东地区",
    ]
}
BaiIiaXingPageModule[218] = {
    "index": "百家姓",
    "name": "富",
    "content": [
        "历史来源",
        "　　「富」源出：",
        "　　一、出自姬姓。周襄王时，郑国有大夫富辰，其后以名为氏，称富氏。",
        "　　二、据《元和姓纂》所载，春秋时鲁国有大夫富父终甥、富父槐，其后有富父氏，简为富氏。",
        "家族名人",
        "　　富嘉谟",
        "　　唐代武功人。长安年间（公元701-704年）任晋阳尉，与晋阳尉吴少微、太原主簿魏谷倚，都以文辞知名，时称‘北京三杰’。他和吴少微都很雅致丰厚、雄壮豪迈，又并称‘吴富体’。二人经韦嗣立推荐，并官左台监察御史。",
        "　　富弼（公元1004-1083年）",
        "　　字彦国，北宋河南郡洛阳人。少年便知名，被晏殊招为女婿。宋仁宗时，跟韩琦同在中书省主持政事。两次出使契丹，力拒契丹的割地要求。至和二年（公元1055年）与文彦博并列为宰相。",
        "　　富元衡",
        "　　字公权，宋代进士，初任随县主簿，绍兴年间（公元1131-1162年）官至工部郎中。做官守节清慎（保持节气，清廉而谨慎），始终不渝。",
        "地望分布",
        "　　山东省定陶县、临淄县一带",
        "　　河南省开封地区",
    ]
}
BaiIiaXingPageModule[219] = {
    "index": "百家姓",
    "name": "巫",
    "content": [
        "历史来源",
        "　　「巫」源出：",
        "　　以事（职）为氏。《风俗通义》载：凡乐于事，巫卜匠陶是也。商同时期的巫人，是专门掌握祝祷、医病、算卦等技能的人士。世代为‘巫人’者，子孙遂为巫氏。",
        "家族名人",
        "　　巫咸",
        "　　商王太戊之臣，治理王家有功。",
        "　　巫凯",
        "　　明代句容人。性刚毅，饶智略。宣宗（公元1426-1435年在位）时任辽东总兵官。居镇三十余年，威惠并行，边务得以整治。",
        "　　巫贤",
        "　　商代人，巫咸之子，佐商王祖乙，为贤相。",
        "地望分布",
        "　　山西省临汾县西南",
    ]
}
BaiIiaXingPageModule[220] = {
    "index": "百家姓",
    "name": "乌",
    "content": [
        "历史来源",
        "　　「乌」源出：",
        "　　一、据《新唐书·宰相世系表》所载，古代少昊氏以鸟名官，有乌鸟氏，其后为乌氏。",
        "　　二、据《宋书·外夷传》所载，南朝宋时，安定国，其王姓乌氏。",
        "　　三、为古代鲜卑族复姓所改。据《魏书·官氏志》所载，南北朝时，北魏有代北三字姓乌石兰氏，进入中原后改为汉姓乌氏。",
        "家族名人",
        "　　乌获",
        "　　战国时秦国勇士，能举鼎。",
        "　　乌氏",
        "　　秦朝人，以畜牧为业，欲以其畜易物，戎王以十偿之。始皇令?比封君，于时与列臣朝请。",
        "　　乌枝鸣",
        "　　春秋齐国大夫，戍守宋国。宋国华氏作乱，昭公二十年（公元前613年），华登奔吴，于次年发吴兵救华氏，枝鸣主张诱敌，与敌短兵相接，以勇取胜。齐君从之，乃胜。",
        "　　乌重胤",
        "　　字保君，唐代张掖人。出身行伍，善抚士，待官属有礼，当时名士石洪、温造皆罗致幕下。",
        "地望分布",
        "　　河南省许昌一带",
    ]
}
BaiIiaXingPageModule[221] = {
    "index": "百家姓",
    "name": "何",
    "content": [
        "　　「何」源出 ;",
        "　　一 ; 出自「姬」姓。为「韩」氏音化而成，据《元和姓纂》所载，周成王分封其第叔虞于韩。其孙韩王安，原居韩邑 ( 一说在山西河津县 ) 为秦国所灭。子孙分散于江淮之间。江淮方言，音「韩」变「何」，逐为「何」氏。",
        "　　二 ; 据《五代史》，吐谷浑族有「何」氏。又据《唐书》所载，「何」氏为「昭武九姓」之一。隋唐时期，祁连山北邵武城 ( 今甘肃省临泽县 ) 有康国，后为匈奴击败，迁至中亚，建立了安，曹，何，康，石，米，史，火寻，戊地等九个小国。唐高宗永徽年间，「昭武九姓」先后归附内地，其中有「何」氏。",
        "　　三 ; 汉代有「何」苗，本为「朱」氏，冒姓「何」氏，见于《汉书．五行志》所载，其后子息皆为望族。",
        "　　四 ; 又据《兰州府志》所载，元代有吐蕃宣慰使锁南，其子锁铭，余明代官拜河州卫指挥同知，朱明王朝赐姓何氏。",
        "家族名人",
        "　　何仙姑",
        "　　生卒年不详。相传为唐朝永州（今湖南省零陵县）人。名琼。为八仙之一，以手执荷花为特征。",
        "　　何进（？～189)",
        "　　东汉南阳宛（今河南南阳）人。字遂高。因异母女弟为灵帝后，故得权，拜为大将军，讨黄巾贼，以发贼党奸，封慎侯。何太后临朝，进为太傅，后因谋诛宦官，反为所害。",
        "地望分布",
        "　　安徽卢江郡，江苏东海郡。",
    ]
}
BaiIiaXingPageModule[222] = {
    "index": "百家姓",
    "name": "吕",
    "content": [
        "历史来源",
        "　　「吕」源出 ;",
        "　　一 ; 出自「姜」姓。以国为氏。据《通志．氏族略．以国为氏》所载，夏朝有「吕」国，在河南省南阳市，周宣王时，吕国改为甫国。春秋时，被楚国所灭。其后有吕氏。",
        "　　二 ; 据《魏书．官氏志》所载，北魏有代北姓「比丘」氏，后改为汉字单姓「吕」氏。",
        "家族名人",
        "　　吕洞宾",
        "　　吕尚",
        "　　吕不韦  (前？～ 前235)",
        "　　战国时秦人。本为商贾，因有功于秦庄襄王，而为秦相，后封文信侯。曾以有孕之姬献给庄襄王，生子政，即秦始皇。始皇时尊为仲父，后与太后私通，畏罪自杀。居相位时，曾使门客着「吕氏春秋」一书。",
        "　　吕后",
        "　　吕布",
        "　　字奉先，东汉九原人，勇冠三军，武艺超群。为董卓义子，后因董卓暴虐，与王允连手杀董卓，拥兵割据，最后为曹操所擒杀。",
        "　　吕蒙（178～219）",
        "　　字子明，富陂人。三国时吴国名将，曾计夺荆州、擒关羽，授南郡太守，封孱陵侯。",
        "　　吕光 (337～399）",
        "　　字世明。后凉开国君主，略阳氐人（故治在今陜西省秦安县东南八十里）。初事苻坚，苻坚死后，自称凉州牧，建元太安；后以麟见金泽县，改号麟嘉，称三河王；又七年，改元龙飞，称天王。在位十年，谥号懿武皇帝。",
        "　　吕留良 （1629～1683）",
        "　　字庄生，又名光纶，又字用晦，号晚村，晚号何求老人，清浙江石门县（今崇德县）人，生于明末。著作中含有种族思想，并誓不仕清。死后因牵涉曾静文字，被毁墓戮尸，全家抄斩。",
        "地望分布",
        "　　山西河东郡，山东东平郡。",
    ]
}
BaiIiaXingPageModule[223] = {
    "index": "百家姓",
    "name": "施",
    "content": [
        "历史来源",
        "　　「施」源出 ;",
        "　　一 ; 出自「子」姓，为「殷民七族」之一。据《左传》所载，周初，武王之弟康叔受封为卫侯，分到了「殷民七族」;陶氏，施氏，繁氏，樊氏等。施氏为制旗帜的工匠。",
        "　　二 ; 以国为氏。夏代诸侯国有「施氏」之国，在今湖北省恩施县，其后有「施」氏。",
        "　　三 ; 出自「姬」姓，以王父字为氏。据《通志．氏族略》所载，春秋时鲁惠公之子字施父，其支孙以王父 ( 祖父 ) 之字为氏。",
        "家族名人",
        "　　施之常",
        "　　春秋时鲁国人，为孔门弟子。",
        "　　西施",
        "　　春秋越国美女。生卒年不详。越国苎萝（今浙江诸暨县南）人。本为浣纱女，适越王句践为吴所败，欲献美女以乱其政，乃令范蠡献西施，吴王大悦，果迷惑忘政，后为越所灭。见《汉˙赵晔˙吴越春秋˙卷九˙句践阴谋外传》。亦称为西子、先施。",
        "　　施琅",
        "　　字尊侯，号琢公，清晋江人，生卒年不详。初为明代郑芝龙部将，降清后，平台湾，灭郑氏，封靖海侯，卒谥襄壮。",
        "地望分布",
        "　　江苏吴兴郡。",
    ]
}
BaiIiaXingPageModule[224] = {
    "index": "百家姓",
    "name": "张",
    "content": [
        "历史来源",
        "　　「张」源出 ;",
        "　　一 ; 出自「姬」姓，据《通志．氏族略．以字为氏》所载，张氏，世代仕晋，晋分为三，又世代仕韩，后渐成望族。",
        "　　二 ; 改姓，三国魏张辽原姓「聂」，改姓「张」。又三国蜀诸葛亮赐南蛮酋长龙佑那为「张」氏。",
        "　　三 ; 「张」氏自汉代以后，人数渐多，与当时道教的兴起与流行有关。道教自称源与黄帝，而盛行「黄帝赐姓张氏」的说法，道教领袖如张角，张鲁等。",
        "　　四 ; 据《元和姓纂》云 ﹔「黄帝第五子青阳生挥，为弓正，观孤星，始制弓矢，主祀张星，因姓张氏」。",
        "家族名人",
        "　　张仪 （前？～309）",
        "　　战国时魏人。相秦惠王，以连横之策游说六国，使六国背叛纵约以事秦。惠王卒，六国复合纵以背秦，群臣谗之，乃去秦而为魏相，一年后卒。",
        "　　张良   (前   ? - 前  186)",
        "　　字子房。汉初名臣。本是韩国公子，秦灭韩，良欲为觊齁仇，乃使人击始皇于博浪沙，不中，遂更姓名，隐于下邳，而受太公兵法于圯上老人。后为高祖策画定天下，封留侯，晚好黄老，学辟谷之术。卒谥文成。",
        "　　张道陵  (34～155）",
        "　　道教的真正创教者，本名陵，东汉沛国（今安徽省宿县西北）人。以符水禁咒法惑人，从学者须出五斗米，故世称五斗米道。亦称为张天师。",
        "　　张飞  (？～271）",
        "　　字益德，一作翼德，三国蜀汉涿郡（今河北省涿县）人。少与关羽俱事刘备，号万人敌。官至车骑将军，封西乡侯。刘备伐吴，飞率兵会合，出兵前为部下所杀。谥桓。",
        "　　张丽华",
        "　　南朝陈后主妃，神采艳丽，聪慧强记，后主常抱置膝上，共商军国大事。国亡，与后主俱入井，隋军擒而斩之。后祀奉为十月芙蓉花神。",
        "　　张果老",
        "　　张居正（1525～1582）",
        "　　字叔大，号太岳，明江陵人。穆宗时入阁，神宗时为首辅，综核名实，信赏必罚，整饬纪纲，推行一条鞭法，为相十年，海内称治。卒谥文忠。着有太岳集、帝鉴图说等。",
        "　　张骞 （？～前114)",
        "　　字子文，西汉成固（今陕西省城固县）人。武帝时以军功封博望侯，旋拜中郎将，出使乌孙，分遣副使至大宛、康居、大夏等，自此西北诸国方与汉交通，使汉朝能与中亚交流，并打通前往西域的南北两条通路，引进优良马种、葡萄及苜蓿等。",
        "　　张旭",
        "　　字伯高，唐代吴（今江苏苏州）人，生卒年不详。为著名书法家，以草书最为知名，有草圣之称。其书法逸势奇状，连绵回绕，具有新风格。与李白歌诗、裴旻剑舞并称三绝。相传他往往大醉后呼喊狂走，挥洒落笔，有时以发濡墨而书，故世称为张颠、书颠。",
        "　　张士诚 （1321～1367）",
        "　　小字九四，元朝泰州（今江苏省泰县）人。元末群雄之一。本从事运盐业，后据吴中，自称吴王，后为明将徐达、常遇春所擒，自杀身亡。",
        "　　张三丰",
        "　　生卒年不详。宋武当道士，所创太极拳术，闻名当时，其法传于后世，称内家拳，又称武当派。或作张三峰。(2) 名全，一名君宝，号三丰，明朝辽东懿州（今黑山县境）人，生卒年不详。因其不修边幅，又称张邋遢。史称其辟谷数月不饥，事能前知，太祖、成祖求之，皆不得，英宗时赠为通微显化真人。",
        "地望分布",
        "　　河南青河郡，河南南阳郡，江苏吴郡，甘肃安定郡，甘肃敦煌郡，甘肃武威郡，河北范阳郡。",
    ]
}
BaiIiaXingPageModule[225] = {
    "index": "百家姓",
    "name": "孔",
    "content": [
        "历史来源",
        "　　「孔」源出 ;",
        "　　一 ; 出自「子」姓，以王父为字氏，据《史记．孔子世家》所载 ; 孔子，宋微子之后。宋襄公弗父何，弗父何生宋父周，周生世子胜，胜生正考父，考父生孔父嘉。五世亲尽，别为公族，姓孔氏。孔父嘉生木金父，木金父生睪夷，睪夷生防叔。防叔畏华氏之逼，奔鲁。其叔为叔梁纥，生子孔丘。",
        "　　二 ; 出自「姬」姓，据《姓考》所载，春秋时卫国有孔悝，以王父字为氏，其后有姬姓之孔氏。",
        "　　三 ; 出自「妫」姓，。春秋时陈国有孔宁，王父字为氏，其后有「妫」姓之孔氏。",
        "　　四 ; 又据《左传》所载，春秋时郑穆公之后有孔张，其支孙以王父字为氏，为郑国的姬姓孔氏。",
        "家族名人 ",
        "　　孔子 (前551～前479）",
        "　　名丘，字仲尼，东方文化的代表之一，儒家思想的创始人，春秋鲁人。生有圣德，学无常师，相传曾问礼于老聃 (老子，道家思想的创始人 )，学乐于苌弘，学琴于师襄。初仕鲁，为司寇，摄行相事，鲁国大治。后周游列国十三年，不见用，年六十八，返鲁，晚年致力整理古代经典。有弟子三千，身通六艺者七十二人，开平民教育先河，后世尊为至圣先师。亦称为孔子。可惜他的思想由汉武帝开始，广被中华帝国的统治者所利用，变成统治者用来约束人民思想的有效工具，大大影响了中华帝国的发展。",
        "　　孔融 (153～208）",
        "　　字文举，东汉曲阜人，孔子二十世孙。有俊才，为建安七子之一，汉献帝时为北海相，世称孔北海；立学校，表儒术，后拜大中大夫，为曹操所杀。",
        "　　孔祥熙 (1880～1967）",
        "　　字庸之，山西太谷人。留学美国耶鲁大学。历任国民政府委员、财政部长 ( 为当时中国的首富 )、行政院长、中央银行总裁等职。",
        "地望分布",
        "　　山东鲁郡。",
    ]
}
BaiIiaXingPageModule[226] = {
    "index": "百家姓",
    "name": "曹",
    "content": [
        "历史来源",
        "　　「曹」源出 ， 曹是为中国最古老的姓氏之一 ;",
        "　　一 ; 古代曹姓的后裔，在公元前十一世纪周武王克商后，受封于邾国 (今山东邹县 ) ，后被楚国所灭，其子孙或为朱氏，或为曹氏。",
        "　　二 ; 出自「姬」姓。以国为氏。文王第十三子叔振铎，受封于陶丘。后被宋国所灭，其国人以「曹」为氏。",
        "　　三 ; 据《新唐书》，为少数民族「昭武九姓」（见「何」氏）之一。隋唐时期，西北突部落建有康居国，其支庶分出小国「曹」国，在今乌孜別克斯坦撤马尔罕东北部。其族人有入中原定居者，于汉族融合，用汉姓「曹」",
        "家族名人",
        "　　曹参 (？～前190）",
        "　　字敬伯，汉初沛人。与萧何同佐高祖定天下，封平阳侯，继萧何为相，一遵萧规。卒谥懿。",
        "　　曹娥 （130～143）",
        "　　东汉上虞人。其父溺死于江中，不得尸骸。娥时年十四，沿江号哭十七昼夜，投江而死。经五日，抱父尸浮出。世传为孝女。",
        "　　曹操",
        "　　曹丕（187～226）",
        "　　字子桓，三国时魏武帝之子。汉建安十六年为五官中郎将，兼副丞相。父卒，嗣为丞相。建安二十五年代汉即帝位，在位七年。性好文学，博闻强识。作有典论及诗赋函札百余篇。卒谥文帝。",
        "　　曹植 （192～232）",
        "　　字子建，三国时魏武帝第三子，文帝之弟。十岁能属文，甚得武帝宠爱。文帝立，忌其才而不重用，封陈王。植才思捷，词藻富丽，尤长于诗。六朝诗人多受其影响，谢灵运尝言：天下才共一石，子建独得八斗。卒谥思，世称为陈思王。着有曹子建集十卷。",
        "　　曹雪芹 （1719～1764）",
        "　　名沾，字梦阮，号芹溪、芹圃，清汉军正白旗人，曹寅之孙。工诗善画。本世家子，后家道中落，因追怀往昔，相传着《红楼梦》八十回，未成病卒。高鹗为续作四十回，合为一百二十回，盛行于世。",
        "　　曹国舅",
        "　　传说中的八仙之一。学道山岩间，遇钟离权、吕洞宾二仙而得道。因相传为宋曹太后之弟，故称为曹国舅。",
        "地望分布",
        "　　安徽焦郡，江苏彭城郡，山东高平郡，山东巨野郡。",
    ]
}
BaiIiaXingPageModule[227] = {
    "index": "百家姓",
    "name": "严",
    "content": [
        "历史来源",
        "　　「严」源出 ， 严是为中国较为晚的姓氏之一 ;",
        "　　避讳改姓。据《元和姓纂》及《通志．氏族略．以谥为氏》所载，严氏本为庄氏。战国时楚王侣，谥号为「庄王」，其支庶子孙逐有庄氏。东汉时，汉明帝为刘庄，为讳避皇帝的名讳，令庄氏改姓「严」氏 ( 「庄」 ，「严」两字同义 )。西汉时的庄光后改为严光。魏晋之际，有复姓本姓「庄」者，故有庄，严二氏之分。",
        "家族名人",
        "　　严嵩 （1481～1568）",
        "　　字惟中，号介溪，明江西分宜人。世宗时为相，揽权贪贿，斥戮异己，后被劾罢官，以子世蕃仍纵恣，籍没，寄食墓舍而死。嵩善书，工诗文，着有钤山堂集。",
        "地望分布",
        "　　甘肃天水郡，陜西冯翔郡，陜西华阴郡。",
    ]
}
BaiIiaXingPageModule[228] = {
    "index": "百家姓",
    "name": "华",
    "content": [
        "历史来源",
        "　　「华」源出  ;",
        "　　出自「子」姓。以邑为氏。据《通志．氏族略．以邑为氏》所载，春秋时期，宋戴公之子考父食邑于华邑 ( 陜西华阴 ) ，其后有华氏。",
        "家族名人",
        "　　华胥",
        "　　古代神话中伏羲的母亲。",
        "　　华佗 （？～207)",
        "　　字符化，东汉谯县（今安徽省亳县）人。为当时名医，擅长外科手术，首用麻醉剂为病人开刀治疗，并创五禽戏之运动以助养生，后因忤曹操而遭杀害。医界或以他为行神。或作华陀、华坨。",
        "　　华衡芳 （1833～1902）",
        "　　字若汀，江苏金匮（今江苏无锡）人，清末数学家。官直隶州知府，精研算理。深通格致之学，蘅芳不仅曾筹划机器制造局，且翻译算学、地质诸书共十二种，一百六十余卷。后讲学二十年，成就甚众。其着译范围甚广，包括代数、三角数理、微积溯源、地学浅识、行素轩算稿、行素轩文存等。",
        "地望分布",
        "　　湖南武陵郡，山东平原郡，安徽沛国。",
    ]
}
BaiIiaXingPageModule[229] = {
    "index": "百家姓",
    "name": "金",
    "content": [
        "历史来源",
        "　　「金」源出;",
        "　　一 ; 为匈奴王后裔。据《前秦录》及《广韵》所载，汉朝时匈奴休屠王太子磾事汉武帝，武帝把太子磾化妆成金色人祭天，并赐姓「金」。",
        "　　二 ; 南北朝时，北方羌族和朝鲜半岛的新罗国皆有「金」氏。据《新唐书》记载 ; 新罗国王姓「金」。",
        "　　三 ; 改姓，《吴越备史》记载 ; 五代十国时，吴越认为避国王「钱镠」之「镠」( 「镠」与「刘」古因相通 ) ，改刘氏为金氏。",
        "家族名人",
        "　　金日磾 (前134～前86)",
        "　　字翁叔，西汉人。本匈奴休屠王太子，武帝时为马监，以功拜车骑将军。武帝崩，与霍光同受遗诏辅政，卒谥敬。相传金日磾为马夫、车夫及骡马商的行神。",
        "地望分布",
        "　　江苏彭城郡。",
    ]
}
BaiIiaXingPageModule[230] = {
    "index": "百家姓",
    "name": "魏",
    "content": [
        "历史来源",
        "　　「魏」源出  ;",
        "　　一 ; 出自「姬」姓，以邑名为氏，据《新唐书．宰相世系表》及《元和姓纂》所载，春秋时，毕公高之裔孙毕万，在晋国为大夫。公元前661年，晋献公封毕万于为邑 (今山西芮城县 ) 。毕万裔孙魏斯，与赵，韩，三家分晋，各自建国。魏斯建魏国，都安邑 ( 山西夏县 ) ，为魏文侯，成为战国七雄之一。公元前225年被秦国所灭，原王族散居各地，以原国名为氏。",
        "　　二 ; 据《史记》记载，秦国穰侯魏冉，奔出自芈姓，后改为魏氏。",
        "家族名人",
        "　　魏文侯",
        "　　魏无忌 （？～前243)",
        "　　战国时魏昭王的幼子、魏安厘王的异母弟。天性仁厚，好养士，有贤名，曾用侯嬴计，却秦救赵；秦伐魏时，率领五国兵归救魏，大破秦兵，声名威振天下。后被谗废用，遂抑郁不乐沉迷于酒色，不久即因饮醇酒多近妇女，病酒而死。与齐孟尝君、赵平原君、楚春君并称为战国四公子。因魏安厘王封其地在信陵，故亦称为信陵君。",
        "　　魏征 （580～643）",
        "　　字玄成，唐曲城（今山东省掖县）人。太宗时拜谏议大夫、检校侍中，谏诤剀切，累官至左光禄大夫，封郑国公。后总修周、隋等史，多所损益，时称良史。以疾卒于官，谥文贞。",
        "地望分布",
        "　　河北巨鹿郡，山东任城郡。",
    ]
}
BaiIiaXingPageModule[231] = {
    "index": "百家姓",
    "name": "陶",
    "content": [
        "历史来源",
        "　　「陶」源出  ;",
        "　　一 ; 以地名为氏。据《姓苑》所载，上古有陶唐氏 ( 尧帝 )，居于陶邑 ( 山东定陶县 ) ，其后有陶氏。",
        "　　二 ; 以官为氏，据《左传》所载，周初，武王弟康叔受封为卫侯，分到「殷民七族」，其中有「陶」氏，即掌管制作陶器的工匠。又据《元和姓纂》所载，周朝初年，虞阏之父虞思为陶正，即掌管陶器制作的官职。其后有陶氏。",
        "家族名人",
        "　　陶侃 (259～334）",
        "　　晋代名臣，浔阳（今湖北省黄梅县北）人，字士行，明帝时拜征西大将军，都督荆襄军事，平定苏峻之乱，初为广州刺史，每日搬运砖块以锻炼体力，为人忠顺勤劳，时人比之诸葛亮。",
        "　　陶弘景 (452～536）",
        "　　南朝秣陵人，字通明。工草隶，好道术；齐高帝时，为诸王侍读，梁时隐于句曲山，自号华阳隐居；武帝时，礼聘不出，然朝廷大事，无不咨询，时称为「山中宰相」；卒赠大中大夫，谥贞白先生。著述甚多，其本草集注一书，是将本草经依药性与种属重新整理而成。",
        "　　陶潜 (365～427）",
        "　　东晋浔阳柴桑人，陶侃的曾孙，一名渊明，字符亮，安贫乐道，尝作五柳先生传以自比，世称靖节先生，诗名尤高，堪称古今隐逸诗人的宗师。",
        "地望分布",
        "　　河南济阳郡，安徽丹阳郡，江西浔阳郡。",
    ]
}
BaiIiaXingPageModule[232] = {
    "index": "百家姓",
    "name": "姜",
    "content": [
        "历史来源",
        "　　「姜」源出  ;",
        "　　姜氏为中华民族最古老的姓之一，炎帝就是姓「姜」。",
        "　　一 ; 以地名为氏。据《说文解字》及《元和姓纂》所载，神农 ( 炎帝 ) 生于姜水，故以为姓。姜太公 ( 姜尚 ) ，封于齐国，后为田和所灭，子孙分散，逐为「姜」氏。",
        "　　二 ; 据《诗经》所载，相传周族始祖后稷之母为「姜嫄」，乃姜姓有邰氏之女。",
        "家族名人",
        "　　姜嫄",
        "　　传为有邰氏之女，「帝喾」妃，周始祖后稷之母。于野外践踏巨人足迹而生稷。见《史记˙卷四˙周本纪》。或作姜原。",
        "　　姜维 (202～264）",
        "　　字伯约，三国蜀汉天水冀县人。本为魏将，后归附蜀，为诸葛亮重用，任征西将军。诸葛亮死后，继领其军。魏军攻蜀，后主刘禅降魏，姜维被迫投降。后欲谋复国，事败被乱军所杀。",
        "　　姜夔 (1155～1221）",
        "　　字尧章，自号白石道人，宋鄱阳人。终生未出仕，常往来于鄂、赣、皖、浙、苏之间，后病死于杭州。姜氏精通音律，常自度曲，工诗，词尤精。夔词以句琢字炼、清丽婉约见胜。在白石道人歌曲六卷中，有十七首词曲均有古工尺字旁谱，为研究词乐的重要资料。宁宗广元三年进大乐议一卷及琴瑟考古图一卷，论评古今的乐制问题，建议整理宫廷音乐，但未被采纳，今已失传。着有白石道人诗集、词集、歌曲等。",
        "地望分布",
        "　　甘肃天水郡。",
    ]
}
BaiIiaXingPageModule[233] = {
    "index": "百家姓",
    "name": "戚",
    "content": [
        "历史来源",
        "　　「戚」源出;",
        "　　一 ; 以邑名为氏。据《姓谱》所载，春秋时卫国大夫孙林父食采邑于戚邑 ( 河南濮阳市 ) ，其后有戚氏。国亡后，子孙逃往东海。",
        "家族名人",
        "　　戚夫人",
        "　　生卒年不详。汉高祖的宠姬，生赵王如意。高祖屡欲立为储君，不果。高祖崩，，吕后酖赵王；杀戚夫人，去其耳目手足，置于厕所中，称为「人彘」。",
        "　　戚继光 (1528～1585？）",
        "　　明代定远人，一说蓬莱人。世袭登州卫指挥佥事，好读书，通经史大义，历官浙江参将、福建总兵官等，平倭寇，功最着，总理苏州、昌平、保定三镇练兵事，节制严明，边备修饬，后改官广东，罢归，卒谥武毅。着有纪效新书、练兵实记、止止堂集等。",
        "地望分布",
        "　　山东东海郡。",
    ]
}
BaiIiaXingPageModule[234] = {
    "index": "百家姓",
    "name": "谢",
    "content": [
        "历史来源",
        "　　「谢」源出;",
        "　　一 ; 以国名为氏。据《元和姓纂》所载，周宣王分封其舅父申伯于谢国，在河南唐河县，后子孙以国为氏。",
        "　　二 ; 据《旧唐书．文苑传》所载 ; 唐代谢偃的祖父孝政，本姓直勒氏，是鲜卑族人，后改姓为「谢」氏。",
        "家族名人",
        "　　谢安 (320～385）",
        "　　字安石，东晋阳夏人。少有重名，征辟皆不就，隐居东山，年四十余，始出为桓州司马。淝水之战任征讨大都督，指导策划，克敌有功，累官至太保，卒赠太傅，故世称谢太傅。",
        "　　谢玄 (343～388）",
        "　　东晋名将，谢安侄子，阳夏人，字幼度，具经国才略，以精锐八千，破前秦苻坚百万大军于淝水，拜前将军，封康乐县公，卒谥献武。",
        "　　谢灵运 (385～433）",
        "　　南朝文学家，谢玄之孙，小名客儿，时称谢客。袭封康乐公，又称谢康乐。少好学，工书画，文章之美与颜延之为江左第一。性好山水，肆意遨游，所至辄为题咏，以致其意。其诗开创山水写实派风格。初为太尉参军，后徙广州，有诗传世。",
        "地望分布",
        "　　河南陈留郡。",
    ]
}
BaiIiaXingPageModule[235] = {
    "index": "百家姓",
    "name": "邹",
    "content": [
        "历史来源",
        "　　「邹」源出;",
        "　　一 ; 以国名为氏。据《说文解字》所载，春秋初期有邾娄国，为鲁国的附庸小国，在山东邹县，战国时鲁穆公将「邾娄」改名为「邹」。后被楚国所灭。其后人以「邹」为氏。",
        "　　二 ; 出自子姓。据《元和姓纂》所载，为春秋时宋愍公之后，正考父食采邑于邹邑，其后亦有「邹」氏。",
        "家族名人",
        "　　邹鲁氏",
        "　　其女为帝喾之妃。黄帝战败蚩尤，千其民于「邹鲁」之地。",
        "　　邹衍 (前305?～前240?）",
        "　　战国时齐人。长于思辩，倡九州岛说、五德终始说，为阴阳家的先驱。著书立说，名重诸侯，燕昭王曾师事之。因其言论迂大而闳辩，齐人称之为「谈天衍」。",
        "地望分布",
        "　　河南范阳郡。",
    ]
}
BaiIiaXingPageModule[236] = {
    "index": "百家姓",
    "name": "喻",
    "content": [
        "历史来源",
        "　　「喻」源出;",
        "　　一 ; 西汉时，苍梧太守谕猛，始改姓为「喻」。东晋时有谕归，本为喻猛之后裔，改姓为「喻」。此后史书无谕姓，晋改为「喻」。",
        "　　二 ; 赐姓，据《宋史．儒林传》所载，南宋时有愈，为梁愈药之后，皇帝赐姓为「喻」。",
        "家族名人",
        "　　喻猛",
        "　　字骄孙，东汉人，和帝 (89-104) 时任苍梧太守，以清白为治，郡人颂之。",
        "地望分布",
        "　　湖北江夏郡，江西南昌郡。",
    ]
}
BaiIiaXingPageModule[237] = {
    "index": "百家姓",
    "name": "柏",
    "content": [
        "历史来源",
        "　　「柏」源出;",
        "　　一 ; 据《姓氏考略》所载，春秋时有柏国 ( 河南西平县 ) ，为楚国所灭，子孙以国名为姓。又据《史记．秦本纪》所载，大费拜受佐舜，调训鸟兽，鸟兽多训服，是为柏翳，舜赐姓为「嬴」。",
        "家族名人",
        "　　柏濩",
        "　　神话传说中的蜀王。《汉˙扬雄˙蜀王本纪》：蜀王之先名蚕丛，后代名曰柏濩，后者名凫，此三代各数百岁，皆神化不死。",
        "　　柏高",
        "　　神话传说中的仙人。《山海经˙海内经》：山青水之东，有山名曰 ; 「肇山」有人名曰柏高，柏高上下于此，至于天。郭璞˙注：「柏子高，仙者也。」",
        "地望分布",
        "　　河南魏郡，山东济阳郡。",
    ]
}
BaiIiaXingPageModule[238] = {
    "index": "百家姓",
    "name": "水",
    "content": [
        "历史来源",
        "　　「水」源出;",
        "　　水是中国历史上比较晚出的姓氏之一，据《姓氏五书》云 ; 水是当指水为氏，如河氏，淮氏，湖氏之类。清代浙江鄞县多水氏。或为水丘氏所改。",
        "家族名人",
        "　　共工氏",
        "　　古代神话中人物，自称水德，相传为水姓之祖。古代水官亦称共工。",
        "地望分布",
        "　　浙江吴兴郡，浙江临安郡。",
    ]
}
BaiIiaXingPageModule[239] = {
    "index": "百家姓",
    "name": "窦",
    "content": [
        "历史来源",
        "　　「窦」源出;",
        "　　「窦」出自「姒」姓。已事为氏，据《风俗演义》及《新唐书．宰相世系表》所载，夏朝夏后氏帝相失国被杀。其妃有仍方怀孕，从「窦」中逃出，奔归娘家有仍 (山东济宁市 )，生有遗腹子少康。后少康中兴，为夏王。二子曰「杼」，曰「龙」，留居有仍，逐为「窦」氏。",
        "　　又 ; 古代氐族 (分布在陜西，甘肃，四川一带)亦有「窦」氏。",
        "家族名人",
        "　　窦太后 (前205 ~ 前135)",
        "　　中华帝国黄老学派的最后一个代表人物，名「漪」，河北清河郡观津人，在吕后时被选入宫。吕后赏赐每个诸侯王宫女五名，窦漪也在被选之列。因家在清河，窦姬请求分配的宦官把她分到离家较近的赵国去。但宦官把事给忘了，她被分配到代国去，就这样她到了代国，但代王刘恒非常喜欢她，和她生了刘启和刘武。窦姬信奉黄老之学(道家学说，「黄」指黄帝，「老」指「老子」。主张无为而治，宽政待民) 在她的影向下，景帝刘启以黄老治国，在以后的日子里黄老思想成为治世的主流思想直到窦太后逝世为止，历经「文，景」二朝，再她逝世前汉武帝也不敢重用儒生。",
        "　　窦宪 (? ～公元92）",
        "　　字伯度，东汉平陵人。窦融之曾孙。和帝时曾出塞三千里，大破匈奴，乃令班固作铭，刻石燕然山上，纪汉功德。还拜大将军，族党满朝，后因专权用事，为和帝赐死。",
        "　　窦建德 (573～621）",
        "　　隋朝漳南人。隋末据河北，自称夏王，为唐太宗擒杀。",
        "地望分布",
        "　　陜西扶风郡，河北观津郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[240] = {
    "index": "百家姓",
    "name": "章",
    "content": [
        "历史来源",
        "　　「章」源出;",
        "　　「章」出自「姜」姓。已国为氏，据《通志．氏族略》所载，齐太公（姜尚）支孙封国于「鄣」（山东章丘县），公元前664年被齐国所灭，子孙去邑旁为章氏。",
        "家族名人",
        "　　章邯",
        "　　生卒年不详。秦代名将，与项羽战于巨鹿及棘原，却因赵高专权，拒却章邯所请，遂降羽，被立为雍王，王咸阳以西，都于废邱；后为汉将韩信所灭。",
        "　　章学诚（1738～1801）",
        "　　字实斋，清会稽（今浙江省绍兴县）人。乾隆进士，官国子监典籍。精于史学，以纂修方志，名重于时。所著有文史通义、校雠通义、史籍考等。",
        "地望分布",
        "　　江西豫章郡。",
    ]
}
BaiIiaXingPageModule[241] = {
    "index": "百家姓",
    "name": "云",
    "content": [
        "历史来源",
        "　　「云」源出;",
        "　　一 ﹕「云」出自「妘」姓。以国名为氏，据《左传》所载，古代「妘」国，亦作「郧」国，故址在湖北郧县，后为楚国所灭，其后有「云」，「芸」，「郧」，「员」氏。",
        "　　二 ﹕ 为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「牒云氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「云」氏。",
        "家族名人",
        "　　云英",
        "　　唐代女子，相传遇裴航于蓝桥驿，遂结为夫妻，后夫妇俱入玉峰，食丹仙去。",
        "地望分布",
        "　　河南河南郡。",
    ],
}
BaiIiaXingPageModule[242] = {
    "index": "百家姓",
    "name": "苏",
    "content": [
        "历史来源",
        "　　「苏」源出  ;",
        "　　一 ﹕「苏」出自「己」姓。以国名为氏，据《元和姓纂》所载，周武王时，司寇忿生，受封于苏国，后迁于温，称为苏忿生，春秋时，苏国被狄族所灭，其子孙以国名为氏。",
        "　　二 ﹕ 为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「拔略氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「苏」氏。",
        "家族名人",
        "　　苏秦 （前？～前317）",
        "　　字季子，洛阳人，战国时纵横家。与张仪同学于鬼谷子。早年曾外出游说，然穷困而归，后佩六国相印，为纵约长，使秦不敢东出函谷关，达十五年之久。后客于齐，被杀。",
        "　　苏武 （前143？～前60）",
        "　　字子卿，西汉杜陵人（今陕西省长安县东南）。武帝时出使匈奴，单于胁降，不屈，被留十九年，仍持汉节。昭帝时，匈奴与汉和亲，始得还，拜典属国。宣帝立，赐爵关内侯，图形麒麟阁。其著作流传于今者，有诗四首、答李陵诗及别李陵等。",
        "　　三苏",
        "　　宋苏洵与二子苏轼、苏辙皆有文名，世称为「三苏」。宋˙苏轼˙次韵子由使契丹至涿州见寄诗四首之三：「毡毳年来亦甚都，时时舌问三苏。」醒世恒言˙卷十一˙苏小妹三难新郎：「老苏生下两个孩儿：大苏﹑小苏。……天下称他兄弟，谓之二苏。称他父子，谓之三苏。」",
        "　　苏轼 （1038～1101）",
        "　　字子瞻，宋眉州眉山人，为苏洵长子。诗、词、文、书、画均有名，为文雄浑奔放，诗亦清疏隽逸，为北派大宗。王安石倡行新法，轼上书痛陈不便，得罪安石，被连贬数州。在黄州时，筑室于东坡，自号东坡居士，后累官至端明殿侍读学士。卒谥文忠。着有东坡集、东坡词等。",
        "地望分布",
        "　　河南河内郡，陜西扶风郡，陜西武功郡。",
    ]
}
BaiIiaXingPageModule[243] = {
    "index": "百家姓",
    "name": "潘",
    "content": [
        "历史来源",
        "　　「潘」源出  ;",
        "　　一 ﹕「潘」出自「姬」姓。以国名为氏，据《广韵》和《元和姓纂》所载，周文王后毕公之子季孙，食邑于「潘」，其子孙以邑名为氏。",
        "　　二 ﹕出自「芈」，以字为氏。据《通志．氏族谱》及《潘岳家谱》载，春秋时楚之公族，潘崇氏也。楚成王时任世子商臣之太师。",
        "　　三 ﹕ 为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「拔略罗氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「潘」氏。",
        "家族名人",
        "　　潘美",
        "　　字仲询，大名人，为宋初名将。从石守信平扬州﹑定金陵﹑北伐太原皆有功，官至忠武军节度使，封韩国公，卒谥武惠。",
        "　　潘安 （？～300)",
        "　　字安仁，西晋中牟（今河南省中牟县东）人。美姿仪，出洛阳道，妇人尝萦绕投果。为文词藻绝丽，尤长于哀诔，有悼亡诗，为世传诵。后孙秀诬以谋反，族诛。亦称为潘河阳﹑潘安。",
        "地望分布",
        "　　河南荥阳郡，河北广宗郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[244] = {
    "index": "百家姓",
    "name": "葛",
    "content": [
        "历史来源",
        "　　「葛」源出;",
        "　　一 ﹕「葛」出自「嬴」姓。以国名为氏，夏代，有诸侯方国「葛」国，在今河南长葛县，《孟子．腾文公》载; 汤居毫，与葛伯为邻。其后有葛氏。",
        "　　二 ﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「贺葛氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「葛」氏。",
        "　　又传说葛氏为「古葛天氏之裔」，或云在伏羲之前。",
        "家族名人",
        "　　葛天氏",
        "　　传说中的上古帝王，其治世不言而信，不化而行，是远古社会理想化的政治领袖人物。晋˙陶渊明˙五柳先生传：「无怀氏之民欤，葛天，鞴坏谢」南朝梁˙刘勰˙文心雕龙˙明诗：「昔葛天騧离膉炕玄鸟在曲；黄帝云门，理不空绮。」",
        "　　葛洪（约250～330）",
        "　　晋句容人，字稚川，自号抱朴子。好神仙导养之法，元帝召为丞相掾，因平贼有功，赐爵关内侯。着抱朴子一书，述炼丹之法，建立长生理论。又相传为油漆工的祖师爷。",
        "地望分布",
        "　　河南顿丘郡，安徽梁国郡，江苏句荣郡。",
    ]
}
BaiIiaXingPageModule[245] = {
    "index": "百家姓",
    "name": "奚",
    "content": [
        "历史来源",
        "　　「奚」源出;",
        "　　一 ﹕「奚」出自「任」姓。据《姓源》载;夏朝奚仲任车正（掌管马车的官），原职于薛（山东滕县）后迁于邳（山东微山县），其后代以「奚」为氏。",
        "　　二 ﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「薄奚氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「葛」氏。",
        "家族名人",
        "　　奚容蒧",
        "　　春秋时卫国人，志气英迈，为孔子三千弟子中七十二贤人之一。",
        "地望分布",
        "　　安徽焦国郡。",
    ]
}
BaiIiaXingPageModule[246] = {
    "index": "百家姓",
    "name": "范",
    "content": [
        "　　「范」源出;",
        "　　以邑为氏，据《元和姓纂》及《通志．氏族略》载，帝尧裔孙刘累之后，在周为唐杜氏，迁于杜邑（陜西西安东南），时称杜伯。周宣王杀杜伯，其子逃奔晋国担任士师。曾孙士会。食邑于范邑（河南范县），世称范武子，子孙逐有范氏。",
        "家族名人",
        "　　范蠡",
        "　　范雎（前？～前225)",
        "　　字叔。战国时策士，魏人，善口辩，以远交近攻的策略游说秦昭王，昭王悦，官拜秦相，封应侯。",
        "　　范增 （前275～前204)",
        "　　秦末巢（今河南省睢县南）人，项羽的谋士，辅项羽称霸诸侯，羽中汉反间而疑范增，遂弃羽而归，疽发于背而卒。亦称为亚父。",
        "　　范仲淹 （989～1052）",
        "　　范成大（ 1126～1193）",
        "　　字致能，号石湖居士。宋江苏省吴县人，有文名，尤工诗，与陆游、杨万里齐名，官至参知政事。着有石湖集、揽辔录、桂海虞衡志等。",
        "地望分布",
        "　　山东高平郡。",
    ]
}
BaiIiaXingPageModule[247] = {
    "index": "百家姓",
    "name": "彭",
    "content": [
        "历史来源",
        "　　「彭」源出;",
        "　　一﹕以国名为氏，据《元和姓纂》所载，大彭为商代的诸侯，大彭国在江苏徐州氏。其后有彭氏。一说大彭即为「彭祖」。",
        "　　二﹕为古代少数民族的姓氏。据《晋书》所载，安定胡水胡有彭氏。又据《姓氏考略》云;西羌，南蛮皆有彭氏。",
        "家族名人",
        "　　彭祖",
        "　　尧的臣子籛铿。陆终氏第三子，帝颛顼之孙，历虞夏至商，相传活了七﹑八百岁。因封于彭城，故称为彭祖。后世用以比喻长寿。",
        "　　彭蒙",
        "　　战国齐的隐士，田骈之师，思想与庄子的齐是非说相近。",
        "　　彭越",
        "　　字仲，昌邑人。为汉初功臣。佐高祖定天下，封梁王。后因人告他谋反而被杀，被刘邦诛杀他的三族。",
        "　　彭绍升",
        "　　字允初，号尺木，又号知归子及二林居士，际清是他受菩萨戒的法名。江苏长洲县人。清代著名的居士。乾隆三十四年进士及第，授县官，辞不就。因结织罗有高与阅读明朝高僧紫柏的全集，受到感动而归心佛法，尤深信净土。他在净土教义上除莲池外，最推重省庵。平日常闭关念佛，发愿回向。着有一行居士集、居士传、阿弥陀经约论、一乘决疑论等。对清代净土信仰的推展有重要的影响。",
        "地望分布",
        "　　甘肃陇西郡，江西宜春郡。",
    ]
}
BaiIiaXingPageModule[248] = {
    "index": "百家姓",
    "name": "郎",
    "content": [
        "历史来源",
        "　　「郎」源出;",
        "　　一﹕出自「姬」姓，以地名为氏，据《元和姓纂》所载，春秋时鲁懿公之孙费伯，筑郎城居之（在山东曲阜），其后有郎氏。",
        "　　二﹕历史上南匈奴的姓氏。",
        "家族名人",
        "　　朗士元",
        "　　字君胄，唐代定州人。天宝年间（744-755）进士，官至郢州刺使。善写诗，与钱起齐名。",
        "　　郎静山 （1892～1995）",
        "　　江苏省人。国际闻名之摄影家。十三岁开始接触摄影，二十五岁成为中国第一名摄影记者。在中国摄影史上，郎氏是首位人体摄影拍摄者，首位摄影课程之教师，首位入选国际摄影沙龙之中国摄影家。以自创集锦摄影闻名于世。",
        "地望分布",
        "　　河北中山郡，山东魏郡。",
    ]
}
BaiIiaXingPageModule[249] = {
    "index": "百家姓",
    "name": "鲁",
    "content": [
        "历史来源",
        "　　「鲁」源出  ;",
        "　　一﹕出自「姬」姓，以国名为氏，据《姓谱》和《元和姓纂》所载，西周初年，周公旦之子伯禽受封于鲁国（山东），传三十四代，九百余年，至鲁顷公时，灭于楚国，迁至下邑，子孙逐以国名为氏。",
        "家族名人",
        "　　鲁仲连",
        "　　战国时齐人。曾游于赵，为赵国解除危难，平原君欲赠与千金却推辞不受。喜替人排难解纷而不肯仕宦任职。后称替人解纷排难的人为鲁仲连。如：他是个古道热肠的鲁仲连，专门替人排解纷争。亦称为鲁连。",
        "　　鲁肃 （173～217)",
        "　　字子敬，东城人（今安徽省定远县东南）。三国时名将，个性方正严谨，富而好施，长于文章，思虑深远，有过人之明。在赤壁之役，建议结合刘备来抵御曹操，并辅佐周瑜大败曹军，为孙权所器重，官拜奋武校尉，转横江将军。",
        "　　鲁迅 （1881～1936）",
        "　　中国现代小说家。浙江省绍兴县人，本名周树人。作品思想深刻，具体反映中国三十年代的社会状况；在艺术上，融冶中外小说的技法而别开新局，好以讽刺的笔法，针砭中国社会的病态与人性弱点。代表作有狂人日记、阿Ｑ正传等，作品编为鲁迅全集二十卷。",
        "地望分布",
        "　　陜西扶风郡，河南新蔡郡。",
    ]
}
BaiIiaXingPageModule[250] = {
    "index": "百家姓",
    "name": "韦",
    "content": [
        "历史来源",
        "　　「韦」源出;",
        "　　一﹕出自「祁」姓，以国名为氏，据《通志．氏族略》所载，在夏朝为御龙氏，在商朝为豕为氏。又《唐书．宰相世系表》所载，豕韦国（河南滑县南）之后有韦氏。",
        "　　二 ﹕据《汉书．西域传》所载，汉代疏勒国亦有韦氏。",
        "　　三 ﹕传说秦汉之际韩信曾藏身于南粤（两广一带）为避仇，以「韩」字的半边「韦」为姓。今广西僮族多韦氏。又传说颛顼孙大彭为夏诸侯，少康封其别孙元哲于豕韦。",
        "家族名人",
        "　　韦昭 （204～273）",
        "　　字弘嗣，三国吴云阳（今江苏省丹阳县）人。好学能文，孙皓时为侍中，领修国史，因持正敢谏为孙皓所杀。所注孝经、论语、国语，均有名于世。",
        "　　韦庄",
        "　　字端己，生卒年不详，前蜀杜陵（今陜西省长安县东南）人。本为唐末进士，后入蜀依附王建，掌书记。及王建据蜀称帝，蜀开国制度皆庄所定，累官吏部尚书，同平章事，谥文靖，工诗词。着有浣花集，所为秦妇吟长诗，尤有名于世。",
        "地望分布",
        "　　陜西京兆郡。",
    ]
}
BaiIiaXingPageModule[251] = {
    "index": "百家姓",
    "name": "昌",
    "content": [
        "历史来源",
        "　　「昌」源出  ;",
        "　　一﹕出自「妊」姓，以国名为氏，据《通志．氏族略》所载，传说上古有昌意，为黄帝之子，「嫘祖」（黄帝的后）所生。",
        "家族名人",
        "　　昌意",
        "　　黄帝二十五子中的其中一位，为嫘祖所生，其后代为「昌」氏。",
        "　　昌容",
        "　　为殷商王之女，修道于常山，食蓬萦根二百余年，颜如二十许。能用紫草来染工，挣德的钱用来给有病的人。",
        "地望分布",
        "　　河南汝南郡，山东东海郡。",
    ],
}
BaiIiaXingPageModule[252] = {
    "index": "百家姓",
    "name": "马",
    "content": [
        "历史来源",
        "　　「马」源出;",
        "　　一﹕出自「嬴」姓，以邑名为氏，据《元和姓纂》所载，赵惠文王二十九年（前270年），赵国大将赵奢因战公，受封于马服（河南邯郸），称为马服君。其后有马服氏，简为马氏。",
        "　　二 ﹕据《金史》所载，西域人马庆祥，入居临洮狄道，逐以马为氏。",
        "　　三 ﹕据《元史》所载，元之月乃和，以祖为金国马步指挥使，因改姓马。名祖常。",
        "　　四 ﹕元明时期，回族依斯兰教徒多用马氏。",
        "家族名人",
        "　　马援　（前14～49）",
        "　　字文渊，东汉茂陵（今陕西省兴平县东北）人。初依隗嚣，后归光武，拜伏波将军，平交趾。援曾有「大丈夫老当益壮」及「男儿要当死于边野，以马革裹尸还葬」等语。世称「马伏波」。",
        "　　马超",
        "　　字孟起，茂陵人。勇冠西凉，乃凉州太守马腾之子，后因其父被曹操杀死，遂起二十万兵伐洛阳报父仇。杀得曹操割须弃袍，事败后投靠张鲁。曾与张飞在葭萌关大战三日三夜，其后加入刘备军，成为五虎将之一。",
        "　　马谡（190～228）",
        "　　三国时蜀臣，马良之弟，才气过人，好论军计，尝谓用兵之道，攻心为上，攻城为下，诸葛亮深加器重，后与魏将张合战于街亭，为合所败，下狱而死，亮为之流涕。",
        "地望分布",
        "　　甘肃扶风郡，山西平阳郡。",
    ]
}
BaiIiaXingPageModule[253] = {
    "index": "百家姓",
    "name": "苗",
    "content": [
        "历史来源",
        "　　「苗」源出;",
        "　　一﹕以邑名为氏，据《风俗通义》及《通志．氏族略．以邑为氏》所载，公元前547年，楚国因若敖之乱，楚大夫伯棼被杀，其子贲皇逃奔国，受封于苗邑（河南济源县），子孙逐以邑名「苗」为氏。",
        "家族名人",
        "　　苗发",
        "　　唐代壶关人。擅长写诗，与卢纶，吉中孚，司空暑，钱起等九人齐名，合称大历十大才子。",
        "地望分布",
        "　　浙江东阳郡。",
    ]
}
BaiIiaXingPageModule[254] = {
    "index": "百家姓",
    "name": "凤",
    "content": [
        "历史来源",
        "　　「凤」源出;",
        "　　一﹕据《左传》云，高辛帝时，凤鸟氏为历正（掌管历法的官），盖以职事为氏。一说，凤氏即为风氏。",
        "家族名人",
        "　　凤鸟氏",
        "　　相传为上古时代高辛氏帝喾时的历正。",
        "　　凤纲",
        "　　西汉渔阳人，相传曾采集百草花制药，服食后成仙而去。",
    ]
}
BaiIiaXingPageModule[255] = {
    "index": "百家姓",
    "name": "花",
    "content": [
        "历史来源",
        "　　「花」源出;",
        "　　是「华」所分出。参见该条。又据《姓苑》云，花氏出自何氏，由音变而成。",
        "家族名人",
        "　　花木兰",
        "　　改易男装代父从军的孝女。古乐府有木兰诗咏其事。姚莹康輶纪行以为北魏人，宋翔凤过庭录以为隋恭帝时人，程大昌演繁露以木兰诗中有可汗大点兵语。则以为非隋即唐之人。姓氏不可考，或以为姓花。",
        "　　花云",
        "　　明初名将，死于陈友凉。",
        "地望分布",
        "　　山东东平郡。",
    ]
}
BaiIiaXingPageModule[256] = {
    "index": "百家姓",
    "name": "方",
    "content": [
        "历史来源",
        "　　「方」源出;",
        "　　出自「姬」姓，以字为氏。周宣王有大臣方叔。见《诗经．小雅．采芑》云﹕「方叔止。」「方叔，卿士也。支孙以王父字「方」为氏。又，《风俗演义》云﹕相传为古帝榆罔之子方雷氏之后。",
        "家族名人",
        "　　方叔",
        "　　西周宣王（前八世纪）时的卿士，征伐古族玁狁有功。",
        "　　方孝孺（1357～1402）",
        "　　字希直，一字希古，明建文帝之忠臣，宁海人。以明王道﹑致太平为己任，工文章，名书室曰正学，官侍讲学士，因拒燕王草即帝位诏之命而被杀，福王时追谥文正。着有侯成集﹑希古堂稿等。",
        "　　方苞 （1668～1749）",
        "　　字凤九，号灵皋，晚号望溪，清安徽桐城人。官至侍郎。论学以宋儒为宗，说经推衍程朱之学，尤致力于春秋三礼。文学韩欧，严于义法，为桐城派之宗主。着有周官辨﹑春秋通论﹑礼记析疑﹑望溪文集等。",
        "地望分布",
        "　　河南河南郡。",
    ]
}
BaiIiaXingPageModule[257] = {
    "index": "百家姓",
    "name": "俞",
    "content": [
        "历史来源",
        "　　「俞」源出;",
        "　　据《通志．氏族略》载，古代有俞跗，善医，为「俞」姓之始。见于《史记》。",
        "家族名人",
        "　　俞伯牙",
        "　　春秋时人，传说以精于琴艺著名，惟知有钟子期完全理解琴意，知其志在高山流水。子期死后，伯牙终身不复鼓琴。",
        "　　俞大猷 （？～1580）",
        "　　字志辅，号虚江，晋江人，为明代名将。读书而知兵法，嘉靖武举，擢广东都司，平交黎，进参将，移浙东，屡破倭寇，升为总兵，复镇两广，剿灭群盗，平定猺乱，威震南服，号称俞家军，卒谥武襄。",
        "地望分布",
        "　　河北河间郡，湖北江陵郡。",
    ]
}
BaiIiaXingPageModule[258] = {
    "index": "百家姓",
    "name": "任",
    "content": [
        "历史来源",
        "　　「任」源出;",
        "　　一﹕「任」（妊）姓为中国最古老的姓之一。《左传正义》云﹕太昊后，谢，章，薛，舒，吕，祝，终，泉，毕，过，此十国皆「任」性也。",
        "　　二﹕出自「风」姓，以国名为氏。据《唐书．宰相世系表》及《通志．氏族略．以国为氏》所载，周代任国，在山东济宁县，其后有「任」氏。",
        "家族名人",
        "　　太任",
        "　　亦作太妊，周文王之母，为「任」姓，史称「太任」。",
        "　　任昉 （460～508）",
        "　　字彦升，南朝梁博昌人（今山东省博兴县南）。武帝时为义兴、新安太守，有政声。见宫中内藏四部古籍篇卷纷杂，于是亲自校雠勘定。着有杂传、地记等书。卒谥敬。",
        "地望分布",
        "　　山东乐安郡。",
    ]
}
BaiIiaXingPageModule[259] = {
    "index": "百家姓",
    "name": "袁",
    "content": [
        "历史来源",
        "　　「袁」源出;",
        "　　出自「妫」姓，据《通志．氏族略．以字为氏》所载，「袁」亦作「辕」，「爰」。陈胡公之裔。十八世孙庄伯生诸，字伯爰。伯爰之孙涛涂，以王父字为氏，称「爰涛涂」。亦作袁涛涂。世代为陈上卿。其后有「袁」氏。",
        "家族名人",
        "　　袁绍 （？～202)",
        "　　字本初，东阳汝阳（今河南省商水县西北）人。曾起兵讨董卓，后据河北，与曹操战于官渡，大败，发病而死。",
        "　　袁崇焕 （？～1630）",
        "　　字元素，明东莞人。有胆略，好谈兵。万历进士，天启间以御清兵着绩，累官至佥都御史，巡抚辽东。崇祯时为兵部尚书兼右副都御史，督师蓟辽，闻警入援京师，遭谗而被磔于市。",
        "　　袁枚 （1716～1797）",
        "　　字子才，号简斋，清钱塘（今浙江省杭县）人。乾隆进士，由翰林为知县，后弃官，筑随园于江宁城西，以吟咏为乐，世称随园先生。论诗主性灵，品评古今，时有新解。着有小仓山房诗文集、随园诗话、随园随笔等。",
        "　　袁世凯（1859～1916）",
        "　　字慰廷，号容庵，河南项城人。清末，为李鸿章所赏识，戊戌政变，因告密而得宠，山东巡抚，进直隶总督，嗣官外务部尚书、军机大臣。辛亥革命事起，以内阁总理大臣，挟北洋兵力，与民军议和，迫清帝退位，孙中山先生力辞大总统让之，遂为民国首任大总统。后谋行帝制，孙中山先生号召全国声讨，忧愤而死。",
        "地望分布",
        "　　河南汝南郡，河南陈郡，江苏彭城郡。",
    ]
}
BaiIiaXingPageModule[260] = {
    "index": "百家姓",
    "name": "柳",
    "content": [
        "历史来源",
        "　　「柳」源出;",
        "　　出自「姬」姓，据《元和姓纂》及《唐书．宰相世系表》所载，春秋时，鲁孝公之后有展禽，曾任鲁国士师（相当于狱官），封邑在柳下。死后缢号为「惠」。其后有「柳」氏。",
        "家族名人",
        "　　柳宗元 （773～819）",
        "　　字子厚，河东（今山西省永济县）人，故亦称为柳河东。唐代文学家。德宗贞元时进士，官至监察御史。后被贬为永州司马，又贬柳州刺史，故亦称为「柳柳州」。为唐代古文运动主将，其诗文擅于刻划山水，反映现实，风格清新峭拔。文集有柳河东集、龙城录等。",
        "　　柳敬亭 （1587～1670？）",
        "　　名逢春，秦州人。明末著名的说书人。本姓曹，为避仇家而流落江湖，休于柳下，改姓柳。曾入左良玉幕府，良玉败，又游松江马提督军中，终不得志。善说书，使人驻足聆听，乐而忘倦。",
        "地望分布",
        "　　山东河东郡。",
    ]
}
BaiIiaXingPageModule[261] = {
    "index": "百家姓",
    "name": "酆",
    "content": [
        "历史来源",
        "　　「酆」源出;",
        "　　出自「姬」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，文王第十七子受封于酆国，称为酆侯，其后以国为氏。",
        "家族名人",
        "　　酆寅初",
        "　　元末明初人，字复出。博学多才，不愿为元朝做官而隐居，洪武年间任国子司业，后弃官，活至105岁。",
        "地望分布",
        "　　陜西京兆郡。",
    ],
}
BaiIiaXingPageModule[262] = {
    "index": "百家姓",
    "name": "鲍",
    "content": [
        "历史来源",
        "　　「鲍」源出;",
        "　　一﹕出自「姒」姓，以国名为氏。据《元和姓纂》和《通志．氏族略》所载，春秋时，夏禹后人，杞国公子敬叔，到齐国出任，食邑于鲍邑。因以鲍为氏。其子鲍叔牙，曾孙鲍国，世代为上卿。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「俟力伐氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「鲍」氏。又代北复姓有「鲍俎」氏。",
        "家族名人",
        "　　鲍叔牙",
        "　　春秋齐大夫，生卒年不详。少与管仲友善，知管仲贤而贫，分财多与；后鲍叔牙事齐桓公，管仲事公子纠，公子纠死，管仲囚，鲍叔牙乃荐管仲于桓公，卒佐桓公成霸业。世多称其知人而笃于友谊。",
        "　　鲍靓 神仙太守",
        "　　鲍姑",
        "地望分布",
        "　　山西上党郡，山东东海郡，山东泰山郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[263] = {
    "index": "百家姓",
    "name": "史",
    "content": [
        "历史来源",
        "　　「史」源出;",
        "　　一﹕以官为氏。据《唐书．宰相世系表》所载，史氏，出自周太史佚之后。。佚亦作「逸」，史乃官名，亦称「作册逸」，「尹佚」主要职责是纪录天子言行。有人将史佚与姜太公，周公，召公并称为「四圣」。其后以史为氏。",
        "　　二﹕为「昭武九姓」之一。（见「何」姓），史国故址在今乌兹别克斯坦，撒马尔罕之南。一度归唐朝管辖，唐高帝永徽年间归附中原，后为史氏。",
        "　　三﹕阿史那氏，居兜牟山，北人呼为突厥窟，历魏晋十代为君长。后属茹茹（蠕蠕），阿史那最为首领。后周末年，逐灭茹茹，霸强北土，盖百余年，至处罗苏尼失等归化，号阿史那，唐开元年间更为史氏。",
        "家族名人",
        "　　史思明（？- 761)",
        "　　本名窣干，唐玄宗赐名思明，为唐朝宁州的夷人，突厥族。骁勇有才略，安禄山起兵造反时，史思明受命攻略河北。后安禄山为其子庆绪所杀，思明则杀庆绪而自立为大燕皇帝，不久亦为其子史朝义所杀。",
        "　　史可法（1601 - 1645）",
        "　　字宪之，一字道邻。明代祥符（今河南省开封县）人。崇祯年间进士，曾任右佥都御史，巡抚皖、豫，后任命为南京兵部尚书。福王立，加武英殿大学士，督师扬州。清多尔衮致书劝降，坚拒，城破被害。清乾隆时追谥为忠正。后人尊称为史阁部。",
        "地望分布",
        "　　陜西京兆郡，安徽宣城郡，湖北武昌郡。",
    ]
}
BaiIiaXingPageModule[264] = {
    "index": "百家姓",
    "name": "唐",
    "content": [
        "历史来源",
        "　　「唐」源出;",
        "　　一﹕出自「祁」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，唐氏，祁姓，亦曰伊祁，尧初陶唐之后。尧初封唐侯，其地中山唐县是也，舜封尧之子丹朱为唐侯。至夏时，丹朱裔孙刘累迁于鲁县，至周朝改为唐公，周成王灭唐，以其地封叔虞，号曰唐叔。然后迁唐公于杜，降爵为伯，今长安杜城是也。故唐氏为尧帝之后。",
        "　　二﹕据《三国志．郭淮传》所载，陇西羌族有唐氏。",
        "家族名人",
        "　　唐尧",
        "　　唐寅",
        "　　（1470～1523）明代画家、文学家，吴县人，字伯虎，一字子畏，号六如居士、桃花庵主等。诗词书画无一不精，文以六朝为宗。诗初多秾丽，中年学刘禹锡、白居易，晚年纵放，不拘成格。擅画山水，多取法南宋李唐、刘松年，兼采元人法，并工画人物、花鸟，笔墨秀润峭利，景物清隽生动，工笔、写意俱佳。与文征明、沈周、仇英合称明朝四大家，又与祝允明、张灵、徐祯卿四人称为吴中四才子。有画谱、诗文集行世，并着有六如居士全集。亦称为唐伯虎。",
        "地望分布",
        "　　山西晋阳郡，山西晋昌郡，山东北海郡，山东鲁国郡。",
    ]
}
BaiIiaXingPageModule[265] = {
    "index": "百家姓",
    "name": "费",
    "content": [
        "历史来源",
        "　　「费」源出;",
        "　　一﹕出自「姒」姓，夏禹之后。",
        "　　二﹕出自「姬」自姓，以邑为氏。据《通志．氏族略》载，春秋时鲁懿公之孙，受封于费邑。（山东费县），其后以邑为氏。",
        "　　三﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「费连氏」（为魏献帝之兄的姓氏）随魏孝文帝南迁洛阳后，定居中原，代为汉姓「费」氏。",
        "家族名人",
        "　　费长房",
        "　　东汉人。据《后汉书．方术传》载，长房学道于壶公，不成，持符而归。相传能治百病，鞭打百鬼，又善变幻捉妖，后丢失符，被鬼所杀。",
        "　　费袆 （? - 253年）",
        "　　三国时江夏人，自文伟。刘备时任舍人，庶子。后主时历任黄门侍郎，昭信校卫，侍中，司马，尚书令，大将军，为诸葛亮所器重，多次出使吴国，终益州刺史，封成乡侯。",
        "地望分布",
        "　　湖北江夏郡。",
    ]
}
BaiIiaXingPageModule[266] = {
    "index": "百家姓",
    "name": "廉",
    "content": [
        "历史来源",
        "　　「廉」源出;",
        "　　一﹕据《元和姓纂》所载，相传为古帝颛顼孙大廉之后，以王父之字为氏。",
        "　　二﹕据《元史》所载，元朝有畏吾尔人布鲁海牙，担任肃政廉防史（简称「廉使」）之际其子希宪适生，逐以官名为「廉」氏，称「廉希宪」。",
        "家族名人",
        "　　廉颇",
        "　　战国赵人，生卒年不详。为赵之名将，屡败齐、魏等国。长平之战，坚壁自守，秦惧不敢加兵，后赵王受秦反间计，以赵括代之，赵遂大败。官拜上卿，与蔺相如为刎颈之交，后又言槉，遂不召用，病死于楚。",
        "　　廉希宪",
        "　　字善甫，元代维吾尔人。元世祖即位时，希宪得以入宫，一日，读《孟子》，用性善与仁义答世祖，被视为廉孟子，官至宰相。",
        "地望分布",
        "　　山西河东郡。",
    ]
}
BaiIiaXingPageModule[267] = {
    "index": "百家姓",
    "name": "岑",
    "content": [
        "历史来源",
        "　　「岑」源出;",
        "　　一 ; 出自「姬」姓，以国名为氏。据《通志．氏族略》引用《吕氏春秋》云 ; 周武王封周文王异母弟耀子渠为岑子，其地处梁国岑亭 ( 陜西韩城县 )。子孙以国为氏。",
        "家族名人",
        "　　岑参 (715～770）",
        "　　唐棘阳人（今河南新野县）。工诗，始佐戎幕，曾至天山一带，故多边塞、战伐之咏。因其属词清尚，用心良苦，故诗调特高。累官补阙起居郎，后出为嘉州刺史，故世称为岑嘉州。着有岑嘉州集。",
        "　　岑毓英 (1829-1889)",
        "　　字彦卿，号匡国，清广西西林人。光绪中法越南之役，击败法兵，官至云贵总督，卒谥襄勤。",
        "地望分布",
        "　　湖北南阳郡，河南棘阳郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[268] = {
    "index": "百家姓",
    "name": "薛",
    "content": [
        "历史来源",
        "　　「薛」源出;",
        "　　一 ; 以国名为氏。据《元和姓纂》，奚仲居于薛（山东滕县），一度迁于邳（山东徽山县）。春秋后期迁到下邳（江苏邳县），后成为齐国的属地。战国时为楚所灭。公子登仕楚。怀王赐沛邑，为大夫，逐以原国名「薛」为氏。",
        "　　二﹕据《吴录》所载，孟尝君受封于薛。秦灭六国而失祀，子孙逐以「薛」为氏，",
        "　　三﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「叱干氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「薛」氏。",
        "家族名人",
        "　　薛仁贵（612～681）",
        "　　名礼，唐绛州龙门人（今山西省河津县西二里）。少贫贱，以田为业。善骑射，贞观年间随太宗征辽东，所向披靡。高宗时屡破高丽、契丹、突厥，而立奇功，官拜本卫大将军，封平阳郡公。永淳二年卒，赠左骁卫大将军、幽州都督。后世据其功勋，编撰杂剧与演义。",
        "　　薛涛（768～831）",
        "　　字洪度。唐长安人，知音律，工诗文，有才情，为一代名妓。晚年居浣花溪，能制松花纸与深红小粉笺，裁书供吟，酬献贤杰，时人称为薛涛笺。着有诗集一卷。",
        "地望分布",
        "　　山西河东郡，河南河南郡，河南新蔡郡，安徽沛郡，山东高平剧。",
    ]
}
BaiIiaXingPageModule[269] = {
    "index": "百家姓",
    "name": "雷",
    "content": [
        "历史来源",
        "　　「雷」源出  ;",
        "　　一 ; 以国名为氏。据《元和姓纂》与《古今姓氏书辨正》所载，古诸侯国有方雷氏，其后分为方氏，雷氏。又神话传说方雷氏之女为黄帝妃。",
        "家族名人",
        "　　雷万春",
        "　　唐代人，安史之乱时，安禄山将令狐潮围雍丘，万春立于成上，面部中六箭，仍巍然不动。成陷不屈而死。",
        "地望分布",
        "　　陜西冯翔郡，江西豫章郡。",
    ]
}
BaiIiaXingPageModule[270] = {
    "index": "百家姓",
    "name": "贺",
    "content": [
        "历史来源",
        "　　「贺」源出  ;",
        "　　一 ; 为「庆」氏所改，据《通志．氏族略》所载，春秋时齐桓公之孙公孙庆克，他的儿子庆封以父名为氏。东汉时有庆纯，任侍中，当时汉安帝之父为清河王刘庆，为毕清河王的名讳，庆纯改姓为「贺」氏（取「贺」与「庆」两字义同）。故东汉永初元年（107年）后方有贺氏。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「贺兰氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「贺」氏。",
        "家族名人",
        "　　贺知章（659～744）",
        "　　字季真，自号四明狂客，唐越州永兴人。是著名的书法家。武则天时进士，官至太子宾客、秘书监，故时称为贺监。擅长草、隶书，亦擅长文辞，其诗风格淡雅而隽永，时出巧思。性旷达，善说笑，嗜酒，与李白、张旭等人交往频繁。后为道士，隐居于镜湖。享年八十八岁。。",
        "地望分布",
        "　　河北广平郡，江苏会稽郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[271] = {
    "index": "百家姓",
    "name": "倪",
    "content": [
        "历史来源",
        "　　「倪」源出  ;",
        "　　一 ; 源出于「曹」氏，以国为氏。周武王封曹挟在邾，郳国亦为小邾国（山东滕县东）。邾文公（一说邾武公）封其子肥于郳。战国时，为楚国所灭，其后为郳氏，去邑旁为儿氏。为避仇。加人字旁为倪氏。",
        "家族名人",
        "　　倪元璐（1593～1644）",
        "　　字玉汝，号鸿宝，浙江上虞人，是明代的忠臣。能诗文，工行草，善画山水竹石。为人正直廉介，不畏强权，官至户部尚书。李自成攻陷京城时，自缢而亡，谥文正，清代时追谥文贞。有倪文贞集传世。",
        "地望分布",
        "　　山东千乘郡。",
    ],
}
BaiIiaXingPageModule[272] = {
    "index": "百家姓",
    "name": "汤",
    "content": [
        "历史来源",
        "　　「汤」源出  ;",
        "　　一 ;据《通志．氏族略．以名为氏》所载，汤氏，子姓。夏商以前未有谥法（谥名如清圣祖即康熙，唐太宗即李世民），尧舜禹汤，皆名也。又，商汤，在金文（仲鼎文）中作「唐」。故汤氏之源并非始自于商汤。",
        "家族名人",
        "　　汤显祖（1550～1617）",
        "　　明江西临川人，字义仍，号海若，又号若士，别署清远道人。万历进士，官至礼部主事，以批评朝政贬官，后罢官归里，专事写作，诗宗香山、眉山，文学南丰、临川，尤精戏曲，其代表作有牡丹亭、邯郸记、南柯记、紫钗记四种，合称玉茗堂四梦或临川四种曲，作品词句典丽生动，排场取材亦颇佳妙，对后世影响甚大。有玉茗堂集传世。",
        "地望分布",
        "　　河北中山郡，北京范阳郡。",
    ]
}
BaiIiaXingPageModule[273] = {
    "index": "百家姓",
    "name": "滕",
    "content": [
        "历史来源",
        "　　「滕」源出;",
        "　　一 ;出自「姬」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，武王克商后，文王第十四子叔秀，受封于滕国（山东滕县）。战国初被越国所灭。不久复国，后又被宋国所灭。其子孙为滕氏。后又有一部份滕氏因避难改为腾氏。",
        "家族名人",
        "　　滕文公",
        "　　战国时滕国的贤君，名宏。曾多次向孟子请教。",
        "地望分布",
        "　　河南南阳郡，河南开封府。",
    ]
}
BaiIiaXingPageModule[274] = {
    "index": "百家姓",
    "name": "殷",
    "content": [
        "历史来源",
        "　　「殷」源出  ;",
        "　　一 ;出自「子」姓，以国名为氏。据《世本》所载，契后。武王克商后，商之子孙四散，以殷为氏。《元和姓纂》载﹕殷姓，成汤国号也，为周所灭，子孙以国名为氏。又《通志．氏族略．以国为氏》云﹕殷氏，契姓，封于商，后世迁于毫。至周为周所灭，子孙以国名为氏。",
        "家族名人",
        "　　殷汤",
        "　　殷浩（？～356）",
        "　　字深源，晋陈郡长平人。识度清远，好老易，负有盛名。初为庾亮记室参军，后起为建武将军。朝廷欲平关河，以浩为中军将军，都督扬、豫、徐、兖、青五州军事，以平定中原为己任。征姚襄兵败，废为庶人，竟日书空，作咄咄怪事四字。",
        "地望分布",
        "　　安徽汝南郡，河南河南府。",
    ]
}
BaiIiaXingPageModule[275] = {
    "index": "百家姓",
    "name": "罗",
    "content": [
        "历史来源",
        "　　「罗」源出  ;",
        "　　一 ;出自「妘」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，周代有罗国，初封宜城（湖北宜城县），徙枝江。春秋时被楚国所灭。周末居长沙，国人以原国名「罗」为氏。",
        "　　二﹕相传古帝祝融的后代。",
        "　　三﹕唐朝西突厥可汗斛瑟罗入中国，其后以斛瑟罗为氏，后改姓「罗」氏。",
        "　　四﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「破多罗」氏，随魏孝文帝南迁洛阳后，定居中原，代为汉姓「罗」氏。",
        "　　五﹕清代皇族爱新觉罗氏中有改姓「罗」，后代亦称罗氏。望族居豫章郡（江西南昌）。",
        "　　六﹕据《后汉书．南蛮传》及《华阳国志》载「板楯七姓」有罗氏。",
        "家族名人",
        "　　罗贯中",
        "　　名本，以字行，号湖海散人，元末太原人。生平事迹不详。工曲，善为通俗小说，著名的有《三国志通俗演义》、《南北史通俗演义》、《隋唐两朝志传》、《说唐》、《残唐五代史演义》、《粉妆楼》、《三遂平妖传》等。",
        "地望分布",
        "　　江西豫章郡，湖南长沙郡。",
    ]
}
BaiIiaXingPageModule[276] = {
    "index": "百家姓",
    "name": "毕",
    "content": [
        "历史来源",
        "　　「毕」源出  ;",
        "　　一 ;出自「姬」姓，据《新唐书．宰相世系表》所载，周文王第十五子被封于毕邑（陜西咸阳市），世称毕公高，其后逐有毕氏。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「出连」氏，随魏孝文帝南迁洛阳后，定居中原，代为汉姓「毕」氏。",
        "家族名人",
        "　　毕升",
        "　　生卒年不详。北宋仁宗庆历时（1041～1048）发明胶泥活字版印刷术的发明家。",
        "地望分布",
        "　　河南河内郡，山东东平郡，山西太原郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[277] = {
    "index": "百家姓",
    "name": "郝",
    "content": [
        "历史来源",
        "　　「郝」源出;",
        "　　一 ;以邑名为氏。据《新唐书．宰相世系表》所载，商王帝乙时，子期受封于郝乡（山西太原），其后以邑名为氏。",
        "　　二﹕少数民族的姓氏。据《旧唐书．南蛮传》所载，唐王朝南方土蛮有郝，杨，刘三大姓。又汉代乌桓有郝氏。",
        "家族名人",
        "　　郝隆",
        "　　字仕治，晋代人，官荆州刺史桓温的南蛮参军。农历七月七日，人们都在晒衣服，唯有郝隆睡在院中，有人问他为甚么，他答道﹕「晒我腹中的书罢了。」",
        "地望分布",
        "　　山西太原郡，陜西京兆郡。",
    ]
}
BaiIiaXingPageModule[278] = {
    "index": "百家姓",
    "name": "邬",
    "content": [
        "历史来源",
        "　　「邬」源出  ;",
        "　　一 ;以邑名为氏。据《通志．氏族略》所载，春秋时晋国有大夫食邑于邬邑，其后有邬氏。邬本为郑国之邑，后入周。晋国强盛时，辖地曾扩大到河南北部，邬邑一度为晋国所有。",
        "　　二﹕据《左传．昭公二十八年》载，晋国司马弥牟为邬郡大夫。邬郡在山西介休县。其后有邬氏。",
        "家族名人",
        "　　邬单",
        "　　春秋时人，孔子弟子。",
        "地望分布",
        "　　山西太原郡，江西南昌郡。",
    ]
}
BaiIiaXingPageModule[279] = {
    "index": "百家姓",
    "name": "安",
    "content": [
        "历史来源",
        "　　「安」源出  ;",
        "　　安氏出自西域少数民族，略有三支﹕",
        "　　一﹕据《新唐书．宰相世系表》所载，汉灵帝时安息国（伊朗东北部）太子安清，潜心佛学，来到当时的京都洛阳定居（见本网的「安世高」段，其后有安氏。南北朝时又有安息世子来到中国定居，亦为安氏。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「安迟」氏，随魏孝文帝南迁洛阳后，定居中原，代为汉姓「安」氏。",
        "　　三﹕为「昭武九姓」之一。（见「何」姓），安国故址在今乌兹别克斯坦布哈拉一带。一度归唐朝管辖，唐高帝永徽年间归附中原，后为安氏。",
        "　　又，唐朝胡人安禄山本姓康氏，冒姓安氏。",
        "家族名人",
        "　　安期生",
        "　　秦琅琊人（今山东省诸城县东南），生卒年不详。受学于河上丈人，于海滨卖药，始皇东游，相谈三昼夜，赐予金帛，皆置之而去，留书以别，谓后千年求我于蓬莱山，始皇遣使入海寻之，遇风浪而还。汉武帝时，李少君言尝游海上，见安期生食巨枣，其大如瓜。",
        "　　安世高",
        "　　安禄山（？～757）",
        "　　唐营州柳城人（今河北省旧永平府境）。胡人，本姓康，初名阿荦山，又作轧荦山。忮忍多智，善臆测人情，通六蕃语。天宝末，以平卢、范阳、河东三镇节度使举兵反，陷洛阳，入长安，称燕帝，寻为其子庆绪所杀。",
        "地望分布",
        "　　宁夏凉州郡，甘肃武威郡，湖北武陵郡。",
    ]
}
BaiIiaXingPageModule[280] = {
    "index": "百家姓",
    "name": "常",
    "content": [
        "历史来源",
        "　　「常」源出  ;",
        "　　一 ;出自「姬」姓，以邑名为氏。据《通志．氏族略》所载，武王克商后，文王子于康国，世称康叔，武庚叛乱被平定后，康叔又被转封于卫国。后来，康叔又分封其子于常邑，其后逐为常氏。",
        "　　二﹕因避讳而改，《世本》载春秋时楚国公族恒惠公之后有恒氏，一度改为常氏。来避宋真宗赵恒的名讳。「恒」和「常」义相同。",
        "　　三﹕又据《路史》云，战国时吴国公族之后亦有常氏。",
        "　　神话中黄帝大臣常先与常曦之后。",
        "家族名人",
        "　　嫦娥",
        "　　后羿的妻子。相传因偷吃不死之药而飞升月宫，成为仙女。汉人为避文帝讳，改姮为嫦。《淮南子˙览冥》：羿请不死之药于西王母，姮娥窃以奔月，怅然有丧，无以续之。明˙刘兑˙金童玉女娇红记：若不是月里姮娥，敢只是花里神仙。亦作常娥、嫦娥。",
        "　　常遇春（1330～1369）",
        "　　字伯仁，明怀远人。貌奇伟，善射，有勇力。辅佐明太祖转战江南，所向皆捷；又率师北征，下元都，逐元帝，平定天下。累官至左副将军，擢为中书、平章军国重事，赠中书右丞相。封鄂国公、开平王。谥忠武。",
        "地望分布",
        "　　山东平原郡。",
    ]
}
BaiIiaXingPageModule[281] = {
    "index": "百家姓",
    "name": "乐",
    "content": [
        "历史来源",
        "　　「乐」源出  ;",
        "　　一 ; 出自「子」姓。以王父自为氏。据《姓氏急就篇》及《唐书．宰相世系表》所载，宋戴公之子，字乐父。生子倾父泽，为公孙泽; 公孙泽之子夷父须，以其祖父之字「乐」为氏，称为乐须。",
        "家族名人",
        "　　乐毅",
        "　　战国时燕国名将，昭王时拜为上将军，率领燕、赵、楚、韩、魏五国兵伐齐，下齐七十余城，封昌国君。昭王死，惠王使骑劫代其职位，毅奔赵，封为望诸君，后卒于赵。",
        "地望分布",
        "　　河南南阳郡。",
    ],
}
BaiIiaXingPageModule[282] = {
    "index": "百家姓",
    "name": "于",
    "content": [
        "历史来源",
        "　　「于」源出  ;",
        "　　一 ; 出自「姬」姓。以国名为氏。据《元和姓纂》和《广韵》所载，周武王第三子受封于邘国，称为邘叔，其后去邑旁为于，有于氏。",
        "　　二﹕为鲜卑族复姓所改。据《路氏》所载，东海于公裔孙随魏孝文帝南迁洛阳后，定居中原，代为汉姓「于」氏。",
        "　　三﹕唐代淳于氏为避唐宪宗李纯之名讳（淳，纯同音）改为于氏。",
        "家族名人",
        "　　于譧（1398-1457）",
        "　　字廷益，明代浙江钱塘人。历任官监察御史，兵部尚书等。正统十四年，土木桥之变，瓦刺首领也先侵扰大同，明英宗被俘，于譧反对放弃北京，拥立英宗弟为景帝，主君务，击退也先军队，接英宗回。英宗复辟后被杀，年六十岁，天下冤之。",
        "　　于成龙（1617-1684）",
        "　　字北溟，清山西永宁人，康熙时，官至两江总督，以清廉著称，时称天下清官第一。",
        "地望分布",
        "　　河南河南郡，山东东海郡。",
    ]
}
BaiIiaXingPageModule[283] = {
    "index": "百家姓",
    "name": "时",
    "content": [
        "历史来源",
        "　　「时」源出  ;",
        "　　一 ; 出自「子」姓。据《世本》所载，春秋时宋国有大夫「来」，受封于时邑。子孙以封邑名「时」为氏。",
        "　　二﹕一曰，时氏为楚国大夫申叔时之后。以王父字为氏。",
        "家族名人",
        "　　时荷",
        "　　晋代人。相传随许真君学道，一起成仙，紫盖府留有遗迹。",
        "地望分布",
        "　　甘肃陇西郡，河南陈留郡。",
    ]
}
BaiIiaXingPageModule[284] = {
    "index": "百家姓",
    "name": "傅",
    "content": [
        "历史来源",
        "　　「傅」源出  ;",
        "　　一 ; 据《通志．氏族略．以地为氏》载，为商朝名相傅说之后。商王武丁在傅岩（山西平陆县）发现了贤者「说」，因筑于傅岩，故称傅说，其后以地为氏。",
        "　　二﹕出自「姬」姓。以邑为氏。据《唐书．宰相世系表》所载，周朝大由受封于傅邑，因以为氏。",
        "家族名人",
        "　　傅说",
        "　　生卒年不详。为商王武丁时的贤相。初隐居于傅岩，武丁梦到他，往访而知其贤，于是举他为相，国家大治。",
        "　　傅恒",
        "　　号春和，清朝满洲镶黄旗人，原姓富察氏。历官尚书，川陜总督，保和殿大学士等。乾隆年间平定金川，准格尔和缅甸，因功封忠勇公，称为「社稷臣」。乾隆二十年，置功臣相于紫光阁，傅恒列为第一。",
        "地望分布",
        "　　山东清河郡，山东临清郡，山东高唐郡，甘肃北地。",
    ]
}
BaiIiaXingPageModule[285] = {
    "index": "百家姓",
    "name": "皮",
    "content": [
        "历史来源",
        "　　「皮」源出  ;",
        "　　出自姬姓。以王子字为氏。据《风俗通义》及《元和姓纂》所载, 鲁献公次子仲山浦, 曾辅佐周宣王中兴, 受封于樊邑, 其后有樊氏。樊侯之后有樊仲皮, 食采于皮氏邑(在今山西河津县一带), 其支孙以王父(祖父)之字皮为氏。",
        "家族名人",
        "　　皮日休（834～883）",
        "　　字袭美，一字逸少，襄阳人，为唐代诗人。性傲诞，尝隐居鹿门山，以文章自负，尤善箴铭。咸通年间中进士，官太常博士，后为黄巢所害，着有《皮子文薮》。",
        "地望分布",
        "　　甘肃天水郡，江苏下邳郡。",
    ]
}
BaiIiaXingPageModule[286] = {
    "index": "百家姓",
    "name": "卞",
    "content": [
        "历史来源",
        "　　「卞」源出  ;",
        "　　一﹕以邑名为氏。据《元和姓纂》所载, 周文王第六子曹叔振的支子(嫡妻第二子以下及妾子皆称为‘支子’) 受封于卞邑(在今山东省兖州, 泗州附近), 称为卞伯, 其后为’卞‘氏。",
        "　　二﹕春秋时鲁国有勇士庄子为卞邑大夫, 称为卞庄子, 又写为弁庄子, 其后亦为卞氏, 亦为   弁氏。",
        "家族名人",
        "　　卞和",
        "　　春秋楚人。于荆山得璞玉献于楚王，两次见疑，左右足遭刖，后楚王乃使玉人琢之，果得宝玉，遂命名为和氏璧。见韩非子˙和氏。",
        "　　卞庄子",
        "　　春秋卞邑大夫，以勇著名，尝刺虎，一举而获两虎，齐人惧之，不敢伐鲁。汉朝时，因避明帝（刘庄）讳，改庄为严。或称为卞严、卞严子、弁严子。",
        "地望分布",
        "　　山东济阴郡，河南济阳郡。",
    ]
}
BaiIiaXingPageModule[287] = {
    "index": "百家姓",
    "name": "齐",
    "content": [
        "历史来源",
        "　　「齐」源出  ;",
        "　　一﹕出自姜姓, 以国为氏。据《元和姓纂》所载, 西周初年, 太公望姜子牙受封于营丘(在今（山东省临淄市) 建立齐国, 至齐恒公时成为春秋五霸之首。后田氏代齐, 原王氏乃为齐氏。",
        "　　二﹕出自姬姓, 以王父字为氏。据《通志氏族略》所载, 春秋时卫国有大夫字齐子, 其支孙以王父(祖父)之字为齐氏。",
        "　　三﹕西北少数民族姓氏。据《晋书》所载, 武都氐族人有齐姓, 如齐万年。",
        "家族名人",
        "　　齐桓公",
        "　　齐白石（1863～1957）",
        "　　名璜，字苹生，号白石山人，湖南湘潭人。初习木工雕刻，从胡沁园、陈少蕃、王湘绮学诗画，苦读古文诗词，临摹名家字画，其艺大进。曾任北平艺术专院教席，诗、书、画、篆刻，彪炳艺坛。",
        "地望分布",
        "　　河南汝南郡，河北高阳郡，河北中山郡。",
    ]
}
BaiIiaXingPageModule[288] = {
    "index": "百家姓",
    "name": "康",
    "content": [
        "历史来源",
        "　　「康」源出  ;",
        "　　一﹕出自姬姓。 以谥号为氏。据《元和姓纂》及《姓苑》所载, 周朝初年, 文王第七子康叔, 受封于卫国, 其后以祖之谥(生谥, 即生前就有的谥号)「康」为氏。",
        "　　二﹕以国为氏．出自西域康居国（约在今巴尔喀什湖与咸海之间）的使者，以及从康居来中国者，有的就以「康」为氏．如汉代的康孟详。",
        "　　三「昭武九姓」之一．隋唐时代康国（在今乌兹别克斯坦，撒马尔罕一带）人来中国者，有的以“康”为氏，如唐代有康谦。",
        "　　四﹕宋代为避宋太祖赵匡胤的名讳，匡氏改为慷氏．",
        "家族名人",
        "　　康有为（1858～1927）",
        "　　字长素，改字更生，晚年又字更甡，清学者及政治家，南海人。治经以今文为宗，旁采当时流行的西洋学术思想，自成一家言。光绪二十四年，以工部主事赞德宗行新政，失败后亡命日本，组织保皇党；民国成立后，谋复辟，迄无成。着有孔子改制考、新学伪经考、大同书、春秋董氏学、春秋笔削大义微言考、孟子微等多种。",
        "地望分布",
        "　　陜西西安市。",
    ]
}
BaiIiaXingPageModule[289] = {
    "index": "百家姓",
    "name": "伍",
    "content": [
        "历史来源",
        "　　「伍」源出  ;",
        "　　出自芈姓，以名为氏．据《通志．氏族略．以名为氏》所载：春秋时楚国大夫伍参之后也．伍子胥奔吴，　其子又为王孙氏适齐．",
        "家族名人",
        "　　伍员（子胥）（？～前664）",
        "　　字子胥，春秋楚人。与父兄俱仕楚，后楚王听谗言杀其父兄，员逃亡吴国佐吴伐楚报仇，并辅吴称。吴王夫差灭越后，欲释越王句践回国，不听员谏，因信谗杀之。伍员死前预言越必灭吴，后九年越果灭吴。",
        "　　伍廷芳（1842～1922）",
        "　　字文爵，号秩庸，广东新会人。创中外新报，为中国有日报之始。留英习法律，为清修律大臣，草民刑律，开中国法律新纪元。武昌起义，首倡清帝退位之议，民军推为议和代表。后历任司法总长、代国务总理、外交总长等。陈明叛变，忧愤而卒。",
        "地望分布",
        "　　甘肃省安定郡，湖南省武陵郡。",
    ]
}
BaiIiaXingPageModule[290] = {
    "index": "百家姓",
    "name": "余",
    "content": [
        "历史来源",
        "　　「余」源出  ;",
        "　　 据《风俗通义》所载，余为春秋时秦国相由余之后。由余本为晋国人，后入秦。其子孙以袓名“余”为氏。世居歙州，为新安（在今安徽省歙县）大族。",
        "家族名人",
        "　　余秋雨",
        "　　当代著名作家。",
        "地望分布",
        "　　江苏省下邳郡，浙江省吴兴郡。",
    ]
}
BaiIiaXingPageModule[291] = {
    "index": "百家姓",
    "name": "元",
    "content": [
        "历史来源",
        "　　「元」源出  ;",
        "　　一﹕以邑名为氏．据《韵会》所载，春秋年代，卫国有大夫元恒, 受封于元城(在今河北省大名县东),其后有元恒氏元氏。",
        "　　二﹕ 据《风俗通义》所载，战国时卫武之子公子元,食邑亦在元城,其后有元氏.",
        "　　三﹕为鲜卑族复姓拓跋氏所改。据《新唐书-宰相世系表》所载,，北魏皇族本姓拓跋氏, 至孝文帝迁都洛阳进入中原后, 改为元氏.又据《魏书-官氏志》所载, 北魏代北复姓纥骨氏,是云氏,皆改为元氏。",
        "家族名人",
        "　　元好问（1190～1257）",
        "　　字裕之，号遗山，金秀容（今山西省忻县）人。系出元魏，七岁能诗，兴定三年进士，官至尚书省左司员外郎，金亡不仕。古文继承韩柳，结构严密。诗主风骨，反对浮艳。其论诗绝句三十首在文学批评史上颇有地位。编有中州集。着有遗山集﹑续夷坚志。金庸小说中的「问世间，情是何物」正是出自他的词「摸鱼儿」",
        "　　元稹（779～831）",
        "　　字微之，唐河南（今河南省洛阳县）人。穆宗时拜相。其诗平易近人，与白居易齐名，世称「元白」。着有《元氏长庆集》。",
        "地望分布",
        "　　河南洛阳，山西太原郡。",
    ],
}
BaiIiaXingPageModule[292] = {
    "index": "百家姓",
    "name": "卜",
    "content": [
        "历史来源",
        "　　「卜」源出  ;",
        "　　一﹕ 据《风俗通义》及《潜夫论》云: 氏于职者,巫卜陶匠是也.殷周时代有专门从事占卜职务者,称为卜人. 世代任卜人者,遂为卜氏. 《潜夫论》云:　夏　后有卜氏，又叔锈后有卜氏．《元和姓纂》云：周礼有卜人氏．以官命氏．晋卜偃.秦卜徒父.鲁卜楚丘，皆为卜筮官，其后遂以为氏。",
        "　　二﹕据《史记》载，古代匈奴部族四大姓之一有须卜氏，其后改为卜氏。",
        "家族名人",
        "　　卜式",
        "　　汉河南人，以牧羊致富，武帝时上书，愿捐一半家财以助边防军需，又助济贫民，受赐为御史大夫，后因不善文章，贬为太子太傅。",
        "地望分布",
        "　　山西省西河郡，湖南省溆浦县。",
    ]
}
BaiIiaXingPageModule[293] = {
    "index": "百家姓",
    "name": "顾",
    "content": [
        "历史来源",
        "　　「顾」源出  ;",
        "　　一﹕ 出自妃姓, 以国为氏. 据《元和姓纂》所载, 夏朝有附庸小国, 在今河南省范县东南. 商汤起兵攻伐夏桀时,先灭顾国,韦国. 其国人以原国名”顾”为氏。",
        "　　二﹕ 越王勾践的七世鬊吮孙为闽君摇, 在汉代受分封于东哦瓯(在今浙江省永嘉县西南).摇之子受封为顾余侯,世居于会稽(在今浙江省绍兴市)",
        "家族名人",
        "　　顾恺之（341～402）",
        "　　字长康，小字虎头，晋无锡人。博学有才气，善绘画，有才绝、艺绝、痴绝三绝之称。多作人物肖像及神仙、佛像、动物、山水等。画人注重点睛。着有画论、魏晋胜流画赞、画云台山记等。存世作品中以女史箴图最有名。其所作维摩诘像，为最早出现于壁画上的佛像。",
        "　　顾炎武（1613～1681）",
        "　　初名绛，字宁人，号亭林，自署蒋山佣，学者称亭林先生。明末清初学者。江苏昆山居林镇人。性耿介，曾参加抗清活动。晚年治经侧重考证，开清代朴学之风。考订古音、离析唐韵，分古韵为十部，于分析音学源流与古韵部目上，居承先启后之功。着有日知录、天下郡国利病书等。",
        "地望分布",
        "　　湖南省溆浦县南。",
    ]
}
BaiIiaXingPageModule[294] = {
    "index": "百家姓",
    "name": "孟",
    "content": [
        "历史来源",
        "　　「孟」源出  ;",
        "　　以次为氏. 古代兄弟排行次序为: 伯(孟), 仲, 叔, 季. 伯为嫡长子, 孟为庶长子. 据<<通志-氏族略>>所载, 春秋时鲁国有孟孙氏, 盖为鲁恒公之子庆父共仲之后. 本为”仲孙”氏, 因弒君之罪, 更为孟氏. 又, 春秋时卫襄公之子, 字孟公, 其支孙以王父字”孟”为氏.",
        "家族名人",
        "　　孟母",
        "　　孟子的母亲。仉姓。曾经三次迁移其居，以激励孟子勤奋学习。后世奉为贤母的典范。",
        "　　孟子（前372～前 289）",
        "　　名轲，字子舆，战国时邹人，生于周烈王四年，卒于周赧王二十六年。受学于子思弟子。提倡王道﹑重仁义﹑轻功利﹑创性善之说，后世尊称为亚圣。着有孟子七篇。亦称为孟子。",
        "　　孟浩然（689～740）",
        "　　字浩然。唐代诗人，襄阳人。少好节义，隐居鹿门山。曾于太学赋诗，一坐叹服，其诗属于自然一派，有孟浩然集。",
        "地望分布",
        "　　山东省历城县东，山东省曲阜县东南，甘肃省汉置郡。",
    ]
}
BaiIiaXingPageModule[295] = {
    "index": "百家姓",
    "name": "平",
    "content": [
        "历史来源",
        "　　「平」源出  ;",
        "　　姬姓。 以邑名为氏。 据<<通志-氏族略-以邑为氏>>所载, 战国时韩哀侯的少子, 受封于平邑(在今山西省临汾市附近)。 公元前230年, 韩国被秦国所灭, 韩哀侯的后代由平邑迁往下邑(在今安徽省砀山县), 以原邑名「平」为氏。",
        "家族名人",
        "　　平当",
        "　　字子思，汉朝时平陵人。对于大禹治水的情况很有研究，汉成帝封他为骑都尉，负责开河筑堤，防治水患。汉哀帝即位后，升他为宰相，赐官内侯，到了第二年，又要升官加薪，他因为生病，拒绝了。他说﹕「我的官位已经够高了，薪俸已经够了，给子孙留的财产太多会使他们过奢侈的生活的。",
        "地望分布",
        "　　河南省洛阳市，河南省武陟县",
    ]
}
BaiIiaXingPageModule[296] = {
    "index": "百家姓",
    "name": "黄",
    "content": [
        "历史来源",
        "　　「黄」源出  ;",
        "　　一 ; 出自「嬴」姓。以国为氏。据《诸暨孝义黄氏族谱》所载，黄氏为嬴姓十四氏之一。古代黄国在今河南潢川。后被楚国所灭，子孙散居四方，以国名为氏。",
        "　　二 ; 古代南方蛮族有黄姓。在广西南宁一带。",
        "家族名人",
        "　　黄歇",
        "　　游学博闻，楚考烈王以之为相，封为春申君。相楚二十余年，食客三千多人。娶李园之妹，知其有孕，纳于考烈王，生幽王。后李园用事，忌春申君，遂伏死士于棘门刺杀之。",
        "　　黄初平（黄大仙）",
        "　　黄霸 (前？～前51）",
        "　　字次公，西汉淮阳阳夏人。少学律令，武帝末，补侍郎谒者，历河南太守丞，时吏尚严酷，而霸为政宽和。尝从经学家夏庚胜治尚书。官至丞相，封建成侯，卒谥定。",
        "　　黄庭坚 (1045～1105）",
        "　　字鲁直，号山谷道人，又号涪翁，宋分宁（今江西修水县）人。与张耒、晁补之、秦观合称苏门四学士。工诗，为江西诗派的开创人，并擅行、草书。着有山谷内集、外集、别集、词等。",
        "　　黄巢 (？～884)",
        "　　唐曹州人。出身盐商，积财聚众，尤好收留亡命之徒。唐懿宗以来，因皇室奢侈过度，赋税沉重，加上连年发生水﹑旱灾，遂致民不聊生，盗匪群起。僖宗干符元年（公元874)，王仙芝率盗匪起事，翌年黄巢起兵响应，干符五年王仙芝败死于湖北，黄巢被推举为冲天大将军，率众攻掠江﹑浙﹑闽﹑粤等地，广明元年（公元880)陷洛阳、长安，僖宗逃奔成都，巢自号为帝，国号大齐。唐以官爵笼络李克用相援，大败黄巢，巢自刎身亡，为害十年的黄巢之乱始告结束，史称为黄巢之乱。",
        "　　黄道婆",
        "　　元朝时擅于纺织技术的女工艺家。曾随崖州黎族学习纺织技术，学成后返乡从事纺织工作，促成棉纺织业的进步，使元明以后的松江细布闻名于四方。纺织业者遂立祠祭之，以感其功。亦称为黄婆。",
        "地望分布",
        "　　湖北江夏郡，陜西栎阳郡，宁夏安定郡，湖北房陵郡，湖北汉东郡，河北上谷郡，安徽焦郡。",
    ]
}
BaiIiaXingPageModule[297] = {
    "index": "百家姓",
    "name": "和",
    "content": [
        "历史来源",
        "　　「和」源出  ;",
        "　　一﹕ 传说为尧时掌管天文律法的羲和之后. 据<<元和姓纂>>所载:”羲和, 尧时掌管天地之官, 和仲. 和叔因以为氏.” 此为后人依神话附会之辞.",
        "　　二﹕ 春秋时期, 楚国有卞和, 曾找到一块玉璞(没有经过雕琢的玉石), 两次献给楚王都被认为是假的, 以欺君之罪, 先后被砍去两脚. 楚文王即位后, 卞和抱着玉璞在荆山之下痛哭. 楚文王派人取来玉璞, 经雕琢果然得到宝玉, 称为”和氏璧”. 卞和之后有和氏.",
        "　　三﹕为鲜卑族复姓所改. 据<<通志-氏族略>>所载, 南北朝时, 北魏有代北复姓「素和氏」, 为鲜卑族檀石槐的支裔, 以其本为白部, 故号”素和”,进入中原以后改为汉姓和氏.",
        "家族名人",
        "　　和峤",
        "　　晋朝西平人。少有盛名。晋武帝时为黄门侍郎，迁中书令。",
        "地望分布",
        "　　河南省汝南郡，浙江省萧山县。",
    ]
}
BaiIiaXingPageModule[298] = {
    "index": "百家姓",
    "name": "穆",
    "content": [
        "历史来源",
"　　「穆」源出  ;",
"　　一﹕ 出自子姓. 以谥号为氏. 据<<元和姓纂>>所载, 春秋时, 宋宣公之弟名和. 继承兄位, 在位九年, 死前将爵位传给宣文公之子夷, 让自己的儿子离开宋国到郑国居住. 为褒奖其品德, 死后谥号为”穆”. 其支庶子孙遂有穆氏。",
"　　二﹕北方鲜卑族复姓所改. 据<<魏书-官氏志>>所载, 南北朝时, 北魏”代北八族”之首为丘穆陵氏, 隋魏孝文帝迁都洛阳, 定居中原以后, 改为汉字单姓穆氏.",
"家族名人",
"　　穆宁",
"　　唐朝人。官至秘书监。为官刚直，奉公守法。安史之乱时，以著名的颜真卿起兵共拒安禄山。",
"地望分布",
"　　河南汝南郡，河南洛阳。",
    ]
}
BaiIiaXingPageModule[299] = {
    "index": "百家姓",
    "name": "萧",
    "content": [
        "历史来源",
        "　　「萧」源出  ;",
        "　　一﹕ 出自子姓, 以国为名氏. 据<<风俗通义>>及<<元和姓纂>>所载, 周代宋国微子之后, 乐叔大心有功, 封于萧, 成为宋的附庸小国. 故址在今安徽省萧县西北, 公元前597年被楚国所破. 子孙以国为氏, 西汉相国萧何即为其后.",
        "　　二﹕古代嬴姓部落首领柏翳之后孟亏, 作士于萧, 其后人遂以萧为氏.",
        "家族名人",
        "　　萧史",
        "　　传说中春秋时的人物。善吹箫，作凤鸣。秦穆公以女弄玉妻之，作凤楼，教弄玉吹箫，感凤来集，弄玉乘凤、萧史乘龙，夫妇同仙去。见《汉˙刘向˙列仙传˙卷上˙萧史》。",
        "　　萧何（？～前193)",
        "　　汉初沛人，佐高祖定天下，论功第一，封酇侯。汉初律令多出其手。卒谥文终。",
        "　　萧道成",
        "　　萧衍",
        "地望分布",
        "　　山东枣庄市，江苏常州市，山东巷山县。",
    ]
}


module.exports = { BaiIiaXingPageModule: BaiIiaXingPageModule }