
import React, { Component } from 'react';
import { AppRegistry, View, Text } from 'react-native';


var BaiIiaXingPageModule = new Array()
BaiIiaXingPageModule[0] = {
    "index": "百家姓",
    "name": "百家姓",
    "content": [
        "《百家姓》与《三字经》、《千字文》并称为三大蒙学读物。《百家姓》成书于北宋初年，原收集中文姓氏411个，后增补到504个，其中单姓444个，复姓60个。 《百家姓》读来顺口，易学好记。《百家姓》并不依照各姓氏的人口数量排序，“赵钱孙李”成为《百家姓》前四姓是因为百家姓形成于宋代吴越钱塘地区，故而宋朝皇帝赵氏、吴越国国王钱氏、吴越国王钱俶正妃孙氏以及南唐国王李氏成为百家姓前四位。",

    ],
}
BaiIiaXingPageModule[1] = {
    "index": "百家姓",
    "name": "赵",
    "content": [
        "历史来源",
        "　　「赵」姓出自「嬴」姓，据「唐书」记载，上古东夷族首领伯益的第十三世孙造父，在周穆王时传说他曾取良马八骏，献与周穆王，周穆王乘这八匹骏马西巡狩猎。来到昆仑山上，西王母在池设宴招待他，饮酒唱和乐而忘返，为周穆王御车，日趋千里，息徐偃王反叛，其后周穆王封造父于赵城，既今山西省洪洞具北，其后为赵氏。",
        "　　「百家姓」编与宋朝，皇帝的的姓氏是国姓，当然放在第一。",
        "　　「百家姓」的第一句，「赵钱孙李」，「赵」指「权」，「钱」指「金钱」。世间万事权和钱的问题是首要问题。",
        "家族名人",
        "　　赵武灵王",
        "　　赵云 ( ? - 229 )",
        "　　是三国名将，字子龙，三国时常山真定人。初从公孙瓒，后归附刘备。勇敢善战，以忠勇著称。封永昌亭侯，累迁镇军将军，卒谥顺平。",
        "　　赵匡胤",
        "　　赵飞燕　(? ～公元前１）",
        "　　汉成帝皇后。善歌舞，因体轻如燕，故称为飞燕。成帝时入宫，为婕妤，极得成帝宠幸，许后废，被立为皇后，擅宠十余年。哀帝立，尊其为皇太后，平帝初年，废为庶人，遂自杀。",
        "地望分布",
        "　　甘肃天水郡，河南南阳郡，甘肃金城郡，江苏下邳郡，河南颍川郡。",
    ],
}
BaiIiaXingPageModule[2] = {
    "index": "百家姓",
    "name": "钱",
    "content": [
        "历史来源",
        "　　「钱」源与彭姓，是以官职命民的姓氏。周朝有官职名「钱府上士」掌管财政，遂以官为氏。相传为古帝颛顼玄孙彭祖(即籛铿)的后代。",
        "家族名人",
        "　　钱元(887-941)",
        "　　五代十国时，吴越国的国王，颇建勋绩，一生好儒，招纳贤士。有诗千首。",
        "　　钱一本(1539-1610)",
        "　　明朝易学家，江苏常州人，官至征御史，因触怒明神宗被斥为民。他研河洛书，六经，尤精「易」，和顾宪成在东林学院讲席。",
        "地望分布",
        "　　江苏彭城郡(今徐州市)，江苏下邳郡(今江苏西北部)，浙江吴兴郡(今江苏宜兴一带)",
    ]
}
BaiIiaXingPageModule[3] = {
    "index": "百家姓",
    "name": "孙",
    "content": [
        "历史来源",
        "　　「孙」源出有三，?姓，芈姓，田姓。",
        "　　一 ; 春秋时卫武公的儿子惠孙任卫国上卿，他的儿子名乙，字武仲，以祖父的字命氏。",
        "　　二 ; 楚国有贤臣为敖，字孙叔，其支庶(宗族旁支)以祖字为氏。",
        "　　三 ; 齐国卿士书(敬仲的五世孙，字子占)。伐莒有功，齐景公封他到乐安，赐姓孙氏。",
        "家族名人",
        "　　孙武 (生卒不详)",
        "　　兵圣，是春秋末期军事家，齐国人，着兵法「十三章」。孙子被推崇为兵法的鼻祖，「孙子兵法」被奉为兵学圣典。",
        "　　孙权 (182-252)",
        "　　孙中山  (1866-1925)",
        "　　字逸仙，别号中山樵，世称中山先生，广东香山县人。清末，因见国势日衰，民族危亡，乃唤起同志，共组兴中会，为革命救国的团体；后递改为中国国民党，被推为总理。致力革命数十年，艰苦奋斗，百折不挠，终于辛亥一役，推翻满清，建立民国，改国体为民主共和。手创三民主义、五权宪法，手着建国方略、建国大纲，为革命建国的最高原则。民国十四年逝世于北京，二十九年国民政府颁令，尊为中华民国国父。",
        "地望分布",
        "　　山东乐安郡",
    ]
}
BaiIiaXingPageModule[4] = {
    "index": "百家姓",
    "name": "李",
    "content": [
        "历史来源",
        "　　「李」源出有四。",
        "　　一 ; 据《唐书，宰相世系表》所载，出自「嬴」姓。皋陶之后，世为大理(掌管刑法的狱官之长)，以官为姓，春秋时道家学说的创始人老子因祖辈为理官，遂以理「李」为氏，称李耳。",
        "　　二 ; 据「北史」所载，赵郡李氏，为赵将武安君之后，李左车其先也。",
        "　　三 ; 据「魏书」所载，后魏有代北鲜卑族复姓「叱李」氏，后改为汉字单姓「李」氏。",
        "　　四 ; 唐朝皇室姓「李」，「李」遂为国姓。唐初开国元勋诸将徐，邴，安，杜，胡，弘，郭，麻，鲜于，张，阿布，阿跌，舍利，董，罗，朱邪共十六姓(其中五家为复姓)赐与国姓「李」。此外还有许多家族改为李氏，由此李氏人丁大增。",
        "家族名人",
        "　　李耳 (即老子)",
        "　　春秋末期重要的哲学家，他崇尚自然，提出「人法地，地法天，天法道，道法自然」的思想，是中国重要的哲学思想「道家」的创始人。",
        "　　李世民 (599-649)",
        "　　李白 (701-762)",
        "　　中国最伟大的浪漫诗人，祖籍甘肃秦安，他被誉为诗仙。",
        "　　李自成 (1823-1864)",
        "　　明末农民义军领袖，号「闯王」，陕西米脂人。",
        "　　李鸿章 (1823～1901）",
        "　　字少荃，安徽合肥人，清代政治家。平定捻匪及太平天国有功，历任直隶、湖广、两广总督。尤善外交，曾多次代表清廷与外国签订条约。后因积劳呕血而死，晋封一等侯，卒谥文忠。",
        "地望分布",
        "　　甘肃陇西郡，河北赵郡，河南顿丘郡，辽宁渤海郡，河北中山郡，河南襄城，湖北江夏，四川梓潼，河北范阳郡，四川广汉郡，安徽梁国，河南南阳郡",
    ]
}
BaiIiaXingPageModule[5] = {
    "index": "百家姓",
    "name": "周",
    "content": [
        "历史来源",
        "　　「周」源出有四。",
        "　　一：周平王儿子烈封在汝州(今河南省)，当地人称他周家，便以周为姓。",
        "　　二：公元前256年，秦灭东周，将赧王废为庶人，王族亦称为周氏。",
        "　　三：唐玄宗李隆基于712年，因避讳「基」，下诏改天下的?姓为周姓。",
        "　　四：代北复姓贺鲁氏为周氏。",
        "家族名人",
        "　　周文王，周武王",
        "　　周勃(?-前169)",
        "　　西汉开国功臣，江苏沛县人。为人质仆敦厚，为汉高祖刘邦之重臣，和陈平合谋平吕氏之乱，立文帝刘恒，为一代忠臣。",
        "　　周瑜(175-21O)",
        "　　三国东吴大都督，建安十三，联合刘备，火烧赤壁，大破曹操的八十万大军，创造以弱胜的战例。",
        "地望分布",
        "　　河南汝南郡，安徽庐江郡，湖北寻阳郡，江西临川郡，河南陈留，江苏沛郡，山东泰山郡，河南河南郡",
    ]
}
BaiIiaXingPageModule[6] = {
    "index": "百家姓",
    "name": "吴",
    "content": [
        "历史来源",
        "　　「吴」源出有三。",
        "　　一;出自「姬」姓，以国名为氏，古公亶父的长子太伯出奔江南建都于梅里(江苏无锡)号称勾吴，武王灭商后太伯的三世孙周章为诸侯。至前473年为越王勾践所灭。子孙以国名为氏。",
        "　　二;古公之子虞仲的后裔，虞通吴故为姓。",
        "　　三;齐鲁一带的吴姓，多为寿梦第四子吴季礼之后。",
        "家族名人",
        "　　吴起(前440～前381）",
        "　　战国时卫人。仕魏文侯，领兵击秦，拔五城，拜西河守。后被谮奔楚，为楚悼王相，楚日益强盛。因主张废公族之疏远者以养战士，遂招怨贵戚大臣，后被射死。李克亦称起贪而好色，然用兵，司马穰苴不能过。着有「吴子六篇」。",
        "　　吴承恩(？～公元1582）",
        "　　字汝忠，号射阳山人，明淮安山阳人。约生于孝宗弘治十三年。性敏多慧，博极群书，诗文雅丽。嘉靖二十三年贡生，授长兴县丞，隆庆初，归山阳，放浪诗酒。身后诗文多散失，邑人邱正纲编纂成射阳存稿四卷，续稿一卷。复善谐剧，着杂记数种，名震一时，尤以《西游记》一书，为明人四大奇书之一，最为脍炙人口。",
        "　　吴三桂(1612～1678）",
        "　　字长白，明末清初高邮人。崇祯年间，以总兵镇山海关，李自成陷京师，夺三桂爱妾陈圆圆，三桂乃引清兵入关，破自成，清遂入主中国。三桂受封为平西王，镇云南。后叛清，自称周帝，旋病死。",
        "地望分布",
        "　　江苏陵郡",
    ]
}
BaiIiaXingPageModule[7] = {
    "index": "百家姓",
    "name": "郑",
    "content": [
        "历史来源",
"　　「郑」源出 出自「?」姓，以国名为氏，据「通志」记臷，周宣王静分封其母弟于郑国 ( 在今陕西华县以东 ) 是为郑桓公，桓公之后，郑武公迁都于新郑，为春秋时的国。后为韩国所灭。其遗族散居于淮阳，商丘一带，以原国名「郑」为姓。",
"家族名人",
"　　郑庄公",
"　　郑和",
"　　郑成功 (公元1624～1662）",
"　　初名森，字大木，唐王赐姓朱，改名成功，为明末南安人。父平国公郑芝龙降清，成功遁入海岛与父绝。桂王封之为延平郡王招讨大将军，命率师攻闽浙，又大举下江南各地，围南京，祭孝陵，后兵失利，退取台湾作为根据地，仍奉明年号，未几而卒。",
"　　郑燮 （1693～1765）",
"　　字克柔，号板桥，清江苏兴化人。少颖悟，读书富于别解，落拓不羁，有狂士之名。乾隆进士，官山东范县、潍县知县，有循吏之称。晚年躬耕自食，以诗酒自娱，诗、书、画俱佳，着有板桥全集。",
"地望分布",
"　　河南荥阳郡",
"　　字长白，明末清初高邮人。崇祯年间，以总兵镇山海关，李自成陷京师，夺三桂爱妾陈圆圆，三桂乃引清兵入关，破自成，清遂入主中国。三桂受封为平西王，镇云南。后叛清，自称周帝，旋病死。",
"地望分布",
"　　江苏陵郡",
    ]
}
BaiIiaXingPageModule[8] = {
    "index": "百家姓",
    "name": "王",
    "content": [
        "历史来源",
"　　「王」源出有许多，帝王的后裔称王子，王孙，遂为氏。",
"　　一 ; 出于「妫」姓，相传为古帝虞舜之后，子孙在陈国，齐王田和为其后人。",
"　　二 ; 出于「子」姓。商纣时王子比干之后。",
"　　三 ; 出于「?」姓。周文王第十五子毕公高之后 ; 又周灵王太子晋，因直谏被废为庶民，迁居于琅邪 ( 今山东胶南 ) ，世人称其为「王」家，其后亦为「王」氏。",
"　　四 ; 秦灭六国后，各国王族避难散居，至汉朝初年纷纷易姓为「王」氏。",
"　　五 ; 南北朝时，西魏鲜卑族复姓可颇氏。亦改为王氏。",
"　　六 ; 古高丽国君有王氏。",
"　　七 ; 西钳耳族有王氏。",
"　　八 ; 赐姓，如燕王丹的玄孙嘉，在西汉末年王莽当朝时被赐姓「王氏」。",
"　　九 ; 冒姓，如隋末王世充本姓支氏。",
"",
"家族名人",
"　　王子乔",
"　　神话传说中的仙人。汉˙刘向˙列仙传˙卷上˙王子乔：王子乔者，周灵王太子晋也。好吹笙作凤凰鸣，游伊洛之间，道士浮丘公接以上嵩高山。三十余年后，求之于山上，见柏良，曰：告我家，七月七日，待我于缑氏山巅。至时，果乘白鹤驻山头。望之不得到，举手谢时人，数日而去。亦称为王乔、王子晋。",
"　　王翦 (生卒年不详)",
"　　战国时秦的名将，频阳（今陕西富平县东北五十里）人。事秦始皇，曾定赵、燕、蓟诸地，后为李信所谗，谢病归里，后信战败，始皇遂用翦策以平荆。",
"　　王昭君 ( 王嫱 ) (生卒年不详)",
"　　汉秭归人。元帝时选入掖庭，呼韩邪单于入朝，求美人为阏氏，帝以嫱赐之，号宁胡阏氏。晋时避司马昭讳，改称明妃。",
"　　王莽",
"　　王羲之 （321～379）",
"　　字逸少，东晋临沂（今属山东）人，后南迁为会稽人。尝为右军将军，世称王右军。善书法，所写草隶，冠绝古今，以兰亭集序、乐毅论等为最，后人称为书圣。",
"　　王安石 (1021～1086）",
"　　字介甫，号半山老人，宋临川人。博览强记，工书画，尤善诗，而文词简练。神宗时为相，改革政治，锐行新法，因反对者众多，没有成功。封荆国公，卒谥文。着有周官新义、临川集、唐百家诗选等。",
"　　王阳明 (1472～1528）",
"　　字伯安，浙江余姚人。明代大儒，弘治进士。正德时巡抚南赣，定宸濠之乱。嘉靖时封新建伯，总督两广，破断藤峡贼，卒谥文成。其学以知行合一为主，发挥致良知之教，反对朱熹格物穷理之说，讲心学渊源于宋之陆九渊，世称姚江学派。尝筑室于阳明洞，学者称「阳明先生」，有王文成公全书。",
"",
"地望分布",
"　　山西太原郡，山东琅邪郡，山东北海郡，河南陈留郡，山东东海郡，山东高平郡，陕西京兆郡，甘肃天水郡，山东东平郡，河南新蔡郡，河南新野郡，江苏山阳郡，河北中山郡，河北章武郡，山东东莱郡，山西河东郡，甘肃金城郡，四川广汉郡，江苏堂邑郡，河南河南郡，河北河间郡，河南汲郡，陕西冯翊郡，辽宁营州。",
    ]
}
BaiIiaXingPageModule[9] = {
    "index": "百家姓",
    "name": "冯",
    "content": [
        "历史来源",
        "　　「冯」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《通志．氏族略．以国为氏》所载，公元前十一世纪周武王克商后，文王第十五子毕公高，初封于毕，继封与冯城。其后代逐有冯氏。",
        "　　二 ; 春秋时郑国大夫冯简子的后代。",
        "家族名人",
        "　　冯谖",
        "　　战国齐人。孟尝君门下食客，曾以食无鱼﹑出无车，弹铗而歌，孟尝君闻而特加礼遇。后冯驩为孟尝君收债于薛城，召债主焚其券，使薛民皆感孟尝君之德。",
        "　　冯梦龙 （1574～1646）",
        "　　字犹龙，一字子犹。江苏吴县人，明文学家。崇祯贡生，知寿宁县。才情跌宕，工诗文，通经学，着有戏曲数种，尤以小说《警世通言》﹑《喻世明言》﹑《醒世恒言》著名于世，称为「三言」。",
        "　　冯玉祥 （1880～1948）",
        "　　字焕章，安徽省巢县人。清末加入新军，为段祺瑞部下。1921年任河南督军，直奉战争时倒戈倾向奉系，并迅速占领北京，推段祺瑞为总统。次年奉系失败。其后加入中国国民党，曾任西北国民军总司令、河南省主席。抗战胜利后，赴国外，在由苏俄回国时，轮船在黑海上发生火灾而被烧死。",
        "地望分布",
        "　　陕西杜城郡，福建长乐郡，陕西始平郡，河南颖川郡，山西上党郡，陜西京兆郡，河南弘农郡，河北河间郡。",
    ]
}
BaiIiaXingPageModule[10] = {
    "index": "百家姓",
    "name": "陈",
    "content": [
        "历史来源",
        "　　「陈」源出 ;",
        "　　一 ; 出自「妫」姓。公元前十一世纪周武王克商后，找到帝舜的后代胡公满 「妫」姓。封胡于陈国，今河南淮阳县。并将其女嫁给他，伺奉舜祠，其后人以国名为姓。",
        "　　二 ; 鲜卑族改姓，据《魏书》所栽，南北朝时有代北三字姓侯莫陈氏，随魏孝文帝迁都洛阳，改姓陈。",
        "　　三 ; 古代安南 ( 今越南 ) 国王有姓陈。",
        "家族名人",
        "　　陈胜 （前？～前208)",
        "　　字涉，秦阳城（今河南省登封县东）人。秦二世时，与吴广起兵，天下之士苦秦苛政，相率归向。旋自立为楚王，势力颇大，后为其部下庄贾所杀。",
        "　　陈平 (生卒年不详)",
        "　　汉初阳武（今河南省阳武县东南）人。幼嗜读书，容貌俊美，足智多谋，事高祖屡出奇策。惠帝时，官至左丞相。卒谥献。",
        "　　陈寿 （233～297）",
        "　　字承祚，晋安汉（今四川省南充县）人。少举孝廉，除著作郎。撰《三国志》，时人称其善叙事，有古良史之风。",
        "　　陈霸先",
        "　　陈圆圆",
        "　　本姑苏名妓，原姓邢名沅，字畹芬。幼从养姥陈氏姓，有殊色，后为吴三桂妾。李自成破京师，掳圆圆，三桂遂引清军入关，攻破李自成，圆圆复归三桂。后三桂为滇王，圆圆随往，以女道士卒于云南。",
        "地望分布",
        "　　河南颖川郡，河北汝南郡，江苏下邳郡，江苏广陵郡，江苏东海郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[11] = {
    "index": "百家姓",
    "name": "褚",
    "content": [
        "历史来源",
        "　　「褚」源出 ;",
        "　　一 ; 以地为氏。据《后汉书．郡国志》所载，洛阳有褚氏聚。《姓氏寻源》云 : 古有褚地，居者以为氏。",
        "　　二 ; 以官为氏。据《通志．氏族略．以官为氏》云 :  本自殷 (商) 后人宋恭公的公子段食采于褚，其德可师，号曰褚师，因而命氏。「褚师」为掌管市场的官员，又叫「市令」。春秋时期，宋国，卫国，郑国都设置褚师之官。世代为楮师者，以官为氏，省为褚氏。",
        "家族名人",
        "　　褚遂良 （596～658）",
        "　　字登善，唐钱塘（今浙江省杭州）人，初唐书法家。博涉文史，工楷、隶，书学钟繇、王羲之，而成古雅瘦劲之体。太宗时历官谏议大夫兼起居注，后与长孙无忌同受顾命。高宗即位，迁尚书左仆射，封河南郡公，帝将废后立武则天，遂良力谏不纳，乞归田里。累贬爱州刺史，忧愤而卒。",
        "地望分布",
        "　　河南河南郡。",
    ]
}
BaiIiaXingPageModule[12] = {
    "index": "百家姓",
    "name": "卫",
    "content": [
        "历史来源",
        "　　「卫」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《通志．氏族略．以国为氏》和《广韵》云 。周文王的第九子原封于康，称为康叔。周公旦平定武庚之乱后，改封康叔管殷民七族，建立卫国，都治在今河南淇县，后被秦国所灭，遗民以原国名「卫」为氏。",
        "　　二 ; 历史上鲜卑族姓氏。据《后燕录》记载，昌黎 (河北昌黎) 鲜卑族有卫氏。",
        "家族名人",
        "　　卫青   (前？～前106）",
        "　　字仲卿，汉平阳（今山西临汾）人。汉武帝时名将，以大将军伐匈奴，立功，封长平侯，卒谥烈。",
        "　　卫夫人 （272～349）",
        "　　名铄，字茂猗，晋河东安邑（今山西夏县）人。为卫恒从妹（一说从女），汝阴太守李矩之妻，书法入妙，师钟繇，擅隶书及正书，王羲之、王献之尝师之。",
        "地望分布",
        "　　山西河东郡。",
    ]
}

module.exports = { BaiIiaXingPageModule: BaiIiaXingPageModule }