
import React, { Component } from 'react';
import { AppRegistry, View, Text } from 'react-native';


var BaiIiaXingPageModule = new Array()
BaiIiaXingPageModule[0] = {
    "index": "百家姓",
    "name": "百家姓",
    "content": [
        "《百家姓》与《三字经》、《千字文》并称为三大蒙学读物。《百家姓》成书于北宋初年，原收集中文姓氏411个，后增补到504个，其中单姓444个，复姓60个。 《百家姓》读来顺口，易学好记。《百家姓》并不依照各姓氏的人口数量排序，“赵钱孙李”成为《百家姓》前四姓是因为百家姓形成于宋代吴越钱塘地区，故而宋朝皇帝赵氏、吴越国国王钱氏、吴越国王钱俶正妃孙氏以及南唐国王李氏成为百家姓前四位。",

    ],
}
BaiIiaXingPageModule[1] = {
    "index": "百家姓",
    "name": "赵",
    "content": [
        "历史来源",
        "　　「赵」姓出自「嬴」姓，据「唐书」记载，上古东夷族首领伯益的第十三世孙造父，在周穆王时传说他曾取良马八骏，献与周穆王，周穆王乘这八匹骏马西巡狩猎。来到昆仑山上，西王母在池设宴招待他，饮酒唱和乐而忘返，为周穆王御车，日趋千里，息徐偃王反叛，其后周穆王封造父于赵城，既今山西省洪洞具北，其后为赵氏。",
        "　　「百家姓」编与宋朝，皇帝的的姓氏是国姓，当然放在第一。",
        "　　「百家姓」的第一句，「赵钱孙李」，「赵」指「权」，「钱」指「金钱」。世间万事权和钱的问题是首要问题。",
        "家族名人",
        "　　赵武灵王",
        "　　赵云 ( ? - 229 )",
        "　　是三国名将，字子龙，三国时常山真定人。初从公孙瓒，后归附刘备。勇敢善战，以忠勇著称。封永昌亭侯，累迁镇军将军，卒谥顺平。",
        "　　赵匡胤",
        "　　赵飞燕　(? ～公元前１）",
        "　　汉成帝皇后。善歌舞，因体轻如燕，故称为飞燕。成帝时入宫，为婕妤，极得成帝宠幸，许后废，被立为皇后，擅宠十余年。哀帝立，尊其为皇太后，平帝初年，废为庶人，遂自杀。",
        "地望分布",
        "　　甘肃天水郡，河南南阳郡，甘肃金城郡，江苏下邳郡，河南颍川郡。",
    ],
}
BaiIiaXingPageModule[2] = {
    "index": "百家姓",
    "name": "钱",
    "content": [
        "历史来源",
        "　　「钱」源与彭姓，是以官职命民的姓氏。周朝有官职名「钱府上士」掌管财政，遂以官为氏。相传为古帝颛顼玄孙彭祖(即籛铿)的后代。",
        "家族名人",
        "　　钱元(887-941)",
        "　　五代十国时，吴越国的国王，颇建勋绩，一生好儒，招纳贤士。有诗千首。",
        "　　钱一本(1539-1610)",
        "　　明朝易学家，江苏常州人，官至征御史，因触怒明神宗被斥为民。他研河洛书，六经，尤精「易」，和顾宪成在东林学院讲席。",
        "地望分布",
        "　　江苏彭城郡(今徐州市)，江苏下邳郡(今江苏西北部)，浙江吴兴郡(今江苏宜兴一带)",
    ]
}
BaiIiaXingPageModule[3] = {
    "index": "百家姓",
    "name": "孙",
    "content": [
        "历史来源",
        "　　「孙」源出有三，?姓，芈姓，田姓。",
        "　　一 ; 春秋时卫武公的儿子惠孙任卫国上卿，他的儿子名乙，字武仲，以祖父的字命氏。",
        "　　二 ; 楚国有贤臣为敖，字孙叔，其支庶(宗族旁支)以祖字为氏。",
        "　　三 ; 齐国卿士书(敬仲的五世孙，字子占)。伐莒有功，齐景公封他到乐安，赐姓孙氏。",
        "家族名人",
        "　　孙武 (生卒不详)",
        "　　兵圣，是春秋末期军事家，齐国人，着兵法「十三章」。孙子被推崇为兵法的鼻祖，「孙子兵法」被奉为兵学圣典。",
        "　　孙权 (182-252)",
        "　　孙中山  (1866-1925)",
        "　　字逸仙，别号中山樵，世称中山先生，广东香山县人。清末，因见国势日衰，民族危亡，乃唤起同志，共组兴中会，为革命救国的团体；后递改为中国国民党，被推为总理。致力革命数十年，艰苦奋斗，百折不挠，终于辛亥一役，推翻满清，建立民国，改国体为民主共和。手创三民主义、五权宪法，手着建国方略、建国大纲，为革命建国的最高原则。民国十四年逝世于北京，二十九年国民政府颁令，尊为中华民国国父。",
        "地望分布",
        "　　山东乐安郡",
    ]
}
BaiIiaXingPageModule[4] = {
    "index": "百家姓",
    "name": "李",
    "content": [
        "历史来源",
        "　　「李」源出有四。",
        "　　一 ; 据《唐书，宰相世系表》所载，出自「嬴」姓。皋陶之后，世为大理(掌管刑法的狱官之长)，以官为姓，春秋时道家学说的创始人老子因祖辈为理官，遂以理「李」为氏，称李耳。",
        "　　二 ; 据「北史」所载，赵郡李氏，为赵将武安君之后，李左车其先也。",
        "　　三 ; 据「魏书」所载，后魏有代北鲜卑族复姓「叱李」氏，后改为汉字单姓「李」氏。",
        "　　四 ; 唐朝皇室姓「李」，「李」遂为国姓。唐初开国元勋诸将徐，邴，安，杜，胡，弘，郭，麻，鲜于，张，阿布，阿跌，舍利，董，罗，朱邪共十六姓(其中五家为复姓)赐与国姓「李」。此外还有许多家族改为李氏，由此李氏人丁大增。",
        "家族名人",
        "　　李耳 (即老子)",
        "　　春秋末期重要的哲学家，他崇尚自然，提出「人法地，地法天，天法道，道法自然」的思想，是中国重要的哲学思想「道家」的创始人。",
        "　　李世民 (599-649)",
        "　　李白 (701-762)",
        "　　中国最伟大的浪漫诗人，祖籍甘肃秦安，他被誉为诗仙。",
        "　　李自成 (1823-1864)",
        "　　明末农民义军领袖，号「闯王」，陕西米脂人。",
        "　　李鸿章 (1823～1901）",
        "　　字少荃，安徽合肥人，清代政治家。平定捻匪及太平天国有功，历任直隶、湖广、两广总督。尤善外交，曾多次代表清廷与外国签订条约。后因积劳呕血而死，晋封一等侯，卒谥文忠。",
        "地望分布",
        "　　甘肃陇西郡，河北赵郡，河南顿丘郡，辽宁渤海郡，河北中山郡，河南襄城，湖北江夏，四川梓潼，河北范阳郡，四川广汉郡，安徽梁国，河南南阳郡",
    ]
}
BaiIiaXingPageModule[5] = {
    "index": "百家姓",
    "name": "周",
    "content": [
        "历史来源",
        "　　「周」源出有四。",
        "　　一：周平王儿子烈封在汝州(今河南省)，当地人称他周家，便以周为姓。",
        "　　二：公元前256年，秦灭东周，将赧王废为庶人，王族亦称为周氏。",
        "　　三：唐玄宗李隆基于712年，因避讳「基」，下诏改天下的?姓为周姓。",
        "　　四：代北复姓贺鲁氏为周氏。",
        "家族名人",
        "　　周文王，周武王",
        "　　周勃(?-前169)",
        "　　西汉开国功臣，江苏沛县人。为人质仆敦厚，为汉高祖刘邦之重臣，和陈平合谋平吕氏之乱，立文帝刘恒，为一代忠臣。",
        "　　周瑜(175-21O)",
        "　　三国东吴大都督，建安十三，联合刘备，火烧赤壁，大破曹操的八十万大军，创造以弱胜的战例。",
        "地望分布",
        "　　河南汝南郡，安徽庐江郡，湖北寻阳郡，江西临川郡，河南陈留，江苏沛郡，山东泰山郡，河南河南郡",
    ]
}
BaiIiaXingPageModule[6] = {
    "index": "百家姓",
    "name": "吴",
    "content": [
        "历史来源",
        "　　「吴」源出有三。",
        "　　一;出自「姬」姓，以国名为氏，古公亶父的长子太伯出奔江南建都于梅里(江苏无锡)号称勾吴，武王灭商后太伯的三世孙周章为诸侯。至前473年为越王勾践所灭。子孙以国名为氏。",
        "　　二;古公之子虞仲的后裔，虞通吴故为姓。",
        "　　三;齐鲁一带的吴姓，多为寿梦第四子吴季礼之后。",
        "家族名人",
        "　　吴起(前440～前381）",
        "　　战国时卫人。仕魏文侯，领兵击秦，拔五城，拜西河守。后被谮奔楚，为楚悼王相，楚日益强盛。因主张废公族之疏远者以养战士，遂招怨贵戚大臣，后被射死。李克亦称起贪而好色，然用兵，司马穰苴不能过。着有「吴子六篇」。",
        "　　吴承恩(？～公元1582）",
        "　　字汝忠，号射阳山人，明淮安山阳人。约生于孝宗弘治十三年。性敏多慧，博极群书，诗文雅丽。嘉靖二十三年贡生，授长兴县丞，隆庆初，归山阳，放浪诗酒。身后诗文多散失，邑人邱正纲编纂成射阳存稿四卷，续稿一卷。复善谐剧，着杂记数种，名震一时，尤以《西游记》一书，为明人四大奇书之一，最为脍炙人口。",
        "　　吴三桂(1612～1678）",
        "　　字长白，明末清初高邮人。崇祯年间，以总兵镇山海关，李自成陷京师，夺三桂爱妾陈圆圆，三桂乃引清兵入关，破自成，清遂入主中国。三桂受封为平西王，镇云南。后叛清，自称周帝，旋病死。",
        "地望分布",
        "　　江苏陵郡",
    ]
}
BaiIiaXingPageModule[7] = {
    "index": "百家姓",
    "name": "八十",
    "content": [
        "周辙东，王纲坠。逞干戈，尚游说。",
        "始春秋，终战国。五霸强，七雄出。",
        "嬴秦氏，始兼并。传二世，楚汉争。",
        "高祖兴，汉业建。至孝平，王莽篡。",
        "光武兴，为东汉。四百年，终于献。",
        "魏蜀吴，争汉鼎。号三国，迄两晋。",
        "宋齐继，梁陈承。为南朝，都金陵。",
        "北元魏，分东西。宇文周，与高齐。",
        "迨至隋，一土宇。不再传，失统绪。",
        "唐高祖，起义师。除隋乱，创国基。",
    ]
}
BaiIiaXingPageModule[8] = {
    "index": "百家姓",
    "name": "九十",
    "content": [
        "二十传，三百载。梁灭之，国乃改。",
"梁唐晋，及汉周。称五代，皆有由。",
"炎宋兴，受周禅。十八传，南北混。",
"辽与金，皆称帝。元灭金，绝宋世。",
"舆图广，超前代。九十年，国祚废。",
"太祖兴，国大明。号洪武，都金陵。",
"迨成祖，迁燕京。十六世，至崇祯。",
"权阉肆，寇如林。李闯出，神器焚。",
"清世祖，膺景命。靖四方，克大定。",
"由康雍，历乾嘉。民安富，治绩夸。",
    ]
}
BaiIiaXingPageModule[9] = {
    "index": "百家姓",
    "name": "正百",
    "content": [
        "道咸间，变乱起。始英法，扰都鄙。",
        "同光后，宣统弱。传九帝，满清殁。",
        "革命兴，废帝制。立宪法，建民国。",
        "古今史，全在兹。载治乱，知兴衰。",
        "史虽繁，读有次。史记一，汉书二。",
        "后汉三，国志四。兼证经，参通鉴。",
        "读史者，考实录。通古今，若亲目。",
        "口而诵，心而惟。朝于斯，夕于斯。",
        "昔仲尼，师项橐。古圣贤，尚勤学。",
        "赵中令，读鲁论。彼既仕，学且勤。",
    ]
}
BaiIiaXingPageModule[10] = {
    "index": "百家姓",
    "name": "百十",
    "content": [
        "披蒲编，削竹简。彼无书，且知勉。",
"头悬梁，锥刺股。彼不教，自勤苦。",
"如囊萤，如映雪。家虽贫，学不辍。",
"如负薪，如挂角。身虽劳，犹苦卓。",
"苏老泉，二十七。始发愤，读书籍。",
"彼既老，犹悔迟。尔小生，宜早思。",
"若梁灏，八十二。对大廷，魁多士。",
"彼既成，众称异。尔小生，宜立志。",
"莹八岁，能咏诗。泌七岁，能赋棋。",
"彼颖悟，人称奇。尔幼学，当效之。",
    ]
}
BaiIiaXingPageModule[11] = {
    "index": "百家姓",
    "name": "百二十",
    "content": [
        "蔡文姬，能辩琴。谢道韫，能咏吟。",
        "彼女子，且聪敏。尔男子，当自警。",
        "唐刘晏，方七岁。举神童，作正字。",
        "晏虽幼，身已仕。有为者，亦若是。",
        "犬守夜，鸡司晨。苟不学，曷为人。",
        "蚕吐丝，蜂酿蜜。人不学，不如物。",
        "幼而学，壮而行。上致君，下泽民。",
        "扬名声，显父母。光于前，裕于后。",
        "人遗子，金满赢。我教子，唯一经。",
        "勤有功，戏无益。戒之哉，宜勉力。",
    ]
}

module.exports = { BaiIiaXingPageModule: BaiIiaXingPageModule }