
import React, { Component } from 'react';
import { AppRegistry, View, Text } from 'react-native';


var BaiIiaXingPageModule = new Array()
BaiIiaXingPageModule[0] = {
    "index": "百家姓",
    "name": "百家姓",
    "content": [
        "《百家姓》与《三字经》、《千字文》并称为三大蒙学读物。《百家姓》成书于北宋初年，原收集中文姓氏411个，后增补到504个，其中单姓444个，复姓60个。 《百家姓》读来顺口，易学好记。《百家姓》并不依照各姓氏的人口数量排序，“赵钱孙李”成为《百家姓》前四姓是因为百家姓形成于宋代吴越钱塘地区，故而宋朝皇帝赵氏、吴越国国王钱氏、吴越国王钱俶正妃孙氏以及南唐国王李氏成为百家姓前四位。",

    ],
}
BaiIiaXingPageModule[1] = {
    "index": "百家姓",
    "name": "赵",
    "content": [
        "历史来源",
        "　　「赵」姓出自「嬴」姓，据「唐书」记载，上古东夷族首领伯益的第十三世孙造父，在周穆王时传说他曾取良马八骏，献与周穆王，周穆王乘这八匹骏马西巡狩猎。来到昆仑山上，西王母在池设宴招待他，饮酒唱和乐而忘返，为周穆王御车，日趋千里，息徐偃王反叛，其后周穆王封造父于赵城，既今山西省洪洞具北，其后为赵氏。",
        "　　「百家姓」编与宋朝，皇帝的的姓氏是国姓，当然放在第一。",
        "　　「百家姓」的第一句，「赵钱孙李」，「赵」指「权」，「钱」指「金钱」。世间万事权和钱的问题是首要问题。",
        "家族名人",
        "　　赵武灵王",
        "　　赵云 ( ? - 229 )",
        "　　是三国名将，字子龙，三国时常山真定人。初从公孙瓒，后归附刘备。勇敢善战，以忠勇著称。封永昌亭侯，累迁镇军将军，卒谥顺平。",
        "　　赵匡胤",
        "　　赵飞燕　(? ～公元前１）",
        "　　汉成帝皇后。善歌舞，因体轻如燕，故称为飞燕。成帝时入宫，为婕妤，极得成帝宠幸，许后废，被立为皇后，擅宠十余年。哀帝立，尊其为皇太后，平帝初年，废为庶人，遂自杀。",
        "地望分布",
        "　　甘肃天水郡，河南南阳郡，甘肃金城郡，江苏下邳郡，河南颍川郡。",
    ],
}
BaiIiaXingPageModule[2] = {
    "index": "百家姓",
    "name": "钱",
    "content": [
        "历史来源",
        "　　「钱」源与彭姓，是以官职命民的姓氏。周朝有官职名「钱府上士」掌管财政，遂以官为氏。相传为古帝颛顼玄孙彭祖(即籛铿)的后代。",
        "家族名人",
        "　　钱元(887-941)",
        "　　五代十国时，吴越国的国王，颇建勋绩，一生好儒，招纳贤士。有诗千首。",
        "　　钱一本(1539-1610)",
        "　　明朝易学家，江苏常州人，官至征御史，因触怒明神宗被斥为民。他研河洛书，六经，尤精「易」，和顾宪成在东林学院讲席。",
        "地望分布",
        "　　江苏彭城郡(今徐州市)，江苏下邳郡(今江苏西北部)，浙江吴兴郡(今江苏宜兴一带)",
    ]
}
BaiIiaXingPageModule[3] = {
    "index": "百家姓",
    "name": "孙",
    "content": [
        "历史来源",
        "　　「孙」源出有三，?姓，芈姓，田姓。",
        "　　一 ; 春秋时卫武公的儿子惠孙任卫国上卿，他的儿子名乙，字武仲，以祖父的字命氏。",
        "　　二 ; 楚国有贤臣为敖，字孙叔，其支庶(宗族旁支)以祖字为氏。",
        "　　三 ; 齐国卿士书(敬仲的五世孙，字子占)。伐莒有功，齐景公封他到乐安，赐姓孙氏。",
        "家族名人",
        "　　孙武 (生卒不详)",
        "　　兵圣，是春秋末期军事家，齐国人，着兵法「十三章」。孙子被推崇为兵法的鼻祖，「孙子兵法」被奉为兵学圣典。",
        "　　孙权 (182-252)",
        "　　孙中山  (1866-1925)",
        "　　字逸仙，别号中山樵，世称中山先生，广东香山县人。清末，因见国势日衰，民族危亡，乃唤起同志，共组兴中会，为革命救国的团体；后递改为中国国民党，被推为总理。致力革命数十年，艰苦奋斗，百折不挠，终于辛亥一役，推翻满清，建立民国，改国体为民主共和。手创三民主义、五权宪法，手着建国方略、建国大纲，为革命建国的最高原则。民国十四年逝世于北京，二十九年国民政府颁令，尊为中华民国国父。",
        "地望分布",
        "　　山东乐安郡",
    ]
}
BaiIiaXingPageModule[4] = {
    "index": "百家姓",
    "name": "李",
    "content": [
        "历史来源",
        "　　「李」源出有四。",
        "　　一 ; 据《唐书，宰相世系表》所载，出自「嬴」姓。皋陶之后，世为大理(掌管刑法的狱官之长)，以官为姓，春秋时道家学说的创始人老子因祖辈为理官，遂以理「李」为氏，称李耳。",
        "　　二 ; 据「北史」所载，赵郡李氏，为赵将武安君之后，李左车其先也。",
        "　　三 ; 据「魏书」所载，后魏有代北鲜卑族复姓「叱李」氏，后改为汉字单姓「李」氏。",
        "　　四 ; 唐朝皇室姓「李」，「李」遂为国姓。唐初开国元勋诸将徐，邴，安，杜，胡，弘，郭，麻，鲜于，张，阿布，阿跌，舍利，董，罗，朱邪共十六姓(其中五家为复姓)赐与国姓「李」。此外还有许多家族改为李氏，由此李氏人丁大增。",
        "家族名人",
        "　　李耳 (即老子)",
        "　　春秋末期重要的哲学家，他崇尚自然，提出「人法地，地法天，天法道，道法自然」的思想，是中国重要的哲学思想「道家」的创始人。",
        "　　李世民 (599-649)",
        "　　李白 (701-762)",
        "　　中国最伟大的浪漫诗人，祖籍甘肃秦安，他被誉为诗仙。",
        "　　李自成 (1823-1864)",
        "　　明末农民义军领袖，号「闯王」，陕西米脂人。",
        "　　李鸿章 (1823～1901）",
        "　　字少荃，安徽合肥人，清代政治家。平定捻匪及太平天国有功，历任直隶、湖广、两广总督。尤善外交，曾多次代表清廷与外国签订条约。后因积劳呕血而死，晋封一等侯，卒谥文忠。",
        "地望分布",
        "　　甘肃陇西郡，河北赵郡，河南顿丘郡，辽宁渤海郡，河北中山郡，河南襄城，湖北江夏，四川梓潼，河北范阳郡，四川广汉郡，安徽梁国，河南南阳郡",
    ]
}
BaiIiaXingPageModule[5] = {
    "index": "百家姓",
    "name": "周",
    "content": [
        "历史来源",
        "　　「周」源出有四。",
        "　　一：周平王儿子烈封在汝州(今河南省)，当地人称他周家，便以周为姓。",
        "　　二：公元前256年，秦灭东周，将赧王废为庶人，王族亦称为周氏。",
        "　　三：唐玄宗李隆基于712年，因避讳「基」，下诏改天下的?姓为周姓。",
        "　　四：代北复姓贺鲁氏为周氏。",
        "家族名人",
        "　　周文王，周武王",
        "　　周勃(?-前169)",
        "　　西汉开国功臣，江苏沛县人。为人质仆敦厚，为汉高祖刘邦之重臣，和陈平合谋平吕氏之乱，立文帝刘恒，为一代忠臣。",
        "　　周瑜(175-21O)",
        "　　三国东吴大都督，建安十三，联合刘备，火烧赤壁，大破曹操的八十万大军，创造以弱胜的战例。",
        "地望分布",
        "　　河南汝南郡，安徽庐江郡，湖北寻阳郡，江西临川郡，河南陈留，江苏沛郡，山东泰山郡，河南河南郡",
    ]
}
BaiIiaXingPageModule[6] = {
    "index": "百家姓",
    "name": "吴",
    "content": [
        "历史来源",
        "　　「吴」源出有三。",
        "　　一;出自「姬」姓，以国名为氏，古公亶父的长子太伯出奔江南建都于梅里(江苏无锡)号称勾吴，武王灭商后太伯的三世孙周章为诸侯。至前473年为越王勾践所灭。子孙以国名为氏。",
        "　　二;古公之子虞仲的后裔，虞通吴故为姓。",
        "　　三;齐鲁一带的吴姓，多为寿梦第四子吴季礼之后。",
        "家族名人",
        "　　吴起(前440～前381）",
        "　　战国时卫人。仕魏文侯，领兵击秦，拔五城，拜西河守。后被谮奔楚，为楚悼王相，楚日益强盛。因主张废公族之疏远者以养战士，遂招怨贵戚大臣，后被射死。李克亦称起贪而好色，然用兵，司马穰苴不能过。着有「吴子六篇」。",
        "　　吴承恩(？～公元1582）",
        "　　字汝忠，号射阳山人，明淮安山阳人。约生于孝宗弘治十三年。性敏多慧，博极群书，诗文雅丽。嘉靖二十三年贡生，授长兴县丞，隆庆初，归山阳，放浪诗酒。身后诗文多散失，邑人邱正纲编纂成射阳存稿四卷，续稿一卷。复善谐剧，着杂记数种，名震一时，尤以《西游记》一书，为明人四大奇书之一，最为脍炙人口。",
        "　　吴三桂(1612～1678）",
        "　　字长白，明末清初高邮人。崇祯年间，以总兵镇山海关，李自成陷京师，夺三桂爱妾陈圆圆，三桂乃引清兵入关，破自成，清遂入主中国。三桂受封为平西王，镇云南。后叛清，自称周帝，旋病死。",
        "地望分布",
        "　　江苏陵郡",
    ]
}
BaiIiaXingPageModule[7] = {
    "index": "百家姓",
    "name": "郑",
    "content": [
        "历史来源",
        "　　「郑」源出 出自「?」姓，以国名为氏，据「通志」记臷，周宣王静分封其母弟于郑国 ( 在今陕西华县以东 ) 是为郑桓公，桓公之后，郑武公迁都于新郑，为春秋时的国。后为韩国所灭。其遗族散居于淮阳，商丘一带，以原国名「郑」为姓。",
        "家族名人",
        "　　郑庄公",
        "　　郑和",
        "　　郑成功 (公元1624～1662）",
        "　　初名森，字大木，唐王赐姓朱，改名成功，为明末南安人。父平国公郑芝龙降清，成功遁入海岛与父绝。桂王封之为延平郡王招讨大将军，命率师攻闽浙，又大举下江南各地，围南京，祭孝陵，后兵失利，退取台湾作为根据地，仍奉明年号，未几而卒。",
        "　　郑燮 （1693～1765）",
        "　　字克柔，号板桥，清江苏兴化人。少颖悟，读书富于别解，落拓不羁，有狂士之名。乾隆进士，官山东范县、潍县知县，有循吏之称。晚年躬耕自食，以诗酒自娱，诗、书、画俱佳，着有板桥全集。",
        "地望分布",
        "　　河南荥阳郡",
        "　　字长白，明末清初高邮人。崇祯年间，以总兵镇山海关，李自成陷京师，夺三桂爱妾陈圆圆，三桂乃引清兵入关，破自成，清遂入主中国。三桂受封为平西王，镇云南。后叛清，自称周帝，旋病死。",
        "地望分布",
        "　　江苏陵郡",
    ]
}
BaiIiaXingPageModule[8] = {
    "index": "百家姓",
    "name": "王",
    "content": [
        "历史来源",
        "　　「王」源出有许多，帝王的后裔称王子，王孙，遂为氏。",
        "　　一 ; 出于「妫」姓，相传为古帝虞舜之后，子孙在陈国，齐王田和为其后人。",
        "　　二 ; 出于「子」姓。商纣时王子比干之后。",
        "　　三 ; 出于「?」姓。周文王第十五子毕公高之后 ; 又周灵王太子晋，因直谏被废为庶民，迁居于琅邪 ( 今山东胶南 ) ，世人称其为「王」家，其后亦为「王」氏。",
        "　　四 ; 秦灭六国后，各国王族避难散居，至汉朝初年纷纷易姓为「王」氏。",
        "　　五 ; 南北朝时，西魏鲜卑族复姓可颇氏。亦改为王氏。",
        "　　六 ; 古高丽国君有王氏。",
        "　　七 ; 西钳耳族有王氏。",
        "　　八 ; 赐姓，如燕王丹的玄孙嘉，在西汉末年王莽当朝时被赐姓「王氏」。",
        "　　九 ; 冒姓，如隋末王世充本姓支氏。",
        "",
        "家族名人",
        "　　王子乔",
        "　　神话传说中的仙人。汉˙刘向˙列仙传˙卷上˙王子乔：王子乔者，周灵王太子晋也。好吹笙作凤凰鸣，游伊洛之间，道士浮丘公接以上嵩高山。三十余年后，求之于山上，见柏良，曰：告我家，七月七日，待我于缑氏山巅。至时，果乘白鹤驻山头。望之不得到，举手谢时人，数日而去。亦称为王乔、王子晋。",
        "　　王翦 (生卒年不详)",
        "　　战国时秦的名将，频阳（今陕西富平县东北五十里）人。事秦始皇，曾定赵、燕、蓟诸地，后为李信所谗，谢病归里，后信战败，始皇遂用翦策以平荆。",
        "　　王昭君 ( 王嫱 ) (生卒年不详)",
        "　　汉秭归人。元帝时选入掖庭，呼韩邪单于入朝，求美人为阏氏，帝以嫱赐之，号宁胡阏氏。晋时避司马昭讳，改称明妃。",
        "　　王莽",
        "　　王羲之 （321～379）",
        "　　字逸少，东晋临沂（今属山东）人，后南迁为会稽人。尝为右军将军，世称王右军。善书法，所写草隶，冠绝古今，以兰亭集序、乐毅论等为最，后人称为书圣。",
        "　　王安石 (1021～1086）",
        "　　字介甫，号半山老人，宋临川人。博览强记，工书画，尤善诗，而文词简练。神宗时为相，改革政治，锐行新法，因反对者众多，没有成功。封荆国公，卒谥文。着有周官新义、临川集、唐百家诗选等。",
        "　　王阳明 (1472～1528）",
        "　　字伯安，浙江余姚人。明代大儒，弘治进士。正德时巡抚南赣，定宸濠之乱。嘉靖时封新建伯，总督两广，破断藤峡贼，卒谥文成。其学以知行合一为主，发挥致良知之教，反对朱熹格物穷理之说，讲心学渊源于宋之陆九渊，世称姚江学派。尝筑室于阳明洞，学者称「阳明先生」，有王文成公全书。",
        "",
        "地望分布",
        "　　山西太原郡，山东琅邪郡，山东北海郡，河南陈留郡，山东东海郡，山东高平郡，陕西京兆郡，甘肃天水郡，山东东平郡，河南新蔡郡，河南新野郡，江苏山阳郡，河北中山郡，河北章武郡，山东东莱郡，山西河东郡，甘肃金城郡，四川广汉郡，江苏堂邑郡，河南河南郡，河北河间郡，河南汲郡，陕西冯翊郡，辽宁营州。",
    ]
}
BaiIiaXingPageModule[9] = {
    "index": "百家姓",
    "name": "冯",
    "content": [
        "历史来源",
        "　　「冯」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《通志．氏族略．以国为氏》所载，公元前十一世纪周武王克商后，文王第十五子毕公高，初封于毕，继封与冯城。其后代逐有冯氏。",
        "　　二 ; 春秋时郑国大夫冯简子的后代。",
        "家族名人",
        "　　冯谖",
        "　　战国齐人。孟尝君门下食客，曾以食无鱼﹑出无车，弹铗而歌，孟尝君闻而特加礼遇。后冯驩为孟尝君收债于薛城，召债主焚其券，使薛民皆感孟尝君之德。",
        "　　冯梦龙 （1574～1646）",
        "　　字犹龙，一字子犹。江苏吴县人，明文学家。崇祯贡生，知寿宁县。才情跌宕，工诗文，通经学，着有戏曲数种，尤以小说《警世通言》﹑《喻世明言》﹑《醒世恒言》著名于世，称为「三言」。",
        "　　冯玉祥 （1880～1948）",
        "　　字焕章，安徽省巢县人。清末加入新军，为段祺瑞部下。1921年任河南督军，直奉战争时倒戈倾向奉系，并迅速占领北京，推段祺瑞为总统。次年奉系失败。其后加入中国国民党，曾任西北国民军总司令、河南省主席。抗战胜利后，赴国外，在由苏俄回国时，轮船在黑海上发生火灾而被烧死。",
        "地望分布",
        "　　陕西杜城郡，福建长乐郡，陕西始平郡，河南颖川郡，山西上党郡，陜西京兆郡，河南弘农郡，河北河间郡。",
    ]
}
BaiIiaXingPageModule[10] = {
    "index": "百家姓",
    "name": "陈",
    "content": [
        "历史来源",
        "　　「陈」源出 ;",
        "　　一 ; 出自「妫」姓。公元前十一世纪周武王克商后，找到帝舜的后代胡公满 「妫」姓。封胡于陈国，今河南淮阳县。并将其女嫁给他，伺奉舜祠，其后人以国名为姓。",
        "　　二 ; 鲜卑族改姓，据《魏书》所栽，南北朝时有代北三字姓侯莫陈氏，随魏孝文帝迁都洛阳，改姓陈。",
        "　　三 ; 古代安南 ( 今越南 ) 国王有姓陈。",
        "家族名人",
        "　　陈胜 （前？～前208)",
        "　　字涉，秦阳城（今河南省登封县东）人。秦二世时，与吴广起兵，天下之士苦秦苛政，相率归向。旋自立为楚王，势力颇大，后为其部下庄贾所杀。",
        "　　陈平 (生卒年不详)",
        "　　汉初阳武（今河南省阳武县东南）人。幼嗜读书，容貌俊美，足智多谋，事高祖屡出奇策。惠帝时，官至左丞相。卒谥献。",
        "　　陈寿 （233～297）",
        "　　字承祚，晋安汉（今四川省南充县）人。少举孝廉，除著作郎。撰《三国志》，时人称其善叙事，有古良史之风。",
        "　　陈霸先",
        "　　陈圆圆",
        "　　本姑苏名妓，原姓邢名沅，字畹芬。幼从养姥陈氏姓，有殊色，后为吴三桂妾。李自成破京师，掳圆圆，三桂遂引清军入关，攻破李自成，圆圆复归三桂。后三桂为滇王，圆圆随往，以女道士卒于云南。",
        "地望分布",
        "　　河南颖川郡，河北汝南郡，江苏下邳郡，江苏广陵郡，江苏东海郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[11] = {
    "index": "百家姓",
    "name": "褚",
    "content": [
        "历史来源",
        "　　「褚」源出 ;",
        "　　一 ; 以地为氏。据《后汉书．郡国志》所载，洛阳有褚氏聚。《姓氏寻源》云 : 古有褚地，居者以为氏。",
        "　　二 ; 以官为氏。据《通志．氏族略．以官为氏》云 :  本自殷 (商) 后人宋恭公的公子段食采于褚，其德可师，号曰褚师，因而命氏。「褚师」为掌管市场的官员，又叫「市令」。春秋时期，宋国，卫国，郑国都设置褚师之官。世代为楮师者，以官为氏，省为褚氏。",
        "家族名人",
        "　　褚遂良 （596～658）",
        "　　字登善，唐钱塘（今浙江省杭州）人，初唐书法家。博涉文史，工楷、隶，书学钟繇、王羲之，而成古雅瘦劲之体。太宗时历官谏议大夫兼起居注，后与长孙无忌同受顾命。高宗即位，迁尚书左仆射，封河南郡公，帝将废后立武则天，遂良力谏不纳，乞归田里。累贬爱州刺史，忧愤而卒。",
        "地望分布",
        "　　河南河南郡。",
    ]
}
BaiIiaXingPageModule[12] = {
    "index": "百家姓",
    "name": "卫",
    "content": [
        "历史来源",
        "　　「卫」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《通志．氏族略．以国为氏》和《广韵》云 。周文王的第九子原封于康，称为康叔。周公旦平定武庚之乱后，改封康叔管殷民七族，建立卫国，都治在今河南淇县，后被秦国所灭，遗民以原国名「卫」为氏。",
        "　　二 ; 历史上鲜卑族姓氏。据《后燕录》记载，昌黎 (河北昌黎) 鲜卑族有卫氏。",
        "家族名人",
        "　　卫青   (前？～前106）",
        "　　字仲卿，汉平阳（今山西临汾）人。汉武帝时名将，以大将军伐匈奴，立功，封长平侯，卒谥烈。",
        "　　卫夫人 （272～349）",
        "　　名铄，字茂猗，晋河东安邑（今山西夏县）人。为卫恒从妹（一说从女），汝阴太守李矩之妻，书法入妙，师钟繇，擅隶书及正书，王羲之、王献之尝师之。",
        "地望分布",
        "　　山西河东郡。",
    ]
}
BaiIiaXingPageModule[13] = {
    "index": "百家姓",
    "name": "蒋",
    "content": [
        "　　「蒋」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《新唐书．宰相世系表》及《通志．氏族略．以国为氏》云 。周朝初，周公第三子伯龄受封于蒋国 ( 一说在今湖北省仙居县，一说在今河南省固始县东 ) 后被楚国所灭，遗民以原国名「蒋」为氏。",
        "家族名人",
        "　　蒋琬 (？～246)",
        "　　字公琰，三国蜀汉湘乡（今湖南省湘乡县）人。初随刘备入蜀，后为诸葛亮所重，称其为社稷才。亮卒，代亮执政，官至尚书令，封安阳亭侯。以镇静为治，后诏琬屯军汉中，又命开府，加大司马。卒谥恭。",
        "地望分布",
        "　山东乐安郡。",
    ],
}
BaiIiaXingPageModule[14] = {
    "index": "百家姓",
    "name": "沈",
    "content": [
        "历史来源",
        "　　「沈」源出 ;",
        "　　一 ; 出自「姬」姓。以国为氏。据《元和姓纂》云 。周朝初，周文王第十子季载，受封于「沈」(今河南省平舆县北 ) ， 因以国名为氏。",
        "　　二 ; 出自「姒」姓，周朝时又有侯国，沈国，其地在安徽省。此地为另一沈国。",
        "家族名人",
        "　　沈括 （1029～1093）",
        "　　字存中，宋钱塘人（今浙江省杭县）。博学多才，兼通天文、方志、律历、音乐、医药、算数等。尝出使契丹。着有梦溪笔谈、长兴集等书。",
        "　　沈周 （1427～1509）",
        "　　字启南，号石田，又号白石翁，明长洲人（今江苏省吴县）。少从陈孟贤学，及长，博综典籍，诗文俱佳，尤工于画，与唐寅、文征明、仇英并称明之四大家。着有客坐新闻、石田集、石田诗钞等。",
        "地望分布",
        "　　浙江吴兴郡。",
    ],
}
BaiIiaXingPageModule[15] = {
    "index": "百家姓",
    "name": "韩",
    "content": [
        "历史来源",
        "　　「韩」源出 ;",
        "　　一 ; 出自「姬」姓。以邑为氏。据《通志。氏族略》所载，周成王分封其第叔虞于唐邑 (山西翼城 )。因邻晋水，叔虞之子燮( 音 谢 )继位后，称为晋侯。晋穆侯之孙毕万受封于韩原 ( 陜西韩城 )，其后逐有韩氏。",
        "　　二 ; 以国为氏。战国七雄之一有韩国，三家分晋以后，于前403年由周威烈王承认为诸侯，建都阳翟 ( 今河南新郑县 )。前 230 年，韩国被秦国攻灭。国族后人有的以「韩」为氏。",
        "　　三 ; 据《魏书．官氏志》所载，北魏有代北三字姓「出大汗」氏，后改为汉字单姓「韩」氏。",
        "家族名人",
        "　　韩非 （？～前234)",
        "　　战国时韩国的诸公子之一。喜刑名法术之学，而归本于黄老，为人口吃而不能流利地辩说，与李斯同受业于荀卿。曾以书谏韩王而不见用，于是发愤著书五十余篇，号为韩非子。文章峻严峭深，集法家之大成。后秦王攻韩，韩王遣非使秦，为李斯所谮，下狱而死。",
        "　　韩信 (？～前196）",
        "　　淮阴人，年轻时曾忍少年胯下之辱，后助汉高祖伐魏、举赵、降燕、破齐，封为齐王，后徙封楚王，高祖疑其背叛，伪作云梦之会，擒置咸阳，降封淮阴侯，终为吕后所杀。",
        "　　韩愈 （768～824）",
        "　　字退之，唐河阳人。通六经百家之学，崇儒辟佛老，文章自成一家，为后世治古文者所取法。官至吏部侍郎。祖先世居昌黎，因此自称为昌黎韩愈。卒谥文，宋代元丰年间追封为昌黎伯，世称为「韩昌黎」。门人编次其诗文为昌黎先生集。",
        "　　韩湘子",
        "　　唐朝韩愈的侄子。生性放荡不拘，不好读书，世传其学道成仙，为八仙之一。尝于初冬季节令牡丹开花数色，又尝令聚盆覆土，顷刻开花。见唐˙段成式˙酉阳杂俎˙卷十九˙广动植之四。或称为「韩湘」。",
        "　　韩世忠 （1089～1151）",
        "　　字良臣，宋延安人。高宗时，平苗傅、刘正彦之乱，破金兀朮于黄天荡，名重当时，称为中兴第一功臣。后以秦桧主和，罢其兵柄，乃口不谈兵，隐居西湖，自号清凉居士。卒谥忠武，孝宗追封蕲王。",
        "　　韩侂冑 （1151～1207）",
        "　　字节夫，宋安阳人，韩琦的曾孙。宁宗时专权十余年，官至平章军国事。专横恣肆，斥理学为伪学，使朱熹等人均获罪。后欲立功以自固，乃北伐金人，终兵败被斩首。",
        "地望分布",
        "　　江西豫章郡。",
    ]
}
BaiIiaXingPageModule[16] = {
    "index": "百家姓",
    "name": "杨",
    "content": [
        "历史来源",
        "　　「杨」源出;",
        "　　一;出自「姬」姓。以国为氏。据《元和姓纂》云。周武王分封其第叔虞于唐邑(山西翼城)。出公子齐，生伯侨，天子封为杨侯，以国为氏。",
        "　　二;为五胡十六国时氐族姓氏，据《晋书》云;氐有杨氏，世居仇池(甘肃仇池山)。",
        "　　三;据《魏书．官氏志》所载，北魏有代北姓「莫胡芦」氏，后改为汉字单姓「杨」氏。",
        "　　四;出自「扬」姓。以邑为氏。古时有「扬氏邑」。",
        "家族名人",
        "　　杨戬(二郎神)",
        "　　杨坚，杨广",
        "　　杨玉环(杨贵妃)",
        "　　杨行密(852～905)",
        "　　字化源。五代吴国开国君主。庐州合肥人。少为群盗，占据庐州，唐昭宗拜为淮南节度使，封吴王，悉有淮南江东地，在位十五年。后其子溥称帝，追尊为太祖武皇帝。",
        "　　杨业",
        "　　宋朝太原人。初事北汉，骁勇善战，赐姓刘，名继业。北汉亡，归宋，刺代州，积功迁云州观察使，后潘美以忠武军节度使北征，业副之，连拔应、寰、朔各州。会契丹国母萧氏率众南下，复陷寰州，业等在朔州，蔚州刺史王侁等偪业赴敌，既战而败，援兵不至，力竭被擒，不食三日死。后杨氏几代杨延昭，杨文广一直为北宋王朝捍卫疆土，杨家将的忠勇事为后人传诵。",
        "　　杨秀清(？～1856)",
        "　　原名嗣龙，清朝广西桂平人。因与洪秀全约为兄弟，故改名秀清。与秀全同起事，屡败清兵，封东王，太平军号令几全出自秀清，权势颇盛，故世并称洪杨，后为韦昌辉所杀。",
        "地望分布",
        "　　河南弘农郡，甘肃天水郡，河南河内郡。",
    ]
}
BaiIiaXingPageModule[17] = {
    "index": "百家姓",
    "name": "朱",
    "content": [
        "历史来源",
        "　　「朱」源出 ;",
        "　　一 ; 出自「曹」姓。以国为氏。据《元和姓纂》和《通志。氏族略》云 。周武王封曹挟于邾国 (金山东邹县 )。后被楚宣王所灭，其遗族以原国名去邑为「朱」氏。",
        "　　二 ; 据《魏书．官氏志》所载，北魏有鲜卑姓「渴烛浑」氏，「朱可浑」氏，于北魏孝文帝时南迁洛阳，改为汉字单姓「朱」氏。",
        "家族名人",
        "　　朱亥",
        "　　人名。生卒年不详。战国时魏人，以屠为业。时秦围赵邯郸，魏遣晋鄙率军救赵，因惧秦兵，便留军于邺，逗留观望。魏公子无忌得侯嬴献计盗得兵符，侯嬴又荐朱亥与之同行。至魏营，晋鄙疑信陵君有诈，朱亥即出袖中铁椎击杀晋鄙，夺得兵权，破秦师，遂解邯郸之围。",
        "　　朱士行",
        "　　生卒年不详。三国魏颖川（今河南省禹县）人。因感当时所译的般若经文句艰涩，难以理解，决定西行求法，是中国最早西行求法的僧人。",
        "　　朱全忠",
        "　　朱熹 (1130～1200）",
        "　　字符晦，后改字仲晦，晚号晦翁，又号晦庵、紫阳。宋婺源人，侨寓建州。曾讲学于建阳考亭，因号考亭，晚筑草堂于云谷山，又号云谷老人。累官宝文阁待制，卒谥文，后世尊称朱子或朱文公。宝庆中赠太师，追封信国公、徽国公。其学以居敬穷理为主，集宋代理学之大成。编次著述之书甚多，所注四书，明清科举奉为程准。",
        "　　朱元璋",
        "地望分布",
        "　安徽沛郡，安徽丹阳，安徽永城，江苏吴郡，浙江钱塘，河南太康，江苏丹徒，河南河南郡 ( 今洛阳 )。 ",
    ]
}
BaiIiaXingPageModule[18] = {
    "index": "百家姓",
    "name": "秦",
    "content": [
        "历史来源",
        "　　「秦」源出;",
        "　　一;出自「姬」姓。以邑为氏，据《古今姓氏书辨正》所载，周朝周公旦之子伯禽受封鲁国，裔孙以公族大夫者食采于秦邑(今河南省范县北)，以邑名「秦」为氏。",
        "　　二;出自「嬴」姓。以国为氏。据《元和姓纂》云。嬴姓之后，伯益裔孙非子，周孝王封之于秦，陇西秦亭是也。至始皇灭六国，子婴归汉，子孙以国为氏。",
        "　　三;古代大秦(罗马帝国)商人秦论。公元226年由海道抵达吴国，曾谒见孙权，谈及大秦的风土人俗，后归本国。",
        "家族名人",
        "　　秦穆公，秦孝公，秦始皇",
        "　　秦琼(?-628)",
        "　　字叔宝，隋代历城人，事唐太宗于长春宫，骁勇善战，常为先锋，征战屡建奇功，经大小二百余阵，以旌战之功封翼国公，拜左武卫大将军。卒后改封胡国公。图形于凌烟阁(唐代为表章有功的大臣，建凌烟阁，放置功臣像)。",
        "　　秦观(1049～1100）",
        "　　字少游，号太虚，北宋高邮人。官太学博士，累迁国史院编修官。少豪隽慷慨，工诗文，词风柔婉，世称秦淮海。着有淮海集四十卷。",
        "　　秦桧（？～1155）",
        "　　字会之，宋江宁人。性阴险，晚年残忍尤甚。高宗时为相，挟金人以自重，力持和议，阻止恢复，诬杀岳飞等，一时忠臣良将殆尽，和议乃成。卒谥忠献，宁宗改谥缪丑。",
        "　　秦良玉",
        "　　生卒年不详。明石砫宣抚史之妻，忠州人。饶胆智，善骑射，兼通词翰，仪度娴雅。驭下严峻，每行军发令，戎伍肃然，所部号白杆兵，远近所惮。天启崇祯年间，屡立战功，官至总兵，拜都督佥事。",
        "地望分布",
        "　　甘肃天水郡，山西太原郡。",
    ]
}
BaiIiaXingPageModule[19] = {
    "index": "百家姓",
    "name": "尤",
    "content": [
        "历史来源",
        "「尤」源出 ;",
        "一 ; 出自「沈」姓。据《梁溪漫录》所载，五代时，王审之在福建称闽王。闽人为避「审」的嫌名 (「审」和「沈」字同音 ) ，把「沈」字去掉三点水旁，余下半个字改为「尤」。",
        "二 ; 据《后汉书．卷七十七》已有尤利多，尤还。在东汉时已见「尤」氏的记载。",
        "家族名人",
        "尤袤 （1127～1194）",
        "字延之，宋常州无锡人。少颖异，入太学，以词赋冠多士，绍兴十八年擢进士，累官国史侍讲，后除礼部尚书。尝取孙绰遂初赋以自号，光宗曾书匾赐之，年七十而卒，谥文简。着有遂初小稿等，为南宋四大家之一。",
        "尤侗 （1618～1704）",
        "字同人，更字展成，号悔",
    ]
}
BaiIiaXingPageModule[20] = {
    "index": "百家姓",
    "name": "许",
    "content": [
        "历史来源",
        "　　「许」源出 ;",
        "　　一 ; 出自「姜」姓。以国为氏。据《通志．氏族略．以国为氏》所载，公元前十一世纪周武王克商后，封伯夷的后人文叔与许国，称为许文叔。旧址在今河南省许昌市。春秋时为郑，楚等国所逼，前533年迁都叶，前524年迁都白羽 ( 今河南西峡县 )，前524年迁容城 ( 今河南鲁山县 )。战国初为楚国所灭，其后代逐有「许」氏。",
        "　　二 ; 传说帝尧时许由的后代。历史上并无证实记在此人，为神话人物。",
        "家族名人",
        "　　许由",
        "　　字武仲，生卒年不详。上古之高士，阳城槐里人。据传帝尧以天下让之，不受，隐于箕山；尧又欲官之，由谓其言污耳，乃洗耳于颍水之滨。死后，葬于箕山顶，尧号为「箕山公神」，以配食五岳。",
        "　　许慎 （58？～147？)",
        "　　字叔重，汝南召陵（今河南郾城）人。东汉经学家、文字学家。性淳笃，少博学经籍，师事贾逵，专攻古文经学，时人誉为五经无双许叔重，官至太尉、南阁祭酒。着有五经异义，今已亡佚。又着有说文解字十四卷，为中国第一部系统分析字形和考究字原的专著，对后世影响很大。",
        "　　许景澄 （1845～1900）",
        "　　字竹筠，清浙江嘉兴人。同治时进士，授编修。光绪年间出使日、俄、法、德、义、奥等国，庚子时官至吏部侍郎。后因诋斥义和团，触怒慈禧太后，被杀，后得昭雪，追谥文肃。着有外国师船图表等书。",
        "地望分布",
        "　　河北高阳郡，河南汝南郡。",
    ]
}
BaiIiaXingPageModule[21] = {
    "index": "百家姓",
    "name": "何",
    "content": [
        "　　「何」源出 ;",
        "　　一 ; 出自「姬」姓。为「韩」氏音化而成，据《元和姓纂》所载，周成王分封其第叔虞于韩。其孙韩王安，原居韩邑 ( 一说在山西河津县 ) 为秦国所灭。子孙分散于江淮之间。江淮方言，音「韩」变「何」，逐为「何」氏。",
        "　　二 ; 据《五代史》，吐谷浑族有「何」氏。又据《唐书》所载，「何」氏为「昭武九姓」之一。隋唐时期，祁连山北邵武城 ( 今甘肃省临泽县 ) 有康国，后为匈奴击败，迁至中亚，建立了安，曹，何，康，石，米，史，火寻，戊地等九个小国。唐高宗永徽年间，「昭武九姓」先后归附内地，其中有「何」氏。",
        "　　三 ; 汉代有「何」苗，本为「朱」氏，冒姓「何」氏，见于《汉书．五行志》所载，其后子息皆为望族。",
        "　　四 ; 又据《兰州府志》所载，元代有吐蕃宣慰使锁南，其子锁铭，余明代官拜河州卫指挥同知，朱明王朝赐姓何氏。",
        "家族名人",
        "　　何仙姑",
        "　　生卒年不详。相传为唐朝永州（今湖南省零陵县）人。名琼。为八仙之一，以手执荷花为特征。",
        "　　何进（？～189)",
        "　　东汉南阳宛（今河南南阳）人。字遂高。因异母女弟为灵帝后，故得权，拜为大将军，讨黄巾贼，以发贼党奸，封慎侯。何太后临朝，进为太傅，后因谋诛宦官，反为所害。",
        "地望分布",
        "　　安徽卢江郡，江苏东海郡。",
    ]
}
BaiIiaXingPageModule[22] = {
    "index": "百家姓",
    "name": "吕",
    "content": [
        "历史来源",
        "　　「吕」源出 ;",
        "　　一 ; 出自「姜」姓。以国为氏。据《通志．氏族略．以国为氏》所载，夏朝有「吕」国，在河南省南阳市，周宣王时，吕国改为甫国。春秋时，被楚国所灭。其后有吕氏。",
        "　　二 ; 据《魏书．官氏志》所载，北魏有代北姓「比丘」氏，后改为汉字单姓「吕」氏。",
        "家族名人",
        "　　吕洞宾",
        "　　吕尚",
        "　　吕不韦  (前？～ 前235)",
        "　　战国时秦人。本为商贾，因有功于秦庄襄王，而为秦相，后封文信侯。曾以有孕之姬献给庄襄王，生子政，即秦始皇。始皇时尊为仲父，后与太后私通，畏罪自杀。居相位时，曾使门客着「吕氏春秋」一书。",
        "　　吕后",
        "　　吕布",
        "　　字奉先，东汉九原人，勇冠三军，武艺超群。为董卓义子，后因董卓暴虐，与王允连手杀董卓，拥兵割据，最后为曹操所擒杀。",
        "　　吕蒙（178～219）",
        "　　字子明，富陂人。三国时吴国名将，曾计夺荆州、擒关羽，授南郡太守，封孱陵侯。",
        "　　吕光 (337～399）",
        "　　字世明。后凉开国君主，略阳氐人（故治在今陜西省秦安县东南八十里）。初事苻坚，苻坚死后，自称凉州牧，建元太安；后以麟见金泽县，改号麟嘉，称三河王；又七年，改元龙飞，称天王。在位十年，谥号懿武皇帝。",
        "　　吕留良 （1629～1683）",
        "　　字庄生，又名光纶，又字用晦，号晚村，晚号何求老人，清浙江石门县（今崇德县）人，生于明末。著作中含有种族思想，并誓不仕清。死后因牵涉曾静文字，被毁墓戮尸，全家抄斩。",
        "地望分布",
        "　　山西河东郡，山东东平郡。",
    ]
}
BaiIiaXingPageModule[23] = {
    "index": "百家姓",
    "name": "施",
    "content": [
        "历史来源",
        "　　「施」源出 ;",
        "　　一 ; 出自「子」姓，为「殷民七族」之一。据《左传》所载，周初，武王之弟康叔受封为卫侯，分到了「殷民七族」;陶氏，施氏，繁氏，樊氏等。施氏为制旗帜的工匠。",
        "　　二 ; 以国为氏。夏代诸侯国有「施氏」之国，在今湖北省恩施县，其后有「施」氏。",
        "　　三 ; 出自「姬」姓，以王父字为氏。据《通志．氏族略》所载，春秋时鲁惠公之子字施父，其支孙以王父 ( 祖父 ) 之字为氏。",
        "家族名人",
        "　　施之常",
        "　　春秋时鲁国人，为孔门弟子。",
        "　　西施",
        "　　春秋越国美女。生卒年不详。越国苎萝（今浙江诸暨县南）人。本为浣纱女，适越王句践为吴所败，欲献美女以乱其政，乃令范蠡献西施，吴王大悦，果迷惑忘政，后为越所灭。见《汉˙赵晔˙吴越春秋˙卷九˙句践阴谋外传》。亦称为西子、先施。",
        "　　施琅",
        "　　字尊侯，号琢公，清晋江人，生卒年不详。初为明代郑芝龙部将，降清后，平台湾，灭郑氏，封靖海侯，卒谥襄壮。",
        "地望分布",
        "　　江苏吴兴郡。",
    ]
}
BaiIiaXingPageModule[24] = {
    "index": "百家姓",
    "name": "张",
    "content": [
        "历史来源",
        "　　「张」源出 ;",
        "　　一 ; 出自「姬」姓，据《通志．氏族略．以字为氏》所载，张氏，世代仕晋，晋分为三，又世代仕韩，后渐成望族。",
        "　　二 ; 改姓，三国魏张辽原姓「聂」，改姓「张」。又三国蜀诸葛亮赐南蛮酋长龙佑那为「张」氏。",
        "　　三 ; 「张」氏自汉代以后，人数渐多，与当时道教的兴起与流行有关。道教自称源与黄帝，而盛行「黄帝赐姓张氏」的说法，道教领袖如张角，张鲁等。",
        "　　四 ; 据《元和姓纂》云 ﹔「黄帝第五子青阳生挥，为弓正，观孤星，始制弓矢，主祀张星，因姓张氏」。",
        "家族名人",
        "　　张仪 （前？～309）",
        "　　战国时魏人。相秦惠王，以连横之策游说六国，使六国背叛纵约以事秦。惠王卒，六国复合纵以背秦，群臣谗之，乃去秦而为魏相，一年后卒。",
        "　　张良   (前   ? - 前  186)",
        "　　字子房。汉初名臣。本是韩国公子，秦灭韩，良欲为觊齁仇，乃使人击始皇于博浪沙，不中，遂更姓名，隐于下邳，而受太公兵法于圯上老人。后为高祖策画定天下，封留侯，晚好黄老，学辟谷之术。卒谥文成。",
        "　　张道陵  (34～155）",
        "　　道教的真正创教者，本名陵，东汉沛国（今安徽省宿县西北）人。以符水禁咒法惑人，从学者须出五斗米，故世称五斗米道。亦称为张天师。",
        "　　张飞  (？～271）",
        "　　字益德，一作翼德，三国蜀汉涿郡（今河北省涿县）人。少与关羽俱事刘备，号万人敌。官至车骑将军，封西乡侯。刘备伐吴，飞率兵会合，出兵前为部下所杀。谥桓。",
        "　　张丽华",
        "　　南朝陈后主妃，神采艳丽，聪慧强记，后主常抱置膝上，共商军国大事。国亡，与后主俱入井，隋军擒而斩之。后祀奉为十月芙蓉花神。",
        "　　张果老",
        "　　张居正（1525～1582）",
        "　　字叔大，号太岳，明江陵人。穆宗时入阁，神宗时为首辅，综核名实，信赏必罚，整饬纪纲，推行一条鞭法，为相十年，海内称治。卒谥文忠。着有太岳集、帝鉴图说等。",
        "　　张骞 （？～前114)",
        "　　字子文，西汉成固（今陕西省城固县）人。武帝时以军功封博望侯，旋拜中郎将，出使乌孙，分遣副使至大宛、康居、大夏等，自此西北诸国方与汉交通，使汉朝能与中亚交流，并打通前往西域的南北两条通路，引进优良马种、葡萄及苜蓿等。",
        "　　张旭",
        "　　字伯高，唐代吴（今江苏苏州）人，生卒年不详。为著名书法家，以草书最为知名，有草圣之称。其书法逸势奇状，连绵回绕，具有新风格。与李白歌诗、裴旻剑舞并称三绝。相传他往往大醉后呼喊狂走，挥洒落笔，有时以发濡墨而书，故世称为张颠、书颠。",
        "　　张士诚 （1321～1367）",
        "　　小字九四，元朝泰州（今江苏省泰县）人。元末群雄之一。本从事运盐业，后据吴中，自称吴王，后为明将徐达、常遇春所擒，自杀身亡。",
        "　　张三丰",
        "　　生卒年不详。宋武当道士，所创太极拳术，闻名当时，其法传于后世，称内家拳，又称武当派。或作张三峰。(2) 名全，一名君宝，号三丰，明朝辽东懿州（今黑山县境）人，生卒年不详。因其不修边幅，又称张邋遢。史称其辟谷数月不饥，事能前知，太祖、成祖求之，皆不得，英宗时赠为通微显化真人。",
        "地望分布",
        "　　河南青河郡，河南南阳郡，江苏吴郡，甘肃安定郡，甘肃敦煌郡，甘肃武威郡，河北范阳郡。",
    ]
}
BaiIiaXingPageModule[25] = {
    "index": "百家姓",
    "name": "孔",
    "content": [
        "历史来源",
        "　　「孔」源出 ;",
        "　　一 ; 出自「子」姓，以王父为字氏，据《史记．孔子世家》所载 ; 孔子，宋微子之后。宋襄公弗父何，弗父何生宋父周，周生世子胜，胜生正考父，考父生孔父嘉。五世亲尽，别为公族，姓孔氏。孔父嘉生木金父，木金父生睪夷，睪夷生防叔。防叔畏华氏之逼，奔鲁。其叔为叔梁纥，生子孔丘。",
        "　　二 ; 出自「姬」姓，据《姓考》所载，春秋时卫国有孔悝，以王父字为氏，其后有姬姓之孔氏。",
        "　　三 ; 出自「妫」姓，。春秋时陈国有孔宁，王父字为氏，其后有「妫」姓之孔氏。",
        "　　四 ; 又据《左传》所载，春秋时郑穆公之后有孔张，其支孙以王父字为氏，为郑国的姬姓孔氏。",
        "家族名人 ",
        "　　孔子 (前551～前479）",
        "　　名丘，字仲尼，东方文化的代表之一，儒家思想的创始人，春秋鲁人。生有圣德，学无常师，相传曾问礼于老聃 (老子，道家思想的创始人 )，学乐于苌弘，学琴于师襄。初仕鲁，为司寇，摄行相事，鲁国大治。后周游列国十三年，不见用，年六十八，返鲁，晚年致力整理古代经典。有弟子三千，身通六艺者七十二人，开平民教育先河，后世尊为至圣先师。亦称为孔子。可惜他的思想由汉武帝开始，广被中华帝国的统治者所利用，变成统治者用来约束人民思想的有效工具，大大影响了中华帝国的发展。",
        "　　孔融 (153～208）",
        "　　字文举，东汉曲阜人，孔子二十世孙。有俊才，为建安七子之一，汉献帝时为北海相，世称孔北海；立学校，表儒术，后拜大中大夫，为曹操所杀。",
        "　　孔祥熙 (1880～1967）",
        "　　字庸之，山西太谷人。留学美国耶鲁大学。历任国民政府委员、财政部长 ( 为当时中国的首富 )、行政院长、中央银行总裁等职。",
        "地望分布",
        "　　山东鲁郡。",
    ]
}
BaiIiaXingPageModule[26] = {
    "index": "百家姓",
    "name": "曹",
    "content": [
        "历史来源",
        "　　「曹」源出 ， 曹是为中国最古老的姓氏之一 ;",
        "　　一 ; 古代曹姓的后裔，在公元前十一世纪周武王克商后，受封于邾国 (今山东邹县 ) ，后被楚国所灭，其子孙或为朱氏，或为曹氏。",
        "　　二 ; 出自「姬」姓。以国为氏。文王第十三子叔振铎，受封于陶丘。后被宋国所灭，其国人以「曹」为氏。",
        "　　三 ; 据《新唐书》，为少数民族「昭武九姓」（见「何」氏）之一。隋唐时期，西北突部落建有康居国，其支庶分出小国「曹」国，在今乌孜別克斯坦撤马尔罕东北部。其族人有入中原定居者，于汉族融合，用汉姓「曹」",
        "家族名人",
        "　　曹参 (？～前190）",
        "　　字敬伯，汉初沛人。与萧何同佐高祖定天下，封平阳侯，继萧何为相，一遵萧规。卒谥懿。",
        "　　曹娥 （130～143）",
        "　　东汉上虞人。其父溺死于江中，不得尸骸。娥时年十四，沿江号哭十七昼夜，投江而死。经五日，抱父尸浮出。世传为孝女。",
        "　　曹操",
        "　　曹丕（187～226）",
        "　　字子桓，三国时魏武帝之子。汉建安十六年为五官中郎将，兼副丞相。父卒，嗣为丞相。建安二十五年代汉即帝位，在位七年。性好文学，博闻强识。作有典论及诗赋函札百余篇。卒谥文帝。",
        "　　曹植 （192～232）",
        "　　字子建，三国时魏武帝第三子，文帝之弟。十岁能属文，甚得武帝宠爱。文帝立，忌其才而不重用，封陈王。植才思捷，词藻富丽，尤长于诗。六朝诗人多受其影响，谢灵运尝言：天下才共一石，子建独得八斗。卒谥思，世称为陈思王。着有曹子建集十卷。",
        "　　曹雪芹 （1719～1764）",
        "　　名沾，字梦阮，号芹溪、芹圃，清汉军正白旗人，曹寅之孙。工诗善画。本世家子，后家道中落，因追怀往昔，相传着《红楼梦》八十回，未成病卒。高鹗为续作四十回，合为一百二十回，盛行于世。",
        "　　曹国舅",
        "　　传说中的八仙之一。学道山岩间，遇钟离权、吕洞宾二仙而得道。因相传为宋曹太后之弟，故称为曹国舅。",
        "地望分布",
        "　　安徽焦郡，江苏彭城郡，山东高平郡，山东巨野郡。",
    ]
}
BaiIiaXingPageModule[27] = {
    "index": "百家姓",
    "name": "严",
    "content": [
        "历史来源",
        "　　「严」源出 ， 严是为中国较为晚的姓氏之一 ;",
        "　　避讳改姓。据《元和姓纂》及《通志．氏族略．以谥为氏》所载，严氏本为庄氏。战国时楚王侣，谥号为「庄王」，其支庶子孙逐有庄氏。东汉时，汉明帝为刘庄，为讳避皇帝的名讳，令庄氏改姓「严」氏 ( 「庄」 ，「严」两字同义 )。西汉时的庄光后改为严光。魏晋之际，有复姓本姓「庄」者，故有庄，严二氏之分。",
        "家族名人",
        "　　严嵩 （1481～1568）",
        "　　字惟中，号介溪，明江西分宜人。世宗时为相，揽权贪贿，斥戮异己，后被劾罢官，以子世蕃仍纵恣，籍没，寄食墓舍而死。嵩善书，工诗文，着有钤山堂集。",
        "地望分布",
        "　　甘肃天水郡，陜西冯翔郡，陜西华阴郡。",
    ]
}
BaiIiaXingPageModule[28] = {
    "index": "百家姓",
    "name": "华",
    "content": [
        "历史来源",
        "　　「华」源出  ;",
        "　　出自「子」姓。以邑为氏。据《通志．氏族略．以邑为氏》所载，春秋时期，宋戴公之子考父食邑于华邑 ( 陜西华阴 ) ，其后有华氏。",
        "家族名人",
        "　　华胥",
        "　　古代神话中伏羲的母亲。",
        "　　华佗 （？～207)",
        "　　字符化，东汉谯县（今安徽省亳县）人。为当时名医，擅长外科手术，首用麻醉剂为病人开刀治疗，并创五禽戏之运动以助养生，后因忤曹操而遭杀害。医界或以他为行神。或作华陀、华坨。",
        "　　华衡芳 （1833～1902）",
        "　　字若汀，江苏金匮（今江苏无锡）人，清末数学家。官直隶州知府，精研算理。深通格致之学，蘅芳不仅曾筹划机器制造局，且翻译算学、地质诸书共十二种，一百六十余卷。后讲学二十年，成就甚众。其着译范围甚广，包括代数、三角数理、微积溯源、地学浅识、行素轩算稿、行素轩文存等。",
        "地望分布",
        "　　湖南武陵郡，山东平原郡，安徽沛国。",
    ]
}
BaiIiaXingPageModule[29] = {
    "index": "百家姓",
    "name": "金",
    "content": [
        "历史来源",
        "　　「金」源出;",
        "　　一 ; 为匈奴王后裔。据《前秦录》及《广韵》所载，汉朝时匈奴休屠王太子磾事汉武帝，武帝把太子磾化妆成金色人祭天，并赐姓「金」。",
        "　　二 ; 南北朝时，北方羌族和朝鲜半岛的新罗国皆有「金」氏。据《新唐书》记载 ; 新罗国王姓「金」。",
        "　　三 ; 改姓，《吴越备史》记载 ; 五代十国时，吴越认为避国王「钱镠」之「镠」( 「镠」与「刘」古因相通 ) ，改刘氏为金氏。",
        "家族名人",
        "　　金日磾 (前134～前86)",
        "　　字翁叔，西汉人。本匈奴休屠王太子，武帝时为马监，以功拜车骑将军。武帝崩，与霍光同受遗诏辅政，卒谥敬。相传金日磾为马夫、车夫及骡马商的行神。",
        "地望分布",
        "　　江苏彭城郡。",
    ]
}
BaiIiaXingPageModule[30] = {
    "index": "百家姓",
    "name": "魏",
    "content": [
        "历史来源",
        "　　「魏」源出  ;",
        "　　一 ; 出自「姬」姓，以邑名为氏，据《新唐书．宰相世系表》及《元和姓纂》所载，春秋时，毕公高之裔孙毕万，在晋国为大夫。公元前661年，晋献公封毕万于为邑 (今山西芮城县 ) 。毕万裔孙魏斯，与赵，韩，三家分晋，各自建国。魏斯建魏国，都安邑 ( 山西夏县 ) ，为魏文侯，成为战国七雄之一。公元前225年被秦国所灭，原王族散居各地，以原国名为氏。",
        "　　二 ; 据《史记》记载，秦国穰侯魏冉，奔出自芈姓，后改为魏氏。",
        "家族名人",
        "　　魏文侯",
        "　　魏无忌 （？～前243)",
        "　　战国时魏昭王的幼子、魏安厘王的异母弟。天性仁厚，好养士，有贤名，曾用侯嬴计，却秦救赵；秦伐魏时，率领五国兵归救魏，大破秦兵，声名威振天下。后被谗废用，遂抑郁不乐沉迷于酒色，不久即因饮醇酒多近妇女，病酒而死。与齐孟尝君、赵平原君、楚春君并称为战国四公子。因魏安厘王封其地在信陵，故亦称为信陵君。",
        "　　魏征 （580～643）",
        "　　字玄成，唐曲城（今山东省掖县）人。太宗时拜谏议大夫、检校侍中，谏诤剀切，累官至左光禄大夫，封郑国公。后总修周、隋等史，多所损益，时称良史。以疾卒于官，谥文贞。",
        "地望分布",
        "　　河北巨鹿郡，山东任城郡。",
    ]
}
BaiIiaXingPageModule[31] = {
    "index": "百家姓",
    "name": "陶",
    "content": [
        "历史来源",
        "　　「陶」源出  ;",
        "　　一 ; 以地名为氏。据《姓苑》所载，上古有陶唐氏 ( 尧帝 )，居于陶邑 ( 山东定陶县 ) ，其后有陶氏。",
        "　　二 ; 以官为氏，据《左传》所载，周初，武王弟康叔受封为卫侯，分到「殷民七族」，其中有「陶」氏，即掌管制作陶器的工匠。又据《元和姓纂》所载，周朝初年，虞阏之父虞思为陶正，即掌管陶器制作的官职。其后有陶氏。",
        "家族名人",
        "　　陶侃 (259～334）",
        "　　晋代名臣，浔阳（今湖北省黄梅县北）人，字士行，明帝时拜征西大将军，都督荆襄军事，平定苏峻之乱，初为广州刺史，每日搬运砖块以锻炼体力，为人忠顺勤劳，时人比之诸葛亮。",
        "　　陶弘景 (452～536）",
        "　　南朝秣陵人，字通明。工草隶，好道术；齐高帝时，为诸王侍读，梁时隐于句曲山，自号华阳隐居；武帝时，礼聘不出，然朝廷大事，无不咨询，时称为「山中宰相」；卒赠大中大夫，谥贞白先生。著述甚多，其本草集注一书，是将本草经依药性与种属重新整理而成。",
        "　　陶潜 (365～427）",
        "　　东晋浔阳柴桑人，陶侃的曾孙，一名渊明，字符亮，安贫乐道，尝作五柳先生传以自比，世称靖节先生，诗名尤高，堪称古今隐逸诗人的宗师。",
        "地望分布",
        "　　河南济阳郡，安徽丹阳郡，江西浔阳郡。",
    ]
}
BaiIiaXingPageModule[32] = {
    "index": "百家姓",
    "name": "姜",
    "content": [
        "历史来源",
        "　　「姜」源出  ;",
        "　　姜氏为中华民族最古老的姓之一，炎帝就是姓「姜」。",
        "　　一 ; 以地名为氏。据《说文解字》及《元和姓纂》所载，神农 ( 炎帝 ) 生于姜水，故以为姓。姜太公 ( 姜尚 ) ，封于齐国，后为田和所灭，子孙分散，逐为「姜」氏。",
        "　　二 ; 据《诗经》所载，相传周族始祖后稷之母为「姜嫄」，乃姜姓有邰氏之女。",
        "家族名人",
        "　　姜嫄",
        "　　传为有邰氏之女，「帝喾」妃，周始祖后稷之母。于野外践踏巨人足迹而生稷。见《史记˙卷四˙周本纪》。或作姜原。",
        "　　姜维 (202～264）",
        "　　字伯约，三国蜀汉天水冀县人。本为魏将，后归附蜀，为诸葛亮重用，任征西将军。诸葛亮死后，继领其军。魏军攻蜀，后主刘禅降魏，姜维被迫投降。后欲谋复国，事败被乱军所杀。",
        "　　姜夔 (1155～1221）",
        "　　字尧章，自号白石道人，宋鄱阳人。终生未出仕，常往来于鄂、赣、皖、浙、苏之间，后病死于杭州。姜氏精通音律，常自度曲，工诗，词尤精。夔词以句琢字炼、清丽婉约见胜。在白石道人歌曲六卷中，有十七首词曲均有古工尺字旁谱，为研究词乐的重要资料。宁宗广元三年进大乐议一卷及琴瑟考古图一卷，论评古今的乐制问题，建议整理宫廷音乐，但未被采纳，今已失传。着有白石道人诗集、词集、歌曲等。",
        "地望分布",
        "　　甘肃天水郡。",
    ]
}
BaiIiaXingPageModule[33] = {
    "index": "百家姓",
    "name": "戚",
    "content": [
        "历史来源",
        "　　「戚」源出;",
        "　　一 ; 以邑名为氏。据《姓谱》所载，春秋时卫国大夫孙林父食采邑于戚邑 ( 河南濮阳市 ) ，其后有戚氏。国亡后，子孙逃往东海。",
        "家族名人",
        "　　戚夫人",
        "　　生卒年不详。汉高祖的宠姬，生赵王如意。高祖屡欲立为储君，不果。高祖崩，，吕后酖赵王；杀戚夫人，去其耳目手足，置于厕所中，称为「人彘」。",
        "　　戚继光 (1528～1585？）",
        "　　明代定远人，一说蓬莱人。世袭登州卫指挥佥事，好读书，通经史大义，历官浙江参将、福建总兵官等，平倭寇，功最着，总理苏州、昌平、保定三镇练兵事，节制严明，边备修饬，后改官广东，罢归，卒谥武毅。着有纪效新书、练兵实记、止止堂集等。",
        "地望分布",
        "　　山东东海郡。",
    ]
}
BaiIiaXingPageModule[34] = {
    "index": "百家姓",
    "name": "谢",
    "content": [
        "历史来源",
        "　　「谢」源出;",
        "　　一 ; 以国名为氏。据《元和姓纂》所载，周宣王分封其舅父申伯于谢国，在河南唐河县，后子孙以国为氏。",
        "　　二 ; 据《旧唐书．文苑传》所载 ; 唐代谢偃的祖父孝政，本姓直勒氏，是鲜卑族人，后改姓为「谢」氏。",
        "家族名人",
        "　　谢安 (320～385）",
        "　　字安石，东晋阳夏人。少有重名，征辟皆不就，隐居东山，年四十余，始出为桓州司马。淝水之战任征讨大都督，指导策划，克敌有功，累官至太保，卒赠太傅，故世称谢太傅。",
        "　　谢玄 (343～388）",
        "　　东晋名将，谢安侄子，阳夏人，字幼度，具经国才略，以精锐八千，破前秦苻坚百万大军于淝水，拜前将军，封康乐县公，卒谥献武。",
        "　　谢灵运 (385～433）",
        "　　南朝文学家，谢玄之孙，小名客儿，时称谢客。袭封康乐公，又称谢康乐。少好学，工书画，文章之美与颜延之为江左第一。性好山水，肆意遨游，所至辄为题咏，以致其意。其诗开创山水写实派风格。初为太尉参军，后徙广州，有诗传世。",
        "地望分布",
        "　　河南陈留郡。",
    ]
}
BaiIiaXingPageModule[35] = {
    "index": "百家姓",
    "name": "邹",
    "content": [
        "历史来源",
        "　　「邹」源出;",
        "　　一 ; 以国名为氏。据《说文解字》所载，春秋初期有邾娄国，为鲁国的附庸小国，在山东邹县，战国时鲁穆公将「邾娄」改名为「邹」。后被楚国所灭。其后人以「邹」为氏。",
        "　　二 ; 出自子姓。据《元和姓纂》所载，为春秋时宋愍公之后，正考父食采邑于邹邑，其后亦有「邹」氏。",
        "家族名人",
        "　　邹鲁氏",
        "　　其女为帝喾之妃。黄帝战败蚩尤，千其民于「邹鲁」之地。",
        "　　邹衍 (前305?～前240?）",
        "　　战国时齐人。长于思辩，倡九州岛说、五德终始说，为阴阳家的先驱。著书立说，名重诸侯，燕昭王曾师事之。因其言论迂大而闳辩，齐人称之为「谈天衍」。",
        "地望分布",
        "　　河南范阳郡。",
    ]
}
BaiIiaXingPageModule[36] = {
    "index": "百家姓",
    "name": "喻",
    "content": [
        "历史来源",
        "　　「喻」源出;",
        "　　一 ; 西汉时，苍梧太守谕猛，始改姓为「喻」。东晋时有谕归，本为喻猛之后裔，改姓为「喻」。此后史书无谕姓，晋改为「喻」。",
        "　　二 ; 赐姓，据《宋史．儒林传》所载，南宋时有愈，为梁愈药之后，皇帝赐姓为「喻」。",
        "家族名人",
        "　　喻猛",
        "　　字骄孙，东汉人，和帝 (89-104) 时任苍梧太守，以清白为治，郡人颂之。",
        "地望分布",
        "　　湖北江夏郡，江西南昌郡。",
    ]
}
BaiIiaXingPageModule[37] = {
    "index": "百家姓",
    "name": "柏",
    "content": [
        "历史来源",
        "　　「柏」源出;",
        "　　一 ; 据《姓氏考略》所载，春秋时有柏国 ( 河南西平县 ) ，为楚国所灭，子孙以国名为姓。又据《史记．秦本纪》所载，大费拜受佐舜，调训鸟兽，鸟兽多训服，是为柏翳，舜赐姓为「嬴」。",
        "家族名人",
        "　　柏濩",
        "　　神话传说中的蜀王。《汉˙扬雄˙蜀王本纪》：蜀王之先名蚕丛，后代名曰柏濩，后者名凫，此三代各数百岁，皆神化不死。",
        "　　柏高",
        "　　神话传说中的仙人。《山海经˙海内经》：山青水之东，有山名曰 ; 「肇山」有人名曰柏高，柏高上下于此，至于天。郭璞˙注：「柏子高，仙者也。」",
        "地望分布",
        "　　河南魏郡，山东济阳郡。",
    ]
}
BaiIiaXingPageModule[38] = {
    "index": "百家姓",
    "name": "水",
    "content": [
        "历史来源",
        "　　「水」源出;",
        "　　水是中国历史上比较晚出的姓氏之一，据《姓氏五书》云 ; 水是当指水为氏，如河氏，淮氏，湖氏之类。清代浙江鄞县多水氏。或为水丘氏所改。",
        "家族名人",
        "　　共工氏",
        "　　古代神话中人物，自称水德，相传为水姓之祖。古代水官亦称共工。",
        "地望分布",
        "　　浙江吴兴郡，浙江临安郡。",
    ]
}
BaiIiaXingPageModule[39] = {
    "index": "百家姓",
    "name": "窦",
    "content": [
        "历史来源",
        "　　「窦」源出;",
        "　　「窦」出自「姒」姓。已事为氏，据《风俗演义》及《新唐书．宰相世系表》所载，夏朝夏后氏帝相失国被杀。其妃有仍方怀孕，从「窦」中逃出，奔归娘家有仍 (山东济宁市 )，生有遗腹子少康。后少康中兴，为夏王。二子曰「杼」，曰「龙」，留居有仍，逐为「窦」氏。",
        "　　又 ; 古代氐族 (分布在陜西，甘肃，四川一带)亦有「窦」氏。",
        "家族名人",
        "　　窦太后 (前205 ~ 前135)",
        "　　中华帝国黄老学派的最后一个代表人物，名「漪」，河北清河郡观津人，在吕后时被选入宫。吕后赏赐每个诸侯王宫女五名，窦漪也在被选之列。因家在清河，窦姬请求分配的宦官把她分到离家较近的赵国去。但宦官把事给忘了，她被分配到代国去，就这样她到了代国，但代王刘恒非常喜欢她，和她生了刘启和刘武。窦姬信奉黄老之学(道家学说，「黄」指黄帝，「老」指「老子」。主张无为而治，宽政待民) 在她的影向下，景帝刘启以黄老治国，在以后的日子里黄老思想成为治世的主流思想直到窦太后逝世为止，历经「文，景」二朝，再她逝世前汉武帝也不敢重用儒生。",
        "　　窦宪 (? ～公元92）",
        "　　字伯度，东汉平陵人。窦融之曾孙。和帝时曾出塞三千里，大破匈奴，乃令班固作铭，刻石燕然山上，纪汉功德。还拜大将军，族党满朝，后因专权用事，为和帝赐死。",
        "　　窦建德 (573～621）",
        "　　隋朝漳南人。隋末据河北，自称夏王，为唐太宗擒杀。",
        "地望分布",
        "　　陜西扶风郡，河北观津郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[40] = {
    "index": "百家姓",
    "name": "章",
    "content": [
        "历史来源",
        "　　「章」源出;",
        "　　「章」出自「姜」姓。已国为氏，据《通志．氏族略》所载，齐太公（姜尚）支孙封国于「鄣」（山东章丘县），公元前664年被齐国所灭，子孙去邑旁为章氏。",
        "家族名人",
        "　　章邯",
        "　　生卒年不详。秦代名将，与项羽战于巨鹿及棘原，却因赵高专权，拒却章邯所请，遂降羽，被立为雍王，王咸阳以西，都于废邱；后为汉将韩信所灭。",
        "　　章学诚（1738～1801）",
        "　　字实斋，清会稽（今浙江省绍兴县）人。乾隆进士，官国子监典籍。精于史学，以纂修方志，名重于时。所著有文史通义、校雠通义、史籍考等。",
        "地望分布",
        "　　江西豫章郡。",
    ]
}
BaiIiaXingPageModule[41] = {
    "index": "百家姓",
    "name": "云",
    "content": [
        "历史来源",
        "　　「云」源出;",
        "　　一 ﹕「云」出自「妘」姓。以国名为氏，据《左传》所载，古代「妘」国，亦作「郧」国，故址在湖北郧县，后为楚国所灭，其后有「云」，「芸」，「郧」，「员」氏。",
        "　　二 ﹕ 为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「牒云氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「云」氏。",
        "家族名人",
        "　　云英",
        "　　唐代女子，相传遇裴航于蓝桥驿，遂结为夫妻，后夫妇俱入玉峰，食丹仙去。",
        "地望分布",
        "　　河南河南郡。",
    ],
}
BaiIiaXingPageModule[42] = {
    "index": "百家姓",
    "name": "苏",
    "content": [
        "历史来源",
        "　　「苏」源出  ;",
        "　　一 ﹕「苏」出自「己」姓。以国名为氏，据《元和姓纂》所载，周武王时，司寇忿生，受封于苏国，后迁于温，称为苏忿生，春秋时，苏国被狄族所灭，其子孙以国名为氏。",
        "　　二 ﹕ 为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「拔略氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「苏」氏。",
        "家族名人",
        "　　苏秦 （前？～前317）",
        "　　字季子，洛阳人，战国时纵横家。与张仪同学于鬼谷子。早年曾外出游说，然穷困而归，后佩六国相印，为纵约长，使秦不敢东出函谷关，达十五年之久。后客于齐，被杀。",
        "　　苏武 （前143？～前60）",
        "　　字子卿，西汉杜陵人（今陕西省长安县东南）。武帝时出使匈奴，单于胁降，不屈，被留十九年，仍持汉节。昭帝时，匈奴与汉和亲，始得还，拜典属国。宣帝立，赐爵关内侯，图形麒麟阁。其著作流传于今者，有诗四首、答李陵诗及别李陵等。",
        "　　三苏",
        "　　宋苏洵与二子苏轼、苏辙皆有文名，世称为「三苏」。宋˙苏轼˙次韵子由使契丹至涿州见寄诗四首之三：「毡毳年来亦甚都，时时舌问三苏。」醒世恒言˙卷十一˙苏小妹三难新郎：「老苏生下两个孩儿：大苏﹑小苏。……天下称他兄弟，谓之二苏。称他父子，谓之三苏。」",
        "　　苏轼 （1038～1101）",
        "　　字子瞻，宋眉州眉山人，为苏洵长子。诗、词、文、书、画均有名，为文雄浑奔放，诗亦清疏隽逸，为北派大宗。王安石倡行新法，轼上书痛陈不便，得罪安石，被连贬数州。在黄州时，筑室于东坡，自号东坡居士，后累官至端明殿侍读学士。卒谥文忠。着有东坡集、东坡词等。",
        "地望分布",
        "　　河南河内郡，陜西扶风郡，陜西武功郡。",
    ]
}
BaiIiaXingPageModule[43] = {
    "index": "百家姓",
    "name": "潘",
    "content": [
        "历史来源",
        "　　「潘」源出  ;",
        "　　一 ﹕「潘」出自「姬」姓。以国名为氏，据《广韵》和《元和姓纂》所载，周文王后毕公之子季孙，食邑于「潘」，其子孙以邑名为氏。",
        "　　二 ﹕出自「芈」，以字为氏。据《通志．氏族谱》及《潘岳家谱》载，春秋时楚之公族，潘崇氏也。楚成王时任世子商臣之太师。",
        "　　三 ﹕ 为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「拔略罗氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「潘」氏。",
        "家族名人",
        "　　潘美",
        "　　字仲询，大名人，为宋初名将。从石守信平扬州﹑定金陵﹑北伐太原皆有功，官至忠武军节度使，封韩国公，卒谥武惠。",
        "　　潘安 （？～300)",
        "　　字安仁，西晋中牟（今河南省中牟县东）人。美姿仪，出洛阳道，妇人尝萦绕投果。为文词藻绝丽，尤长于哀诔，有悼亡诗，为世传诵。后孙秀诬以谋反，族诛。亦称为潘河阳﹑潘安。",
        "地望分布",
        "　　河南荥阳郡，河北广宗郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[44] = {
    "index": "百家姓",
    "name": "葛",
    "content": [
        "历史来源",
        "　　「葛」源出;",
        "　　一 ﹕「葛」出自「嬴」姓。以国名为氏，夏代，有诸侯方国「葛」国，在今河南长葛县，《孟子．腾文公》载; 汤居毫，与葛伯为邻。其后有葛氏。",
        "　　二 ﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「贺葛氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「葛」氏。",
        "　　又传说葛氏为「古葛天氏之裔」，或云在伏羲之前。",
        "家族名人",
        "　　葛天氏",
        "　　传说中的上古帝王，其治世不言而信，不化而行，是远古社会理想化的政治领袖人物。晋˙陶渊明˙五柳先生传：「无怀氏之民欤，葛天，鞴坏谢」南朝梁˙刘勰˙文心雕龙˙明诗：「昔葛天騧离膉炕玄鸟在曲；黄帝云门，理不空绮。」",
        "　　葛洪（约250～330）",
        "　　晋句容人，字稚川，自号抱朴子。好神仙导养之法，元帝召为丞相掾，因平贼有功，赐爵关内侯。着抱朴子一书，述炼丹之法，建立长生理论。又相传为油漆工的祖师爷。",
        "地望分布",
        "　　河南顿丘郡，安徽梁国郡，江苏句荣郡。",
    ]
}
BaiIiaXingPageModule[45] = {
    "index": "百家姓",
    "name": "奚",
    "content": [
        "历史来源",
        "　　「奚」源出;",
        "　　一 ﹕「奚」出自「任」姓。据《姓源》载;夏朝奚仲任车正（掌管马车的官），原职于薛（山东滕县）后迁于邳（山东微山县），其后代以「奚」为氏。",
        "　　二 ﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「薄奚氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「葛」氏。",
        "家族名人",
        "　　奚容蒧",
        "　　春秋时卫国人，志气英迈，为孔子三千弟子中七十二贤人之一。",
        "地望分布",
        "　　安徽焦国郡。",
    ]
}
BaiIiaXingPageModule[46] = {
    "index": "百家姓",
    "name": "范",
    "content": [
        "　　「范」源出;",
        "　　以邑为氏，据《元和姓纂》及《通志．氏族略》载，帝尧裔孙刘累之后，在周为唐杜氏，迁于杜邑（陜西西安东南），时称杜伯。周宣王杀杜伯，其子逃奔晋国担任士师。曾孙士会。食邑于范邑（河南范县），世称范武子，子孙逐有范氏。",
        "家族名人",
        "　　范蠡",
        "　　范雎（前？～前225)",
        "　　字叔。战国时策士，魏人，善口辩，以远交近攻的策略游说秦昭王，昭王悦，官拜秦相，封应侯。",
        "　　范增 （前275～前204)",
        "　　秦末巢（今河南省睢县南）人，项羽的谋士，辅项羽称霸诸侯，羽中汉反间而疑范增，遂弃羽而归，疽发于背而卒。亦称为亚父。",
        "　　范仲淹 （989～1052）",
        "　　范成大（ 1126～1193）",
        "　　字致能，号石湖居士。宋江苏省吴县人，有文名，尤工诗，与陆游、杨万里齐名，官至参知政事。着有石湖集、揽辔录、桂海虞衡志等。",
        "地望分布",
        "　　山东高平郡。",
    ]
}
BaiIiaXingPageModule[47] = {
    "index": "百家姓",
    "name": "彭",
    "content": [
        "历史来源",
        "　　「彭」源出;",
        "　　一﹕以国名为氏，据《元和姓纂》所载，大彭为商代的诸侯，大彭国在江苏徐州氏。其后有彭氏。一说大彭即为「彭祖」。",
        "　　二﹕为古代少数民族的姓氏。据《晋书》所载，安定胡水胡有彭氏。又据《姓氏考略》云;西羌，南蛮皆有彭氏。",
        "家族名人",
        "　　彭祖",
        "　　尧的臣子籛铿。陆终氏第三子，帝颛顼之孙，历虞夏至商，相传活了七﹑八百岁。因封于彭城，故称为彭祖。后世用以比喻长寿。",
        "　　彭蒙",
        "　　战国齐的隐士，田骈之师，思想与庄子的齐是非说相近。",
        "　　彭越",
        "　　字仲，昌邑人。为汉初功臣。佐高祖定天下，封梁王。后因人告他谋反而被杀，被刘邦诛杀他的三族。",
        "　　彭绍升",
        "　　字允初，号尺木，又号知归子及二林居士，际清是他受菩萨戒的法名。江苏长洲县人。清代著名的居士。乾隆三十四年进士及第，授县官，辞不就。因结织罗有高与阅读明朝高僧紫柏的全集，受到感动而归心佛法，尤深信净土。他在净土教义上除莲池外，最推重省庵。平日常闭关念佛，发愿回向。着有一行居士集、居士传、阿弥陀经约论、一乘决疑论等。对清代净土信仰的推展有重要的影响。",
        "地望分布",
        "　　甘肃陇西郡，江西宜春郡。",
    ]
}
BaiIiaXingPageModule[48] = {
    "index": "百家姓",
    "name": "郎",
    "content": [
        "历史来源",
        "　　「郎」源出;",
        "　　一﹕出自「姬」姓，以地名为氏，据《元和姓纂》所载，春秋时鲁懿公之孙费伯，筑郎城居之（在山东曲阜），其后有郎氏。",
        "　　二﹕历史上南匈奴的姓氏。",
        "家族名人",
        "　　朗士元",
        "　　字君胄，唐代定州人。天宝年间（744-755）进士，官至郢州刺使。善写诗，与钱起齐名。",
        "　　郎静山 （1892～1995）",
        "　　江苏省人。国际闻名之摄影家。十三岁开始接触摄影，二十五岁成为中国第一名摄影记者。在中国摄影史上，郎氏是首位人体摄影拍摄者，首位摄影课程之教师，首位入选国际摄影沙龙之中国摄影家。以自创集锦摄影闻名于世。",
        "地望分布",
        "　　河北中山郡，山东魏郡。",
    ]
}
BaiIiaXingPageModule[49] = {
    "index": "百家姓",
    "name": "鲁",
    "content": [
        "历史来源",
        "　　「鲁」源出  ;",
        "　　一﹕出自「姬」姓，以国名为氏，据《姓谱》和《元和姓纂》所载，西周初年，周公旦之子伯禽受封于鲁国（山东），传三十四代，九百余年，至鲁顷公时，灭于楚国，迁至下邑，子孙逐以国名为氏。",
        "家族名人",
        "　　鲁仲连",
        "　　战国时齐人。曾游于赵，为赵国解除危难，平原君欲赠与千金却推辞不受。喜替人排难解纷而不肯仕宦任职。后称替人解纷排难的人为鲁仲连。如：他是个古道热肠的鲁仲连，专门替人排解纷争。亦称为鲁连。",
        "　　鲁肃 （173～217)",
        "　　字子敬，东城人（今安徽省定远县东南）。三国时名将，个性方正严谨，富而好施，长于文章，思虑深远，有过人之明。在赤壁之役，建议结合刘备来抵御曹操，并辅佐周瑜大败曹军，为孙权所器重，官拜奋武校尉，转横江将军。",
        "　　鲁迅 （1881～1936）",
        "　　中国现代小说家。浙江省绍兴县人，本名周树人。作品思想深刻，具体反映中国三十年代的社会状况；在艺术上，融冶中外小说的技法而别开新局，好以讽刺的笔法，针砭中国社会的病态与人性弱点。代表作有狂人日记、阿Ｑ正传等，作品编为鲁迅全集二十卷。",
        "地望分布",
        "　　陜西扶风郡，河南新蔡郡。",
    ]
}
BaiIiaXingPageModule[50] = {
    "index": "百家姓",
    "name": "韦",
    "content": [
        "历史来源",
        "　　「韦」源出;",
        "　　一﹕出自「祁」姓，以国名为氏，据《通志．氏族略》所载，在夏朝为御龙氏，在商朝为豕为氏。又《唐书．宰相世系表》所载，豕韦国（河南滑县南）之后有韦氏。",
        "　　二 ﹕据《汉书．西域传》所载，汉代疏勒国亦有韦氏。",
        "　　三 ﹕传说秦汉之际韩信曾藏身于南粤（两广一带）为避仇，以「韩」字的半边「韦」为姓。今广西僮族多韦氏。又传说颛顼孙大彭为夏诸侯，少康封其别孙元哲于豕韦。",
        "家族名人",
        "　　韦昭 （204～273）",
        "　　字弘嗣，三国吴云阳（今江苏省丹阳县）人。好学能文，孙皓时为侍中，领修国史，因持正敢谏为孙皓所杀。所注孝经、论语、国语，均有名于世。",
        "　　韦庄",
        "　　字端己，生卒年不详，前蜀杜陵（今陜西省长安县东南）人。本为唐末进士，后入蜀依附王建，掌书记。及王建据蜀称帝，蜀开国制度皆庄所定，累官吏部尚书，同平章事，谥文靖，工诗词。着有浣花集，所为秦妇吟长诗，尤有名于世。",
        "地望分布",
        "　　陜西京兆郡。",
    ]
}
BaiIiaXingPageModule[51] = {
    "index": "百家姓",
    "name": "昌",
    "content": [
        "历史来源",
        "　　「昌」源出  ;",
        "　　一﹕出自「妊」姓，以国名为氏，据《通志．氏族略》所载，传说上古有昌意，为黄帝之子，「嫘祖」（黄帝的后）所生。",
        "家族名人",
        "　　昌意",
        "　　黄帝二十五子中的其中一位，为嫘祖所生，其后代为「昌」氏。",
        "　　昌容",
        "　　为殷商王之女，修道于常山，食蓬萦根二百余年，颜如二十许。能用紫草来染工，挣德的钱用来给有病的人。",
        "地望分布",
        "　　河南汝南郡，山东东海郡。",
    ],
}
BaiIiaXingPageModule[52] = {
    "index": "百家姓",
    "name": "马",
    "content": [
        "历史来源",
        "　　「马」源出;",
        "　　一﹕出自「嬴」姓，以邑名为氏，据《元和姓纂》所载，赵惠文王二十九年（前270年），赵国大将赵奢因战公，受封于马服（河南邯郸），称为马服君。其后有马服氏，简为马氏。",
        "　　二 ﹕据《金史》所载，西域人马庆祥，入居临洮狄道，逐以马为氏。",
        "　　三 ﹕据《元史》所载，元之月乃和，以祖为金国马步指挥使，因改姓马。名祖常。",
        "　　四 ﹕元明时期，回族依斯兰教徒多用马氏。",
        "家族名人",
        "　　马援　（前14～49）",
        "　　字文渊，东汉茂陵（今陕西省兴平县东北）人。初依隗嚣，后归光武，拜伏波将军，平交趾。援曾有「大丈夫老当益壮」及「男儿要当死于边野，以马革裹尸还葬」等语。世称「马伏波」。",
        "　　马超",
        "　　字孟起，茂陵人。勇冠西凉，乃凉州太守马腾之子，后因其父被曹操杀死，遂起二十万兵伐洛阳报父仇。杀得曹操割须弃袍，事败后投靠张鲁。曾与张飞在葭萌关大战三日三夜，其后加入刘备军，成为五虎将之一。",
        "　　马谡（190～228）",
        "　　三国时蜀臣，马良之弟，才气过人，好论军计，尝谓用兵之道，攻心为上，攻城为下，诸葛亮深加器重，后与魏将张合战于街亭，为合所败，下狱而死，亮为之流涕。",
        "地望分布",
        "　　甘肃扶风郡，山西平阳郡。",
    ]
}
BaiIiaXingPageModule[53] = {
    "index": "百家姓",
    "name": "苗",
    "content": [
        "历史来源",
        "　　「苗」源出;",
        "　　一﹕以邑名为氏，据《风俗通义》及《通志．氏族略．以邑为氏》所载，公元前547年，楚国因若敖之乱，楚大夫伯棼被杀，其子贲皇逃奔国，受封于苗邑（河南济源县），子孙逐以邑名「苗」为氏。",
        "家族名人",
        "　　苗发",
        "　　唐代壶关人。擅长写诗，与卢纶，吉中孚，司空暑，钱起等九人齐名，合称大历十大才子。",
        "地望分布",
        "　　浙江东阳郡。",
    ]
}
BaiIiaXingPageModule[54] = {
    "index": "百家姓",
    "name": "凤",
    "content": [
        "历史来源",
        "　　「凤」源出;",
        "　　一﹕据《左传》云，高辛帝时，凤鸟氏为历正（掌管历法的官），盖以职事为氏。一说，凤氏即为风氏。",
        "家族名人",
        "　　凤鸟氏",
        "　　相传为上古时代高辛氏帝喾时的历正。",
        "　　凤纲",
        "　　西汉渔阳人，相传曾采集百草花制药，服食后成仙而去。",
    ]
}
BaiIiaXingPageModule[55] = {
    "index": "百家姓",
    "name": "花",
    "content": [
        "历史来源",
        "　　「花」源出;",
        "　　是「华」所分出。参见该条。又据《姓苑》云，花氏出自何氏，由音变而成。",
        "家族名人",
        "　　花木兰",
        "　　改易男装代父从军的孝女。古乐府有木兰诗咏其事。姚莹康輶纪行以为北魏人，宋翔凤过庭录以为隋恭帝时人，程大昌演繁露以木兰诗中有可汗大点兵语。则以为非隋即唐之人。姓氏不可考，或以为姓花。",
        "　　花云",
        "　　明初名将，死于陈友凉。",
        "地望分布",
        "　　山东东平郡。",
    ]
}
BaiIiaXingPageModule[56] = {
    "index": "百家姓",
    "name": "方",
    "content": [
        "历史来源",
        "　　「方」源出;",
        "　　出自「姬」姓，以字为氏。周宣王有大臣方叔。见《诗经．小雅．采芑》云﹕「方叔止。」「方叔，卿士也。支孙以王父字「方」为氏。又，《风俗演义》云﹕相传为古帝榆罔之子方雷氏之后。",
        "家族名人",
        "　　方叔",
        "　　西周宣王（前八世纪）时的卿士，征伐古族玁狁有功。",
        "　　方孝孺（1357～1402）",
        "　　字希直，一字希古，明建文帝之忠臣，宁海人。以明王道﹑致太平为己任，工文章，名书室曰正学，官侍讲学士，因拒燕王草即帝位诏之命而被杀，福王时追谥文正。着有侯成集﹑希古堂稿等。",
        "　　方苞 （1668～1749）",
        "　　字凤九，号灵皋，晚号望溪，清安徽桐城人。官至侍郎。论学以宋儒为宗，说经推衍程朱之学，尤致力于春秋三礼。文学韩欧，严于义法，为桐城派之宗主。着有周官辨﹑春秋通论﹑礼记析疑﹑望溪文集等。",
        "地望分布",
        "　　河南河南郡。",
    ]
}
BaiIiaXingPageModule[57] = {
    "index": "百家姓",
    "name": "俞",
    "content": [
        "历史来源",
        "　　「俞」源出;",
        "　　据《通志．氏族略》载，古代有俞跗，善医，为「俞」姓之始。见于《史记》。",
        "家族名人",
        "　　俞伯牙",
        "　　春秋时人，传说以精于琴艺著名，惟知有钟子期完全理解琴意，知其志在高山流水。子期死后，伯牙终身不复鼓琴。",
        "　　俞大猷 （？～1580）",
        "　　字志辅，号虚江，晋江人，为明代名将。读书而知兵法，嘉靖武举，擢广东都司，平交黎，进参将，移浙东，屡破倭寇，升为总兵，复镇两广，剿灭群盗，平定猺乱，威震南服，号称俞家军，卒谥武襄。",
        "地望分布",
        "　　河北河间郡，湖北江陵郡。",
    ]
}
BaiIiaXingPageModule[58] = {
    "index": "百家姓",
    "name": "任",
    "content": [
        "历史来源",
        "　　「任」源出;",
        "　　一﹕「任」（妊）姓为中国最古老的姓之一。《左传正义》云﹕太昊后，谢，章，薛，舒，吕，祝，终，泉，毕，过，此十国皆「任」性也。",
        "　　二﹕出自「风」姓，以国名为氏。据《唐书．宰相世系表》及《通志．氏族略．以国为氏》所载，周代任国，在山东济宁县，其后有「任」氏。",
        "家族名人",
        "　　太任",
        "　　亦作太妊，周文王之母，为「任」姓，史称「太任」。",
        "　　任昉 （460～508）",
        "　　字彦升，南朝梁博昌人（今山东省博兴县南）。武帝时为义兴、新安太守，有政声。见宫中内藏四部古籍篇卷纷杂，于是亲自校雠勘定。着有杂传、地记等书。卒谥敬。",
        "地望分布",
        "　　山东乐安郡。",
    ]
}
BaiIiaXingPageModule[59] = {
    "index": "百家姓",
    "name": "袁",
    "content": [
        "历史来源",
        "　　「袁」源出;",
        "　　出自「妫」姓，据《通志．氏族略．以字为氏》所载，「袁」亦作「辕」，「爰」。陈胡公之裔。十八世孙庄伯生诸，字伯爰。伯爰之孙涛涂，以王父字为氏，称「爰涛涂」。亦作袁涛涂。世代为陈上卿。其后有「袁」氏。",
        "家族名人",
        "　　袁绍 （？～202)",
        "　　字本初，东阳汝阳（今河南省商水县西北）人。曾起兵讨董卓，后据河北，与曹操战于官渡，大败，发病而死。",
        "　　袁崇焕 （？～1630）",
        "　　字元素，明东莞人。有胆略，好谈兵。万历进士，天启间以御清兵着绩，累官至佥都御史，巡抚辽东。崇祯时为兵部尚书兼右副都御史，督师蓟辽，闻警入援京师，遭谗而被磔于市。",
        "　　袁枚 （1716～1797）",
        "　　字子才，号简斋，清钱塘（今浙江省杭县）人。乾隆进士，由翰林为知县，后弃官，筑随园于江宁城西，以吟咏为乐，世称随园先生。论诗主性灵，品评古今，时有新解。着有小仓山房诗文集、随园诗话、随园随笔等。",
        "　　袁世凯（1859～1916）",
        "　　字慰廷，号容庵，河南项城人。清末，为李鸿章所赏识，戊戌政变，因告密而得宠，山东巡抚，进直隶总督，嗣官外务部尚书、军机大臣。辛亥革命事起，以内阁总理大臣，挟北洋兵力，与民军议和，迫清帝退位，孙中山先生力辞大总统让之，遂为民国首任大总统。后谋行帝制，孙中山先生号召全国声讨，忧愤而死。",
        "地望分布",
        "　　河南汝南郡，河南陈郡，江苏彭城郡。",
    ]
}
BaiIiaXingPageModule[60] = {
    "index": "百家姓",
    "name": "柳",
    "content": [
        "历史来源",
        "　　「柳」源出;",
        "　　出自「姬」姓，据《元和姓纂》及《唐书．宰相世系表》所载，春秋时，鲁孝公之后有展禽，曾任鲁国士师（相当于狱官），封邑在柳下。死后缢号为「惠」。其后有「柳」氏。",
        "家族名人",
        "　　柳宗元 （773～819）",
        "　　字子厚，河东（今山西省永济县）人，故亦称为柳河东。唐代文学家。德宗贞元时进士，官至监察御史。后被贬为永州司马，又贬柳州刺史，故亦称为「柳柳州」。为唐代古文运动主将，其诗文擅于刻划山水，反映现实，风格清新峭拔。文集有柳河东集、龙城录等。",
        "　　柳敬亭 （1587～1670？）",
        "　　名逢春，秦州人。明末著名的说书人。本姓曹，为避仇家而流落江湖，休于柳下，改姓柳。曾入左良玉幕府，良玉败，又游松江马提督军中，终不得志。善说书，使人驻足聆听，乐而忘倦。",
        "地望分布",
        "　　山东河东郡。",
    ]
}
BaiIiaXingPageModule[61] = {
    "index": "百家姓",
    "name": "酆",
    "content": [
        "历史来源",
        "　　「酆」源出;",
        "　　出自「姬」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，文王第十七子受封于酆国，称为酆侯，其后以国为氏。",
        "家族名人",
        "　　酆寅初",
        "　　元末明初人，字复出。博学多才，不愿为元朝做官而隐居，洪武年间任国子司业，后弃官，活至105岁。",
        "地望分布",
        "　　陜西京兆郡。",
    ],
}
BaiIiaXingPageModule[62] = {
    "index": "百家姓",
    "name": "鲍",
    "content": [
        "历史来源",
        "　　「鲍」源出;",
        "　　一﹕出自「姒」姓，以国名为氏。据《元和姓纂》和《通志．氏族略》所载，春秋时，夏禹后人，杞国公子敬叔，到齐国出任，食邑于鲍邑。因以鲍为氏。其子鲍叔牙，曾孙鲍国，世代为上卿。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「俟力伐氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「鲍」氏。又代北复姓有「鲍俎」氏。",
        "家族名人",
        "　　鲍叔牙",
        "　　春秋齐大夫，生卒年不详。少与管仲友善，知管仲贤而贫，分财多与；后鲍叔牙事齐桓公，管仲事公子纠，公子纠死，管仲囚，鲍叔牙乃荐管仲于桓公，卒佐桓公成霸业。世多称其知人而笃于友谊。",
        "　　鲍靓 神仙太守",
        "　　鲍姑",
        "地望分布",
        "　　山西上党郡，山东东海郡，山东泰山郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[63] = {
    "index": "百家姓",
    "name": "史",
    "content": [
        "历史来源",
        "　　「史」源出;",
        "　　一﹕以官为氏。据《唐书．宰相世系表》所载，史氏，出自周太史佚之后。。佚亦作「逸」，史乃官名，亦称「作册逸」，「尹佚」主要职责是纪录天子言行。有人将史佚与姜太公，周公，召公并称为「四圣」。其后以史为氏。",
        "　　二﹕为「昭武九姓」之一。（见「何」姓），史国故址在今乌兹别克斯坦，撒马尔罕之南。一度归唐朝管辖，唐高帝永徽年间归附中原，后为史氏。",
        "　　三﹕阿史那氏，居兜牟山，北人呼为突厥窟，历魏晋十代为君长。后属茹茹（蠕蠕），阿史那最为首领。后周末年，逐灭茹茹，霸强北土，盖百余年，至处罗苏尼失等归化，号阿史那，唐开元年间更为史氏。",
        "家族名人",
        "　　史思明（？- 761)",
        "　　本名窣干，唐玄宗赐名思明，为唐朝宁州的夷人，突厥族。骁勇有才略，安禄山起兵造反时，史思明受命攻略河北。后安禄山为其子庆绪所杀，思明则杀庆绪而自立为大燕皇帝，不久亦为其子史朝义所杀。",
        "　　史可法（1601 - 1645）",
        "　　字宪之，一字道邻。明代祥符（今河南省开封县）人。崇祯年间进士，曾任右佥都御史，巡抚皖、豫，后任命为南京兵部尚书。福王立，加武英殿大学士，督师扬州。清多尔衮致书劝降，坚拒，城破被害。清乾隆时追谥为忠正。后人尊称为史阁部。",
        "地望分布",
        "　　陜西京兆郡，安徽宣城郡，湖北武昌郡。",
    ]
}
BaiIiaXingPageModule[64] = {
    "index": "百家姓",
    "name": "唐",
    "content": [
        "历史来源",
        "　　「唐」源出;",
        "　　一﹕出自「祁」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，唐氏，祁姓，亦曰伊祁，尧初陶唐之后。尧初封唐侯，其地中山唐县是也，舜封尧之子丹朱为唐侯。至夏时，丹朱裔孙刘累迁于鲁县，至周朝改为唐公，周成王灭唐，以其地封叔虞，号曰唐叔。然后迁唐公于杜，降爵为伯，今长安杜城是也。故唐氏为尧帝之后。",
        "　　二﹕据《三国志．郭淮传》所载，陇西羌族有唐氏。",
        "家族名人",
        "　　唐尧",
        "　　唐寅",
        "　　（1470～1523）明代画家、文学家，吴县人，字伯虎，一字子畏，号六如居士、桃花庵主等。诗词书画无一不精，文以六朝为宗。诗初多秾丽，中年学刘禹锡、白居易，晚年纵放，不拘成格。擅画山水，多取法南宋李唐、刘松年，兼采元人法，并工画人物、花鸟，笔墨秀润峭利，景物清隽生动，工笔、写意俱佳。与文征明、沈周、仇英合称明朝四大家，又与祝允明、张灵、徐祯卿四人称为吴中四才子。有画谱、诗文集行世，并着有六如居士全集。亦称为唐伯虎。",
        "地望分布",
        "　　山西晋阳郡，山西晋昌郡，山东北海郡，山东鲁国郡。",
    ]
}
BaiIiaXingPageModule[65] = {
    "index": "百家姓",
    "name": "费",
    "content": [
        "历史来源",
        "　　「费」源出;",
        "　　一﹕出自「姒」姓，夏禹之后。",
        "　　二﹕出自「姬」自姓，以邑为氏。据《通志．氏族略》载，春秋时鲁懿公之孙，受封于费邑。（山东费县），其后以邑为氏。",
        "　　三﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「费连氏」（为魏献帝之兄的姓氏）随魏孝文帝南迁洛阳后，定居中原，代为汉姓「费」氏。",
        "家族名人",
        "　　费长房",
        "　　东汉人。据《后汉书．方术传》载，长房学道于壶公，不成，持符而归。相传能治百病，鞭打百鬼，又善变幻捉妖，后丢失符，被鬼所杀。",
        "　　费袆 （? - 253年）",
        "　　三国时江夏人，自文伟。刘备时任舍人，庶子。后主时历任黄门侍郎，昭信校卫，侍中，司马，尚书令，大将军，为诸葛亮所器重，多次出使吴国，终益州刺史，封成乡侯。",
        "地望分布",
        "　　湖北江夏郡。",
    ]
}
BaiIiaXingPageModule[66] = {
    "index": "百家姓",
    "name": "廉",
    "content": [
        "历史来源",
        "　　「廉」源出;",
        "　　一﹕据《元和姓纂》所载，相传为古帝颛顼孙大廉之后，以王父之字为氏。",
        "　　二﹕据《元史》所载，元朝有畏吾尔人布鲁海牙，担任肃政廉防史（简称「廉使」）之际其子希宪适生，逐以官名为「廉」氏，称「廉希宪」。",
        "家族名人",
        "　　廉颇",
        "　　战国赵人，生卒年不详。为赵之名将，屡败齐、魏等国。长平之战，坚壁自守，秦惧不敢加兵，后赵王受秦反间计，以赵括代之，赵遂大败。官拜上卿，与蔺相如为刎颈之交，后又言槉，遂不召用，病死于楚。",
        "　　廉希宪",
        "　　字善甫，元代维吾尔人。元世祖即位时，希宪得以入宫，一日，读《孟子》，用性善与仁义答世祖，被视为廉孟子，官至宰相。",
        "地望分布",
        "　　山西河东郡。",
    ]
}
BaiIiaXingPageModule[67] = {
    "index": "百家姓",
    "name": "岑",
    "content": [
        "历史来源",
        "　　「岑」源出;",
        "　　一 ; 出自「姬」姓，以国名为氏。据《通志．氏族略》引用《吕氏春秋》云 ; 周武王封周文王异母弟耀子渠为岑子，其地处梁国岑亭 ( 陜西韩城县 )。子孙以国为氏。",
        "家族名人",
        "　　岑参 (715～770）",
        "　　唐棘阳人（今河南新野县）。工诗，始佐戎幕，曾至天山一带，故多边塞、战伐之咏。因其属词清尚，用心良苦，故诗调特高。累官补阙起居郎，后出为嘉州刺史，故世称为岑嘉州。着有岑嘉州集。",
        "　　岑毓英 (1829-1889)",
        "　　字彦卿，号匡国，清广西西林人。光绪中法越南之役，击败法兵，官至云贵总督，卒谥襄勤。",
        "地望分布",
        "　　湖北南阳郡，河南棘阳郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[68] = {
    "index": "百家姓",
    "name": "薛",
    "content": [
        "历史来源",
        "　　「薛」源出;",
        "　　一 ; 以国名为氏。据《元和姓纂》，奚仲居于薛（山东滕县），一度迁于邳（山东徽山县）。春秋后期迁到下邳（江苏邳县），后成为齐国的属地。战国时为楚所灭。公子登仕楚。怀王赐沛邑，为大夫，逐以原国名「薛」为氏。",
        "　　二﹕据《吴录》所载，孟尝君受封于薛。秦灭六国而失祀，子孙逐以「薛」为氏，",
        "　　三﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「叱干氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「薛」氏。",
        "家族名人",
        "　　薛仁贵（612～681）",
        "　　名礼，唐绛州龙门人（今山西省河津县西二里）。少贫贱，以田为业。善骑射，贞观年间随太宗征辽东，所向披靡。高宗时屡破高丽、契丹、突厥，而立奇功，官拜本卫大将军，封平阳郡公。永淳二年卒，赠左骁卫大将军、幽州都督。后世据其功勋，编撰杂剧与演义。",
        "　　薛涛（768～831）",
        "　　字洪度。唐长安人，知音律，工诗文，有才情，为一代名妓。晚年居浣花溪，能制松花纸与深红小粉笺，裁书供吟，酬献贤杰，时人称为薛涛笺。着有诗集一卷。",
        "地望分布",
        "　　山西河东郡，河南河南郡，河南新蔡郡，安徽沛郡，山东高平剧。",
    ]
}
BaiIiaXingPageModule[69] = {
    "index": "百家姓",
    "name": "雷",
    "content": [
        "历史来源",
        "　　「雷」源出  ;",
        "　　一 ; 以国名为氏。据《元和姓纂》与《古今姓氏书辨正》所载，古诸侯国有方雷氏，其后分为方氏，雷氏。又神话传说方雷氏之女为黄帝妃。",
        "家族名人",
        "　　雷万春",
        "　　唐代人，安史之乱时，安禄山将令狐潮围雍丘，万春立于成上，面部中六箭，仍巍然不动。成陷不屈而死。",
        "地望分布",
        "　　陜西冯翔郡，江西豫章郡。",
    ]
}
BaiIiaXingPageModule[70] = {
    "index": "百家姓",
    "name": "贺",
    "content": [
        "历史来源",
        "　　「贺」源出  ;",
        "　　一 ; 为「庆」氏所改，据《通志．氏族略》所载，春秋时齐桓公之孙公孙庆克，他的儿子庆封以父名为氏。东汉时有庆纯，任侍中，当时汉安帝之父为清河王刘庆，为毕清河王的名讳，庆纯改姓为「贺」氏（取「贺」与「庆」两字义同）。故东汉永初元年（107年）后方有贺氏。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「贺兰氏」随魏孝文帝南迁洛阳后，定居中原，代为汉姓「贺」氏。",
        "家族名人",
        "　　贺知章（659～744）",
        "　　字季真，自号四明狂客，唐越州永兴人。是著名的书法家。武则天时进士，官至太子宾客、秘书监，故时称为贺监。擅长草、隶书，亦擅长文辞，其诗风格淡雅而隽永，时出巧思。性旷达，善说笑，嗜酒，与李白、张旭等人交往频繁。后为道士，隐居于镜湖。享年八十八岁。。",
        "地望分布",
        "　　河北广平郡，江苏会稽郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[71] = {
    "index": "百家姓",
    "name": "倪",
    "content": [
        "历史来源",
        "　　「倪」源出  ;",
        "　　一 ; 源出于「曹」氏，以国为氏。周武王封曹挟在邾，郳国亦为小邾国（山东滕县东）。邾文公（一说邾武公）封其子肥于郳。战国时，为楚国所灭，其后为郳氏，去邑旁为儿氏。为避仇。加人字旁为倪氏。",
        "家族名人",
        "　　倪元璐（1593～1644）",
        "　　字玉汝，号鸿宝，浙江上虞人，是明代的忠臣。能诗文，工行草，善画山水竹石。为人正直廉介，不畏强权，官至户部尚书。李自成攻陷京城时，自缢而亡，谥文正，清代时追谥文贞。有倪文贞集传世。",
        "地望分布",
        "　　山东千乘郡。",
    ],
}
BaiIiaXingPageModule[72] = {
    "index": "百家姓",
    "name": "汤",
    "content": [
        "历史来源",
        "　　「汤」源出  ;",
        "　　一 ;据《通志．氏族略．以名为氏》所载，汤氏，子姓。夏商以前未有谥法（谥名如清圣祖即康熙，唐太宗即李世民），尧舜禹汤，皆名也。又，商汤，在金文（仲鼎文）中作「唐」。故汤氏之源并非始自于商汤。",
        "家族名人",
        "　　汤显祖（1550～1617）",
        "　　明江西临川人，字义仍，号海若，又号若士，别署清远道人。万历进士，官至礼部主事，以批评朝政贬官，后罢官归里，专事写作，诗宗香山、眉山，文学南丰、临川，尤精戏曲，其代表作有牡丹亭、邯郸记、南柯记、紫钗记四种，合称玉茗堂四梦或临川四种曲，作品词句典丽生动，排场取材亦颇佳妙，对后世影响甚大。有玉茗堂集传世。",
        "地望分布",
        "　　河北中山郡，北京范阳郡。",
    ]
}
BaiIiaXingPageModule[73] = {
    "index": "百家姓",
    "name": "滕",
    "content": [
        "历史来源",
        "　　「滕」源出;",
        "　　一 ;出自「姬」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，武王克商后，文王第十四子叔秀，受封于滕国（山东滕县）。战国初被越国所灭。不久复国，后又被宋国所灭。其子孙为滕氏。后又有一部份滕氏因避难改为腾氏。",
        "家族名人",
        "　　滕文公",
        "　　战国时滕国的贤君，名宏。曾多次向孟子请教。",
        "地望分布",
        "　　河南南阳郡，河南开封府。",
    ]
}
BaiIiaXingPageModule[74] = {
    "index": "百家姓",
    "name": "殷",
    "content": [
        "历史来源",
        "　　「殷」源出  ;",
        "　　一 ;出自「子」姓，以国名为氏。据《世本》所载，契后。武王克商后，商之子孙四散，以殷为氏。《元和姓纂》载﹕殷姓，成汤国号也，为周所灭，子孙以国名为氏。又《通志．氏族略．以国为氏》云﹕殷氏，契姓，封于商，后世迁于毫。至周为周所灭，子孙以国名为氏。",
        "家族名人",
        "　　殷汤",
        "　　殷浩（？～356）",
        "　　字深源，晋陈郡长平人。识度清远，好老易，负有盛名。初为庾亮记室参军，后起为建武将军。朝廷欲平关河，以浩为中军将军，都督扬、豫、徐、兖、青五州军事，以平定中原为己任。征姚襄兵败，废为庶人，竟日书空，作咄咄怪事四字。",
        "地望分布",
        "　　安徽汝南郡，河南河南府。",
    ]
}
BaiIiaXingPageModule[75] = {
    "index": "百家姓",
    "name": "罗",
    "content": [
        "历史来源",
        "　　「罗」源出  ;",
        "　　一 ;出自「妘」姓，以国名为氏。据《通志．氏族略．以国为氏》所载，周代有罗国，初封宜城（湖北宜城县），徙枝江。春秋时被楚国所灭。周末居长沙，国人以原国名「罗」为氏。",
        "　　二﹕相传古帝祝融的后代。",
        "　　三﹕唐朝西突厥可汗斛瑟罗入中国，其后以斛瑟罗为氏，后改姓「罗」氏。",
        "　　四﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「破多罗」氏，随魏孝文帝南迁洛阳后，定居中原，代为汉姓「罗」氏。",
        "　　五﹕清代皇族爱新觉罗氏中有改姓「罗」，后代亦称罗氏。望族居豫章郡（江西南昌）。",
        "　　六﹕据《后汉书．南蛮传》及《华阳国志》载「板楯七姓」有罗氏。",
        "家族名人",
        "　　罗贯中",
        "　　名本，以字行，号湖海散人，元末太原人。生平事迹不详。工曲，善为通俗小说，著名的有《三国志通俗演义》、《南北史通俗演义》、《隋唐两朝志传》、《说唐》、《残唐五代史演义》、《粉妆楼》、《三遂平妖传》等。",
        "地望分布",
        "　　江西豫章郡，湖南长沙郡。",
    ]
}
BaiIiaXingPageModule[76] = {
    "index": "百家姓",
    "name": "毕",
    "content": [
        "历史来源",
        "　　「毕」源出  ;",
        "　　一 ;出自「姬」姓，据《新唐书．宰相世系表》所载，周文王第十五子被封于毕邑（陜西咸阳市），世称毕公高，其后逐有毕氏。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「出连」氏，随魏孝文帝南迁洛阳后，定居中原，代为汉姓「毕」氏。",
        "家族名人",
        "　　毕升",
        "　　生卒年不详。北宋仁宗庆历时（1041～1048）发明胶泥活字版印刷术的发明家。",
        "地望分布",
        "　　河南河内郡，山东东平郡，山西太原郡，河南河南郡。",
    ]
}
BaiIiaXingPageModule[77] = {
    "index": "百家姓",
    "name": "郝",
    "content": [
        "历史来源",
        "　　「郝」源出;",
        "　　一 ;以邑名为氏。据《新唐书．宰相世系表》所载，商王帝乙时，子期受封于郝乡（山西太原），其后以邑名为氏。",
        "　　二﹕少数民族的姓氏。据《旧唐书．南蛮传》所载，唐王朝南方土蛮有郝，杨，刘三大姓。又汉代乌桓有郝氏。",
        "家族名人",
        "　　郝隆",
        "　　字仕治，晋代人，官荆州刺史桓温的南蛮参军。农历七月七日，人们都在晒衣服，唯有郝隆睡在院中，有人问他为甚么，他答道﹕「晒我腹中的书罢了。」",
        "地望分布",
        "　　山西太原郡，陜西京兆郡。",
    ]
}
BaiIiaXingPageModule[78] = {
    "index": "百家姓",
    "name": "邬",
    "content": [
        "历史来源",
        "　　「邬」源出  ;",
        "　　一 ;以邑名为氏。据《通志．氏族略》所载，春秋时晋国有大夫食邑于邬邑，其后有邬氏。邬本为郑国之邑，后入周。晋国强盛时，辖地曾扩大到河南北部，邬邑一度为晋国所有。",
        "　　二﹕据《左传．昭公二十八年》载，晋国司马弥牟为邬郡大夫。邬郡在山西介休县。其后有邬氏。",
        "家族名人",
        "　　邬单",
        "　　春秋时人，孔子弟子。",
        "地望分布",
        "　　山西太原郡，江西南昌郡。",
    ]
}
BaiIiaXingPageModule[79] = {
    "index": "百家姓",
    "name": "安",
    "content": [
        "历史来源",
        "　　「安」源出  ;",
        "　　安氏出自西域少数民族，略有三支﹕",
        "　　一﹕据《新唐书．宰相世系表》所载，汉灵帝时安息国（伊朗东北部）太子安清，潜心佛学，来到当时的京都洛阳定居（见本网的「安世高」段，其后有安氏。南北朝时又有安息世子来到中国定居，亦为安氏。",
        "　　二﹕为鲜卑族复姓所改。据《魏书．官氏志》所载，南北朝时，北魏有代北复姓「安迟」氏，随魏孝文帝南迁洛阳后，定居中原，代为汉姓「安」氏。",
        "　　三﹕为「昭武九姓」之一。（见「何」姓），安国故址在今乌兹别克斯坦布哈拉一带。一度归唐朝管辖，唐高帝永徽年间归附中原，后为安氏。",
        "　　又，唐朝胡人安禄山本姓康氏，冒姓安氏。",
        "家族名人",
        "　　安期生",
        "　　秦琅琊人（今山东省诸城县东南），生卒年不详。受学于河上丈人，于海滨卖药，始皇东游，相谈三昼夜，赐予金帛，皆置之而去，留书以别，谓后千年求我于蓬莱山，始皇遣使入海寻之，遇风浪而还。汉武帝时，李少君言尝游海上，见安期生食巨枣，其大如瓜。",
        "　　安世高",
        "　　安禄山（？～757）",
        "　　唐营州柳城人（今河北省旧永平府境）。胡人，本姓康，初名阿荦山，又作轧荦山。忮忍多智，善臆测人情，通六蕃语。天宝末，以平卢、范阳、河东三镇节度使举兵反，陷洛阳，入长安，称燕帝，寻为其子庆绪所杀。",
        "地望分布",
        "　　宁夏凉州郡，甘肃武威郡，湖北武陵郡。",
    ]
}
BaiIiaXingPageModule[80] = {
    "index": "百家姓",
    "name": "常",
    "content": [
        "历史来源",
        "　　「常」源出  ;",
        "　　一 ;出自「姬」姓，以邑名为氏。据《通志．氏族略》所载，武王克商后，文王子于康国，世称康叔，武庚叛乱被平定后，康叔又被转封于卫国。后来，康叔又分封其子于常邑，其后逐为常氏。",
        "　　二﹕因避讳而改，《世本》载春秋时楚国公族恒惠公之后有恒氏，一度改为常氏。来避宋真宗赵恒的名讳。「恒」和「常」义相同。",
        "　　三﹕又据《路史》云，战国时吴国公族之后亦有常氏。",
        "　　神话中黄帝大臣常先与常曦之后。",
        "家族名人",
        "　　嫦娥",
        "　　后羿的妻子。相传因偷吃不死之药而飞升月宫，成为仙女。汉人为避文帝讳，改姮为嫦。《淮南子˙览冥》：羿请不死之药于西王母，姮娥窃以奔月，怅然有丧，无以续之。明˙刘兑˙金童玉女娇红记：若不是月里姮娥，敢只是花里神仙。亦作常娥、嫦娥。",
        "　　常遇春（1330～1369）",
        "　　字伯仁，明怀远人。貌奇伟，善射，有勇力。辅佐明太祖转战江南，所向皆捷；又率师北征，下元都，逐元帝，平定天下。累官至左副将军，擢为中书、平章军国重事，赠中书右丞相。封鄂国公、开平王。谥忠武。",
        "地望分布",
        "　　山东平原郡。",
    ]
}
BaiIiaXingPageModule[81] = {
    "index": "百家姓",
    "name": "乐",
    "content": [
        "历史来源",
        "　　「乐」源出  ;",
        "　　一 ; 出自「子」姓。以王父自为氏。据《姓氏急就篇》及《唐书．宰相世系表》所载，宋戴公之子，字乐父。生子倾父泽，为公孙泽; 公孙泽之子夷父须，以其祖父之字「乐」为氏，称为乐须。",
        "家族名人",
        "　　乐毅",
        "　　战国时燕国名将，昭王时拜为上将军，率领燕、赵、楚、韩、魏五国兵伐齐，下齐七十余城，封昌国君。昭王死，惠王使骑劫代其职位，毅奔赵，封为望诸君，后卒于赵。",
        "地望分布",
        "　　河南南阳郡。",
    ],
}
BaiIiaXingPageModule[82] = {
    "index": "百家姓",
    "name": "于",
    "content": [
        "历史来源",
        "　　「于」源出  ;",
        "　　一 ; 出自「姬」姓。以国名为氏。据《元和姓纂》和《广韵》所载，周武王第三子受封于邘国，称为邘叔，其后去邑旁为于，有于氏。",
        "　　二﹕为鲜卑族复姓所改。据《路氏》所载，东海于公裔孙随魏孝文帝南迁洛阳后，定居中原，代为汉姓「于」氏。",
        "　　三﹕唐代淳于氏为避唐宪宗李纯之名讳（淳，纯同音）改为于氏。",
        "家族名人",
        "　　于譧（1398-1457）",
        "　　字廷益，明代浙江钱塘人。历任官监察御史，兵部尚书等。正统十四年，土木桥之变，瓦刺首领也先侵扰大同，明英宗被俘，于譧反对放弃北京，拥立英宗弟为景帝，主君务，击退也先军队，接英宗回。英宗复辟后被杀，年六十岁，天下冤之。",
        "　　于成龙（1617-1684）",
        "　　字北溟，清山西永宁人，康熙时，官至两江总督，以清廉著称，时称天下清官第一。",
        "地望分布",
        "　　河南河南郡，山东东海郡。",
    ]
}
BaiIiaXingPageModule[83] = {
    "index": "百家姓",
    "name": "时",
    "content": [
        "历史来源",
        "　　「时」源出  ;",
        "　　一 ; 出自「子」姓。据《世本》所载，春秋时宋国有大夫「来」，受封于时邑。子孙以封邑名「时」为氏。",
        "　　二﹕一曰，时氏为楚国大夫申叔时之后。以王父字为氏。",
        "家族名人",
        "　　时荷",
        "　　晋代人。相传随许真君学道，一起成仙，紫盖府留有遗迹。",
        "地望分布",
        "　　甘肃陇西郡，河南陈留郡。",
    ]
}
BaiIiaXingPageModule[84] = {
    "index": "百家姓",
    "name": "傅",
    "content": [
        "历史来源",
        "　　「傅」源出  ;",
        "　　一 ; 据《通志．氏族略．以地为氏》载，为商朝名相傅说之后。商王武丁在傅岩（山西平陆县）发现了贤者「说」，因筑于傅岩，故称傅说，其后以地为氏。",
        "　　二﹕出自「姬」姓。以邑为氏。据《唐书．宰相世系表》所载，周朝大由受封于傅邑，因以为氏。",
        "家族名人",
        "　　傅说",
        "　　生卒年不详。为商王武丁时的贤相。初隐居于傅岩，武丁梦到他，往访而知其贤，于是举他为相，国家大治。",
        "　　傅恒",
        "　　号春和，清朝满洲镶黄旗人，原姓富察氏。历官尚书，川陜总督，保和殿大学士等。乾隆年间平定金川，准格尔和缅甸，因功封忠勇公，称为「社稷臣」。乾隆二十年，置功臣相于紫光阁，傅恒列为第一。",
        "地望分布",
        "　　山东清河郡，山东临清郡，山东高唐郡，甘肃北地。",
    ]
}
BaiIiaXingPageModule[85] = {
    "index": "百家姓",
    "name": "皮",
    "content": [
        "历史来源",
        "　　「皮」源出  ;",
        "　　出自姬姓。以王子字为氏。据《风俗通义》及《元和姓纂》所载, 鲁献公次子仲山浦, 曾辅佐周宣王中兴, 受封于樊邑, 其后有樊氏。樊侯之后有樊仲皮, 食采于皮氏邑(在今山西河津县一带), 其支孙以王父(祖父)之字皮为氏。",
        "家族名人",
        "　　皮日休（834～883）",
        "　　字袭美，一字逸少，襄阳人，为唐代诗人。性傲诞，尝隐居鹿门山，以文章自负，尤善箴铭。咸通年间中进士，官太常博士，后为黄巢所害，着有《皮子文薮》。",
        "地望分布",
        "　　甘肃天水郡，江苏下邳郡。",
    ]
}
BaiIiaXingPageModule[86] = {
    "index": "百家姓",
    "name": "卞",
    "content": [
        "历史来源",
        "　　「卞」源出  ;",
        "　　一﹕以邑名为氏。据《元和姓纂》所载, 周文王第六子曹叔振的支子(嫡妻第二子以下及妾子皆称为‘支子’) 受封于卞邑(在今山东省兖州, 泗州附近), 称为卞伯, 其后为’卞‘氏。",
        "　　二﹕春秋时鲁国有勇士庄子为卞邑大夫, 称为卞庄子, 又写为弁庄子, 其后亦为卞氏, 亦为   弁氏。",
        "家族名人",
        "　　卞和",
        "　　春秋楚人。于荆山得璞玉献于楚王，两次见疑，左右足遭刖，后楚王乃使玉人琢之，果得宝玉，遂命名为和氏璧。见韩非子˙和氏。",
        "　　卞庄子",
        "　　春秋卞邑大夫，以勇著名，尝刺虎，一举而获两虎，齐人惧之，不敢伐鲁。汉朝时，因避明帝（刘庄）讳，改庄为严。或称为卞严、卞严子、弁严子。",
        "地望分布",
        "　　山东济阴郡，河南济阳郡。",
    ]
}
BaiIiaXingPageModule[87] = {
    "index": "百家姓",
    "name": "齐",
    "content": [
        "历史来源",
        "　　「齐」源出  ;",
        "　　一﹕出自姜姓, 以国为氏。据《元和姓纂》所载, 西周初年, 太公望姜子牙受封于营丘(在今（山东省临淄市) 建立齐国, 至齐恒公时成为春秋五霸之首。后田氏代齐, 原王氏乃为齐氏。",
        "　　二﹕出自姬姓, 以王父字为氏。据《通志氏族略》所载, 春秋时卫国有大夫字齐子, 其支孙以王父(祖父)之字为齐氏。",
        "　　三﹕西北少数民族姓氏。据《晋书》所载, 武都氐族人有齐姓, 如齐万年。",
        "家族名人",
        "　　齐桓公",
        "　　齐白石（1863～1957）",
        "　　名璜，字苹生，号白石山人，湖南湘潭人。初习木工雕刻，从胡沁园、陈少蕃、王湘绮学诗画，苦读古文诗词，临摹名家字画，其艺大进。曾任北平艺术专院教席，诗、书、画、篆刻，彪炳艺坛。",
        "地望分布",
        "　　河南汝南郡，河北高阳郡，河北中山郡。",
    ]
}
BaiIiaXingPageModule[88] = {
    "index": "百家姓",
    "name": "康",
    "content": [
        "历史来源",
        "　　「康」源出  ;",
        "　　一﹕出自姬姓。 以谥号为氏。据《元和姓纂》及《姓苑》所载, 周朝初年, 文王第七子康叔, 受封于卫国, 其后以祖之谥(生谥, 即生前就有的谥号)「康」为氏。",
        "　　二﹕以国为氏．出自西域康居国（约在今巴尔喀什湖与咸海之间）的使者，以及从康居来中国者，有的就以「康」为氏．如汉代的康孟详。",
        "　　三「昭武九姓」之一．隋唐时代康国（在今乌兹别克斯坦，撒马尔罕一带）人来中国者，有的以“康”为氏，如唐代有康谦。",
        "　　四﹕宋代为避宋太祖赵匡胤的名讳，匡氏改为慷氏．",
        "家族名人",
        "　　康有为（1858～1927）",
        "　　字长素，改字更生，晚年又字更甡，清学者及政治家，南海人。治经以今文为宗，旁采当时流行的西洋学术思想，自成一家言。光绪二十四年，以工部主事赞德宗行新政，失败后亡命日本，组织保皇党；民国成立后，谋复辟，迄无成。着有孔子改制考、新学伪经考、大同书、春秋董氏学、春秋笔削大义微言考、孟子微等多种。",
        "地望分布",
        "　　陜西西安市。",
    ]
}
BaiIiaXingPageModule[89] = {
    "index": "百家姓",
    "name": "伍",
    "content": [
        "历史来源",
        "　　「伍」源出  ;",
        "　　出自芈姓，以名为氏．据《通志．氏族略．以名为氏》所载：春秋时楚国大夫伍参之后也．伍子胥奔吴，　其子又为王孙氏适齐．",
        "家族名人",
        "　　伍员（子胥）（？～前664）",
        "　　字子胥，春秋楚人。与父兄俱仕楚，后楚王听谗言杀其父兄，员逃亡吴国佐吴伐楚报仇，并辅吴称。吴王夫差灭越后，欲释越王句践回国，不听员谏，因信谗杀之。伍员死前预言越必灭吴，后九年越果灭吴。",
        "　　伍廷芳（1842～1922）",
        "　　字文爵，号秩庸，广东新会人。创中外新报，为中国有日报之始。留英习法律，为清修律大臣，草民刑律，开中国法律新纪元。武昌起义，首倡清帝退位之议，民军推为议和代表。后历任司法总长、代国务总理、外交总长等。陈明叛变，忧愤而卒。",
        "地望分布",
        "　　甘肃省安定郡，湖南省武陵郡。",
    ]
}
BaiIiaXingPageModule[90] = {
    "index": "百家姓",
    "name": "余",
    "content": [
        "历史来源",
        "　　「余」源出  ;",
        "　　 据《风俗通义》所载，余为春秋时秦国相由余之后。由余本为晋国人，后入秦。其子孙以袓名“余”为氏。世居歙州，为新安（在今安徽省歙县）大族。",
        "家族名人",
        "　　余秋雨",
        "　　当代著名作家。",
        "地望分布",
        "　　江苏省下邳郡，浙江省吴兴郡。",
    ]
}
BaiIiaXingPageModule[91] = {
    "index": "百家姓",
    "name": "元",
    "content": [
        "历史来源",
        "　　「元」源出  ;",
        "　　一﹕以邑名为氏．据《韵会》所载，春秋年代，卫国有大夫元恒, 受封于元城(在今河北省大名县东),其后有元恒氏元氏。",
        "　　二﹕ 据《风俗通义》所载，战国时卫武之子公子元,食邑亦在元城,其后有元氏.",
        "　　三﹕为鲜卑族复姓拓跋氏所改。据《新唐书-宰相世系表》所载,，北魏皇族本姓拓跋氏, 至孝文帝迁都洛阳进入中原后, 改为元氏.又据《魏书-官氏志》所载, 北魏代北复姓纥骨氏,是云氏,皆改为元氏。",
        "家族名人",
        "　　元好问（1190～1257）",
        "　　字裕之，号遗山，金秀容（今山西省忻县）人。系出元魏，七岁能诗，兴定三年进士，官至尚书省左司员外郎，金亡不仕。古文继承韩柳，结构严密。诗主风骨，反对浮艳。其论诗绝句三十首在文学批评史上颇有地位。编有中州集。着有遗山集﹑续夷坚志。金庸小说中的「问世间，情是何物」正是出自他的词「摸鱼儿」",
        "　　元稹（779～831）",
        "　　字微之，唐河南（今河南省洛阳县）人。穆宗时拜相。其诗平易近人，与白居易齐名，世称「元白」。着有《元氏长庆集》。",
        "地望分布",
        "　　河南洛阳，山西太原郡。",
    ],
}
BaiIiaXingPageModule[92] = {
    "index": "百家姓",
    "name": "卜",
    "content": [
        "历史来源",
        "　　「卜」源出  ;",
        "　　一﹕ 据《风俗通义》及《潜夫论》云: 氏于职者,巫卜陶匠是也.殷周时代有专门从事占卜职务者,称为卜人. 世代任卜人者,遂为卜氏. 《潜夫论》云:　夏　后有卜氏，又叔锈后有卜氏．《元和姓纂》云：周礼有卜人氏．以官命氏．晋卜偃.秦卜徒父.鲁卜楚丘，皆为卜筮官，其后遂以为氏。",
        "　　二﹕据《史记》载，古代匈奴部族四大姓之一有须卜氏，其后改为卜氏。",
        "家族名人",
        "　　卜式",
        "　　汉河南人，以牧羊致富，武帝时上书，愿捐一半家财以助边防军需，又助济贫民，受赐为御史大夫，后因不善文章，贬为太子太傅。",
        "地望分布",
        "　　山西省西河郡，湖南省溆浦县。",
    ]
}
BaiIiaXingPageModule[93] = {
    "index": "百家姓",
    "name": "顾",
    "content": [
        "历史来源",
        "　　「顾」源出  ;",
        "　　一﹕ 出自妃姓, 以国为氏. 据《元和姓纂》所载, 夏朝有附庸小国, 在今河南省范县东南. 商汤起兵攻伐夏桀时,先灭顾国,韦国. 其国人以原国名”顾”为氏。",
        "　　二﹕ 越王勾践的七世鬊吮孙为闽君摇, 在汉代受分封于东哦瓯(在今浙江省永嘉县西南).摇之子受封为顾余侯,世居于会稽(在今浙江省绍兴市)",
        "家族名人",
        "　　顾恺之（341～402）",
        "　　字长康，小字虎头，晋无锡人。博学有才气，善绘画，有才绝、艺绝、痴绝三绝之称。多作人物肖像及神仙、佛像、动物、山水等。画人注重点睛。着有画论、魏晋胜流画赞、画云台山记等。存世作品中以女史箴图最有名。其所作维摩诘像，为最早出现于壁画上的佛像。",
        "　　顾炎武（1613～1681）",
        "　　初名绛，字宁人，号亭林，自署蒋山佣，学者称亭林先生。明末清初学者。江苏昆山居林镇人。性耿介，曾参加抗清活动。晚年治经侧重考证，开清代朴学之风。考订古音、离析唐韵，分古韵为十部，于分析音学源流与古韵部目上，居承先启后之功。着有日知录、天下郡国利病书等。",
        "地望分布",
        "　　湖南省溆浦县南。",
    ]
}
BaiIiaXingPageModule[94] = {
    "index": "百家姓",
    "name": "孟",
    "content": [
        "历史来源",
        "　　「孟」源出  ;",
        "　　以次为氏. 古代兄弟排行次序为: 伯(孟), 仲, 叔, 季. 伯为嫡长子, 孟为庶长子. 据<<通志-氏族略>>所载, 春秋时鲁国有孟孙氏, 盖为鲁恒公之子庆父共仲之后. 本为”仲孙”氏, 因弒君之罪, 更为孟氏. 又, 春秋时卫襄公之子, 字孟公, 其支孙以王父字”孟”为氏.",
        "家族名人",
        "　　孟母",
        "　　孟子的母亲。仉姓。曾经三次迁移其居，以激励孟子勤奋学习。后世奉为贤母的典范。",
        "　　孟子（前372～前 289）",
        "　　名轲，字子舆，战国时邹人，生于周烈王四年，卒于周赧王二十六年。受学于子思弟子。提倡王道﹑重仁义﹑轻功利﹑创性善之说，后世尊称为亚圣。着有孟子七篇。亦称为孟子。",
        "　　孟浩然（689～740）",
        "　　字浩然。唐代诗人，襄阳人。少好节义，隐居鹿门山。曾于太学赋诗，一坐叹服，其诗属于自然一派，有孟浩然集。",
        "地望分布",
        "　　山东省历城县东，山东省曲阜县东南，甘肃省汉置郡。",
    ]
}
BaiIiaXingPageModule[95] = {
    "index": "百家姓",
    "name": "平",
    "content": [
        "历史来源",
        "　　「平」源出  ;",
        "　　姬姓。 以邑名为氏。 据<<通志-氏族略-以邑为氏>>所载, 战国时韩哀侯的少子, 受封于平邑(在今山西省临汾市附近)。 公元前230年, 韩国被秦国所灭, 韩哀侯的后代由平邑迁往下邑(在今安徽省砀山县), 以原邑名「平」为氏。",
        "家族名人",
        "　　平当",
        "　　字子思，汉朝时平陵人。对于大禹治水的情况很有研究，汉成帝封他为骑都尉，负责开河筑堤，防治水患。汉哀帝即位后，升他为宰相，赐官内侯，到了第二年，又要升官加薪，他因为生病，拒绝了。他说﹕「我的官位已经够高了，薪俸已经够了，给子孙留的财产太多会使他们过奢侈的生活的。",
        "地望分布",
        "　　河南省洛阳市，河南省武陟县",
    ]
}
BaiIiaXingPageModule[96] = {
    "index": "百家姓",
    "name": "黄",
    "content": [
        "历史来源",
        "　　「黄」源出  ;",
        "　　一 ; 出自「嬴」姓。以国为氏。据《诸暨孝义黄氏族谱》所载，黄氏为嬴姓十四氏之一。古代黄国在今河南潢川。后被楚国所灭，子孙散居四方，以国名为氏。",
        "　　二 ; 古代南方蛮族有黄姓。在广西南宁一带。",
        "家族名人",
        "　　黄歇",
        "　　游学博闻，楚考烈王以之为相，封为春申君。相楚二十余年，食客三千多人。娶李园之妹，知其有孕，纳于考烈王，生幽王。后李园用事，忌春申君，遂伏死士于棘门刺杀之。",
        "　　黄初平（黄大仙）",
        "　　黄霸 (前？～前51）",
        "　　字次公，西汉淮阳阳夏人。少学律令，武帝末，补侍郎谒者，历河南太守丞，时吏尚严酷，而霸为政宽和。尝从经学家夏庚胜治尚书。官至丞相，封建成侯，卒谥定。",
        "　　黄庭坚 (1045～1105）",
        "　　字鲁直，号山谷道人，又号涪翁，宋分宁（今江西修水县）人。与张耒、晁补之、秦观合称苏门四学士。工诗，为江西诗派的开创人，并擅行、草书。着有山谷内集、外集、别集、词等。",
        "　　黄巢 (？～884)",
        "　　唐曹州人。出身盐商，积财聚众，尤好收留亡命之徒。唐懿宗以来，因皇室奢侈过度，赋税沉重，加上连年发生水﹑旱灾，遂致民不聊生，盗匪群起。僖宗干符元年（公元874)，王仙芝率盗匪起事，翌年黄巢起兵响应，干符五年王仙芝败死于湖北，黄巢被推举为冲天大将军，率众攻掠江﹑浙﹑闽﹑粤等地，广明元年（公元880)陷洛阳、长安，僖宗逃奔成都，巢自号为帝，国号大齐。唐以官爵笼络李克用相援，大败黄巢，巢自刎身亡，为害十年的黄巢之乱始告结束，史称为黄巢之乱。",
        "　　黄道婆",
        "　　元朝时擅于纺织技术的女工艺家。曾随崖州黎族学习纺织技术，学成后返乡从事纺织工作，促成棉纺织业的进步，使元明以后的松江细布闻名于四方。纺织业者遂立祠祭之，以感其功。亦称为黄婆。",
        "地望分布",
        "　　湖北江夏郡，陜西栎阳郡，宁夏安定郡，湖北房陵郡，湖北汉东郡，河北上谷郡，安徽焦郡。",
    ]
}
BaiIiaXingPageModule[97] = {
    "index": "百家姓",
    "name": "和",
    "content": [
        "历史来源",
        "　　「和」源出  ;",
        "　　一﹕ 传说为尧时掌管天文律法的羲和之后. 据<<元和姓纂>>所载:”羲和, 尧时掌管天地之官, 和仲. 和叔因以为氏.” 此为后人依神话附会之辞.",
        "　　二﹕ 春秋时期, 楚国有卞和, 曾找到一块玉璞(没有经过雕琢的玉石), 两次献给楚王都被认为是假的, 以欺君之罪, 先后被砍去两脚. 楚文王即位后, 卞和抱着玉璞在荆山之下痛哭. 楚文王派人取来玉璞, 经雕琢果然得到宝玉, 称为”和氏璧”. 卞和之后有和氏.",
        "　　三﹕为鲜卑族复姓所改. 据<<通志-氏族略>>所载, 南北朝时, 北魏有代北复姓「素和氏」, 为鲜卑族檀石槐的支裔, 以其本为白部, 故号”素和”,进入中原以后改为汉姓和氏.",
        "家族名人",
        "　　和峤",
        "　　晋朝西平人。少有盛名。晋武帝时为黄门侍郎，迁中书令。",
        "地望分布",
        "　　河南省汝南郡，浙江省萧山县。",
    ]
}
BaiIiaXingPageModule[98] = {
    "index": "百家姓",
    "name": "穆",
    "content": [
        "历史来源",
"　　「穆」源出  ;",
"　　一﹕ 出自子姓. 以谥号为氏. 据<<元和姓纂>>所载, 春秋时, 宋宣公之弟名和. 继承兄位, 在位九年, 死前将爵位传给宣文公之子夷, 让自己的儿子离开宋国到郑国居住. 为褒奖其品德, 死后谥号为”穆”. 其支庶子孙遂有穆氏。",
"　　二﹕北方鲜卑族复姓所改. 据<<魏书-官氏志>>所载, 南北朝时, 北魏”代北八族”之首为丘穆陵氏, 隋魏孝文帝迁都洛阳, 定居中原以后, 改为汉字单姓穆氏.",
"家族名人",
"　　穆宁",
"　　唐朝人。官至秘书监。为官刚直，奉公守法。安史之乱时，以著名的颜真卿起兵共拒安禄山。",
"地望分布",
"　　河南汝南郡，河南洛阳。",
    ]
}
BaiIiaXingPageModule[99] = {
    "index": "百家姓",
    "name": "萧",
    "content": [
        "历史来源",
        "　　「萧」源出  ;",
        "　　一﹕ 出自子姓, 以国为名氏. 据<<风俗通义>>及<<元和姓纂>>所载, 周代宋国微子之后, 乐叔大心有功, 封于萧, 成为宋的附庸小国. 故址在今安徽省萧县西北, 公元前597年被楚国所破. 子孙以国为氏, 西汉相国萧何即为其后.",
        "　　二﹕古代嬴姓部落首领柏翳之后孟亏, 作士于萧, 其后人遂以萧为氏.",
        "家族名人",
        "　　萧史",
        "　　传说中春秋时的人物。善吹箫，作凤鸣。秦穆公以女弄玉妻之，作凤楼，教弄玉吹箫，感凤来集，弄玉乘凤、萧史乘龙，夫妇同仙去。见《汉˙刘向˙列仙传˙卷上˙萧史》。",
        "　　萧何（？～前193)",
        "　　汉初沛人，佐高祖定天下，论功第一，封酇侯。汉初律令多出其手。卒谥文终。",
        "　　萧道成",
        "　　萧衍",
        "地望分布",
        "　　山东枣庄市，江苏常州市，山东巷山县。",
    ]
}
BaiIiaXingPageModule[100] = {
    "index": "百家姓",
    "name": "尹",
    "content": [
        "历史来源",
        "　　「尹」源出  ;",
        "　　一﹕ 以官为氏. 据《风俗通义》云: 师尹, 三公官也. 师即太师, 尹即尹氏, 职同太师.",
        "　　二﹕ 以邑名为氏. 据《通志．氏族略．以邑为氏》所载, 尹氏, 少旱之子封于尹城, 因以为氏. 子孙世为周卿士, 食采于尹. 故址在今河南省新安县东南, 周代为畿内国; 一说在今山西省隰县东北. 其后亦有尹氏.",
        "家族名人",
        "　　尹喜",
        "　　字公度，战国时秦人，生卒年不详。为函谷关尹，老子西游，喜望见紫气，知有真人当过。老子至，授《道德经》五千言而去。其自著书称关尹子。",
        "　　尹文",
        "　　战国齐宣王至愍王时人，生卒年不详。庄子天下篇将他与宋钘并称，汉书艺文志列入名家。着有尹文子二篇。",
        "地望分布",
        "　　甘肃天水郡，河北河间县。",
    ]
}


module.exports = { BaiIiaXingPageModule: BaiIiaXingPageModule }