
import React, {Component} from 'react';
import {AppRegistry,View,Text} from 'react-native';


var GuanZiBookPageModule = new Array()



GuanZiBookPageModule[0] = {"index":"管子","name":"管子",
"content":["《管子》是先秦时期各学派的言论汇编，内容很博大，大约成书于战国(前475～前221)时代至秦汉时期，内容很庞杂，包括法家、儒家、道家、阴阳家、名家、兵家和农家的观点，《汉书·艺文志》将其列为道家著作，当时有86篇﹐今本实存76篇﹐其馀10篇仅存目录。《管子》一书的思想，是中国先秦时期政治家治国、平天下的大经大法。"
],
}

GuanZiBookPageModule[1]={
"index":"管子",
"name":"牧民",
"content":[
    "　　国颂",
"　　凡有地牧民者，务在四时，守在仓廪。国多财，则远者来，地辟举，则民留处；仓廪实，则知礼节；衣食足，则知荣辱；上服度，则六亲固。四维张，则君令行。故省刑之要，在禁文巧，守国之度，在饰四维，顺民之经，在明鬼神，只山川，敬宗庙，恭祖旧。不务天时，则财不生；不务地利，则仓廪不盈；野芜旷，则民乃菅，上无量，则民乃妄。文巧不禁，则民乃淫，不璋两原，则刑乃繁。不明鬼神，则陋民不悟；不只山川，则威令不闻；不敬宗庙，则民乃上校；不恭祖旧，则孝悌不备；四维不张，国乃灭亡。",
"　　四维",
"　　国有四维，一维绝则倾，二维绝则危，三维绝则覆，四维绝则灭。倾可正也，危可安也，覆可起也，灭不可复错也。何谓四维？一曰礼、二曰义、三曰廉、四曰耻。礼不踰节，义不自进。廉不蔽恶，耻不从枉。故不踰节，则上位安；不自进，则民无巧轴；不蔽恶，则行自全；不从枉，则邪事不生。",
"　　四顺",
"　　政之所兴，在顺民心。政之所废，在逆民心。民恶忧劳，我佚乐之。民恶贫贱，我富贵之，民恶危坠，我存安之。民恶灭绝，我生育之。能佚乐之，则民为之忧劳。能富贵之，则民为之贫贱。能存安之，则民为之危坠。能生育之，则民为之灭绝。故刑罚不足以畏其意，杀戮不足以服其心。故刑罚繁而意不恐，则令不行矣。杀戮众而心不服，则上位危矣。故从其四欲，则远者自亲；行其四恶，则近者叛之，故知“予之为取者，政之宝也”。",
"　　十一经",
"　　错国于不倾之地，积于不涸之仓，藏于不竭之府，下令于流水之原，使民于不争之官，明必死之路，开必得之门。不为不可成，不求不可得，不处不可久，不行不可复。错国于不倾之地者，授有德也；积于不涸之仓者，务五谷也；藏于不竭之府者，养桑麻育六畜也；下令于流水之原者，令顺民心也；使民于不争之官者，使各为其所长也；明必死之路者，严刑罚也；开必得之门者，信庆赏也；不为不可成者，量民力也；不求不可得者，不彊民以其所恶也；不处不可久者，不偷取一世也；不行不可复者，不欺其民也；故授有德，则国安；务五谷，则食足；养桑麻，育六畜，则民富；令顺民心，则威令行；使民各为其所长，则用备；严刑罚，则民远邪；信庆赏，则民轻难；量民力，则事无不成；不彊民以其所恶，则轴伪不生；不偷取一世，则民无怨心；不欺其民，则下亲其上。",
"　　六亲五法",
"　　以家为乡，乡不可为也。以乡为国，国不可为也。以国为天下，天下不可为也。以家为家，以乡为乡，以国为国，以天下为天下。毋曰不同生，远者不听。毋曰不同乡，远者不行。毋曰不同国，远者不从。如地如天，何私何亲？如月如日，唯君之节。御民之辔，在上之所贵。道民之门，在上之所先。召民之路，在上之所好恶。故君求之，则臣得之。君嗜之，则臣食之。君好之，则臣服之。君恶之，则臣匿之。毋蔽汝恶，毋异汝度，贤者将不汝助。言室满室，言堂满堂，是谓圣王。城郭沟渠，不足以固守；兵甲彊力，不足以应敌；博地多财，不足以有众。惟有道者，能备患于未形也，故祸不萌。天下不患无臣，患无君以使之。天下不患无财，患无人以分之。故知时者，可立以为长。无私者，可置以为政。审于时而察于用，而能备官者，可奉以为君也。缓者后于事。吝于财者失所亲，信小人者失士。",
],
}
GuanZiBookPageModule[2]={
"index":"管子",
"name":"形势",
"content":[
    "　　山高而不崩，则祈羊至矣；渊深而不涸，则沈玉极矣，天不变其常，地不易其则，春秋冬夏，不更其节，古今一也。蛟龙得水，而神可立也；虎豹得幽，而威可载也。风雨无乡，而怨怒不及也。贵有以行令，贱有以忘卑，寿夭贫富，无徒归也。",
"　　衔命者，君之尊也。受辞者，名之鉉也。上无事，则民自试。抱蜀不言，而庙堂既修。槛鹄锵锵，唯民歌之。济济多士，殷民化之，纣之失也。飞蓬之问，不在所宾；燕雀之集，道行不顾。牺牷圭璧，不足以飨鬼神。主功有素，宝币奚为？羿之道，非射也；造父之术，非驭也；奚仲之巧，非斫削也。召远者使无为焉，亲近者言无事焉，唯夜行者独有也。",
"　　平原之隰，奚有于高？大山之隈，奚有于深？訾讆之人，勿与任大。譕臣者可以远举。顾忧者可与致道。其计也速而忧在近者，往而勿召也举长者可远见也；裁大者众之所比也。美人之怀，定服而勿厌也。必得之事，不足赖也；必诺之言，不足信也。小谨者不大立，訾食者不肥体；有无弃之言者，必参于天地也。坠岸三仞，人之所大难也，而猿猱饮焉，故曰伐矜好专，举事之祸也。不行其野，不违其马；能予而无取者，天地之配也。",
"　　怠倦者不及，无广者疑神，神者在内，不及者在门，在内者将假，在门者将待。曙戒勿怠，后稚逢殃。朝忘其事，夕失其功。邪气入内，正色乃衰。君不君，则臣不臣。父不父，则子不子。上失其位，则下踰其节。上下不和，令乃不行。衣冠不正，则宾者不肃；进退无仪，则政令不行。且怀且威，则君道备矣。莫乐之，则莫哀之。莫生之，则莫死之。往者不至，来者不极。",
"　　道之所言者一也，而用之者异。有闻道而好为家者，一家之人也；有闻道而好为乡者，一乡之人也；有闻道而好为国者，一国之人也；有闻道而好为天下者，天下之人也；有闻道而好定万物者，天下之配也。道往者，其人莫来；道来者，其人莫往；道之所设，身之化也。持满者与天，安危者与人。失天之度，虽满必涸。上下不和，虽安必危。欲王天下，而失天之道，天下不可得而王也。得天之道。其事若自然。失天之道，虽立不安。其道既得，莫知其为之。其功既成，莫知其释之。藏之无刑，天之道也。疑今者，察之古不知来者，视之往，万事之生也，异趣而同归，古今一也。",
"　　生栋覆屋。怨怒不及；弱子下瓦，慈母操棰。天道之极，远者自亲。人事之起，近亲造怨。万物之于人也，无私近也，无私远也；巧者有余，而拙者不足；其功顺天者天助之，其功逆天者天违之；天之所助，虽小必大；天之所违，虽成必败；顺天者有其功，逆天者怀其兇，不可复振也。",
"　　乌鸟之狡，虽善不亲。不重之结，虽固必解；道之用也，贵其重也。毋与不可，毋彊不能，毋告不知；与不可，彊不能，告不知，谓之劳而无功。见与之交，几于不亲；见哀之役，几于不结；见施之德，几于不报；四方所归，心行者也。独王之国，劳而多祸；独国之君，卑而不威；自媒之女，丑而不信，未之见而亲焉，可以往矣；久而不忘焉，可以来矣。日月不明，天不易也；山高而不见，地不易也。言而不可复者，君不言也；行而不可再者，君不行也。凡言而不可复，行而不可再者，有国者之大禁也。",
],
}
GuanZiBookPageModule[3]={
"index":"管子",
"name":"权修",
"content":[
    "　　万乘之国，兵不可以无主，土地博大，野不可以无吏，百姓殷众，官不可以无长，操民之命，朝不可以无政。",
"　　地博而国贫者，野不辟也，民众而兵弱者，民无取也。故末产不禁，则野不辟。赏罚不信，则民无取。野不辟，民无取，外不可以应敌，内不可以固守，故曰有万乘之号，而无千乘之用，而求权之无轻，不可得也。",
"　　地辟而国贫者，舟舆饰，台榭广也。赏罚信而兵弱者，轻用众，使民劳也。舟车饰，台榭广，则赋敛厚矣。轻用众，使民劳，则民力竭矣。赋敛厚，则下怨上矣。民力竭，则令不行矣。下怨上，令不行，而求敌之勿谋己，不可得也。",
"　　欲为天下者，必重用其国，欲为其国者，必重用其民，欲为其民者，必重尽其民力。无以畜之，则往而不可止也；无以牧之，则处而不可使也；远人至而不去，则有以畜之也。民众而可一，则有以牧之也。见其可也，喜之有征。见其不可也，恶之有刑。赏罚信于其所见，虽其所不见，其敢为之乎？见其可也，喜之无征；见其不可也，恶之无刑；赏罚不信于其所见，而求其所不见之为之化，不可得也。厚爱利，足以亲之。明智礼，足以教之。上身服以先之。审度量以闲之。乡置师以说道之，然后申之以宪令，劝之以庆赏，振之以刑罚，故百姓皆说为善，则暴乱之行无由至矣。",
"　　地之生财有时，民之用力有倦，而人君之欲无穷，以有时与有倦，养无穷之君，而度量不生于其间，则上下相疾也。是以臣有杀其君，子有杀其父者矣。故取于民有度，用之有止，国虽小必安；取于民无度，用之不止，国虽大必危。",
"　　地之不辟者，非吾地也。民之不牧者，非吾民也。凡牧民者。以其所积者食之。不可不审也。其积多者其食多，其积寡者其食寡，无积者不食。或有积而不食者，则民离上；有积多而食寡者，则民不力；有积寡而食多者，则民多轴；有无积而徒食者，则民偷幸；故离上不力，多轴偷幸，举事不成，应敌不用。故曰：察能授官，班禄赐予，使民之机也。",
"　　野与市争民。家与府争货，金与粟争贵，乡与朝争治；故野不积草，农事先也；府不积货，藏于民也；市不成肆，家用足也；朝不合众，乡分治也。故野不积草，府不积货，市不成肆。朝不合众，治之至也。",
"　　人情不二，故民情可得而御也。审其所好恶，则其长短可知也；观其交游，则其贤不肖可察也；二者不失，则民能可得而官也。",
"　　地之守在城，城之守在兵，兵之守在人，人之守在粟；故地不辟，则城不固。有身不治，奚待于人？有人不治，奚待于家？有家不治，奚待于乡？有乡不治，奚待于国？有国不治，奚待于天下？天下者，国之本也；国者，乡之本也；乡者，家之本也；家者，人之本也；人者，身之本也；身者，治之本也。故上不好本事，则末产不禁；末产不禁，则民缓于时事而轻地利；轻地利，而求田野之辟，仓廪之实，不可得也。",
"　　商贾在朝，则货财上流；妇言人事，则赏罚不信；男女无别，则民无廉耻；货财上流，赏罚不信，民无廉耻，而求百姓之安难，兵士之死节，不可得也。朝廷不肃，贵贱不明，长幼不分，度量不审，衣服无等，上下凌节，而求百姓之尊主政令，不可得也。上好轴谋闲欺，臣下赋敛竞得，使民偷壹，则百姓疾怨，而求下之亲上，不可得也。有地不务本事，君国不能壹民，而求宗庙社稷之无危，不可得也。上恃龟筮，好用巫医，则鬼神骤祟；故功之不立，名之不章，为之患者三：有独王者、有贫贱者、有日不足者。",
"　　一年之计，莫如树谷；十年之计，莫如树木；终身之计，莫如树人。一树一获者，谷也；一树十获者，木也；一树百获者，人也。我茍种之，如神用之，举事如神，唯王之门。",
"　　凡牧民者，使士无邪行，女无淫事。士无邪行，教也。女无淫事，训也。教训成俗，而刑罚省，数也。凡牧民者，欲民之正也；欲民之正，则微邪不可不禁也；微邪者，大邪之所生也；微邪不禁，而求大邪之无伤国，不可得也。",
"　　凡牧民者，欲民之有礼也；欲民之有礼，则小礼不可不谨也；小礼不谨于国，而求百姓之行大礼，不可得也。凡牧民者，欲民之有义也；欲民之有义，则小义不可不行；小义不行于国，而求百姓之行大义，不可得也。",
"　　凡牧民者，欲民之有廉也；欲民之有廉，则小廉不可不修也；小廉不修于国，而求百姓之行大廉，不可得也。凡牧民者，欲民之有耻也，欲民之有耻，则小耻不可不饰也。小耻不饰于国，而求百姓之行大耻，不可得也。凡牧民者，欲民之修小礼、行小义、饰小廉、谨小耻、禁微邪、此厉民之道也。民之修小礼、行小义、饰小廉、谨小耻、禁微邪、治之本也。",
"　　凡牧民者，欲民之可御也；欲民之可御，则法不可不审；法者，将立朝廷者也；将立朝廷者，则爵服不可不贵也；爵服加于不义，则民贱其爵服；民贱其爵服，则人主不尊；人主不尊，则令不行矣。法者，将用民力者也；将用民力者，则禄赏不可不重也；禄赏加于无功，则民轻其禄赏；民轻其禄赏，则上无以劝民；上无以劝民，则令不行矣。法者，将用民能者也；将用民能者，则授官不可不审也；授官不审，则民闲其治；民闲其治，则理不上通；理不上通，则下怨其上；下怨其上，则令不行矣。法者，将用民之死命者也；用民之死命者，则刑罚不可不审；刑罚不审，则有辟就；有辟就，则杀不辜而赦有罪；杀不辜而赦有罪，则国不免于贼臣矣。故夫爵服贱、禄赏轻、民闲其治、贼臣首难，此谓败国之教也。",
],
}
GuanZiBookPageModule[4]={
"index":"管子",
"name":"立政",
"content":[
    "　　国之所以治乱者三，杀戮刑罚，不足用也。国之所以安危者四，城郭险阻，不足守也。国之所以富贫者五，轻税租，薄赋敛，不足恃也。治国有三本，而安国有四固，而富国有五事，五事五经也。",
"　　三本",
"　　君之所审者三：一曰德不当其位；二曰功不当其禄；三曰能不当其官；此三本者，治乱之原也；故国有德义未明于朝者，则不可加以尊位；功力未见于国者，则不可授与重禄；临事不信于民者，则不可使任大官；故德厚而位卑者谓之过；德薄而位尊者谓之失；宁过于君子，而毋失于小人；过于君子，其为怨浅；失于小人，其为祸深；是故国有德义未明于朝而处尊位者，则良臣不进；有功力未见于国而有重禄者，则劳臣不劝；有临事不信于民而任大官者，则材臣不用；三本者审，则下不敢求；三本者不审，则邪臣上通，而便辟制威；如此，则明塞于上，而治壅于下，正道捐弃，而邪事日长。三本者审，则便辟无威于国，道涂无行禽，疏远无蔽狱，孤寡无隐治，故曰：“刑省治寡，朝不合众”。",
"　　四固",
"　　君之所慎者四：一曰大德不至仁，不可以授国柄。二曰见贤不能让，不可与尊位。三曰罚避亲贵，不可使主兵。四曰不好本事，不务地利，而轻赋敛，不可与都邑。此四务者，安危之本也。故曰：“卿相不得众，国之危也。大臣不和同，国之危也。兵主不足畏，国之危也。民不怀其产，国之危也。”故大德至仁，则操国得众。见贤能让，则大臣和同。罚不避亲贵，则威行于邻敌。好本事，务地利，重赋敛，则民怀其产。",
"　　五事",
"　　君之所务者五：一曰山泽不救于火，草木不植成，国之贫也。二曰沟渎不遂于隘，鄣水不安其藏，国之贫也。三曰桑麻不植于野，五谷不宜其地，国之贫也。四曰六畜不育于家，瓜瓠荤菜百果不备具，国之贫也。五曰工事竞于刻镂，女事繁于文章，国之贫也。故曰：“山泽救于火，草木植成，国之富也。沟渎遂于隘，鄣水安其藏，国之富也。桑麻植于野，五谷宜其地，国之富也。六畜育于家，瓜瓠荤菜百果备具，国之富也。工事无刻镂，女事无文章，国之富也。”",
"　　首宪",
"　　分国以为五乡，乡为之师，分乡以为五州，州为之长。分州以为十里，里为之尉。分里以为十游，游为之宗。十家为什，五家为伍，什伍皆有长焉。筑障塞匿，一道路，博出入，审闾闬，慎筦键，筦藏于里尉。置闾有司，以时开闭。闾有司观出入者，以复于里尉。凡出入不时，衣服不中，圈属群徒，不顺于常者，闾有司见之，复无时。",
"　　若在长家子弟臣妾属役宾客，则里尉以谯于游宗，游宗以谯于什伍，什伍以谯于长家，谯敬而勿复。一再则宥，三则不赦。凡孝悌忠信、贤良俊材，若在长家子弟臣妾属役宾客，则什伍以复于游宗，游宗以复于里尉。里尉以复于州长。州长以计于乡师。乡师以著于士师。凡过党，其在家属，及于长家。其在长家，及于什伍之长。其在什伍之长，及于游宗。其在游宗，及于里尉。其在里尉，及于州长。其在州长，及于乡师，其在乡师，及于士师。三月一复，六月一计，十二月一著。凡上贤不过等，使能不兼官，罚有罪不独及，赏有功不专与。孟春之朝，君自听朝，论爵赏校官，终五日。季冬之夕，君自听朝，论罚罪刑杀，亦终五日。正月之朔，百吏在朝，君乃出令布宪于国，五乡之师，五属大夫，皆受宪于太史。大朝之日，五乡之师，五属大夫，皆身习宪于君前。太史既布宪，入籍于太府。宪籍分于君前。五乡之师出朝，遂于乡官致于乡属，及于游宗，皆受宪。宪既布，乃反致令焉，然后敢就舍；宪未布，令未致，不敢就舍。就舍，谓之留令。罪死不赦。五属大夫，皆以行车朝，出朝不敢就舍，遂行至都之日。遂于庙致属吏，皆受宪。宪既布，乃发使者致令以布宪之日蚤晏之时，宪既布，使者以发，然后敢就舍；宪未布。使者未发，不敢就舍；就舍，谓之留令，罪死不赦。宪既布，有不行宪者，谓之不从令，罪死不赦。考宪而有不合于太府之籍者，侈曰专制，不足曰亏令，罪死不赦。首宪既布，然后可以布宪。",
"　　首事",
"　　凡将举事，令必先出，曰事将为。其赏罚之数，必先明之，立事者，谨守令以行赏罚，计事致令，复赏罚之所加，有不合于令之所谓者，虽有功利，则谓之专制，罪死不赦。首事既布，然后可以举事。",
"　　省官",
"　　修火宪，敬山泽，林薮积草，夫财之所出，以时禁发焉。使民足于宫室之用，薪蒸之所积，虞师之事也，决水潦，通沟渎，修障防，安水藏，使时水虽过度，无害于五谷。岁虽兇旱，有所秎获，司空之事也。相高下，视肥墝，观地宜，明诏期，前后农夫，以时均修焉，使五谷桑麻，皆安其处，由田之事也。行乡里，视宫室，观树艺，简六畜，以时钧修焉。劝勉百姓，使力作毋偷。怀乐家室，重去乡里，乡师之事也。论百工，审时事，辨功苦，上完利，监壹五乡，以时钧修焉。使刻镂文采，毋敢造于乡，工师之事也。",
"　　服制",
"　　度爵而制服，量禄而用财，饮食有量，衣服有制，宫室有度，六畜人徒有数，舟车陈器有禁，修生则有轩冕服位谷禄田宅之分，死则有棺槨绞衾圹垄之度。虽有贤身贵体，毋其爵，不敢服其服。虽有富家多资，毋其禄，不敢用其财。天子服文有章，而夫人不敢以燕以飨庙，将军大夫不敢以朝官吏，以命士，止于带缘，散民不敢服杂采，百工商贾不得服长鬈貂，刑余戮民不敢服絻，不敢畜连乘车。",
"　　九败",
"　　寝兵之说胜，则险阻不守；兼爱之说胜，则士卒不战。全生之说胜，则廉耻不立。私议自贵之说胜，则上令不行。群徒比周之说胜，则贤不肖不分。金玉货财之说胜。则爵服下流，观乐玩好之说胜。则奸民在上位。请谒任举之说胜，则绳墨不正，谄谀饰过之说胜，则巧佞者用。",
"　　七观",
"　　期而致，使而往，百姓舍己以上为心者，教之所期也。始于不足见，终于不可及，一人服之，万人从之，训之所期也。未之令而为，未之使而往，上不加勉，而民自尽，竭俗之所期也。好恶形于心，百姓化于下，罚未行而民畏恐，赏未加而民劝勉，诚信之所期也。为而无害，成而不议，得而莫之能争，天道之所期也。为之而成，求之而得，上之所欲，小大必举，事之所期也。令则行，禁则止，宪之所及，俗之所被，如百体之从心，政之所期也。",
],
}
GuanZiBookPageModule[5]={
"index":"管子",
"name":"乘马",
"content":[
    "　　立国",
"　　凡立国都，非于大山之下，必于广川之上；高毋近旱，而水用足；下毋近水，而沟防省；因天材，就地利，故城郭不必中规矩，道路不必中准绳。",
"　　大数",
"　　无为者帝，为而无以为者王，为而不贵者霸，不自以为所贵，则君道也。贵而不过度，则臣道也。",
"　　地政",
"　　地者，政之本也。朝者，义之理也。市者，货之准也。黄金者，用之量也。诸侯之地，千乘之国者，器之制也。五者其理可知也，为之有道。地者政之本也，是故地可以正政也，地不平均和调，则政不可正也；政不正，则事不可理也。",
"　　阴阳",
"　　春秋冬夏，阴阳之推移也。时之短长，阴阳之利用也；日夜之易，阴阳之化也；然则阴阳正矣，虽不正，有余不可损，不足不可益也。天地莫之能损益也。然则可以正政者地也。故不可不正也，正地者，其实必正，长亦正，短亦正；小亦正，大亦正；长短大小尽正。正不正，则官不理；官不理，则事不治；事不治，则货不多；是故何以知货之多也？曰：事治。何以知事之治也？曰：货多。货多事治，则所求于天下者寡矣，为之有道。",
"　　爵位",
"　　朝者，义之理也。是故爵位正而民不怨；民不怨，则不乱，然后义可理。理不正，则不可以治；而不可不理也，故一国之人，不可以皆贵；皆贵，则事不成而国不利也。为事之不成，国之不利也。使无贵者，则民不能自理也，是故辨于爵列之尊卑，则知先后之序，贵贱之义矣，为之有道。",
"　　务市事",
"　　市者，货之准也。是故百货贱，则百利不得。百利不得，则百事治。百事治，则百用节矣；是故事者生于虑，成于务，失于傲。不虑则不生，不务则不成，不傲则不失，故曰：市者可以知治乱，可以知多寡，而不能为多寡，为之有道。",
"　　黄金",
"　　黄金者，用之量也。辨于黄金之理，则知侈俭。知侈俭，则百用节矣，故俭则伤事，侈则伤货；俭则金贱，金贱则事不成，故伤事。",
"　　侈则金贵，金贵则货贱，故伤货。货尽而后知不足，是不知量也，事已，而后知货之有余，是不知节也，不知量，不知节不可，为之有道。",
"　　诸侯之地千乘之国",
"　　诸侯之地，千乘之国者，器之制也。天下乘马服牛，而任之轻重有制，有壹宿之行，道之远近有数矣。是知诸侯之地千乘之国者，所以知地之小大也，所以知任之轻重也；重而后损之，是不知任也；轻而后益之，是不知器也。不知任不知器不可，为之有道。",
"　　士农工商",
"　　地之不可食者，山之无木者，百而当一。涸泽，百而当一。地之无草木者，百而当一。樊棘杂处，民不得入焉，百而当一。薮，镰缠得入焉，九而当一。蔓山，其木可以为材，可以为轴，斤斧得入焉，九而当一。汎山，其木可以为棺，可以为车，斤斧得入焉，十而当一。流水，网罟得入焉，五而当一。林，其木可以为棺，可以为车，斤斧得入焉，五而当一。泽，网罟得入焉，五而当一。命之曰地均，以实数。方六里，命之曰暴。五暴命之曰部。五部命之曰聚。聚者有市，无市则民乏。五聚命之曰某乡，四乡命之曰方，官制也。官成而立邑。五家而伍，十家而连，五连而暴。五暴而长，命之曰某乡。四乡命之曰都，邑制也，邑成而制事。四聚为一离，五离为一制，五制为一田，二田为一夫，三夫为一家，事制也。事成而制器，方六里，为一乘之地也。一乘者，四马也。一马其甲七，其蔽五。四乘，其甲二十有八，其蔽二十。白徒三十人奉车两，器制也。方六里，一乘之地也。方一里，九夫之田也。黄金一镒，百乘一宿之尽也，无金则用其绢。季绢三十三制当一镒，无绢则用其布。经暴布百两当一镒，一镒之金，食百乘之一宿，则所市之地，六灸一斗，命之曰中，岁有市无市，则民不乏矣。方六里，名之曰社，有邑焉，名之曰央，亦关市之赋。黄金百镒为一箧，其货一谷笼为十箧。其商茍在市者三十人。其正月十二月，黄金一镒，命之曰正。分春曰书比，立夏曰月程，秋曰大稽。与民数得亡。三岁修封，五岁修界。十岁更制，经正也。十仞见水不大潦，五尺见水不大旱，十一仞见水轻征，十分去二三，二则去三四，四则去四，五则去半，比之于山。五尺见水，十分去一，四则去三，三则去二，二则去一，三尺而见水，比之于泽。距国门以外，穷四竟之内，丈夫二犁，童五尺一犁，以为三日之功。正月，令农始作，服于公田农耕，及雪释，耕始焉，芸卒焉。士闻见博，学意察，而不为君臣者，与功而不与分焉。贾知贾之贵贱，日至于市，而不为官贾者，与功而不与分焉。工治容貌功能，日至于市，而不为官工者，与功而不与分焉。不可使而为工，则视货离之实而出夫粟。是故智者知之，愚者不知，不可以教民。巧者能之，拙者不能，不可以教民。非一令而民服之也，不可以为大善。非夫人能之也，不可以为大功；是故非诚贾不得食于贾，非诚工不得食于工，非诚农不得食于农，非信士不得立于朝。是故官虚而莫敢为之请，君有珍车珍甲而莫之敢有。君举事，臣不敢诬其所不能。君知臣，臣亦知君知己也；故臣莫敢不竭力俱操其诚以来。道曰，均地分力，使民知时也，民乃知时日之蚤晏，日月之不足，饥寒之至于身也；是故夜寝蚤起，父子兄弟，不忘其功。为而不倦，民不惮劳苦。故不均之为恶也：地利不可竭，民力不可殚。不告之以时，而民不知；不道之以事，而民不为。与之分货，则民知得正矣，审其分，则民尽力矣，是故不使而父子兄弟不忘其功。",
"　　圣人",
"　　圣人之所以为圣人者，善分民也。圣人不能分民，则犹百姓也，于己不足，安得名圣。是故有事则用，无事则归之于民，唯圣人为善讬业于民。民之生也，辟则愚，闭则类，上为一。下为二。",
"　　失时",
"　　时之处事精矣，不可藏而舍也。故曰，今日不为，明日忘货。昔之日已往而不来矣。",
"　　地里",
"　　上地方八十里，万室之国一，千室之都四；中地方百里，万室之国一，千室之都四。下地方百二十里，万室之国一，千室之都四。以上地方八十里，与下地方百二十里，通于中地方百里。",
],
}
GuanZiBookPageModule[6]={
"index":"管子",
"name":"七法",
"content":[
    "　　言是而不能立，言非而不能废；有功而不能赏，有罪而不能诛，若是而能治民者，未之有也。是必立，非必废，有功必赏，有罪必诛，若是安治矣，未也，是何也？曰：形势器械未具，犹之不治也。形势器械具四者备，治矣。不能治其民，而能彊其兵者，未之有也。能治其民矣，而不明于为兵之数，犹之不可。不能彊其兵，而能必胜敌国者，未之有也；能彊其兵，而不明于胜敌国之理，犹之不胜也。兵不必胜敌国，而能正天下者，未之有也。兵必胜敌国矣，而不明正天下之分，犹之不可，故曰：治民有器，为兵有数，胜敌国有理。正天下有分：则、象、法、化、决塞、心术、计数，根天地之气，寒暑之和，水土之性，人民鸟兽草木之生物，虽不甚多，皆均有焉，而未尝变也，谓之则。义也、名也、时也、似也、类也、比也、状也、谓之象。尺寸也、绳墨也、规矩也、衡石也、斗斛也、角量也、谓之法。",
"　　七法",
"　　渐也、顺也、靡也、久也、服也、习也、谓之化。予夺也、险易也、利害也、难易也、开闭也、杀生也、谓之决塞。实也、诚也、厚也、施也、度也、恕也、谓之心术。刚柔也、轻重也、大小也、实虚也、远近也、多少也、谓之计数。不明于则，而欲出号令，犹立朝夕于鉉均之上，檐竿而欲定其末。不明于象，而欲论材审用，犹绝长以为短，续短以为长。不明于法，而欲治民一众，犹左书而右息之。不明于化，而欲变俗易教，犹朝揉轮而夕欲乘车。不明于决塞，而欲敺众移民，犹使水逆流。不明于心术，而欲行令于人，犹倍招而必拘之。不明于计数，而欲举大事，犹无舟楫而欲经于水险也。故曰：错仪画制，不知则不可。论材审用，不知象不可。和民一众，不知法不可。变俗易教，不知化不可。敺众移民，不知决塞不可。布令必行，不知心术不可。举事必成，不知计数不可。",
"　　四伤百匿",
"　　百匿伤上威。奸吏伤官法。奸民伤俗教。贼盗伤国众。威伤，则重在下。法伤，则货上流。教伤，则从令者不辑。众伤，则百姓不安其居。重在下，则令不行。货上流，则官徒毁。从令者不辑，则百事无功。百姓不安其居，则轻民处而重民散，轻民处，重民散，则地不辟；地不辟，则六畜不育；六畜不育，则国贫而用不足；国贫而用不足，则兵弱而士不厉；兵弱而士不厉，则战不胜而守不固；战不胜而守不固，则国不安矣。故曰：常令不审，则百匿胜；官爵不审，则奸吏胜；符籍不审，则奸民胜；刑法不审，则盗贼胜；国之四经败，人君泄见危，人君泄，则言实之士不进；言实之士不进，则国之情伪不竭于上。世主所贵者宝也，所亲者戚也，所爱者民也，所重者爵禄也，亡君则不然，致所贵，非宝也，致所亲，非戚也；致所爱，非民也；致所重，非爵禄也，故不为重宝亏其命，故曰：“令贵于宝”。不为爱亲危其社稷，故曰：“社稷戚于亲”。不为爱人枉其法，故曰：“法爱于人”。不为重爵禄分其威，故曰：“威重于爵禄”。不通此四者，则反于无有。故曰：治人如治水潦，养人如养六畜，用人如用草木。居身论道行理，则群臣服教，百吏严断，莫敢开私焉。论功计劳，未尝失法律也。便辟、左右、大族、尊贵、大臣、不得增其功焉。疏远、卑贱、隐不知之人、不忘其劳，故有罪者不怨上，爱赏者无贪心，则列陈之士，皆轻其死而安难，以要上事，本兵之极也。",
"　　为兵之数",
"　　为兵之数，存乎聚财，而财无敌。存乎论工，而工无敌。存乎制器，而器无敌。存乎选士，而士无敌。存乎政教，而政教无敌。存乎服习，而服习无敌。存乎遍知天下，而遍知天下无敌。存乎明于机数，而明于机数无敌。故兵未出境，而无敌者八；是以欲正天下，财不盖天下，不能正天下；财盖天下，而工不盖天下，不能正天下；工盖天下，而器不盖天下，不能正天下；器盖天下，而士不盖天下，不能正天下；士盖天下，而教不盖天下，不能正天下；教盖天下，而习不盖天下，不能正天下；习盖天下，而不遍知天下，不能正天下；遍知天下，而不明于机数，不能正天下；故明于机数者，用兵之势也。大者时也，小者计也。王道非废也，而天下莫敢窥者，王者之正也。衡库者，天子之礼也。是故器成卒选，则士知胜矣。遍知天下，审御机数，则独行而无敌矣。所爱之国，而独利之；所恶之国，而独害之；则令行禁止，是以圣王贵之。胜一而服百，则天下畏之矣。立少而观多，则天下怀之矣。罚有罪，赏有功，则天下从之矣。故聚天下之精财，论百工之锐器，春秋角试，以练精锐为右；成器不课不用，不试不藏。收天下之豪杰，有天下之骏雄；故举之如飞鸟，动之如雷电，发之如风雨，莫当其前，莫害其后，独出独入，莫敢禁圉。成功立事，必顺于礼义，故不礼不胜天下，不义不胜人；故贤知之君，必立于胜地，故正天下而莫之敢御也。",
"　　选阵",
"　　若夫曲制时举，不失天时，毋圹地利。其数多少，其要必出于计数。故凡攻伐之为道也，计必先定于内，然后兵出乎境；计未定于内，而兵出乎境，是则战之自胜，攻之自毁也。是故张军而不能战。围邑而不能攻。得地而不能实，三者见一焉。则可破毁也。故不明于敌人之政，不能加也，不明于敌人之情，不可约也。不明于敌人之将，不先军也。不明于敌人之士，不先陈也。是故以众击寡，以治击乱，以富击贫，以能击不能，以教卒练士击敺众白徒。故十战十胜，百战百胜。故事无备，兵无主，则不蚤知。野不辟，地无吏，则无蓄积。官无常，下怨上，而器械不功。朝无政，则赏罚不明。赏罚不明，则民幸生。故蚤知敌人如独行，有蓄积，则久而不匮。器械功，则伐而不费。赏罚明，则人不幸。人不幸，则勇士劝之。故兵也者。审于地图，谋十官。日量蓄积，齐勇士，遍知天下，审御机数，兵主之事也。故有风雨之行，故能不远道里矣。有飞鸟之举，故能不险山河矣。有雷电之战，故能独行而无敌矣。有水旱之功，故能攻国救邑。有金城之守，故能定宗庙，育男女矣。有一体之治，故能出号令，明宪法矣。风雨之行者，速也。飞鸟之举者，轻也。雷电之战者，士不齐也。水旱之功者，野不收，耕不获也。金城之守者，用货财，设耳目也。一体之治者。去奇说。禁雕俗也。不远道里，故能威绝域之民，不险山河，故能服恃固之国。独行无敌，故令行而禁止。故攻国救邑，不恃权与之国，故所指必听。定宗庙，育男女，天下莫之能伤，然后可以有国。制仪法，出号令，莫不向应，然后可以治民一众矣。",
],
}
GuanZiBookPageModule[7]={
"index":"管子",
"name":"版法",
"content":[
    "　　凡将立事，正彼天植，风雨无违。远近高下，各得其嗣。三经既饬，君乃有国。喜无以赏，怒无以杀；喜以赏，怒以杀，怨乃起，令乃废，骤令不行，民心乃外。外之有徒，祸乃始牙。众之所忿，置不能图。举所美，必观其所终。废所恶，必计其所穷。庆勉敦敬以显之，富禄有功以劝之，爵贵有名以休之。兼爱无遗，是谓君心。必先顺教，万民乡风。旦暮利之，众乃胜任。取人以己，成事以质。审用财，慎施报，察称量；故用财不可以嗇，用力不可以苦。用财嗇则费，用力苦则劳。民不足，令乃辱。民苦殃，令不行。施报不得，祸乃始昌。祸昌不寤，民乃自图。正法直度，罪杀不赦。杀僇必信，民畏而惧。武威既明，令不再行，顿卒怠倦以辱之，罚罪宥过以惩之，杀僇犯禁以振之。植固不动，倚邪乃恐。倚革邪化，令往民移。法天合德，象法无亲。参于日月，佐于四时。悦在施有，众在废私。召远在修近，闭祸在除怨。修长在乎任贤，高安在乎同利。",
],
}
GuanZiBookPageModule[8]={
"index":"管子",
"name":"幼官",
"content":[
    "　　中方本图",
"　　若因处虚守静人物，人物则皇。五和时节，君服黄色，味甘味，听宫声，治和气，用五数，饮于黄后之井，以倮兽之火爨，藏温濡，行敺养，坦气修通，凡物开静，形生理。常至命，尊贤授德，则帝。身仁行义，服忠用信，则王。审谋章礼，选士利械，则霸。定生处死，谨贤修伍，则众。信赏审罚，爵材禄能，则强。计凡付终，务本饬末，则富。明法审数，立常备能，则治。同异分官，则安。",
"　　通之以道，畜之以惠，亲之以仁，养之以义，报之以德，结之以信，接之以礼，和之以乐，期之以事，攻之以官，发之以力，威之以诚。一举而上下得终，再举而民无不从，三举而地辟散成，四举而农佚粟十，五举而务轻金九，六举而絜知事变，七举而外内为用，八举而胜行威立，九举而帝事成形 。",
"　　九本搏大，人主之守也。八分有职，卿相之守也。七官饰胜备威，将军之守也。六纪审密，贤人之守也。五纪不解，庶人之守也。动而无不从，静而无不同。治乱之本三，尊卑之交四，富贫之经五，盛衰之纪六，安危之机七，强弱之应八，存亡之数九。练之以散群傰署。凡数财署，杀僇以聚财，劝勉以选众，使二分具本。发善必审于密，执威必明于中。此居图方中。",
"　　中方副图",
"　　必得文威武官习，胜之，务时因，胜之。终无方，胜之。几行义，胜之。理名实，胜之。急时分，胜之。事察伐，胜之。行备具，胜之。原无象，胜之。本定独威，胜。定计财，胜。定闻知，胜。定选士，胜。定制禄，胜。定方用，胜。定纶理，胜。定死生，胜。定成败，胜。定依奇，胜。定实虚，胜。定盛衰，胜。举机诚要，则敌不量。用利至诚，则敌不校。明名章实，则士死节。奇举发不意，则士欢用。交物因方，则械器备。因能利备，则求必得。执务明本，则士不偷。备具无常，无方应也。听于钞，故能闻未极。视于新，故能见未形，思于濬，故能知未始。发于惊，故能至无量。动于昌，故能得其宝。立于谋，故能实不可故也。器成教守，则不远道里。号审教施，则不险山河。博一纯固，则独行而无敌。慎号审章，则其攻不待权与。明必胜，则慈者勇。器无方，则愚者智。攻不守，则拙者巧。数也。动慎十号。明审九章。饰习十器。善习五官。谨修三官。必设常主。计必先定。求天下之精材。论百工之锐器。器成，角试否臧。收天下之豪杰，有天下之称材。说行若风雨，发如雷电。此居于图方中。",
"　　东方本图",
"　　春行冬政，肃。行秋政，雷。行夏政，阉。十二，地气发，戒春事。十二，小卯，出耕。十二，天气下，赐与。十二，义气至，修门闾。十二，清明，发禁。十二，始卯，合男女。十二，中卯。十二，下卯。三卯同事，八举时节。君服青色，味酸味，听角声，治燥气，用八数，饮于青后之井。以羽兽之火爨。藏不忍，行敺养。坦气修通，凡物开静，形生理。合内空周外。强国为圈，弱国为属。动而无不从，静而无不同。举发以礼，时礼必得。和好不基。贵贱无司，事变日至。此居于图东方方外。",
"　　东方副图",
"　　旗物尚青，兵尚矛。刑则交寒害釱。器成不守，经不知。教习不著，发不意。经不知，故莫之能圉。发不意，故莫之能应。莫之能应，故全胜而无害。莫之能圉，故必胜而无敌。四机不明，不过九日，而游兵惊军。障塞不审，不过八日，而外贼得闲。由守不慎，不过七日，而内有谗谋。诡禁不修，不过六日，而窃盗者起。死亡不食，不过四日，而军财在敌。此居于图东方方外。",
"　　南方本图",
"　　夏行春政，风。行冬政，落。重则雨雹。行秋政，水。十二，小郢至，德。十二，绝气下，下爵赏。十二，中郢，赐与。十二，中绝，收聚。十二，大暑至，尽善。十二，中暑。十二，小暑终。三暑同事。七举时节，君服赤色，味苦味，听羽声，治阳气，用七数。饮于赤后之井。以毛兽之火爨。藏薄纯，行笃厚，坦气修通，凡物开静，形生理。定府官，明名分，而审责于群臣有司，则下不乘上，贱不乘贵，法立数得，而无比周之民，则上尊而下卑，远近不乖，此居于图南方方外。",
"　　南方副图",
"　　旗物尚赤。兵尚戟。刑则烧交彊郊。必明其一，必明其将，必明其政，必明其士。四者备，则以治击乱，以成击败。数战则士疲，数胜则君骄，骄君使疲民，则国危。至善不战，其次一之。大胜者积众。胜无非义者，焉可以为大胜。大胜，无不胜也。此居于图南方方外。",
"　　西方本图",
"　　秋行夏政，叶。行春政，华。行冬政，秏。十二，期风至，戒秋事。十二，小卯，薄百爵。十二，白露下，收聚。十二，复理，赐与。十二，始节赋事。十二，始卯，合男女。十二，中卯。十二，下卯。三卯同事。九和时节，君服白色，味辛味，听商声，治湿气，用九数。饮于白后之井。以介虫之火爨。藏恭敬，行搏锐，坦气修通，凡物开静，形生理。闲男女之畜，修乡闾之什伍。量委积之多寡，定府官之计数。养老弱而勿通，信利周而无私，此居于图西方方外。",
"　　西方副图",
"　　旗物尚白，兵尚剑。刑则绍昧断绝。始乎无端，卒乎无穷。始乎无端，道也。卒乎无穷，德也。道不可量，德不可数。不可量，则众强不能图。不可数，则为轴不敢乡。两者备施，动静有功。畜之以道，养之以德。畜之以道，则民和，养之以德，则民合。和合故能习；习故能偕。偕习以悉。莫之能伤也。此居于图西方方外。",
"　　北方本图",
"　　冬行秋政，雾。行夏政，雷。行春政，烝泄。十二，始寒，尽刑。十二，小榆，赐予。十二，中寒，收聚。十二，中榆，大收。十二，寒至，静。十二，大寒，之阴。十二，大寒终三寒同事。六行时节，君服黑色，味咸味，听征声，治阴气，用六数，饮于黑后之井。以鳞兽之火爨。藏慈厚，行薄纯。坦气修通，凡物开静，形生理。",
"　　器成于僇，教行于钞。动静不记，行止无量。戒审四时以别息，异出入以两易，明养生以解固，审取予以总之。",
"　　一会诸侯，令曰：“非玄帝之命，毋有一日之师役”。再会诸侯，令曰：养孤老，食常疾，收孤寡。三会诸侯，令曰：田租百取五。市赋百取二。关赋百取一。毋乏耕织之器。四会诸侯，令曰：修道路，偕度量，一称数。薮泽以时禁发之。五会诸侯，令曰：修春秋冬夏之常祭，食。天壤山川之故祀，必以时。六会诸侯，令曰：以尔壤生物共玄官，请四辅，将以礼上帝。七会诸侯，令曰：官处四体而无礼者。流之焉莠命。八会诸侯，令曰：立四义而毋议者，尚之于玄官，听于三公。九会诸侯，令曰：以尔封内之财物，国之所有为币。",
"　　九会，大命焉出，常至。千里之外，二千里之内。诸侯三年而朝习命。二年，三卿使四辅。一年正月朔日，令大夫来修。受命三公。二千里之外，三千里之内，诸侯五年而会至习命。三年，名卿请事。二年，大夫通吉兇。十年，重适入，正礼义。五年，大夫请受变。三千里之外，诸侯世一至，置大夫以为廷安，入，共受命焉。此居于图北方方外。",
"　　北方副图",
"　　旗物尚黑，兵尚胁盾。刑则游仰灌流。察数而知治，审器而识胜。明谋而适胜。通德而天下定。定宗庙。育男女。官四分，则可以立威、行、德、制法仪、出号令。至善之为兵也，非地是求也，罚人是君也。立义而加之以胜，至威而实之以德。守之而后修，胜心焚海内。民之所利立之，所害除之，则民人从。立为六千里之侯。则大人从。使国君得其治。则人君从会。请命于天地，知气和，则生物从。计缓急之事。则危危而无难。明于器械之利，则涉难而不变。察于先后之理，则兵出而不困。通于出入之度，则深入而不危。审于动静之务，则功得而无害。著于取与之分，则得地而不执。慎于号令之官。则举事而有功。此居于图北方方外。",
],
}
GuanZiBookPageModule[9]={
"index":"管子",
"name":"幼官图",
"content":[
    "　　右中方本图",
"　　若因处虚守静，人物则皇。五和时节，君服黄色，味甘味，听宫声，治和气，用五数，饮于黄后之井，以倮兽之火爨。藏漫濡，行驱养，坦气修通。凡物开静，形生理。",
"　　常至命，尊贤授德则帝；身仁行义，服忠用信则王；审谋章礼，选士利械则霸；定生处死，谨贤修伍则众；信赏审罚，爵材禄能则强；计凡付终，务本饰末则富；明法审数，立常备能则治；同异分官则安。",
"　　通之以道，畜之以惠，亲之以仁，养之以义，报之以德，结之以信，接之以礼，和之以乐，期之以事，攻之以言，发之以力，威之以诚。一举而上下得终，再举而民无不从，三举而地辟谷成，四举而农佚粟十，五举而务轻金九，六举而絜知事变，七举而内外为用，八举而胜行威立，九举而帝事成形。",
"　　九本搏大，人主之守也；八分有职，卿相之守也；七胜备威，将军之守也；六纪审密，贤人之守也；五纪不解，庶人之守也；动而无不从，静而无不同。治乱之本三，卑尊之交四，富贫之终五，盛衰之纪六，安危之机七，强弱之应八，存亡之数九。练之以散群傰署，凡数财署。杀僇以聚财，劝勉以迁众，使二分具本。发善必审于密，执威必明于中。",
"　　此居图方中。",
"　　右中方副图",
"　　必得文威武，官习胜之务。时因胜之终，无方胜之几，行义胜之理，名实胜之急，时分胜之事，察伐胜之行，备具胜之原，无象胜之本。定独威胜，定计财胜，定知闻胜，定选士胜，定制禄胜，定方用胜，定纶理胜，定死生胜，定成败胜，定依奇胜，定实虚胜，定盛衰胜。举机诚要，则敌不量；用利至诚，则敌不校。明名章实，则士死节；奇举发不意，则士欢用。交物因方，则械器备；因能利备，则求必得。执务明本，则士不偷；备具无常，无方应也。",
"　　听于钞故能闻无极，视于新故能见未形，思于浚故能知未始，发于惊故能至无量，动于昌故能得其宝，立于谋故能实不可故也。器成教守，则不远道里；号审教施，则不险山河；博一纯固，则独行而无敌；慎号审章，则其攻不待权与。明必胜则慈者勇，器无方则愚者智，攻不守则拙者巧，数也。动慎十号，明审九章，饰习十器，善习五教，谨修三官。必设常主，计必先定。求天下之精材，论百工之锐器，器成角试否臧。收天下之豪杰，有天下之称材，说行若风雨，发如雷电。",
"　　此居于图方中",
"　　右东方本图",
"　　春行冬政肃，行秋政霜，行夏政阉。十二地气发，戒春事。十二小卯，出耕。十二天气下，赐与。十二义气至，修门闾。十二清明，发禁。十二始卯，合男女。十二中卯，十二下卯，三卯同事。八举时节，君服青色。味酸味，听角声，治燥气，用八数，饮于青后之井，以羽兽之火爨。藏不忍，行驱养，坦气修通，凡物开静，形生理。",
"　　合内空周外，强国为圈，弱国为属。动而无不从，静而无不同。举发以礼，时礼必得。和好不基，贵贱无司，事变日至。",
"　　此居于图东方方外。",
"　　右东方副图",
"　　旗物尚青，兵尚矛，刑则交寒害釱。",
"　　器成不守经不知，教习不著发不意。经不知，故莫之能圉；发不意，故莫之能应。莫之能应，故全胜而无害，莫之能圉，故必胜而无敌。",
"　　四机不明，不过九日而游兵惊军；障塞不审，不过八日而外贼得间；申守不慎，不过七日而内有谗谋；诡禁不修，不过六日而窃盗者起；死亡不食，不过四日而军财在敌。",
"　　此居于图东方方外。",
"　　右南方本图",
"　　夏行春政风，行冬政落，重则雨雹，行秋政水。十二小郢，至德。十二绝气下，下爵赏。十二中郢，赐与。十二中绝，收聚。十二大暑至，尽善。十二中暑，十二小暑终，三暑同事，七举时节，君服赤色，味苦味，听羽声，治阳气，用七数，饮于赤后之井，以毛兽之火爨。藏薄纯，行笃厚，坦气修通，凡物开静，形生理。",
"　　定府官，明名分，而审责于群臣有司，则下不乘上，贱不乘贵。法立数得，而无比周之民，则上尊而下卑，远近不乖。",
"　　此居于图南方方外。",
"　　右南方副图",
"　　旗物尚赤，兵尚戟，刑则烧交疆郊。",
"　　必明其情，必明其将，必明其政，必明其士。四者备，则以治击乱，以成击败。数战则士疲，数胜则君骄；骄君使疲民则危国。至善不战，其次一之。",
"　　大胜者，积众胜而无非义者焉，可以为大胜。大胜无不胜也。",
"　　此居于图南方方外",
"　　右西方本图",
"　　秋行夏政叶，行春政华，行冬政耗。十二期风至，戒秋事。十二小卯，薄百爵。十二白露下，收聚。十二复理，赐与。十二始节赋事。十二始卯，合男女。十二中卯，十二下卯，三卯同事。九和时节，君服白色，味辛味，听商声，治湿气，用九数，饮于白后之井，以介兽之火爨。藏恭敬，行搏锐，坦气修通，凡物开静，形生理。",
"　　间男女之畜，修乡闾之什伍。量委积之多寡，定府官之计数。养老弱而勿通，信利害而无私。",
"　　此居于图西方方外。",
"　　右西方副图",
"　　旗物尚白，兵尚剑，刑则绍味断绝。",
"　　始乎无端，卒乎无穷。始乎无端，首也；卒乎无穷，德也。道不可量，德不可数。不可量，则众强不能图；不可数，则为诈不敢乡。两者备施，动静有功。",
"　　畜之以道，养之以德。畜之以道则民和，养之以德则民合。和合故能习，习故能偕，借习以悉，莫之能伤也。",
"　　此居于图西方方外。",
"　　右北方本图",
"　　冬行秋政雾。行夏政雷，行春政烝泄。十二始寒，尽刑。十二小榆，赐予。十二中寒，收聚。十二中榆，大收。十二大寒，至静。十二大寒之阴，十二大寒终，三寒同事。六行时节，君服黑色，味咸味，听徵声，汉阴气，用六数，饮于黑后之井，以鳞兽之火爨。藏慈厚，行薄纯，坦气修通，凡物开静，形生理。",
"　　器成于僇，教行于钞。动静不记，行止无量。戒四时以别息，异出入以两易，明养生以解固，审取予以总之。一会诸侯令曰：非玄帝之命，毋有一日之师役。再会诸侯令曰：养孤老、食常疾、收孤寡。三会诸侯令曰：田租百取五，市赋百取二，关赋百取一，毋乏耕织之器。四会诸侯令曰：修道路，偕度量，一称数；毋征薮泽以时禁发之。五会诸侯令曰：修春秋冬夏之常祭，食天壤山川之故祀，必以时。六会诸侯令曰：以尔壤生物共玄官，请四辅，将以礼上帝。七会诸侯令曰：官处四体而无礼者，流之焉莠命。八会诸侯令曰：立四义而毋议者，尚之于玄官，听于三公。九会诸侯令曰：以尔封内之财物，国之所有为币。九会大令焉出，常至。千里之外，二千里之内，诸侯三年而朝，习命。二年，三卿使四辅。一年正月朔日，令大夫来修，受命三公。二千里之外，三千里之内，诸侯五年而会至，习命。三年，名卿请事。二年，大夫通吉凶。十年，重适入，正礼义。五年，大夫请受变。三千里之外，诸侯世一至，置大夫以为廷安，入共受命焉。",
"　　此居于图北方方外。",
"　　右北方副图",
"　　旗物尚黑，兵尚胁盾，刑则游仰灌流。",
"　　察数而知治，审器而识胜，明谋而适胜，通德而天下定。定宗庙，育男女，官四分，则可以立威行德，制法仪，出号令。至善之为兵也，非地是求也，罚人是君也。立义而加之以胜，至威而实之以德，守之而后修胜，心焚海内。民之所利立之，所害除之，则民人从。立为六千里之侯，则大人从。",
"　　使国君得其治，则人君从。会请命于天，地知气和，则生物从。",
"　　计缓急之事，则危危而无难。明于器械之利，则涉难而不变。察于先后之理，则兵出而不困。通于出入之度，则深入而不危。审于动静之务，则功得而无害也。著于取与之分，则得地而不执。慎于号令之官，则举事而有功。",
"　　此居于图北方方外。",
],
}
GuanZiBookPageModule[10]={
"index":"管子",
"name":"五辅",
"content":[
    "　　古之圣王，所以取明名广誉，厚功大业，显于天下，不忘于后世，非得人者，未之尝闻。暴王之所以失国家，危社稷，覆宗庙，灭于天下，非失人者，未之尝闻。今有士之君，皆处欲安，动欲威，战欲胜，守欲固，大者欲王天下，小者欲霸诸侯。而不务得人，是以小者兵挫而地削，大者身死而国亡，故曰：人不可不务也。此天下之极也。",
"　　曰：然则得人之道，莫如利之。利之之道，莫如教之以政，故善为政者，田畴垦而国邑实，朝廷闲而官府治，公法行而私曲止，仓廪实而囹圄空，贤人进而奸民退，其君子上中正而下谄谀。其士民贵武勇而贱得利。其庶人好耕农而恶饮食。于是财用足，而饮食薪菜饶。是故上必宽裕，而有解舍。下必听从，而不疾怨。上下和同，而有礼义，故处安而动威，战胜而守固，是以一战而正诸侯。不能为政者，田畴荒而国邑虚，朝廷兇而官府乱。公法废而私曲行，仓廪虚而囹圄实，贤人退而奸民进，其君子上谄谀而下中正，其士民贵得利而贱武勇，其庶人好饮食而恶耕农，于是财用匮而食饮薪菜乏，上弥残茍，而无解舍，下愈覆鸷而不听从，上下交引而不和同，故处不安而动不威，战不胜而守不固，是以小者兵挫而地削，大者身死而国亡，故以此观之，则政不可不慎也。",
"　　德有六兴，义有七体，礼有八经，法有五务，权有三度，所谓六兴者何？曰：辟田畴，利坛宅。修树艺，劝士民，勉稼穑，修墙屋，此谓厚其生。发伏利，输墆积修道途，便关市，慎将宿，此谓输之以财。导水潦，利陂沟，决潘渚，溃泥滞，通郁闭，慎津梁，此谓遗之以利，薄征敛，轻征赋，弛刑罚，赦罪戾，宥小过，此谓宽其政。养长老，慈幼孤，恤鳏寡，问疾病，吊祸丧，此谓匡其急。衣冻寒。食饥渴，匡贫窭，振罢露。资乏绝，此谓振其穷。凡此六者，德之兴也。六者既布，则民之所欲，无不得矣。夫民必得其所欲，然后听上，听上，然后政可善为也，故曰德不可不兴也。",
"　　曰：民知德矣，而未知义，然后明行以导之义，义有七体，七体者何？曰：孝悌慈惠，以养亲戚。恭敬忠信，以事君上。中正比宜，以行礼节。整齐撙诎，以辟刑僇。纤嗇省用，以备饥馑。敦懞纯固，以备祸乱。和协辑睦，以备寇戎。凡此七者，义之体也。夫民必知义然后中正，中正然后和调，和调乃能处安，处安然后动威，动威乃可以战胜而守固，故曰义不可不行也。",
"　　曰：民知义矣，而未知礼，然后饰八经以导之礼。所谓八经者何？曰：上下有义，贵贱有分，长幼有等贫富有度，凡此八者，礼之经也。故上下无义则乱，贵贱无分则争，长幼无等则倍，贫富无度则失。上下乱，贵贱争，长幼倍，贫富失，而国不乱者，未之尝闻也。是故圣王饬此八礼，以导其民；八者各得其义，则为人君者，中正而无私。为人臣者，忠信而不党。为人父者，慈惠以教。为人子者，孝悌以肃。为人兄者，宽裕以诲。为人弟者，比顺以敬。为人夫者，敦懞以固。为人妻者，劝勉以贞。夫然则下不倍上，臣不杀君，贱不踰贵，少不陵长，远不闲亲，新不闲旧，小不加大，淫不破义，凡此八者，礼之经也。夫人必知礼然后恭敬，恭敬然后尊让，尊让然后少长贵贱不相踰越，少长贵贱不相踰越，故乱不生而患不作，故曰礼不可不谨也。",
"　　曰：民知礼矣，而未知务，然后布法以任力，任力有五务，五务者何？曰：君择臣而任官，大夫任官辩事，官长任事守职，士修身功材，庶人耕农树艺。君择臣而任官，则事不烦乱。大夫任官辩事，则举措时。官长任事守职，则动作和。士修身功材，则贤良发。庶人耕农树艺，则财用足。故曰：凡此五者，力之务也。夫民必知务，然后心一，心一然后意专，心一而意专，然后功足观也。故曰：力不可不务也。",
"　　曰：民知务矣，而未知权，然后考三度以动之；所谓三度者何？曰：上度之天祥，下度之地宜，中度之人顺，此所谓三度。故曰：天时不祥，则有水旱。地道不宜，则有饥馑。人道不顺，则有祸乱；此三者之来也，政召之。曰：审时以举事，以事动民，以民动国，以国动天下。天下动，然后功名可成也，故民必知权然后举错得。举错得则民和辑，民和辑则功名立矣，故曰：权不可不度也。",
"　　故曰五经既布，然后逐奸民，诘轴伪，屏谗慝，而毋听淫辞，毋作淫巧。若民有淫行邪性，树为淫辞，作为淫巧，以上谄君上，而下惑百姓，移国动众，以害民务者，其刑死流，故曰：凡人君之所以内失百姓，外失诸侯，兵挫而地削，名卑而国亏，社稷灭覆，身体危殆，非生于谄淫者未之尝闻也。何以知其然也？曰：淫声谄耳，淫观谄目，耳目之所好谄心，心之所好伤民，民伤而身不危者，未之尝闻也。曰：实圹虚，垦田畴，修墙屋，则国家富。节饮食，撙衣服，则财用足。举贤良，务功劳，布德惠，则贤人进。逐奸人，诘轴伪，去谗慝，则奸人止。修饥馑，救灾害，振罢露，则国家定。",
"　　明王之务，在于强本事，去无用，然后民可使富。论贤人，用有能，而民可使治。薄税敛，毋茍于民，待以忠爱，而民可使亲；三者，霸王之事也。事有本而仁义其要也，今工以巧矣，而民不足于备用者，其悦在玩好。农以劳矣，而天下饥者，其悦在珍怪，方丈陈于前。女以巧矣，而天下寒者，其悦在文绣。是故博带梨，大袂列，文绣染，刻镂削，雕琢采。关几而不征，市鄽而不税。是故古之良工，不劳其知巧以为玩好，无用之物，守法者不失。",
],
}
GuanZiBookPageModule[11]={
"index":"管子",
"name":"宙合",
"content":[
    "　　左操五音，右执五味，怀绳与准钩，多备规轴，减溜大成，是唯时德之节。春采生，秋采蓏，夏处阴，冬处阳，大贤之德长。明乃哲，哲乃明，奋乃苓，明哲乃大行，毒而无怒，怨而无言，欲而无谋。大揆度仪，若觉卧，若晦明，若敖之在尧也。毋访于佞，毋蓄于谄，毋育于凶，毋监于谗，不正广其荒，不用其区区，鸟飞准绳，讂充末衡，易政利民，毋犯其凶，毋迩其求，而远其忧；高为其居，危颠莫之救。可浅可深，可浮可沉，可曲可直，可言可默。天不一时，地不一利；人不一事，可正而视；定而履，深而□，夫天地一险一易，若鼓之有楟，擿挡则击。天地万物之橐，宙合有橐天地。”左操五音，右执五味，”此言君臣之分也。君出令佚，故立于左。臣任力劳，故立于右。夫五音不同声而能调，此言君之所出令无妄也。而无所不顺，顺而令行政成。五味不同物而能和，此言臣之所任力无也，而无所不得，得而力务财多；故君出令，正其国而无齐其欲，一其爱而无独与是。王施而无私，则海内来宾矣。臣任力，同其忠而无争其利，不失其事而无有其名，分敬而无妒，则夫妇和勉矣。君失音则风律必流，流则乱败。臣离味则百姓不养。百姓不养，则众散亡。臣各能其分，则国宁矣。故名之曰不德。",
"　　“怀绳与准钩，多备规轴，减溜大成，是唯时德之节。”夫绳扶拨以为正，准坏险以为平，钩入枉而出直，此言圣君贤佐之制举也。博而不失，因以备能而无遗国犹是国也，民犹是民也，桀纣以乱亡，汤武以治。昌章道以教，明法以期，民之兴善也如此，汤武之功是也。多备规轴者，成轴也。夫成轴之多也，其处大也不究，其入小也不塞。犹□求履之宪也。夫焉有不适善﹖适善，备也，仙也是以无乏。故谕教者取辟焉。天淯阳，无计量，地化生，无法□。所谓是而无非，非而无是，是非有，必交来，苟信是，以有不可先规之，必有不可识虑之，然将卒而不戒，故圣人博闻、多见、畜道、以待物。物至而对形，曲均存矣。减、尽也。溜，发也。言□环毕善，莫不备得，故曰减溜大成。成功之术，必有巨获。必周于德，审于时，时德之遇，事之会也，若合符然，故曰是唯时德之节。",
"　　“春采生，秋采蓏，夏处阴，冬处阳”，此言圣人之动静开阖，诎信浧儒，取与之必因于时也。时则动，不时则静，是以古之士有意而未可阳也。故愁其治言，含愁而藏之也。贤人之处乱世也，知道之不可行，则沉抑以辟罚，静默以侔免，辟之也犹夏之就清，冬之就温焉。可以无及于寒暑之灾矣。非为畏死而不忠也，夫强言以为僇，而功泽不加，进伤为人君严之义，退害为人臣者之生，其为不利弥甚。故退身不舍端，修业不息版，以待清明。故微子不与于纣之难，而封于宋，以为殷主，先祖不灭，后世不绝，故曰大贤之德长。",
"　　“明乃哲，哲乃明，奋乃苓，明哲乃大行”，此言擅美主盛自奋也，以琅汤凌轹人，人之败也常自此；是故圣人着之简策，传以告后进，曰：“奋盛，苓落也。盛而不落者，昧之有也。”故有道者，不平其称，不满其量，不依其乐，不致其度。爵尊则肃士，禄丰则务施，功大而不伐，业明而不矜。夫名实之相怨久矣，是故绝而无交。惠者知其不可两守，乃取一焉，故安而无忧。",
"　　“毒而无怒”，此言止忿速，济没法也。”怨而无言”，言不可不慎也；言不周密，反伤其身。故曰”欲而无谋”。言谋不可以泄，谋泄灾极。夫行忿速，遂没法，贼发。言轻谋泄，灾必及于身；故曰毒而无怒，怨而无言，欲而无谋。",
"　　“大揆度仪，若觉卧，若晦明”，言渊色以自诘也，静默以审虑，依贤可用也。仁良既明，通于可不利害之理，循发蒙也。故曰，若觉卧，若晦明，若敖之在尧也。",
"　　“毋访于佞”，言毋用佞人也，用佞人，则私多行。“毋蓄于谄”，言毋听谄。听谄则欺上。“毋育于凶”，言毋使暴，使暴则伤民“毋监于谗”，言毋听谗，听则失士。夫行私、欺上、伤民、失士、此四者用，所以害君义失正也。夫为君上者，既失其义正，而倚以为名誉。为臣者不忠而邪，以趋爵禄，乱俗败世，以偷安怀乐，虽广其威，可损也。故曰不正广其荒。是以古之人，阻其路，塞其遂，守而物修，故着之简策，传以告后人曰：其为怨也深，是以威尽焉。",
"　　“不用其区区”，者虚也，人而无良焉，故曰虚也。凡坚解而不动，陼堤而不行，其于时必失，失则废而不济。失植之正而不谬，不可贤也。植而无能，不可善也。所贤美于圣人者，以其与变随化也。渊泉而不尽，微约而流施。是以德之流润泽均，加于万物。故曰圣人参于天地。",
"　　“鸟飞准绳”，此言大人之义也。夫鸟之飞也，必还山集谷；不还山则因，不集谷则死。山与谷之处也，不必正直，而还山集谷，曲则曲矣，而名绳焉。以为鸟起于北，意南而至于南。起于南，意北而至于北。苟大意得，不以小缺为伤。故圣人美而着之，曰：千里之路，不可扶以绳。万家之都，不可平以准。言大人之行，不必以先帝，常义立之谓贤。故为上者之论其下也，不可以失此术也。",
"　　“讂充”，言心也，心欲忠。“末衡”，言耳目也，耳目欲端。中正者，治之本也。耳司听，听必顺闻，闻审谓之聪。目司视，视必顺见。见察谓之明。心司虑，虑必顺言，言得谓之知。聪明以知，则博。博而不惛，所以易政也。政易民利，利乃劝，劝则告。听不顺，不审不聪，不审不聪则缪。视不察不明，不察不明则过。虑不得不知，不得不知则□。缪过以□则忧，忧则所以伎苛，伎苛所以险政，政险民害，害乃怨。怨则凶，故曰：讂充末衡，言易政利民也。",
"　　“毋犯其凶”，言中正以蓄慎也。“毋迩其求”，言上之败常，贪于金玉马女，而□爱于粟米货财也。厚藉敛于百姓，则万民怼怨。“远其忧”，言上之亡其国也。常迩其乐，立优美，而外淫于驰骋田腊，内纵于美色淫声，下乃解怠惰失，百吏皆失其端。则烦乱以亡其国家矣。“高为其居。危颠莫之救”，此言尊高满大，而好矜人以丽，主盛处贤，而自予雄也；故盛必失而雄必败。夫上既主盛处贤，以操士民，国家烦乱，万民心怨，此其必亡也，犹自万仞之山播而入深渊，其死而不振也必矣。故曰：毋迩其求，而远其忧，高为其居，危颠莫之救也。",
"　　“可浅可深，可沉可浮，可曲可直，可言可默”，此言指意要功之谓也。”天不一时，地不一利，人不一事”，是以着业不得不多，人之名位不得不殊方。明者察于事，故不官于物而旁通于道。道也者，通乎无上，详乎无穷，运乎诸生。是故辨于一言，察于一治，攻于一事者，可以曲说，而不可以广举。圣人由此知言之不可兼也，故博为之治，而计其意。知事之不可兼也，故名为之说，而况其功。岁有春秋冬夏，月有上下中旬，日有朝暮，夜有□晨，半星。辰序各有其司，故曰天不一时。山陵岑岩，渊泉闳流，泉逾瀷而不尽，薄承瀷不满。高下肥硗，物有所宜，故曰地不一利。乡有俗，国有法，食饮不同味，衣服异世用器械，规矩绳准，称量数度，品有所成，故曰人不一事。此各事之仪，其详不可尽也。",
"　　“可正而视”言察美恶，审别良苦，不可以不审。操分不杂，故政治不悔。“定而履”，言处其位，行其路，为其事，则民守其职而不乱，故葆统而好终。“深而□”，言明墨章书，道德有常，则后世人人修理而不迷，故名声不息。",
"　　“夫天地一险一易，若鼓之有桴，擿挡则击”，言苟有唱之，必有和之，和之不差，因以尽天地之道。景不为曲物直，响不为恶声美。是以圣人明乎物之性者必以其类来也，故君子绳绳乎慎其所先。",
"　　“天地万物之橐，宙合有橐天地”，天地苴万物，故曰万物之橐。宙合之意，上通于天之上，下泉于地之下，外出于四海之外，合络天地，以为一裹。散之至于无闲。不可名而山。是大之无外，小之无内，故曰有橐天地，其义不传。一典品之不极一薄，然而典品无治也。多内则富。时出则当。而圣人之道，贵富以当。奚谓当，本乎无妄之治，运乎无方之事，应变不失之谓当。变无不至，无有应当本错不敢忿。故言而名之曰宙合。",
],
}
GuanZiBookPageModule[12]={
"index":"管子",
"name":"枢言",
"content":[
    "　　管子曰：“道之在天者日也，其在人者心也。”故曰：“有气则生，无气则死，生者以其气。有名则治，无名则乱，治者以其名。”枢言曰：“爱之利之，益之安之。”四者道之出。",
"　　帝王者用之而天下治矣。帝王者，审所先所后，先民与地，则得矣。先贵与骄，则失矣。是故先王慎贵在所先所后。人主不可以不慎贵，不可以不慎民，不可以不慎富，慎贵在举贤，慎民在置官，慎富在务地。故人主之卑尊轻重，在此三者，不可不慎。国有宝有器有用，城郭险阻蓄藏，宝也。圣智，器也。",
"　　珠玉，末用也。先王重其宝器，而轻其末用。故能为天下生而不死者二，立而不立者四。喜也者、怒也者、恶也者、欲也者、天下之败也。而贤者宝之，为善者非善也故善无以为也，故先王贵善。王主积于民，霸主积于将战士，衰主积于贵人，亡主积于妇女珠玉，故先王慎其所积。疾之疾之，万物之师也。为之为之，万物之时也。强之强之，万物之指也。凡国有三制，有制人者，有为人之所制者，有不能制人，人亦不能制者。何以知其然，德盛义尊，而不好加名于人，人众兵强，而不以其国造难生患。天下有大事，而好以其国后，如此者，制人者也。",
"　　德不盛，义不尊，而好加名于人；人不众，兵不强，而好以其国造难生患；恃与国，幸名利，如此者，人之所制也。人进亦进，人退亦退；人劳亦劳，人佚亦佚，进退劳佚，与人相苟，如此者，不能制人，人亦不能制也。爱人甚而不能利也，憎人甚而不能害也。故先王贵当，贵周。周者不出于口，不见于色，一龙一蛇，一日五化之谓周，故先王不以一过二，先王不独举，不擅功。先王不约束，不结纽，约束则解，结纽则绝。故亲不在约束结纽。先王不货交，不列地，以为天下。天下不可改也，而可以鞭棰使也。时也利也。出为之也。余目不明，余耳不聪。",
"　　是以能继天子之容。官职亦然。时者得天，义者得人，既时且义，故能得天与人。先王不以勇猛为边竟，则边竟安。边竟安，则邻国亲。邻国亲，则举当矣。人故相憎也，人之心悍。故为之法。法出于礼，礼出于治，治礼道也，万物待治礼而后定。",
"　　凡万物，阴阳两生而参视，先王因其参而慎所入所出。以卑为卑，卑不可得，以尊为尊，尊不可得，桀舜是也，先王之所以最重也。得之必生，失之必死者，何也？唯无得之，尧舜禹汤文武孝己，斯待以成，天下必待以生，故先王重之。一日不食，比岁歉。三日不食，比岁饥。五日不食，比岁荒。七日不食，无国土，十日不食，无畴类尽死矣。先王贵诚信，诚信者，天下之结也。贤大夫不恃宗至，士不恃外权。坦坦之利不以功，坦坦之备不为用。故存国家，定社稷，在卒谋之闲耳。圣人用其心，沌沌乎博而圜，豚豚乎莫得其门，纷纷乎若乱丝，遗遗乎若有从治。故曰：欲知者知之，欲利者利之，欲勇者勇之，欲贵者贵之。彼欲贵，我贵之，人谓我有礼。彼欲勇，我勇之，人谓我恭。彼欲利，我利之，人谓我仁。彼欲知，我知之，人谓我愍，戒之戒之，微而异之。动作必思之，无令人识之，卒来者必备之，信之者仁也，不可欺者智也。既智且仁，是谓成人。贱固事贵，不肖固事贤。贵之所以能成其贵者，以其贵而事贱也，贤之所以能成其贤者，以其贤而事不肖也。恶者美之充也，卑者尊之充也，贱者贵之充也，故先王贵之。天以时使，地以材使，人以德使，鬼神以祥使，禽兽以力使。所谓德者，先之之谓也，故德莫如先，应适莫如后。先王用一阴二阳者霸，尽以阳者王，以一阳二阴者削，尽以阴者亡。量之不以少多称之不以轻重，度之不以短长，不审此三者，不可举大事。能戒乎？能敕乎？能隐而伏乎？能而稷乎？能而麦乎？春不生而夏无得乎，众人之用其心也，爱者憎之始也，德者怨之本也，唯贤者不然。先王事以合交，德以合人，二者不合，则无成矣，无亲矣。凡国之亡也，以其长者也。人之自失也，以其所长者也，故善游者死于梁池，善射者死于中野。命属于食，治属于事。无善事而有善治者，自古及今，未尝之有也。众胜寡，疾胜徐，勇胜怯，智胜愚，善胜恶，有义胜无义，有天道胜无天道，凡此七胜者贵众，用之终身者众矣。人主好佚欲，亡其身失其国者殆。其德不足以怀其民者殆。明其刑而贱其士者殆。",
"　　诸侯假之威，久而不知极已者殆。身弥老不知敬其适子者殆。",
"　　蓄藏积陈朽腐，不以与人者殆。凡人之名三，有治也者，有耻也者，有事也者。事之名二，正之察之，五者而天下治矣。名正则治，名倚则乱，无名则死，故先王贵名。先王取天下，远者以礼，近者以体，体礼者，所以取天下，远近者，所以殊天下之际。日益之而患少者惟忠，日损之而患多者惟欲。多忠少欲，智也，为人臣者之广道也。为人臣者，非有功劳于国也，家富而国贫，为人臣者之大罪也。为人臣者，非有功劳于国也，爵尊而主卑，为人臣者之大罪也。无功劳于国而贵富者，其唯尚贤乎？众人之用其心也，爱者憎之始也，德者怨之本也。生其事亲也，妻子具，则孝衰矣。其事君也，有好业，家室富足，则行衰矣。爵禄满，则忠衰矣，唯贤者不然，故先王不满也。",
"　　人主操逆人臣操顺。先王重荣辱，荣辱在为，天下无私爱也，无私憎也，为善者有福，为不善者有祸，祸福在为，故先王重为。明赏不费明刑不暴，赏罚明，则德之至者也，故先王贵明。",
"　　天道大而帝王者用爱恶。爱恶天下可秘，爱恶重闭必固。釜鼓满，则人概之，人满，则天概之，故先王不满也。先王之书，心之敬执也，而众人不知也。故有事事也，毋事亦事也。吾畏事，不欲为事，吾畏言，不欲为言，故行年六十而老吃也。",
],
}
GuanZiBookPageModule[13]={
"index":"管子",
"name":"八观",
"content":[
    "　　大城不可以不完，郭周不可以外通，里域不可以横通，闾闬不可以毋阖，宫垣关闭不可以不修。故大城不完，则乱贼之人谋；郭周外通，则奸遁逾越者作；里域横通，则攘夺窃盗者不止；闾闬无阖，外内交通，则男女无别；宫垣不备，关闭不固，虽有良货，不能守也。故形势不得力非，则奸邪之人悫愿；禁罚威严，则简慢之人整齐；宪令著明，则蛮夷之人不敢犯；赏庆信必，则有功者劝；教训习俗者众，则君民化变而不自知也。是故明君在上位，刑省罚寡，非可刑而不刑，非可罪而不罪也；明君者，闭其门，塞其涂，弇其迹，使民毋由接于淫非之地，是以民之道正行善也若性然。故罪罚寡而民以治矣。",
"　　行其田野，视其耕芸，计其农事，而饥饱之国可以知也。其耕之不深，芸之不谨，地宜不任，草田多秽，耕者不必肥，荒者不必墝，以人猥计其野，草田多而辟田少者，虽不水旱，饥国之野也。若是而民寡，则不足以守其地，若是而民众，则国贫民饥。以此遇水旱，则众散而不收；彼民不足以守者，其城不固。民饥者不可以使战。众散而不收，则国为丘墟。故曰：有地君国，而不务耕耘，寄生之君也。故曰：行其田野，视其耕芸，计其农事，而饥饱之国可知也。",
"　　行其山泽，观其桑麻，计其六蓄之产，而贫富之国可知也。夫山泽广大，则草木易多也。壤地肥饶，则桑麻易植也。荐草多衍，则六畜易繁也。山泽虽广，草木毋禁，壤地虽肥。桑麻毋数；荐草虽多，六畜有征，闭货之门也。故曰：“时货不遂”。金玉虽多，谓之贫国也。故曰：“行其山泽，观其桑麻，计其六畜之产，而贫富之国可知也。”",
"　　入国邑，视宫室，观车马衣服，而侈俭之国可知也。夫国城大而田野浅狭者，其野不足以养其民。城域大而人民寡者，其民不足以守其城。宫营大而室屋寡者，其室不足以实其宫。室屋众而人徒寡者，其人不足以处其室。囷仓寡而台榭繁者，其藏不足以共其费。故曰：“主上无积而宫室美，氓家无积而衣服修，乘车者饰观望，灸行者杂文采，本资少而末用多者，侈国之俗也。”国侈则用费，用费则民贫，民贫则奸智生，奸智生则邪巧作；故奸邪之所生，生于匮不足；匮不足之所生，生于侈；侈之所生，生于毋度；故曰：“审度量，节衣服，俭财用，禁侈泰，为国之急也。”不通于若计者，不可使用国。故曰：“入国邑，视宫室，观车马衣服，而侈俭之国可知也。”",
"　　课兇饥，计师役，观台榭，量国费，而实虚之国可知也。凡田野万家之众，可食之地，方五十里，可以为足矣。万家以下，则就山泽可矣。万家以上，则去山泽可矣。彼野悉辟而民无积者，国地小而食地浅也。田半垦而民有余食而粟米多者，国地大而食地博也。国地大而野不辟者，君好货而臣好利者也。辟地广而民不足者，上赋重，流其藏者也，故曰：“粟行于三百里，则国毋一年之积；粟行于四百里，则国毋二年之积；粟行于五百里，则众有饥色；”其稼亡三之一者，命曰小兇。小兇三年而大兇，大兇，则众有大遗苞矣。什一之师，什三毋事，则稼亡三之一。稼亡三之一，而非有故盖积也，则道有损瘠矣。什一之师，三年不解，非有余食也，则民有鬻子矣。故曰：“山林虽近。草木虽美，宫室必有度，禁发必有时，是何也？曰：“大木不可独伐也，大木不可独举也，大木不可独鉉也，大木不可加之薄墙之上。”故曰：“山林虽广，草木虽美，禁发必有时；国虽充盈，金玉虽多，宫室必有度；江海虽广，池泽虽博，鱼鳖虽多，罔罟必有正。”船网不可一财而成也。非私草木爱鱼鳖也，恶废民于生谷也。故曰：“先王之禁山泽之作者，博民于生谷也。”彼民非谷不食，谷非地不生，地非民不动，民非作力毋以致财，天下之所生，生于用力；力之所生，生于劳身，是故主上用财毋已，是民用力毋休也，故曰：“台榭相望者，其上下相怨也”。民毋余积者，其禁不必止，众有遗苞者，其战不必胜。道有损瘠者，其守不必固。故令不必行，禁不必止，战不必胜，守不必固，则危亡随其后矣；故曰：“课兇饥，计师役，观台榭，量国费，实虚之国可知也。”",
"　　入州里，观习俗，听民之所以化其上。而治乱之国可知也。州里不鬲，闾闬不设，出入毋时，早晏不禁，则攘夺窃盗，攻击残贼之民，毋自胜矣。食谷水，巷凿井，场容接，树木茂，宫墙毁坏，门户不闭，外内交通，则男女之别毋自正矣。乡毋长游，里毋士舍，时无会同，丧烝不聚，禁罚不严，则齿长辑睦，毋自生矣。故帐礼不谨，则民不修廉，论贤不乡举，则士不及行，货财行于国，则法令毁于官。请谒得于上，则党与成于下。乡官毋法制，百姓群徒不从；此亡国弒君之所自生也。故曰：“入州里，观习俗，听民之所以化其上者，而治乱之国可知也。”",
"　　入朝廷，观左右，求本朝之臣，论上下之所贵贱者，而彊弱之国可知也。功多为上，禄赏为下，则积劳之臣，不务尽力。治行为上，爵列为下，则豪桀材臣，不务竭能。便辟左右，不论功能，而有爵禄，则百姓疾怨。非上贱爵轻禄。金玉货财商贾之人，不论志行，而有爵禄也，则上令轻，法制毁。权重之人，不论才能，而得尊位，则民倍本行而求外势。彼积劳之臣，不务尽力。则兵士不战矣。豪桀材人不务竭能，则内治不别矣。百姓疾怨，非上贱爵轻禄，则上毋以劝众矣。上令轻，法制毁，则君毋以使臣，臣毋以事君矣。民倍本行而求外势，则国之情伪竭在敌国矣。故曰：“入朝廷，观左右，求本朝之臣，论上下之所贵贱者，而彊弱之国可知也。”",
"　　置法出令，临众用民，计其威严宽惠，行于其民与不行于其民可知也。法虚立而害疏远，令一布而不听者存，贱爵禄而毋功者富，然则众必轻令，而上位危。故曰：“良田不在战士，三年而兵弱。赏罚不信，五年而破。上卖官爵，十年而亡。倍人伦而禽兽行，十年而灭。”战不胜，弱也。地四削，入诸侯，破也。离本国，徙都邑，亡也。有者异姓，灭也。故曰：“置法出令，临众用民，计其威严宽惠，而行于其民不行于其民可知也。”",
"　　计敌与，量上意，察国本，观民产之所有余不足，而存亡之国可知也。敌国彊而与国弱，谏臣死而谀臣尊，私情行而公法毁，然则与国不恃其亲，而敌国不畏其彊，豪杰不安其位，而积劳之人不怀其禄。悦商贩而不务本货，则民偷处而不事积聚。豪杰不安其位，则良臣出，积劳之人不怀其禄，则兵士不用。民偷处而不事积聚，则囷仓空虚，如是而君不为变。然则攘夺窃盗，残贼进取之人起矣。内者廷无良臣，兵士不用，囷仓空虚，而外有彊敌之忧，则国居而自毁矣。故曰：“计敌与，量上意，察国本，观民产之所有余不足，而存亡之国可知也。",
"　　故以此八者观人主之国，而人主毋所匿其情矣。”",
],
}
GuanZiBookPageModule[14]={
"index":"管子",
"name":"法禁",
"content":[
    "　　法制不议，则民不相私。刑杀毋赦，则民不偷于为善。爵禄毋假。则下不乱其上。三者藏于官则为法，施于国则成俗，其余不彊而治矣。",
"　　君壹置则仪，则百官守其法。上明陈其制，则下皆会其度矣。君之置其仪也不一，则下之倍法而立私理者必多矣。是以人用其私，废上之制，而道其所闻，故下与官列法，而上与君分威。国家之危，必自此始矣。昔者圣王之治其民也不然，废上之法制者，必负以耻。财厚博惠，以私亲于民者，正经而自正矣。乱国之道，易国之常，赐赏恣于己者，圣王之禁也。圣王既殁，受之者衰，君人而不能知立君之道，以为国本，则大臣之赘下而射人心者必多矣，君不能审立其法，以为下制。则百姓之立私理而径于利者必众矣。",
"　　昔者圣王之治人也，不贵其人博学也，欲其人之和同以听令也。《泰誓》曰：“纣有臣亿万人，亦有亿万之心，武王有臣三千而一心，故纣以亿万之心亡，武王以一心存”。故有国之君，茍不能同人心，一国威，齐士义，通上之治，以为下法，则虽有广地众民，犹不能以为安也。君失其道，则大臣比权重，以相举于国，小臣必循利以相就也。故举国之士，以为亡党，行公道以为私惠。进则相推于君，退则相誉于民，各便其身，而忘社稷。以广其居，聚徒威群。上以蔽君，下以索民。此皆弱君乱国之道也，故国之危也。",
"　　乱国之道，易国之常，赐赏恣于己者，圣王之禁也。擅国权以深索于民者，圣王之禁也。其身毋任于上者，圣王之禁也。",
"　　进则受禄于君，退则藏禄于室，毋事治职，但力事属，私王官，私君事，去非其人而人私行者，圣王之禁也。",
"　　修行则不以亲为本，治事则不以官为主，举毋能、进毋功者，圣王之禁也。",
"　　交人则以为己赐，举人则以为己劳，仕人则与分其禄者，圣王之禁也。",
"　　交于利通而获于贫穷，轻取于其民而重致于其君，削上以附下，枉法以求于民者，圣王之禁也。",
"　　用不称其人，家富于其列，其禄甚寡而资财甚多者，圣王之禁也。",
"　　拂世以为行，非上以为名，常反上之法制以成群于国者，圣王之禁也。",
"　　饰于贫穷，而发于勤劳，权于贫贱，身无职事，家无常姓，列上下之闲，议言为民者，圣王之禁也。",
"　　壶士以为亡资，修田以为亡本，则生之养私不死然后失缫以深与上为市者。圣王之禁也。",
"　　审饰小节以示民时言大事以动上远交以踰群，假爵以临朝者，圣王之禁也。",
"　　卑身杂处隐行辟倚，侧入迎远，遁上而遁民者，圣王之禁也。",
"　　诡俗异礼，大言法行，难其所为，而高自错者，圣王之禁也。",
"　　守委闲居，博分以致众。勤身遂行，说人以货财。济人以买誉，其身甚静，而使人求者，圣王之禁也。",
"　　行辟而坚言诡而辩，术非而博，顺恶而泽者，圣王之禁也。",
"　　以朋党为友，以蔽恶为仁，以数变为智，以重敛为忠，以遂忿为勇者，圣王之禁也。",
"　　固国之本，其身务往于上，深附于诸侯者，圣王之禁也。",
"　　圣王之身，治世之时，德行必有所是，道义必有所明；故士莫敢诡俗异礼，以自见于国，莫敢布惠缓行，修上下之交，以和亲于民。故莫敢超等踰官，渔利苏功。以取顺其君。圣王之治民也，进则使无由得其所利，退则使无由避其所害，必使反乎安其位，乐其群，务其职，荣其名，而后止矣。故踰其官而离其群者，必使有害。不能其事而失其职者，必使有耻；是故圣王之教民也，以仁错之，以耻使之，修其能，致其所成而止。故曰：“绝而定，静而治，安而尊，举错而不变者，圣王之道也。”",
],
}
GuanZiBookPageModule[15]={
"index":"管子",
"name":"重令",
"content":[
    "　　凡君国之重器，莫重于令。令重则君尊，君尊则国安；令轻则君卑，君卑则国危。故安国在乎尊君，尊君在乎行令，行令在乎严罚。罚严令行，则百吏皆恐；罚不严，令不行，则百吏皆喜。故明君察于治民之本，本莫要于令。故曰：亏令者死，益令者死，不行令者死，留令者死，不从令者死。五者死而无赦，唯令是视。故曰：令重而下恐。",
"　　为上者不明，令出虽自上，而论可与不可者在下。夫倍上令以为威，则行恣于己以为私，百吏奚不喜之有？且夫令出虽自上，而论可与不可者在下，是威下系于民也。威下系于民，而求上之毋危，不可得也。令出而留者无罪，则是教民不敬也。令出而不行者毋罪，行之者有罪，是皆教民不听也。令出而论可与不可者在官，是威下分也。益损者毋罪，则是教民邪途也。如此，则巧佞之人，将以此成私为交；比周之人，将以此阿党取与；贪利之人，将以此收货聚财；懦弱之人，将以此阿贵事富便辟；伐矜之人，将以此买誉成名。故令一出，示民邪途五衢，而求上之毋危，下之毋乱，不可得也。",
"　　菽粟不足，末生不禁，民必有饥饿之色，而工以雕文刻镂相稚也，谓之逆。布帛不足，衣服毋度，民必有冻寒之伤，而女以美衣锦绣綦组相稚也，谓之逆。万乘藏兵之国，卒不能野战应敌，社稷必有危亡之患，而士以毋分役相稚也，谓之逆。爵人不论能，禄人不论功，则士无为行制死节，而群臣必通外请谒，取权道，行事便辟，以贵富为荣华以相稚也，谓之逆。",
"　　朝有经臣，国有经俗，民有经产。何谓朝之经臣？察身能而受官，不诬于上；谨于法令以治，不阿党；竭能尽力而不尚得，犯难离患而不辞死；受禄不过其功，服位不侈其能，不以毋实虚受者，朝之经臣也。何谓国之经俗？所好恶不违于上，所贵贱不逆于令；毋上拂之事，毋下比之说，毋侈泰之养，毋逾等之服；谨于乡里之行，而不逆于本朝之事者，国之经俗也。何谓民之经产？畜长树艺，务时殖谷，力农垦草，禁止末事者，民之经产也。故曰：朝不贵经臣，则便辟得进，毋功虚取；奸邪得行，毋能上通。国不服经俗，则臣下不顺，而上令难行。民不务经产，则仓廪空虚，财用不足。便辟得进，毋功虚取，奸邪得行，毋能上通，则大臣不和。臣下不顺，上令难行，则应难不捷。仓廪空虚，财用不足，则国毋以固守。三者见一焉，则敌国制之矣。",
"　　故国不虚重，兵不虚胜，民不虚用，令不虚行。凡国之重也，必待兵之胜也，而国乃重。凡兵之胜也，必待民之用也，而兵乃胜；凡民之用也，必待令之行也，而民乃用。凡令之行也，必待近者之胜也，而令乃行。故禁不胜于亲贵，罚不行于便辟，法禁不诛于严重，而害于疏远，庆赏不施于卑贱，二三而求令之必行，不可得也。能不通于官受，禄赏不当于功，号令逆于民心，动静诡于时变，有功不必赏，有罪不必诛，令焉不必行，禁焉不必止，在上位无以使下，而求民之必用，不可得也。将帅不严威，民心不专一，阵士不死制，卒士不轻敌，而求兵之必胜，不可得也。内守不能完，外攻不能服，野战不能制敌，侵伐不能威四邻，而求国之重，不可得也。德不加于弱小，威不信于强大，征伐不能服天下，而求霸诸侯，不可得也。威有与两立，兵有与分争，德不能怀远国，令不能一诸侯，而求王天下，不可得也。",
"　　地大国富，人众兵强，此霸王之本也，然而与危亡为邻矣。天道之数，人心之变。天道之数，至则反，盛则衰。人心之变，有余则骄，骄则缓怠。夫骄者，骄诸侯，骄诸侯者，诸侯失于外；缓怠者，民乱于内。诸侯失于外，民乱于内，天道也。此危亡之时也。若夫地虽大，而不并兼，不攘夺；人虽众，不缓怠，不傲下；国虽富，不侈泰，不纵欲；兵虽强，不轻侮诸侯，动众用兵必为天下政理，此正天下之本而霸王之主也。",
"　　凡先王治国之器三，攻而毁之者六。明王能胜其攻，故不益于三者，而自有国、正天下。乱王不能胜其攻，故亦不损于三者，而自有天下而亡。三器者何也？曰：号令也，斧钺也，禄赏也。六攻者何也？曰：亲也，贵也，货也，色也，巧佞也，玩好也。三器之用何也？曰：非号令毋以使下，非斧钺毋以威众，非禄赏毋以劝民。六攻之败何也？曰：虽不听，而可以得存者；虽犯禁，而可以得免者；虽毋功，而可以得富者。凡国有不听而可以得存者，则号令不足以使下；有犯禁而可以得免者，则斧钺不足以威众；有毋功而可以得富者，则禄赏不足以劝民。号令不足以使下，斧钺不足以威众，禄赏不足以劝民，若此，则民毋为自用。民毋为自用，则战不胜；战不胜，而守不固；守不固，则敌国制之矣。然则先王将若之何？曰，不为六者变更于号令，不为六者疑错于斧钺，不为六者益损于禄赏。若此，则远近一心；远近一心，则众寡同力；众寡同力；则战可以必胜，而守可以必固。非以并兼攘夺也，以为天下政治也，此正天下之道也。",
],
}
GuanZiBookPageModule[16]={
"index":"管子",
"name":"法法",
"content":[
    "　　不法法，则事毋常；法不法，则令不行。令而不行，则令不法也；法而不行，则修令者不审也；审而不行，则赏罚轻也；重而不行，则赏罚不信也；信而不行，则不以身先之也。故曰：禁胜于身，则令行于民矣。",
"　　闻贤而不举，殆；闻善而不索，殆；见能而不使，殆；亲人而不固，殆；同谋而离，殆；危人而不能，殆；废人而复起，殆；可而不为，殆；足而不施，殆；几而不密，殆。人主不周密，则正言直行之士危；正言直行之士危，则人主孤而毋内；人主孤而毋内，则人臣党而成群。使人主孤而毋内、人臣党而成群者，此非人臣之罪也，人主之过也。",
"　　民毋重罪，过不大也，民毋大过，上毋赦也。上赦小过，则民多重罪，积之所生也。故曰：赦出则民不敬，惠行则过日益。惠赦加于民，而囹圄虽实，杀戮虽繁，奸不胜矣。故曰：邪莫如蚤禁之。赦过遗善，则民不励。有过不赦，有善不遗，励民之道，于此乎用之矣。故曰：明君者，事断者也。",
"　　君有三欲于民，三欲不节，则上位危。三欲者何也？一曰求，二曰禁，三曰令。求必欲得，禁必欲止，令必欲行。求多者，其得寡；禁多者，其止寡；令多者，其行寡。求而不得，则威日损；禁而不止，则刑罚侮；令而不行，则下凌上。故未有能多求而多得者也，未有能多禁而多止者也，未有能多令而多行者也。故曰：上苛则下不听，下不听而强以刑罚，则为人上者众谋矣。为人上而众谋之，虽欲毋危，不可得也。号令已出又易之，礼义已行又止之；度量已制又迁之，刑法已错又移之。如是，则庆赏虽重，民不劝也；杀戮虽繁，民不畏也。故曰：上无固植，下有疑心。国无常经，民力必竭，数也。",
"　　明君在上位，民毋敢立私议自贵者，国毋怪严，毋杂俗，毋异礼，士毋私议。倨傲易令，错仪画制，作议者尽诛。故强者折，锐者挫，坚者破。引之以绳墨，绳之以诛僇，故万民之心皆服而从上，推之而往，引之而来。彼下有立其私议自贵，分争而退者，则令自此不行矣。故曰：私议立则主道卑矣。况主倨傲易令，错仪画制，变易风俗，诡服殊说犹立。上不行君令，下不合于乡里，变更自为，易国之成俗者，命之曰不牧之民。不牧之民，绳之外也；绳之外诛。使贤者食于能，斗士食于功。贤者食于能，则上尊而民从；斗士食于功，则卒轻患而傲敌。上尊而民从，卒轻患而傲敌。二者设于国，则天下治而主安矣。",
"　　凡赦者，小利而大害者也，故久而不胜其祸。毋赦者，小害而大利者也，故久而不胜其福。故赦者，奔马之委辔；毋赦者，痤雎之矿石也。爵不尊、禄不重者，不与图难犯危，以其道为未可以求之也。是故先王制轩冕所以著贵贱，不求其美；设爵禄所以守其服，不求其观也。使君子食于道，小人食于力。君子食于道，则上尊而民顺；小人食于力，则财厚而养足。上尊而民顺，财厚而养足，四者备体，则胥足上尊时而王不难矣。文有三侑，武毋一赦。惠者，多赦者也，先易而后难，久而不胜其祸：法者，先难而后易，久而不胜其福。故惠者，民之仇雠也；法者，民之父母也。太上以制制度，其次失而能追之，虽有过，亦不甚矣。",
"　　明君制宗庙，足以设宾祀，不求其美；为宫室台榭，足以避燥湿寒暑，不求其大；为雕文刻镂，足以辨贵贱，不求其观。故农夫不失其时，百工不失其功，商无废利，民无游日，财无砥墆。故曰：俭其道乎！",
"　　令未布而民或为之，而赏从之，则是上妄予也。上妄予，则功臣怨；功臣怨，而愚民操事于妄作；愚民操事于妄作，则大乱之本也。令未布而罚及之，则是上妄诛也。上妄诛，则民轻生；民轻生，则暴人兴、曹党起而乱贼作矣。令已布而赏不从，则是使民不劝勉、不行制、不死节。民不劝勉、不行制、不死节，则战不胜而守不固；战不胜而守不固，则国不安矣。令已布而罚不及，则是教民不听。民不听，则强者立；强者立，则主位危矣。故曰：宪律制度必法道，号令必著明，赏罚必信密，此正民之经也。",
"　　凡大国之君尊，小国之君卑。大国之君所以尊者，何也？曰：为之用者众也。小国之君所以卑者，何也？曰：为之用者寡也。然则为之用者众则尊，为之用者寡则卑，则人主安能不欲民之众为己用也？使民众为己用，奈何？曰：法立令行，则民之用者众矣；法不立，令不行，则民之用者寡矣。故法之所立、令之所行者多，而所废者寡，则民不诽议；民不诽议，则听从矣。法之所立，令之所行，与其所废者钧，则国毋常经；国毋常经，则民妄行矣。法之所立、令之所行者寡，而所废者多，则民不听；民不听，则暴人起而奸邪作矣。",
"　　计上之所以爱民者，为用之爱之也。为爱民之故，不难毁法亏令，则是失所谓爱民矣。夫以爱民用民，则民之不用明矣。夫至用民者，杀之危之，劳之苦之，饥之渴之；用民者将致之此极也，而民毋可与虑害己者，明王在上，道法行于国，民皆舍所好而行所恶。故善用民者，轩冕不下拟，而斧钺不上因。如是，则贤者劝而暴人止。贤者劝而暴人止，则功名立其后矣。蹈白刃，受矢石，入水火，以听上令；上令尽行，禁尽止。引而使之，民不敢转其力；推而战之，民不敢爱其死。不敢转其力，然后有功；不敢爱其死，然后无敌。进无敌，退有功，是以三军之众皆得保其首领，父母妻子完安于内。故民未尝可与虑始，而可与乐成功。是故仁者、知者、有道者，不与大虑始。",
"　　国无以小与不幸而削亡者，必主与大臣之德行失于身也，官职、法制、政教失于国也，诸侯之谋虑失于外也，故地削而国危矣。国无以大与幸而有功名者，必主与大臣之德行得于身也。官职、法制、政教得于国也，诸侯之谋虑得于外也。然后功立而名成。然则国何可无道？人何可无求？得道而导之，得贤而使之，将有所大期于兴利除害。期于兴利除害莫急于身，而君独甚。伤也，必先令之失。人主失令而蔽，已蔽而劫，已劫而弑。",
"　　凡人君之所以为君者，势也。故人君失势，则臣制之矣。势在下，则君制于臣矣；势在上，则臣制于君矣。故君臣之易位，势在下也。在臣期年，臣虽不忠，君不能夺也；在子期年，子虽不孝，父不能服也。故《春秋》之记，臣有弑其君、子有弑其父者矣。故曰：堂上远于百里，堂下远于千里，门庭远于万里。今步者一日，百里之情通矣；堂上有事，十日而君不闻，此所谓远于百里也。步者十日，千里之情通矣；堂下有事，一月而君不闻，此所谓远于千里也。步者百日，万里之情通矣，门庭有事，期年而君不闻，此所谓远于万里也。故请入而不出谓之灭，出而不入谓之绝，入而不至谓之侵，出而道止谓之壅。灭绝侵壅之君者，非杜其门而守其户也、为政之有所不行也。故曰：令重于宝，社稷先于亲戚，法重于民，威权贵于爵禄。故不为重宝轻号令，不为亲戚后社稷，不为爱民枉法律，不为爵禄分威权。故曰：势非所以予人也。",
"　　政者，正也。正也者，所以正定万物之命也。是故圣人精德立中以生正，明正以治国。故正者，所以止过而逮不及也。过与不及也，皆非正也；非正，则伤国一也。勇而不义伤兵，仁而不法伤正。故军之败也，生于不义；法之侵也，生于不正。故言有辨而非务者，行有难而非善者。故言必中务，不苟为辩；行必思善，不苟为难。",
"　　规矩者，方圜之正也。虽有巧目利手，不如拙规矩之正方圜也。故巧者能生规矩，不能废规矩而正方圜。虽圣人能生法，不能废法而治国。故虽有明智高行，倍法而治，是废规矩而正方圜也。",
"　　一曰：凡人君之德行威严，非独能尽贤于人也；曰人君也，故从而贵之，不敢论其德行之高卑有故。为其杀生，急于司命也；富人贫人，使人相畜也；良人贱人，使人相臣也。人主操此六者以畜其臣，人臣亦望此六者以事其君，君臣之会，六者谓之谋。六者在臣期年，臣不忠，君不能夺；在子期年，子不孝，父不能夺。故《春秋》之记，臣有弑其君，子有弑其父者，得此六者，而君父不智也。六位在臣，则主蔽矣；主蔽者，失其令也。故曰：令入而不出谓之蔽，令出而不入谓之壅，令出而不行谓之牵，令入而不至谓之瑕。牵瑕蔽壅之事君者，非敢杜其门而守其户也，为令之有所不行也。此其所以然者，在贤人不至而忠臣不用也。故人主不可以不慎其令。令者，人主之大宝也。",
"　　一曰：贤人不至谓之蔽，忠臣不用谓之塞，令而不行谓之障，禁而不止谓之逆。蔽塞障逆之君者，不敢杜其门而守其户也，为贤者之不至、令之不行也。",
"　　凡民从上也，不从口之所言，从情之所好者也；上好勇，则民轻死；上好仁，则民轻财。故上之所好，民必甚焉。是故明君知民之必以上为心也，故置法以自治，立仪以自正也。故上不行，则民不从；彼民不服法死制，则国必乱矣。是以有道之君，行法修制，先民服也。",
"　　凡论人有要：矜物之人，无大士焉。彼矜者，满也；满者，虚也。满虚在物，在物为制也。矜者，细之属也。凡论人而远古者，无高士焉。既不知古而易其功者，无智土焉。德行成于身而远古，卑人也。事无资，遇时而简其业者，愚士也。钓名之人，无贤士焉。钓利之君，无王主焉。贤人之行其身也，忘其有名也；王主之行其道也，忘其成功也。贤人之行，王主之道，其所不能已也。",
"　　明君公国一民以听于世，忠臣直进以论其能。明君不以禄爵私所爱，忠臣不诬能以干爵禄。君不私国，臣不诬能，行此道者，虽未大治，正民之经也。今以诬能之臣事私国之君，而能济功名者，古今无之。诬能之人易知也。臣度之先王者，舜之有天下也，禹为司空，契为司徒，皋陶为李，后稷为田。此四士者，天下之贤人也，犹尚精一德以事其君。今诬能之人，服事任官，皆兼四贤之能。自此观之，功名之不立，亦易知也。故列尊禄重，无以不受也；势利官大，无以不从也；以此事君，此所谓诬能篡利之臣者也。世无公国之君，则无直进之士；无论能之主，则无成功之臣。昔者三代之相授也，安得二天下而杀之。",
"　　贫民伤财，莫大于兵；危国忧主，莫速于兵。此四患者明矣，古今莫之能废也。兵当废而不废，则古今惑也；此二者不废而欲废之，则亦惑也。此二者伤国一也。黄帝唐虞，帝之隆也，资有天下，制在一人。当此之时也，兵不废。今德不及三帝，天下不顺，而求废兵，不亦难乎？故明君知所擅，知所患。国治而民务积，此所谓擅也。动与静，此所患也。是故明君审其所擅，以备其所患也。",
"　　猛毅之君，不免于外难；懦弱之君，不免于内乱。猛毅之君者轻诛，轻诛之流，道正者不安；道正者不安、则材能之臣去亡矣。彼智者知吾情伪，为敌谋我，则外难自是至矣。故曰：猛毅之君，不免于外难。懦弱之君者重诛，重诛之过，行邪者不革；行邪者久而不革，则群臣比周；群臣比周，则蔽美扬恶；蔽美扬恶，则内乱自是起。故曰：懦弱之君，不免于内乱。",
"　　明君不为亲戚危其社稷，社稷戚于亲；不为君欲变其令、令尊于君；不为重宝分其威，威贵于宝；不为爱民亏其法，法爱于民。",
],
}
GuanZiBookPageModule[17]={
"index":"管子",
"name":"兵法",
"content":[
    "　　明一者皇，察道者帝，通德者王，谋得兵胜者霸。故夫兵，虽非备道至德也，然而所以辅王成霸。今代之用兵者不然，不知兵权者也。故举兵之日而境内贫，战不必胜，胜则多死，得地而国败。此四者，用兵之祸者也。四祸其国而无不危矣。",
"　　大度之书曰：举兵之日而境内不贫，战而必胜，胜而不死，得地而国不败。为此四者若何？举兵之日而境内不贫者，计数得也。战而必胜者，法度审也。胜而不死者，教器备利，而敌不敢校也。得地而国不败者，因其民也。因其民，则号制有发也。教器备利，则有制也。法度审，则有守也。计数得，则有明也。治众有数，胜敌有理。察数而知理，审器而识胜，明理而胜敌。定宗庙，遂男女，官四分，则可以定威德；制法仪，出号令，然后可以一众治民。",
"　　兵无主，则不蚤知敌。野无吏，则无蓄积。官无常，则下怨上，器械不巧。则朝无定，赏罚不明，则民轻其产。故曰：蚤知敌，则独行；有蓄积，则久而不匮；器械巧，则伐而不费：赏罚明，则勇士劝也。",
"　　三官不缪，五教不乱，九章著明，则危危而无害，穷穷而无难。故能致远以数，纵强以制。三官：一曰鼓棗鼓所以任也，所以起也，所以进也；二曰金棗金所以坐也，所以退也，所以免也；三曰旗棗旗所以立兵也，所以利兵也，所以偃兵也。此之谓三官。有三令，而兵法治也。五教：一曰教其目以形色之旗，二曰教其身以号令之数，三曰教其足以进退之度，四曰教其手以长短之利，五曰教其心以赏罚之诚。五教各习，而士负以勇矣。九章：一曰举日章，则昼行；二曰举月章，则夜行；三曰举龙章，则行水；四曰举虎章，则行林；五曰举鸟章，则行陂；六曰举蛇章，则行泽；七曰举鹊章，则行陆；八曰举狼章，则行山；九曰举韟章，则载食而驾。九章既定，而动静不过。",
"　　三官、五教、九章，始乎无端，卒乎无穷。始乎无端者，道也；卒乎无穷者，德也。道不可量，德不可数也。故不可量，则众强不能图；不可数，则伪诈不敢向。两者备施，则动静有功。径乎不知，发乎不意。径乎不知，故莫之能御也；发乎不意，故莫之能应也。故全胜而无害。因便而教，准利而行。教无常，行无常。两者备施，动乃有功。",
"　　器成教施，追亡逐遁若飘风，击刺若雷电。绝地不守，恃固不拔，中处而无敌，令行而不留。器成教施，散之无方，聚之不可计。教器备利，进退若雷电，而无所疑匮。一气专定，则傍通而不疑；厉士利械，则涉难而不匮。进无所疑，退无所匮，敌乃为用。凌山坑，不待钩梯；历水谷，不须舟辑。径于绝地，攻于恃固，独出独入而莫之能止。宝不独入，故莫之能止；宝不独见，故莫之能敛。无名之至，尽尽而不意。故不能疑神。",
"　　畜之以道，则民和；养之以德，则民合。和合故能谐，谐故能辑，谐辑以悉，莫之能伤。定一至，行二要，纵三权，施四教，发五机，设六行，论七数，守八应，审九器，章十号。故能全胜大胜。",
"　　无守也，故能守胜。数战则士罢，数胜则君骄，夫以骄君使罢民，则国安得无危？故至善不战，其次一之。破大胜强，一之至也。乱之不以变，乘之不以诡，胜之不以诈，一之实也。近则用实，远则施号；力不可量，强不可度，气不可极，德不可测，一之原也。众若时雨，寡若飘风，一之终也。",
"　　利適，器之至也；用敌，教之尽也。不能致器者，不能利適；不能尽教者，不能用敌。不能用敌者穷，不能致器者困。远用兵，则可以必胜。出入异涂，则伤其敌。深入危之，则士自修；士自修，则同心同力。善者之为兵也，使敌若据虚，若搏景。无设无形焉，无不可以成也；无形无为焉，无不可以化也，此之谓道矣。若亡而存，若后而先，威不足以命之。",
],
}
GuanZiBookPageModule[18]={
"index":"管子",
"name":"匡君大匡",
"content":[
    "　　齐僖公生公子诸儿、公子纠、公子小白。使鲍叔傅小白，鲍叔辞，称疾不出。管仲与召忽往见之，曰：“何故不出？”鲍叔曰：“先人有言曰：‘知子奠若父，知臣莫若君。’今君知臣不肖也，是以使贱臣傅小白也。贱臣知弃矣。”召忽曰：“子固辞，无出，吾权任子以死亡，必免子。”鲍叔曰：“子如是，何不免之有乎？”管仲曰：“不可。持社稷宗庙者，不让事，不广闲。将有国者未可知也。子其出乎。”召忽曰：“不可。吾三人者之于齐国也，譬之犹鼎之有足也，去一焉，则必不立矣。吾观小白，必不为后矣。”管仲曰，“不然也。夫国人憎恶纠之母，以及纠之身，而怜小白之无母也。诸儿长而贱，事未可知也。夫所以定齐国者，非此二公子者，将无已也。小白之为人无小智，惕而有大虑，非夷吾莫容小白。天下不幸降祸加殃于齐，纠虽得立，事将不济，非子定社稷，其将谁也？”召忽曰：“百岁之后：吾君卜世，犯吾君命，而废吾所立，夺吾纠也，虽得天下，吾不生也。兄与我齐国之政也，受君令而不改，奉所立而不济，是吾义也。”管仲曰：“夷吾之为君臣也，将承君命，奉社稷，以持宗庙，岂死一纠哉？夷吾之所死者，社稷破，宗庙灭，祭祀绝，则夷吾死之；非此三者，则夷吾生。夷吾生，则齐国利；夷吾死，则齐国不利。”鲍叔曰：“然则奈何？”管子曰：“子出奉令则可。”鲍叔许诺。乃出奉令，邀傅小白。鲍叔谓管仲曰：“何行？”管仲曰；“为人臣者，不尽力于君则不亲信，不亲信则言不听，言不听则社稷不定。大事君者无二心。”鲍叔许诺。",
"　　僖公之母弟夷仲年生公孙无知，有宠于僖公，衣服札秩如適。僖公卒，以诸儿长，得为君，是为襄公。襄公立后，绌无知，无知怒。公令连称、管至父戍葵丘曰：“瓜时而往，及瓜时而来。”期戍，公问不至，请代，不许，故二人因公孙无知以作乱。",
"　　鲁桓公夫人文姜，齐女也。公将如齐，与夫人皆行。申俞谏曰：“不可，女有家，男有室，无相渎也，谓之有礼。”公不听，遂以文姜会齐侯于泺。文姜通于齐侯，桓公闻，责文姜。文姜告齐侯，齐侯怒，飨公，使公子彭生乘鲁侯胁之，公薨于车。竖曼曰：“贤者死忠以振疑，百姓寓焉；智者究理而长虑，身得免焉。今彭生二于君，无尽言。而谀行以戏我君，使我君失亲戚之礼命，又力成吾君之祸，以构二国之怨，彭生其得免乎？祸理属焉。夫君以怒遂祸，不畏恶亲闻容，昏生无丑也。岂及彭生而能止之哉？鲁若有诛，必以彭生为说。”二月，鲁人告齐曰：“寡君畏君之威，不敢宁居，来修旧好。礼成而不反，无所归死，请以彭生除之。”齐人为杀彭生，以谢于鲁。五月，襄公田于贝丘、见豕彘。从者曰：“公子彭生也。”公怒曰：“公子彭生安敢见！”射之，豕人立而啼。公惧，坠于车下，伤足亡屦。反，诛屦于徒人费，不得也，鞭之见血。费走而出，遇贼于门，胁而束之，费袒而示之背，贼信之，使费先入，伏公而出，斗死于门中。石之纷如死于阶下。孟阳代君寝于床，贼杀之。曰：“非君也，不类。”见公之足于户下，遂杀公，而立公孙无知也。",
"　　鲍叔牙奉公子小白奔莒，管夷吾、召忽奉公子纠奔鲁。九年，公孙无知虐于雍廪，雍廪杀无知也。桓公自莒先入，鲁人伐齐，纳公子纠。战于乾时，管仲射桓公中钩，鲁师败绩，桓公贱位。于是劫鲁，使鲁杀公子纠。桓公问于鲍叔曰：“将何以定社稷？”鲍叔曰：“得管仲与召忽，则社稷定矣。”公曰：“夷吾与召忽，吾贼也。”鲍叔乃告公其故图。公曰：“然则可得乎？”鲍叔曰：“若亟召，则可得也；不亟，不可得也。夫鲁施伯知夷吾为人之有慧也，其谋必将令鲁致政于夷吾、夷吾受之，则彼知能弱齐矣；夷吾不受，彼知其将反于齐也，必将杀之。”公曰：“然则夷吾将受鲁之政乎？其否也？”鲍叔对曰：“不受。夫夷吾之不死纠也，为欲定齐国之社稷也，今受鲁之政，是弱齐也。夷吾之事君无二心，虽知死，必不受也。”公曰：“其于我也，曾若是乎？”鲍叔对曰：“非为君也，为先君也。其于君不如亲纠也，纠之不死，而况君乎？君若欲定齐之社稷，则亟迎之。”公曰：“恐不及，奈何？”鲍叔曰：“夫施伯之为人也，敏而多畏。公若先反，恐注怨焉，必不杀也。”公曰：“诺。”施伯进对鲁君曰：“管仲有急，其事不济，今在鲁，君其致鲁之政焉。若受之，则齐可弱也；若不受，则杀之。杀之，以悦于齐也，与同怒，尚贤于已。”君曰：“诺。”鲁未及致政，而齐之使至，曰：“夷吾与召忽也，寡人之贼也，今在鲁，寡人愿生得之。若不得也，是君与寡人贼比也。”鲁君问施伯，施伯曰：“君与之。臣闻齐君惕而亟骄，虽得贤，庸必能用之乎？及齐君之能用之也，管子之事济也。夫管仲天下之大圣也，今彼反齐、天下皆乡之，岂独鲁乎！今若杀之，此鲍叔之友也，鲍叔因此以作难，君必不能待也，不如与之。”鲁君乃遂束缚管仲与召忽。管仲谓召忽曰：“子惧乎？”召忽曰：“何惧乎？吾不蚤死，将胥有所定也；今既定矣，令子相齐之左，必令忽相齐之右。虽然，杀君而用吾身，是再辱我也。子为生臣，忽为死臣。忽也知得万乘之政而死，公子纠可谓有死臣矣。子生而霸诸侯，公子纠可谓有生臣矣。死者成行，生者成名，名不两立，行不虚至。子其勉之，死生有分矣。”乃行，入齐境，自刎而死。管仲遂入。君子闻之曰：“召忽之死也，贤其生也：管仲之生也，贤其死也。”",
"　　或曰：明年，襄公逐小白，小白走莒。三年，襄公薨，公子纠践位。国人召小白。鲍叔曰：“胡不行矣？”小白曰：“不可。夫管仲知，召忽强武，虽国人召我，我犹不得入也。”鲍叔曰：“管仲得行其知于国，国可谓乱乎？召忽强武，岂能独图我哉？”小白曰：“夫虽不得行其知，岂且不有焉乎？召忽虽不得众，其及岂不足以图我哉？”鲍叔对曰：“夫国之乱也，智人不得作内事，朋友不能相合摎，而国乃可图也。”乃命车驾，鲍叔御小白乘而出于莒。小白曰：“夫二人者奉君令，吾不可以试也。”乃将下，鲍叔履其足曰：“事之济也，在此时；事若不济，老臣死之，公于犹之免也。”乃行。至于邑郊，鲍叔令车二十乘先，十乘后。鲍叔乃告小白曰：“夫国之疑二三子，莫忍老臣。事之未济也，老臣是以塞道。“鲍叔乃誓曰：“事之济也，听我令；事之不济也，免公子者为上，死者为下，吾以五乘之实距路。”鲍叔乃为前驱，遂入国，逐公子纠。管仲射小自，中钩。管仲与公子纠、召忽遂走鲁。桓公践位，鲁伐齐，纳公子纠而不能。",
"　　桓公二年践位，召管仲。管仲至，公问曰：“社稷可定乎？”管仲对曰：“君霸王，社稷定；君不霸王，社稷不定。”公曰：“吾不敢至于此其大也，定社稷而已。”管仲又请，君曰：“不能。”管仲辞于君曰：“君免臣于死，臣之幸也；然臣之不死纠也，为欲定社稷也。社稷不定，臣禄齐国之政而不死纠也，臣不敢。”乃走出，至门，公召管仲。管仲反，公汗出曰：“勿已，其勉霸乎。”管仲再拜稽首而起曰：“今日君成霸，臣贪承命，趋立于相位。”乃令五官行事。异日，公告管仲曰：“欲以诸侯之间无事也，小修兵革。”管仲曰：“不可。百姓病，公先与百姓，而藏其兵。与其厚于兵，不如厚于人。齐国之社稷未定，公未始于人而始于兵，外不亲于诸侯，内不亲于民。”公曰：“诺。”政未能有行也。",
"　　二年，桓公弥乱，又告管仲曰：“欲缮兵。”管仲又曰：“不可。”公不听，果为兵。桓公与宋夫人饮船中。夫人荡船而惧公。公怒，出之，宋受而嫁之蔡侯。明年，公怒告管仲曰：“欲伐宋。”管仲曰：“不可。臣闻内政不修，外举事不济。”公不听，果伐宋。诸侯兴兵而救宋，大败齐师。公怒，归告管仲曰：“请修兵革。吾士不练，吾兵不实，诸侯故敢救吾仇。内修兵革！”管仲曰：“不可，齐国危矣。内夺民用，士劝于勇，外乱之本也。外犯诸侯，民多怨也。为义之士，不入齐国，安得无危？”鲍叔曰：“公必用夷吾之言。”公不听，乃令四封之内修兵。关市之征侈之，公乃遂用以勇授禄。鲍叔谓管仲曰：“异日者，公许子霸，今国弥乱，子将何如？”管仲曰：“吾君惕，其智多诲，姑少胥其自及也。”鲍叔曰：“比其自及也，国无阙亡乎？”管仲曰：“未也。国中之政，夷吾尚微为焉，”乱乎尚可以待。外诸侯之佐，既无有吾二人者，未有敢犯我者。”明年，朝之争禄相刺，裚领而刎颈者不绝。鲍叔谓管仲曰：“国死者众矣，毋乃害乎？”管仲曰：“安得已然，此皆其贪民也。夷吾之所患者，诸侯之为义者莫肯入齐，齐之为义者莫肯仕。此夷吾之所患也。若夫死者，吾安用而爱之？”",
"　　公又内修兵。三年，桓公将伐鲁，曰：“鲁与寡人近，于是其救宋也疾，寡人且诛焉。”管仲曰：“不可。臣闻有土之君，不勤于兵，不忌于辱，不辅其过，则社稷安。勤于兵，忌于辱，辅其过，则社稷危。”公不听。兴师伐鲁，造于长勺。鲁庄公兴师逆之，大败之。桓公曰：“吾兵犹尚少，吾参围之，安能圉我！”",
"　　四年，修兵，同甲十万，车五千乘。谓管仲曰：“吾士既练，吾兵既多，寡人欲服鲁。”管仲喟然叹曰：“齐国危矣。君不竞于德而竞于兵。天下之国带甲十万者不鲜矣，吾欲发小兵以服大兵。内失吾众，诸侯设备，吾人设诈，国欲无危，得已乎？”公不听，果伐鲁。鲁不敢战，去国五十里而为之关。鲁请比于关内，以从于齐，齐亦毋复侵鲁。桓公许诺。鲁人请盟曰：“鲁小国也，固不带剑，今而带剑，是交兵闻于诸侯，君不如已。请去兵。”桓公曰：“诺。”乃令从者毋以兵。管仲曰：“不可。诸侯加忌于君，君如是以退可。君果弱鲁君，诸侯又加贪于君，后有事，小国弥坚，大国设备，非齐国之利也。”桓公不听。管仲又谏曰：“君必不去鲁，胡不用兵？曹刿之为人也，坚强以忌，不可以约取也。”桓公不听，果与之遇。庄公自怀剑，曹刿亦怀剑，践坛，庄公抽剑其怀曰：“鲁之境去国五十里，亦无不死而已。”左揕桓公，右自承曰：“均之死也，戮死于君前。”管仲走君，曹刿抽剑当两阶之间，曰：“二君将改图，无有进者！”管仲曰：“君与地，以汶为竟。”桓公许诺，以汶为竟而归。桓公归而修于政，不修于兵革，自圉，辟人，以过，弭师。",
"　　五年，宋伐杞。桓公谓管仲与鲍叔曰，“夫宋，寡人固欲伐之，无若诸侯何？夫杞，明王之后也。今宋伐之，予欲救之，其可乎？”管仲对曰：“不可。臣闻内政之不修，外举义不信。君将外举义，以行先之，则诸侯可令附。”桓公曰：“于此不救，后无以伐宋。”管仲曰：“诸侯之君，不贪于土。贪于土必勤于兵、勤于兵必病于民，民病则多诈。夫诈密而后动者胜，诈则不信于民。夫不信于民则乱，内动则危于身。是以古之人闻先王之道者，不竞于兵。”桓公曰：“然则奚若？”管仲对曰：“以臣则不而，令人以重市使之。使之而不可，君受而封之。”桓公问鲍叔曰：“奚若？”鲍叔曰：“公行夷吾之言。”公乃命曹孙宿使于宋。宋不听，果伐杞。桓公筑缘陵以封之，予车百乘，甲一千。明年，狄人伐邢，邢君出致于齐，桓公筑夷仪以封之，予车百乘，卒干人。明年，狄人伐卫，卫君出致于虚，桓公且封之，隰朋、宾胥无谏曰：“不可。三国所以亡者，绝以小。今君封亡国，国尽若何？”桓公问管仲曰：“奚若？”管仲曰：”君有行之名，安得有其实。君其行也。”公又间鲍叔，鲍叔曰：“君行夷吾之言。”桓公筑楚丘以封之，与车三百乘，甲五千。既以封卫，明年，桓公问管仲：将何行？管仲对曰：“公内修政而劝民，可以信于诸侯矣。”君许诺。乃轻税，弛关市之征，为赋禄之制，既已，管仲又请曰：“问病。臣愿赏而无罚，五年，诸侯可令傅。”公曰，“诺。”既行之，管仲又请曰：“诸侯之礼，令齐以豹皮往，小侯以鹿皮报；齐以马往，小侯以犬报。”桓公许诺，行之。管仲又请赏于国以及诸侯，君曰：“诺。”行之。管仲赏于国中，君赏于诸侯。诸侯之君有行事善者，以重币贺之；从列士以下有善者，衣裳贺之；凡诸侯之臣有谏其君而善者，以玺问之、以信其言。公既行之，又问管仲曰：“何行？”管仲曰：“隰朋聪明捷给，可令为东国。宾胥无坚强以良，可以为西士。卫国之教，危傅以利。公子开方之为人也，慧以给，不能久而乐始，可游于卫。鲁邑之教，好迩而训于礼。季友之为人也，恭以精，博于粮，多小信，可游于鲁。楚国之教，巧文以利，不好立大义，而好立小信。蒙孙博于教，而文巧于辞，不好立大义，而好结小信，可游于楚。小侯既服，大侯既附，夫如是，则始可以施政矣。”君曰：“诺。”乃游公子开方于卫，游季友于鲁，游蒙孙于楚。五年，诸侯附。",
"　　狄人伐，桓公告诸侯曰：“请救伐。诸侯许诺，大侯车二百乘，卒二千人；小侯车百乘，卒于人。”诸侯皆许诺。齐车千乘，卒先致缘陵，战于后。故败狄。其车甲与货，小侯受之，大侯近者，以其县分之，不践其国。北州侯莫来，桓公遇南州侯于召陵，曰：“狄为无道，犯天子令，以伐小国；以天子之故，敬天之命，令以救伐。北州侯莫至，上不听天子令，下无礼诸侯，寡人请诛于北州之侯。”诸侯许诺。桓公乃北伐令支，下凫之山，斩孤竹，遇山戎，顾问管仲曰：“将何行？”管仲对曰：“君教诸侯为民聚食，诸侯之兵不足者，君助之发。如此，则始可以加政矣。”桓公乃告诸侯，必足三年之食，安以其余修兵革。兵革不足，以引其事告齐，齐助之发。既行之，公又问管仲曰：“何行？”管仲对曰：“君会其君臣父子，则可以加政矣。”公曰：“会之道奈何？”曰：“诸侯毋专立妾以为妻，毋专杀大臣，无国劳毋专予禄；士庶人毋专弃妻，毋曲堤，毋贮粟，毋禁材。行此卒岁，则始可以罚矣。”君乃布之于诸侯，诸侯许诺，受而行之。卒岁，吴人伐穀，桓公告诸侯未遍，诸侯之师竭至，以待桓公。桓公以车千乘会诸侯于竟，都师未至，吴人逃。诸侯皆罢。桓公归，问管仲曰：“将何行？”管仲曰：“可以加政矣。”曰：“从今以往二年，嫡子不闻孝，不闻爱其弟，不闻敬老国良，三者无一焉，可诛也。诸侯之臣及国事，三年不闻善，可罚也。君有过，大夫不谏；士庶人有善，而大夫不进，可罚也。士庶人闻之吏贤、孝、悌，可赏也。”桓公受而行之，近侯莫不请事，兵车之会六，乘车之会三，飨国四十有二年。",
"　　桓公践位十九年，弛关市之征，五十而取一。赋禄以粟，案田而税。二岁而税一，上年什取三，中年什取二，下年什取一；岁饥不税，岁饥弛而税。",
"　　桓公使鲍叔识君臣之有善者，晏子识不仕与耕者之有善者；高子识工贾之有善者，国子为李，隰朋为东国，宾胥无为西土，弗郑为宅。凡仕者近宫，不仕与耕者近门，工贾近市。三十里置遽，委焉，有司职之。从诸侯欲通，吏从行者，令一人为负以车；若宿者，令人养其马，食其委。客与有司别契，至国八契费。义数而不当，有罪。凡庶人欲通，乡吏不通，七日，囚，出欲通，吏不通，五日，囚。贵人子欲通，吏不通，二日，囚。凡具吏进诸侯士而有善，观其能之大小以为之赏，有过无罪。令鲍叔进大夫，劝国家，得之成而不悔，为上举。从政治为次。野为原，又多不发，起讼不骄，次之。劝国家，得之成而悔；从政虽治而不能，野原又多发；起讼骄，行此三者为下。令晏子进贵人之子，出不仕，处不华，而友有少长，为上举；得二，为次；得一，为下。士处靖，敬老与贵，交不失礼，行此三者，为上举；得二，为次；得一，为下。耕者农农用力，应于父兄，事贤多，行此三者，为上举；得二，为次；得一，为下。令高子进工贾，应于父兄，筝长养老，承事敬，行此三者，为上举；得二者，为次；得一者，为下。令国子以情断狱。三大夫既已选举，使县行之。管仲进而举言，上而见之于君，以卒年君举。管仲告鲍叔曰：“劝国家，不得成而悔，从政不治不能、野原又多而发，讼骄，凡三者，有罪元赦。”告晏子曰：“贵人子处华，下交，好饮食，行此三者，有罪无赦。士出入无常，不敬老而营富，行此三者，有罪无赦。耕者出入不应于父兄，用力不农，不事贤，行此三者，有罪无赦。”告国子曰：“工贾出入不应父兄，承事不敬，而违老治危，行此三者，有罪无赦，凡于父兄无过，州里称之，吏进之，君用之。有善无赏，有过无罚。吏不进，廉意。于父兄无过，于州里莫称，吏进之，君用之。善，为上赏；不善，吏有罚。”君谓国子：“凡贵贱之义，入与父俱，出与师俱，上与君俱。凡三者，遇贼不死，不知贼，则无赦。断狱，情与义易，义与禄易，易禄可无敛，有可无赦。”",
],
}
GuanZiBookPageModule[19]={
"index":"管子",
"name":"匡君中匡",
"content":[
    "　　管仲会国用，三分二在宾客，其一在国，管仲惧而复之。公曰：“吾子犹如是乎？四邻宾客，入者说，出者誉，光名满天下。入者不说，出者不誉，污名满天下。壤可以为粟，木可以为货。粟尽则有生，货散则有聚。君人者，名之为贵，财安可有？”管仲曰：“此君之明也。”公曰：“民办军事矣，则可乎？”对曰：“不可，甲兵未足也。请薄刑罚，以厚甲兵。”于是死罪不杀，刑罪不罚，使以甲兵赎。死罪以犀甲一戟，刑罚以胁盾一戟，过罚以金军，无所计而讼者，成以束矢。公曰：“甲兵既足矣，吾欲诛大国之不道者，可乎？”对曰：“爱四封之内，而后可以恶竟外之不善者；安卿大夫之家，而后可以危救敌之国；赐小国地，而后可以诛大国之不道者；举贤良，而后可以废慢法鄙贱之民。是故先王必有置也，而后必有废也；必有利也，而后必有害也。”桓公曰：“昔三王者，既弑其君，今言仁义，则必以三王为法度，不识其故何也？”对曰：“昔者禹平治天下，及桀而乱之，汤放桀，以定禹功也。汤平治天下，及纣而乱之，武王伐纣，以定汤功也。且善之伐不善也，自古至今，未有改之。君何疑焉？”公又问曰：“古之亡国其何失？”对曰：“计得地与宝，而不计失诸侯；计得财委，而不计失百姓；计见亲，而不计见弃。三者之属一，足以削；遍而有者，亡矣。古之隳国家，陨社稷者，非故且为之也，必少有乐焉，不知其陷于恶也。”",
"　　桓公谓管仲曰：“请致仲父。”公与管仲父而将饮之，掘新井而柴焉。十日斋戒，召管仲。管仲至，公执爵，夫人执尊，觞三行，管仲趋出。公怒曰：“寡人斋戒十日而饮仲父，寡人自以为修矣。仲父不告寡人而出，其故何也？”鲍叔、隰朋趋而出，及管仲于途，曰：“公怒。”管仲反，入，倍屏而立，公不与言。少进中庭，公不与言。少进傅堂，公曰：“寡人斋戒十日而饮仲父，自以为脱于罪矣。仲父不告寡人而出，未知其故也。”对曰：“臣闻之，沉于乐者洽于忧，厚于味者薄于行，慢于朝者缓于政，害于国家者危于社稷，臣是以敢出也。”公遽下堂曰：“寡人非敢自为修也，仲父年长，虽寡人亦衰矣，吾愿一朝安仲父也。”对曰：“臣闻壮者无怠，老者无偷，顺天之道，必以善终者也。三王失之也，非一朝之萃，君奈何其偷乎？”管仲走出，君以宾客之礼再拜送之。明日，管仲朝，公曰：“寡人愿闻国君之信。”对曰：“民爱之，邻国亲之，天下信之，此国君之信。”公曰：“善。请间信安始而可？”对曰：“始于为身，中于为国，成于为天下。”公曰：“请问为身。”对曰：“道血气，以求长年、长心、长德。此为身也。”公曰：“请问为国。”对曰：“远举贤人，慈爱百姓，外存亡国，继绝世，起诸孤；薄税敛，轻刑罚，此为国之大礼也。”公曰：“请问为天下。”对曰：“法行而不苛，刑廉而不赦，有司宽而不凌；菀浊困滞皆，法度不亡，往行不来，而民游世矣，此为天下也。”",
],
}
GuanZiBookPageModule[20]={
"index":"管子",
"name":"匡君小匡",
"content":[
    "　　桓公自莒反于齐，使鲍叔牙为宰。鲍叔辞曰：“臣，君之庸臣也。君有加惠于其臣，使臣不冻饥，则是君之赐也。若必治国家，则非臣之所能也，其唯管夷吾乎。臣之所不如管夷吾者五：宽惠爱民，臣不如也；治国不失秉，臣不如也；忠信可结于诸侯，臣不如也；制礼义可法于四方，臣不如也；介胃执枹，立于军门，使百姓皆加勇，臣不如也。夫管仲，民之父母也，将欲治其子，不可弃其父母。”公曰：“管夷吾亲射寡人，中钩，殆于死，今乃用之，可乎？”鲍叔曰：“彼为其君动也，君若宥而反之，其为君亦犹是也。”公曰：“然则为之奈何？”鲍叔曰：“君使人请之鲁。”公曰：“施伯，鲁之谋臣也。彼知吾将用之，必不吾予也。”鲍叔曰：“君诏使者曰：‘寡君有不令之臣在君之国，愿请之以戮群臣。’鲁君必诺。且施伯之知夷吾之才，必将致鲁之政。夷吾受之，则鲁能弱齐矣。夷吾不受，彼知其将反于齐。必杀之。”公曰：“然则夷吾受乎？”鲍叔曰：“不受也。夷吾事君无二心。”公曰：“其于寡人犹如是乎？”对曰：“非为君也，为先君与社稷之故。君若欲定宗庙，则亟请之，不然，无及也。”公乃使鲍叔行成，曰：“公子纠，亲也。请君讨之。”鲁人为杀公子纠。又曰：“管仲，仇也。请受而甘心焉。”鲁君许诺。施伯谓鲁侯曰：“勿予。非戮之也，将用其政也。管仲者，天下之贤人也，大器也。在楚则楚得意于天下，在晋则晋得意于天下，在狄则狄得意于天下。今齐求而得之，则必长为鲁国忧，君何不杀而受之其尸。”鲁君曰：“诺。”将杀管仲。鲍叔进曰：“杀之齐，是戮齐也。杀之鲁，是戮鲁也。弊邑寡君愿生得之，以徇于国，为群臣僇；若不生得，是君与寡君贼比也。非弊邑之君所谓也，使臣不能受命。”于是鲁君乃不杀，遂生束缚而柙以予齐。鲍叔受而哭之，三举。施伯从而笑之，谓大夫曰：“管仲必不死。夫鲍叔之，忍不僇贤人，其智称贤以自成也。鲍叔相公子小白先入得国，管仲、召忽奉公子纠后入，与鲁以战，能使鲁败，功足以。得天与失天，其人事一也。今鲁惧，杀公子纠、召忽，囚管仲以予齐，鲍叔知无后事，必将勤管仲以劳其君愿，以显其功。众必予之有得。力死之功，犹尚可加也，显生之功将何如？是昭德以贰君也，鲍叔之知，不是失也。”",
"　　至于堂阜之上，鲍叔祓而浴之三。桓公亲迎之郊。管仲诎缨插衽，使人操斧而立其后。公辞斧三，然后退之。公曰：“垂缨下衽，寡人将见。”管仲再拜稽首曰：“应公之赐，杀之黄泉，死且不朽。”公遂与归，礼之于庙，三酌而问为政焉，曰：“首先君襄公，高台广池，湛乐饮酒，田猎罼弋，不听国政。卑圣侮士，唯女是崇，九妃六嫔，陈妾数千。食必粱肉，衣必文绣，而戎士冻饥。戎马待游车之弊，戎士待陈妾之余。倡优侏儒在前，而贤大夫在后。是以国家不日益，不月长。吾恐宗庙之不扫除，社稷之不血食，敢问为之奈何？”管子对曰：“昔吾先王周昭王、穆王世法文武之远迹，以成其名。合群国，比校民之有道者，设象以为民纪、式美以相应，比缀以书，原本穷末。劝之以庆赏，纠之以刑罚，粪除其颠旄，赐予以镇抚之，以为民终始。”公曰：“为之奈何？”管子对曰：“昔者圣王之治其民也，参其国而伍其鄙，定民之居，成民之事，以为民纪，谨用其六秉；如是而民情可得，而百姓可御。”桓公曰：“六秉者何也？”管子曰：“杀、生、贵、贱、贫、富，此六秉也。”桓公曰：“参国奈何？”管子对曰：“制国以为二十一乡：商工之乡六，士农之乡十五。公帅十一乡，高子帅五乡，国子帅五乡。参国故为三军。公立三官之臣：市立三乡，工立三族，泽立三虞，山立三衡。制五家为轨，轨有长；十轨为里，里有司；四里为连，连有长；十连为乡，乡有良人；三乡一帅。”桓公曰：“五鄙奈何？”管子对曰：“制五家为轨，轨有长；六轨为邑，邑有司；十邑为率，率有长；十率为乡，乡有良人；三乡为属，属有帅。五属一五大夫。武政听属，文政听乡，各保而听，毋有淫佚者。”桓公曰：“定民之居，成民之事奈何？”管子对曰：“士农工商四民者，国之石民也，不可使杂处，杂处则其言哤，其事乱。是故圣王之处士必于闲燕，处农必就田野，处工必就官府，处商必就市井。今夫士群萃而州处，闲燕则父与父言义，子与子言孝，其事君者言敬，长者言爱，幼者言弟。旦昔从事于此，以教其子弟，少而习焉，其心安焉，不见异物而迁焉。是故其父兄之教不肃而成；其子弟之学不劳而能。夫是故士之子常为士。今夫农群萃而州处，审其四时，权节具，备其械器用，比耒耜谷芨。及寒击槁除田，以待时乃耕，深耕、均种、疾耰。先雨芸耨，以待时雨。时雨既至，挟其枪刈耨镈，以旦暮从事于田野，税衣就功，别苗莠，列疏遬。首戴苎蒲，身服袯襫，沾体涂足，暴其发肤，尽其四支之力，以疾从事于田野。少而习焉，其心安焉，不见异物而迁焉。是故其父兄之教不肃而成；其子弟之学不劳而能。是故农之子常为农，朴野而不慝，其秀才之能为士者，则足赖也，故以耕则多粟，以仕则多贤，是以圣王敬畏戚农。今夫工群萃而州处，相良材，审其四时，辨其功苦，权节其用，论比计制，断器尚完利。相语以事，相示以功，相陈以巧，相高以知事。旦昔从事于此，以教其子弟。少而习焉，其心安焉，不见异物而迁焉。是故其父兄之教不肃而成，其子弟之学不劳而能。夫是故工之子常为工。今夫商群萃而州处，观凶饥，审国变，察其四时而监其乡之货，以知其市之贾。负任担荷，服牛辂马，以周四方；料多少，计贵贱，以其所有，易其所无，买贱鬻贵。是以羽旄不求而至，竹筋有余于国；奇怪时来，珍异物聚。旦昔从事于此，以教其子弟。相语以利，相示以时，相陈以知贾。少而习焉，其心安焉，不见异物而迁焉。是故其父兄之教不肃而成；其子弟之学不劳而能。夫是故商之子常为商。相地而衰其政，则民不移矣。正旅旧，则民不惰。山泽各以其时至，则民不苟。陵陆、丘井、田畴均，则民不惑。无夺民时，则百姓富；牺牲不劳，则牛马育。”",
"　　桓公又问曰：“寡人欲修政以干时于天下，其可平？”管子对曰：“可。”公曰：“安始而可？”管子对曰：“始于爱民。”公曰：“爱民之道奈何？”管子对曰：“公修公族，家修家族，使相连以事，相及以禄，则民相亲矣。放旧罪，修旧宗，立无后，则民殖矣。省刑罚，薄赋敛，则民富矣。乡建贤士，使教于国，则民有礼矣。出令不改，则民正矣。此爱民之道也。”公曰：“民富而以亲，则可以使之乎？”管于对曰：“举财长工，以止民用；陈力尚贤，以劝民知；加刑无苛，以济百姓。行之无私，则足以容众矣；出言必信，则令不穷矣。此使民之道也。”",
"　　桓公曰：“民居定矣，事已成矣，吾欲从事于天下诸侯，其可乎？”管子对曰：“未可。民心未吾安。”公曰：“安之奈何？”管子对曰：“修旧法，择其善者，举而严用之；慈于民，予无财，宽政役，敬百姓，则国富而民安矣。”公曰：“民安矣，其可乎？”管仲对曰：“未可。君若欲正卒伍，修甲兵，则大国亦将正卒伍，修甲兵。君有征战之事，则小国诸侯之臣有守圉之备矣。然则难以速得意于天下。公欲速得意于天下诸侯，则事有所隐，而政有所寓。”公曰，“为之奈何？”管子对曰：“作内政而寓军令焉。为高子之里，为国子之里，为公里，三分齐国，以为三军。择其贤民，使为里君。乡有行伍，卒长则其制令，且以田猎，因以赏罚，则百姓通于军事矣。”桓公曰：“善。”于是乎管子乃制五家以为轨，轨为之长；十轨为里，里有司；四里为连，连为之长；十连为乡，乡有良人，以为军令。是故五家为轨，五人为伍，轨长率之。十轨为里，故五十人为小戎，里有司率之。四里为连，故二百人为卒，连长率之。十连为乡，故二千人为旅，乡良人率之。五乡一师，故万人一军，五乡之师率之。三军故有中军之鼓，有高子之鼓，有国子之鼓。春以田，曰蒐①，振旅。秋以田，曰獼，治兵。是故卒伍政定于里，军旅政定于郊。内教既成，令不得迁徙。故卒伍之人，人与人相保，家与家相爱，少相居，长相游，祭祀相福，死丧相恤，祸福相忧，居处相乐，行作相和，哭泣相哀。是故夜战其声相闻，足以无乱；昼战其目相见，足以相识；欢欣足以相死，是故以守则固，以战则胜。君有此教士三万人，以横行于天下，诛无道，以定周室，天下大国之君莫之能圉也。",
"　　正月之朝，乡长复事，公亲问焉，曰：“于子之乡，有居处为义好学、聪明质仁、慈孝于父母、长弟闻于乡里者，有则以告。有而不以告，谓之蔽贤，其罪五。”有司已于事而竣。公又问焉，曰：“于子之乡，有拳勇、股肱之力、筋骨秀出于众者，有则以告。有而不以告，谓之蔽才，其罪五。”有司已于事而竣。公又问焉，曰：“于子之乡，有不慈孝于父母，不长弟于乡里，骄躁淫暴，不用上令者，有则以告。有而不以告，谓之下比，其罪五。”有司已于事而竣。于是乎乡长退而修德进贤。桓公亲见之，遂使役之官。公令官长，期而书伐以告，且令选官之贤者而复之。曰：“有人居我官有功，休德维顺，端悫以待时使。使民恭敬以劝。其称秉言，则足以补官之不善政。”公宣问其乡里，而有考验。乃召而与之坐，省相其质，以参其成功成事。可立而时。设问国家之患而不肉，退而察问其乡里，以观其所能，而无大过，登以为上卿之佐。名之曰三选。高子、国子退而修乡，乡退而修连，连退而修里，里退而修轨，轨退而修家。是故匹夫有善，故可得而举也；匹夫有不善，故可得而诛也。政既成，乡不越长，朝不越爵。罢士无伍，罢女无家。士三出妻，逐于境外。女三嫁，入于舂谷。是故民皆勉为善。士与其为善于乡，不如为善于里；与其为善于里，不如为善于家。是故士莫敢言一朝之便，皆有终岁之汁；莫敢以终岁为议，皆有终身之功。",
"　　正月之朝，五属大夫复事于公，择其寡功者而谯之曰：“列地分民者若一，何故独寡功？何以不及人？教训不善，政事其不治，一再则宥，三则不赦。”公又问焉，曰，“于子之属，有居处为义好学、聪明质仁、慈孝于父母、长弟闻于乡里者，有则以告。有而不以告，谓之蔽贤，其罪五。”有司已事而竣。公又问焉，曰：“于子之属，有拳勇、股肱之力秀出于众者，有则以告。有而不以告，谓之蔽才，其罪五。”有司已事而竣。公又问焉，曰：“于子之属，有不慈孝于父母，不长弟于乡里，骄躁淫暴，不用上令者，有则以告。有而不以告者，谓之下比，其罪五。”有司已事而竣。于是乎五属大夫退而修属，属退而修连，连退而修乡，乡退而修卒，卒退而修邑，邑退而修家。是故匹夫有善，可得而举；匹夫有不善，可得而诛。政成国安，以守则固，以战则强。封内治，百姓亲，可以出征四方，立一霸王矣。",
"　　桓公曰：“卒伍定矣，事已成矣，”吾欲从事于诸侯，其可乎？”管子对曰：“未可。若军令则吾既寄诸内政矣，夫齐国寡甲兵，吾欲轻重罪而移之于甲兵。”公曰：“为之奈何？”管子对曰：“制重罪入以兵甲、犀胁、二戟，轻罪入兰、盾、鞈革、二戟，小罪入以金钧分，宥薄罪入以半钧，无坐抑而讼狱者，正三禁之而不直，则入一束矢以罚之。美金以铸戈、剑、矛、戟，试诸狗马；恶金以铸斤、斧、鉏、夷、锯、欘，试诸木土。”",
"　　桓公曰，“甲兵大足矣，吾欲从事于诸侯，可乎？”管仲对曰：“未可。治内者未具也，为外者未备也。”故使鲍叔牙为大谏，王子城父为将，弦子旗为理，宁戚为田，隰朋为行，曹孙宿处楚，商容处宋，季劳处鲁，徐开封处卫，匽尚处燕，审友处晋。又游士八千人，奉之以车马衣裘，多其资粮，财币足之，使出周游于四方，以号召收求天下之贤士。饰玩好，使出周游于四方，鬻之诸侯，以观其上下之所贵好，择其沈乱者而先政之。公曰：“外内定矣，可乎？”管子对曰：“未可。邻国未吾亲也。”公曰：“亲之奈何？”管子对曰：“审吾疆场，反其侵地，正其封界；毋受其货财，而美为皮弊，以极聘覜于诸侯，以安四邻，则邻国亲我矣。”桓公曰：“甲兵大足矣，吾欲南伐，何主？”管子对曰：“以鲁为主。反其侵地常、潜，使海于有弊，渠弥于河有陼，纲山于有牢。”桓公曰：“吾欲西伐，何主？”管子对曰：“以卫为主。反其侵地吉台、原、姑与柒里，使海于有弊，渠弥于有陼，纲山于有牢。”桓公曰：“吾欲北伐，何主？”管子对曰：“以燕为主，反其侵地柴夫、吠狗。使海于有弊，渠弥于有陼，纲山于有牢。”四邻大亲。既反其侵地，正其封疆，地南至于岱阴，西至于济，北至于海，东至于纪随，地方三百六十里。三岁治定，四岁教成，五岁兵出。有教士三万人，革车八百乘。诸侯多沈乱，不服于天子。于是乎桓公东救徐州，分吴半。存鲁蔡陵陵蔡，割越地。南据宋、郑，征伐楚，济汝水，逾方地。望文山，使贡丝于周室。成周反胙于隆岳，荆州诸侯莫不来服。中救晋公，禽狄王，败胡貉，破屠何，而骑寇始服。北伐山戎，制泠支，斩孤竹，而九夷始听。海滨诸侯，莫不来服。西征攘白狄之地，遂至于西河，方舟投柎，乘桴济河，至于石沈。县车柬马，逾大行与卑耳之貉，拘秦夏，西服流沙西虞，而秦戎始从。故兵一出而大功十二。故东夷、西戎、南蛮、北狄、中诸侯国，莫不宾服。与诸侯饰牲为载书，以誓要于上下荐神。然后率天下定周室，大朝诸侯于阳谷。故兵车之会六，乘车之会三，九合诸侯，一匡天下。甲不解垒，兵不解翳，弢无弓，服无矢，寝武事，行文道，以朝天子。",
"　　葵丘之会，天子使大夫宰孔致胙于桓公曰：“余一人之命有事于文武。使宰孔致胙。”且有后命曰：“以尔自卑劳，实谓尔伯舅毋下拜。”桓公召管仲而谋，管仲对曰：“为君不君，为臣不臣，乱之本也。”桓公曰：“余乘车之会三，兵车之会六，九合诸侯，一匡天下。北至于孤竹、山戎、秽貉，拘秦夏；西至流沙、西虞；南至吴、越、巴、牂牁、[]、不庾、雕题、黑齿。荆夷之国，莫违寡人之命，而中国卑我，昔三代之受命者，其异于此乎？”管子对曰：“夫凤凰鸾鸟不降，而鹰隼鸱枭丰，庶神不格，守龟不兆，握粟而筮者屡中。时雨甘露不降，飘风暴雨数臻。五谷不蕃，六畜不育，而蓬蒿藜藋并兴。夫凤凰之文，前德义，后日昌，昔人之受命者，龙龟假，河出图，雒出书，地出乘黄。今三祥未见有者，虽曰受命，无乃失诸乎？”桓公惧，出见客曰：“天威不违颜咫尺，小白承天子之命而毋下拜，恐颠蹶于下，以为天子羞。”遂下拜，登受赏服、大路、龙旗九游、渠门赤旗。天子致胙于桓公而不受，天下诸侯称顺焉。",
"　　恒公忧天下诸侯。鲁有夫人庆父之乱，而二君弑死，国绝无后。桓公闻之，使高子存之。男女不淫，马牛选具。执玉以见，请为关内之侯，而桓公不使也。狄人攻邢，桓公筑夷仪以封之。男女不淫，马牛选具。执玉以见，请为关内之侯，而桓公不使也。狄人攻卫，卫人出旅干曹，桓公城楚丘封之。其畜以散亡，故桓公予之系马三百匹，天下诸侯称仁焉。于是天下之诸侯知桓公之为己勤也，是以诸侯之归之也譬若市人。桓公知诸侯之归己也，故使轻其币而重其礼。故使天下诸侯以疲马犬羊为币，齐以良马报。诸侯以缕帛布鹿皮四分以为币，齐以文锦虎豹皮报。诸侯之使垂橐而入，载而归。故钧之以爱，致之以利，结之以信，示之以武。是故天下小国诸侯，既服桓公，莫之敢倍而归之。喜其爱而贪其利，信其仁而畏其武。桓公知天下小国诸侯之多与己也，于是又大施忠焉。可为忧者为之忧，可为谋者为之谋，可为动者为之动。伐谭莱而不有也，诸侯称仁焉。通齐国之鱼盐东莱，使关市几而不正，壥而不税，以为诸侯之利，诸侯称宽焉。筑蔡、鄢陵、培夏、灵父丘，以卫戎狄之地，所以禁暴于诸侯也。筑五鹿、中牟、邺、盖与、社丘，以卫诸夏之地，所以示劝于中国也。教大成。是故天下之于桓公，远国之民望如父母，近国之民从如流水。故行地滋远，得人弥众，是何也？怀其文而畏其武。故杀无道，定周室，天下莫之能圉，武事立也。定三革，偃五兵，朝服以济河，而无怵惕焉，文事胜也。是故大国之君惭愧，小国诸侯附比。是故大国之君事如臣仆，小国诸侯欢如父母。夫然，故大国之君不尊，小国诸侯不卑。是故大国之君不骄，小国诸侯不慑。于是列广地以益狭地，损有财以与无财。周其君子，不失成功；周其小人，不失成命。夫如是，居处则顺，出则有成功。不称动甲兵之事，以遂文武之迹于天下。",
"　　桓公能假其群臣之谋以益其智也。其相曰夷吾，大夫曰宁戚、隰朋、宾胥无、鲍叔牙。用此五子者何功？度义光德，继法绍终，以遗后嗣，贻孝昭穆，大霸天下，名声广裕，不可掩也。则唯有明君在上，察相在下也。初，桓公郊迎管子而问焉。管仲辞让，然后对以参国伍鄙，立五乡以崇化，建五属以厉武，寄兵于政，因罚，备器械，加兵无道诸侯，以事周室。桓公大说。于是斋戒十日，将相管仲。管仲曰：“斧钺之人也，幸以获生，以属其腰领，臣之禄也。若知国政，非臣之任也。”公曰：“子大夫受政，寡人胜任；子大夫不受政，寡人恐崩。”管仲许诺，再拜而受相。三日，公曰：“寡人有大邪三，其犹尚可以为国乎？”对曰：“臣未得闻。”公曰：“寡人不幸而好田，晦夜而至禽侧，田莫不见禽而后反。诸侯使者无所致，百官有司无所复。”对曰：“恶则恶矣，然非其急者也。”公曰：“寡人不幸而好酒，日夜相继，诸侯使者无所致、百官有司无所复。”对曰：“恶则恶矣，然非其急者也。”公曰、“寡人有污行，不幸而好色，而姑姊有不嫁者。”对曰：“恶则恶矣，然非其急者也。”公作色曰：“此三者且可，则恶有不可者矣？”对曰：“人君唯优与不敏为不可，优则亡众，不敏不及事。”公曰：“善。吾子就舍，异日请与吾子图之。”对曰：“时可将与夷吾，何待异日乎？”公曰：“奈何？”对曰：“公子举为人博闻而知礼，好学而辞逊，请使游于鲁，以结交焉。公子开方为人巧转而兑利，请使游于卫，以结交焉，曹孙宿其为人也小廉而苛忕、足恭而辞结，正荆之则也，请使往游，以结交焉。”遂立行三使者，而后退。相三月，请论百官。公曰；“诺。”管仲曰：“升降揖让，进退闲习，辨辞之刚柔，臣不如隰朋，请立为大行。垦草入邑，辟土聚粟多众，尽地之利，臣不如宁戚，请立为大司田。平原广牧，车不结辙，士不旋踵，鼓之而三军之士视死如归，臣不如王子城父，请立为大司马。决狱折中，不杀不辜，不诬无罪，臣不如宾胥无，请立为大司理。犯君颜色，进谏必忠，不辟死亡，不挠富贵，臣不如东郭牙，请立以为大谏之官。此五子者，夷吾一不如；然而以易夷吾，夷吾不为也。君若欲治国强兵，则五子者存矣；若欲霸王，夷吾在此。”桓公曰：“善。”",
],
}
GuanZiBookPageModule[21]={
"index":"管子",
"name":"王言(亡)",
"content":[
    ""
],
}
GuanZiBookPageModule[22]={
"index":"管子",
"name":"霸形",
"content":[
    "　　桓公在位，管仲、隰朋见。立有间，有贰鸿飞而过之。桓公叹曰：“仲父，今彼鸿鹄有时而南，有时而北，有时而往，有时而来，四方无远，所欲至而至焉，非唯有羽翼之故，是以能通其意于天下乎？”管仲、隰朋不对。桓公曰：“二子何故不对？”管子对曰：“君有霸王之心，而夷吾非霸王之臣也，是以不敢对。”桓公曰：“仲父胡为然？盍不当言，寡人其有乡乎？？寡人之有仲父也，犹飞鸿之有羽翼也，若济大水有舟楫也。仲父不一言教寡人，寡人之有耳，将安闻道而得度哉。”管子对曰：“君若将欲霸王举大事乎？则必从其本事矣。”桓公变躬迁席，拱手而问曰：“敢问何谓其本？”管子对曰：“齐国百姓，公之本也。人甚忧饥，而税敛重；人甚惧死，而刑政险；人甚伤劳，而上举事不时。公轻其税敛，则人不忧饥；缓其刑政，则人不惧死；举事以时，则人不伤劳。”桓公曰：“寡人闻仲父之言此三者，闻命矣，不敢擅也，将荐之先君。”于是令百官有司，削方墨笔。明日，皆朝于太庙之门朝，定令于百吏。使税者百一钟，孤幼不刑，泽梁时纵，关讥而不征，市书而不赋；近者示之以忠信，远者示之以礼义。行此数年，而民归之如流水。",
"　　此其后，宋伐杞，狄伐邢、卫。桓公不救，裸体纫胸称疾。召管仲曰：“寡人有千岁之食，而无百岁之寿，今有疾病，姑乐乎！”管子曰：“诺。”于是令之县钟磬之榬，陈歌舞竽瑟之乐，日杀数十牛者数旬。群臣进谏曰：“宋伐杞，狄伐邢、卫，君不可不救。”桓公曰：“寡人有千岁之食，而无百岁之寿，今又疾病，姑乐乎！且彼非伐寡人之国也，伐邻国也，子无事焉。”宋已取杞，狄已拔邢、卫矣。桓公起，行笋虡之间，管子从。至大钟之西，桓公南面而立，管仲北乡对之，大钟鸣。桓公视管仲曰：“乐夫，仲父？”管子对曰：“此臣之所谓哀，非乐也。臣闻之，古者之言乐于钟磬之间者不如此。言脱于口，而令行乎天下；游钟磬之间，而无四面兵革之忧。今君之事，言脱于口，令不得行于天下；在钟磬之间，而有四面兵革之忧。此臣之所谓哀，非乐也。”桓公曰：“善。”于是伐钟磬之县，并歌舞之乐。宫中虚无人。桓公曰：“寡人以伐钟磬之县，并歌舞之乐矣，请问所始于国，将为何行？”管子对曰：“宋伐杞，狄伐邢、卫，而君之不救也，臣请以庆。臣闻之，诸侯争于强者，勿与分于强。今君何不定三君之处哉？”于是桓公曰：“诺。”因命以车百乘、卒千人，以缘陵封杞；车百乘、卒千人，以夷仪封邢；车五百乘、卒五千人，以楚丘封卫。桓公曰：“寡人以定三君之居处矣，今又将何行？”管子对曰：“臣闻诸侯贪于利，勿与分于利。君何不发虎豹之皮、文锦以使诸侯，令诸侯以缦帛鹿皮报？”桓公曰：“诺。”于是以虎豹皮、文锦使诸侯，诸侯以缦帛、鹿皮报。则令固始行于天下矣。此其后，楚人攻宋、郑。烧焫熯焚郑地，使城坏者不得复筑也，屋之烧者不得复葺也；令其人有丧雌雄，居室如鸟鼠处穴。要宋田，夹塞两川，使水不得东流，东山之西，水深灭垝，四百里而后可田也。楚欲吞宋、郑而畏齐，曰思人众兵强能害己者，必齐也。于是乎楚王号令于国中曰：“寡人之所明于人君者，莫如桓公；所贤于人臣者，莫如管仲。明其君而贤其臣，寡人愿事之。谁能为我交齐者，寡人不爱封侯之君焉。”于是楚国之贤士皆抱其重宝币帛以事齐。桓公之左右，无不受重宝币帛者。于是桓公召管仲曰：“寡人闻之，善人者人亦善之。今楚王之善寡人一甚矣，寡人不善，将拂于道。仲父何不遂交楚哉？”管子对曰：“不可。楚人攻宋、郑，烧焫熯焚郑地，使城坏者不得复筑也，屋之烧者不得复葺也，令人有丧雌雄，居室如鸟鼠处穴。要宋田，夹塞两川，使水不得东流，东山之西，水深灭垝，四百里而后可田也。楚欲吞宋。郑，思人众兵强而能害己者，必齐也。是欲以文克齐，而以武取宋、郑也，楚取宋、郑而不知禁，是失宋、郑也；禁之，则是又不信于楚也。知失于内，兵困于外，非善举也。”桓公曰：“善。然则若何？”管子对曰：“请兴兵而南存宋、郑，而令曰：‘无攻楚，言与楚王遇。’至于遇上，而以郑城与宋水为请，楚若许，则是我以文令也；楚若不许，则遂以武令焉。”桓公曰：“善。”于是遂兴兵而南存宋、郑，与楚王遇于召陵之上，而令于遇上曰：“毋贮粟，毋曲堤，无擅废嫡子，无置妾以为妻。”因以郑城与宋水为请于楚，楚人不许。遂退七十里而舍。使军人城郑南之地，立百代城焉。曰：自此而北至于河者，郑自城之，而楚不敢隳也。东发宋田，夹两川，使水复东流，而楚不敢塞也。遂南伐，及逾方城，济于汝水，望汶山，南致楚越之君，而西伐秦，北伐狄，东存晋公于南，北伐孤竹，还存燕公。兵车之会六，乘车之会三，九合诸侯，反位已霸。修钟磬而复乐。管子曰：“此臣之所谓乐也。”",
],
}
GuanZiBookPageModule[23]={
"index":"管子",
"name":"霸言",
"content":[
    "　　霸王之形；象天则地，化人易代，创制天下，等列诸侯，宾属四海，时匡天下；大国小之，曲国正之，强国弱之，重国轻之；乱国并之，暴工残之：僇其罪，卑其列，维其民，然后王之。夫丰国之谓霸，兼正之国之谓王。夫王者有所独明。德共者不取也，道同者不王也。夫争天下者，以威易危暴，王之常也。君人者有道，霸王者有时。国修而邻国无道，霸王之资也。夫国之存也，邻国有焉；国之亡也，邻国有焉。邻国有事，邻国得焉；邻国有事，邻国亡焉。天下有事，则圣王利也。国危，则圣人知矣。夫先王所以王者，资邻国之举不当也。举而不当，此邻敌之所以得意也。",
    "　　夫欲用天下之权者，必先布德诸侯。是故先王有所取，有所与，有所诎，有所信，然后能用天下之权。夫兵幸于权，权幸于地。故诸侯之得地利者，权从之；失地利者，权去之，夫争天下者，必先争人。明大数者得人，审小计者失人。得天下之众者王，得其半者霸。是故圣王卑礼以下天下之贤而王之，均分以钓天下之众而臣之。故贵为天子，富有天下，而伐不谓贪者，其大计存也。以天下之财，利天下之人；以明威之振，合天下之权；以遂德之行，结诸侯之亲；以好佞之罪，刑天下之心；因天下之威，以广明王之伐；攻逆乱之国，赏有功之劳；封贤圣之德，明一人之行，而百姓定矣。夫先王取天下也，术术乎大德哉，物利之谓也。夫使国常无患，而名利并至者，神圣也；国在危亡，而能寿者，明圣也。是故先王之所师者，神圣也；其所赏者，明圣也。夫一言而寿国，不听而国亡，若此者，大圣之言也。夫明王之所轻者马与玉，其所重者政与军。若失主不然，轻予人政，而重予人马；轻予人军，而重与人玉；重宫门之营，而轻四境之守，所以削也。",
    "　　夫权者，神圣之所资也；独明者，天下之利器也；独断者，微密之营垒也。此三者，圣人之所则也，圣人畏微，而愚人畏明；圣人之憎恶也内，愚人之憎恶也外；圣人将动必知，愚人至危易辞。圣人能辅时，不能违时。知者善谋，不如当时。精时者，日少而功多。夫谋无主则困，事无备则废。是以圣王务具其备。而慎守其时。以备待时，以时兴事，时至而举兵。绝坚而攻国，破大而制地，大本而小标，埊近而攻远。以大牵小，以强使弱，以众致寡，德利百姓，威振天下；令行诸侯而不拂，近无不服，远无不听。夫明王为天下正，理也。按强助弱，圉暴止贪，存亡定危，继绝世，此天下之所载也，诸侯之所与也，百姓之所利也，是故天下王之。知盖天下，继最一世，材振四海，王之佐也。",
    "　　千乘之国得其守，诸侯可得而臣，天下可得而有也。万乘之国失其守，国非其国也。天下皆理己独乱，国非其国也；诸侯皆令己独孤，国非其国也；邻国皆险己独易，国非其国也。此三者，亡国之徵也。夫国大而政小者，国从其政；国小而政大者，国益大。大而不为者，复小；强而不理者，复弱；众而不理者，复寡；贵而无礼者，复贱；重而凌节者，复轻，富而骄肆者，复贫。故观国者观君，观军者观将，观备者观野。其君如明而非明也，其将如贤而非贤也，其人如耕者而非耕也，三守既失，国非其国也。地大而不为，命曰土满；人众而不理，命曰人满；兵威而不止，命曰武满。三满而不止，国非其国也。地大而不耕，非其地也；卿贵而不臣，非其卿也；人众而不亲，非其人也。",
    "　　夫无土而欲富者忧，无德而欲王者危，施薄而求厚者孤。夫上夹而下苴、国小而都大者弑。主尊臣卑，上威下敬，令行人服，理之至也。使天下两天子，天下不可理也：一国而两君，一国不可理也；一家而两父，一家不可理也。夫令，不高不行，不抟不听。尧舜之人，非生而理也；桀纣之人，非生而乱也。故理乱在上也。夫霸王之所始也，以人为本。本理则国固，本乱则国危。故上明则下敬，政平则人安，士教和则兵胜敌，使能则百事理，亲仁则上不危，任贤则诸侯服。",
    "　　霸王之形，德义胜之，智谋胜之，兵战胜之，地形胜之，动作胜之，故王之。夫善用国者，因其大国之重，以其势小之；因强国之权，以其势弱之；因重国之形，以其势轻之。强国众，合强以攻弱，以图霸。强国少，合小以攻大，以图王。强国众，而言王势者，愚人之智也；强国少，而施霸道者，败事之谋也。夫神圣，视天下之形，知动静之时；视先后之称，知祸福之门。强国众，先举者危，后举者利。强国少，先举者王，后举者亡。战国众，后举可以霸；战国少，先举可以王。",
    "　　夫王者之心，方而不最，列不让贤，贤不齿第择众，是贪大物也。是以王之形大也。夫先王之争天下也以方心，其立之也以整齐，其理之也以平易。立政出令用人道，施爵禄用地道，举大事用天道。是故先王之伐也，伐逆不伐顺，伐险不伐易，伐过不伐及。四封之内，以正使之；诸侯之会，以权致之。近而不服者，以地患之；远而不听者，以刑危之。一而伐之，武也；服而舍之，文也；文武具满，德也。夫轻重强弱之形，诸侯合则强，孤则弱。骥之材，而百马伐之，骥必罢矣。强最一伐，而天下共之，国必弱矣。强国得之也以收小，其失之也以恃强。小国得之也以制节，其失之也以离强。夫国小大有谋，强弱有形。服近而强远，王国之形也；合小以攻大，敌国之形也；以负海攻负海，中国之形也；折节事强以避罪，小国之形也。自古以至今，未尝有先能作难，违时易形，以立功名者；无有常先作难，违时易形，无不败者也。夫欲臣伐君，正四海者，不可以兵独攻而取也。必先定谋虑，便地形，利权称，亲与国，视时而动，王者之术也。夫先王之伐也，举之必义，用之必暴，相形而知可，量力而知攻，攻得而知时。是故先王之伐也，必先战而后攻，先攻而后取地。故善攻者料众以攻众，料食以攻食，料备以攻备。以众攻众，众存不攻；以食攻食，食存不攻；以备攻备，备存不攻。释实而攻虚，释坚而攻膬，释难而攻易。",
    "　　夫抟国不在敦古，理世不在善攻，霸王不在成曲。夫举失而国危，刑过而权倒，谋易而祸反，计得而强信，功得而名从，权重而令行，固其数也。",
    "　　夫争强之国，必先争谋，争刑，争权。令人主一喜一怒者，谋也；令国一轻一重者，刑也；令兵一进一退者，权也。故精于谋，则人主之愿可得，而令可行也；精干刑，则大国之地可夺，强国之兵可圉也；精于权，则天下之兵可齐，诸侯之君可朝也。夫神圣视天下之刑，知世之所谋，知兵之所攻，知地之所归，知令之所加矣。夫兵攻所憎而利之，此邻国之所不亲也。权动所恶，而实寡归者强。擅破一国，强在后世者王。擅破一国，强在邻国者亡。",
],
}
GuanZiBookPageModule[24]={
"index":"管子",
"name":"问",
"content":[
    "　　凡立朝廷，问有本纪。爵授有德，则大臣兴义。禄予有功，则士轻死节。上帅士以人之所戴，则上下和。授事以能，则人上功。审刑当罪，则人不易讼。无乱社稷宗庙则人有所宗。毋遗老忘亲，则大臣不怨。举知人急，则众不乱。行此道也，国有常经，人知终始，此霸王之术也。",
"　　然后问事：事先大功，政自小始。",
"　　问死事之孤其未有田宅者有乎？问少壮而未胜甲兵者几何人？问死事之寡，其餼廪何如问国之有功大者何官之吏也？问州之大夫也何里之士也。今吏亦何以明之矣，问刑论有常以行，不可改也，今其事之久留也何若？问五官有制度，官都有其常断。今事之稽也何待。问独夫寡妇孤寡疾病者几何人也？问国之弃人何族之子弟也？问乡之良家其所牧养者几何人矣。问邑之贫人债而食者几何家？问理园容而食者几何家？人之开田而耕者几何家？士之身耕者几何家？问乡之贫人何族之别也？问宗子之收昆弟者，以贫从昆弟者几何家？余子仕而有田邑，今入者几何人？子弟以孝闻于乡里者几何人？余子父母存，不养而出离者几何人？士之有田而不使者几何人？吏恶何事士之有田而不耕者几何人？身何事。君臣有位而未有田者几何人？外人之来从而未有田宅者几何家？国子弟之游于外者几何人？贫士之受责于大夫者几何人？官贱行书，身士以家臣自代者几何人？官承吏之无田餼而徒理事者几何人？群臣有位事官大夫者几何人？外人来游在大夫之家者几何人？乡子弟力田为人率者几何人？国子弟之无上事，衣食不节；率子弟不田弋猎者几何人？男女不整齐，乱乡子弟者有乎？问人之贷粟米，有别券者几何家？",
"　　问国之伏利其可应人之急者几何所也？人之所害于乡里者何物也？问士之有田宅身在陈列者几何人？余子之胜甲兵有行伍者几何人？问男女有巧伎，能利备用者几何人？处女操工事者几何人？冗国所开口而食者几何人？问一民有几年之食也？问兵车之计几何乘也？牵家马軶家车者几何乘。处士修行。足以教人，可使帅众莅百姓者几何人？士之急难可使者几何人？工之巧，出，足以利军伍，处，可以修城郭补守备者几何人？城粟军粮其可以行几何年也。吏之急难可使者几何人？大夫疏器甲兵、兵车、旌旗、鼓铙、帷幕、帅车之载、几何乘？疏藏器弓弩之张、衣夹铗钩弦之造、戈戟之紧，其厉何若？其宜修而不修者故何视？而造修之官，出器处器之具，宜起而未起者何待？乡师车辎造修之具，其缮何若？工尹伐材用，毋于三时，群材乃植，而造器定冬，完良备用必足。人有余兵，诡陈之行，以慎国常。时简稽帅马牛之肥膌，其老而死者皆举之。其就山薮林泽食荐者几何，出入死生之会几何。若夫城郭之厚薄，沟壑之浅深，门闾之尊卑，宜修而不修者，上必几之。守备之伍，器物不失其具，淫雨而各有处藏。问兵官之吏，国之豪士，其急难足以先后者几何人？夫兵事者危物也，不时而胜，不义而得，未为福也。失谋而败，国之危也。慎谋乃保国。",
"　　问所以教选人者何事？问执官都者，其位事几何年矣。所辟草莱有益于家邑者几何矣？所封表以益人之生利者何物也？所筑城郭修墙闭绝通道阨阙深防沟以益人之地守者何所也？所捕盗贼，除人害者几何矣？",
"　　制地。君曰：理国之道，地德为首，君臣之礼，父子之亲，覆育万人，官府之藏，彊兵保国，城郭之险，外应四极，具取之地。而市者天地之财具也。而万人之所和而利也。正是道也。民荒无苛人，尽地之职，一保其国。各主异位，毋使谗人乱普，而德营九军之亲。关者，诸侯之陬隧也。而外财之门户也。万人之道行也。明道以重告之。征于关者，勿征于市，征于市者，勿征于关。虚车勿索，徒负勿入，以来远人。十六道同身外事谨，则听其名，视其名，视其色，是其事，稽其德。以观其外则，无敦于权人，以困貌德。国则不惑，行之职也。问于边吏曰：小利害信，小怒伤义，边信伤德，厚和构四国以顺貌德。后乡四极，令守法之官日行，度必明，无失经常。",
],
}
GuanZiBookPageModule[25]={
"index":"管子",
"name":"谋失",
"content":[""],
}
GuanZiBookPageModule[26]={
"index":"管子",
"name":"戒",
"content":[
    "　　桓公将东游，问于管仲曰：我游犹轴转斛，南至瑯邪。司马曰：“亦先王之游已。”何谓也？管仲对曰：“先王之游也，春出，原农事之不本者，谓之游。秋出，补人之不足者，谓之夕。夫师行而粮食其民者，谓之亡。从乐而不反者，谓之荒。先王有游夕之业于人，无亡荒之行于身。”桓公退再拜命曰：“宝法也。”管仲复于桓公曰：“无翼而飞者声也，无根而固者情也，无方而富者生也，公亦固情谨声，以严尊生。此谓道之荣。桓公退。再拜，请若此言。管仲复于桓公曰：“任之重者莫如身，涂之畏者莫如口，期而远者莫如年。以重任行畏涂至远期。唯君子乃能矣。”桓公退，再拜之曰：“夫子数以此言者教寡人。”管仲对曰：“滋味动静，生之养也。好恶喜怒哀乐，生之变也。聪明当物，生之德也。是故圣人齐滋味而时动静，御正六气之变。禁止声色之淫。邪行亡乎体，违言不存口。静无定生，圣也。仁从中出，义从外作。仁故不以天下为利，义故不以天下为名。仁故不代王，义故七十而致政。是故圣人上德而下功，尊道而贱物。道德当身故不以物惑。是故，身在草茅之中，而无慑意，南面听天下，而无骄色。如此，而后可以为天下王。所以谓德者。不动而疾，不相告而知，不为而成，不召而至，是德也。故天不动，四时云下，而万物化；君不动，政令陈下，而万功成；心不动，使四肢耳目，而万物情。寡交多亲，谓之知人。寡事成功，谓之知用。闻一言以贯万物，谓之知道。多言而不当，不如其寡也。博学而不自反，必有邪。孝弟者，仁之祖也。忠信者，交之庆也。内不考孝弟，外不正忠信，泽其四经而诵学者，是亡其身者也。”",
"　　桓公明日弋在廪，管仲隰朋朝，公望二子，弛弓脱釬，而迎之曰：“今夫槛鹄春北而秋南，而不失其时，夫唯有羽翼以通其意于天下乎？今孤之不得意于天下，非皆二子之忧也。”桓公再言，二子不对，桓公曰：“孤既言矣，二子何不对乎？”管仲对曰：“今夫人患劳，而上使不时，人患饥，而上重敛焉。人患死，而上急刑焉，如此，而又近有色，而远有德。虽槛鹄之有翼，济大水之有舟楫也，其将若君何？”桓公蹙然逡遁。管仲曰：“昔先王之理人也，盖人患劳，而上使之以时，则人不患劳也。人患饥，而上薄敛焉，则人不患饥矣。人患死，而上宽刑焉，则人不患死矣。如此，而近有德而远有色，则四封之内，视君其犹父母邪，四方之外，归君其犹流水乎。公辍射援绥而乘，自御，管仲为左，隰朋参乘，朔月三日，进二子于里官。再拜顿首曰：“孤之闻二子之言也，耳加聪而视加明，于孤不敢独听之，荐之先祖。”管仲隰朋再拜顿首曰：“如君之王也，此非臣之言也，君之教也。”于是管仲与桓公盟誓为令曰：“老弱勿刑。参宥而后弊，关箭而不正市正而不布。山林梁泽，以时禁发，而不正也。”草封泽盐者之归之也譬若市人。三年教人，四年选贤以为长，五年始兴车践乘，遂南伐楚，门傅施城。北伐山戎，出冬葱与戎叔，布之天下，果三匡天子而九合诸侯。",
"　　桓公外舍，而不鼎馈。中妇诸子谓宫人盍不出从乎？君将有行，宫人皆出从。公怒曰：“庸谓我有行者？”宫人曰：“贱妾闻之中妇诸子。”公召中妇诸子曰：“女焉闻吾有行也？”对曰：“妾人闻之，君外舍而不鼎馈，非有内忧，必有外患。今君外舍而不鼎馈，君非有内忧也，妾是以知君之将有行也。”公曰：“善！此非吾所与女及也。而言乃至焉，吾是以语女。吾欲致诸侯而不至，为之奈何？”中妇诸子曰：“自妾之身之不为人持接也，未尝得人之布织也。意者更容不审耶？”明日，管仲朝，公告之，管仲曰：“此圣人之言也，君必行也。”",
"　　管仲寝疾，桓公往问之曰：“仲父之疾甚矣，若不可讳也不幸而不起此疾，彼政我将安移之？”管仲未对。桓公曰：“鲍叔之为人何如？”管子对曰：“鲍叔君子也，千乘之国，不以其道，予之，不受也。虽然，不可以为政，其为人也，好善而恶恶已甚，见一恶终身不忘。”桓公曰：“然则庸可？”管仲对曰：“隰朋可，朋之为人，好上识而下问，臣闻之，以德予人者，谓之仁；以财予人者，谓之良；以善胜人者，未有能服人者也。以善养人者，未有不服人者也。于国有所不知政，于家有所不知事，则必朋乎。且朋之为人也，居其家不忘公门，居公门不忘其家，事君不二其心，亦不忘其身，举齐国之币。握路家五十室，其人不知也，大仁也哉，其朋乎！”公又问曰：“不幸而失仲父也，二三大夫者，其犹能以国宁乎？”管仲对曰：“君请矍已乎，鲍叔牙之为人也好直，宾胥无之为人也好善，宁戚之为人也能事，孙在之为人也善言。”公曰：“此四子者，其庸能一人之上也？寡人并而臣之，则其不以国宁，何也。”对曰：“鲍叔之为人也好直，而不能以国诎，宾胥无之为人也好善，而不能以国诎。宁戚之为人也能事，而不能以足息。孙在之为人也善言，而不能以信默臣闻之，消息盈虚，与百姓诎信，然后能以国宁，勿已者，朋其可乎！朋之为人也，动必量力，举必量技。”言终，喟然而叹曰：“天之生朋，以为夷吾舌也，其身死，舌焉得生哉？”管仲曰：“夫江黄之国近于楚，为臣死乎，君必归之楚而寄之。君不归，楚必私之，私之而不救也，则不可，救之，则乱自此始矣。”桓公曰：“诺。”管仲又言曰：“东郭有狗啀啀，旦暮欲啮我，猳而不使也，今夫易牙，子之不能爱，将安能爱君？君必去之。”公曰：“诺。”管子又言曰：“北郭有狗啀啀，旦暮欲啮我，猳而不使也，今夫竖刁，其身之不爱，焉能爱君，君必去之。”公曰：“诺。”管子又言曰：“西郭有狗啀啀，旦暮欲啮我，猳而不使也，今夫卫公子开方，去其千乘之太子，而臣事君，是所愿也得于君者，将欲过其千乘也，君必去之。”桓公曰：“诺。”管子遂卒。卒十月，隰朋亦卒。桓公去易牙竖刁卫公子开方。五味不至，于是乎复反易牙。宫中乱，复反竖刁。利言卑辞不在侧，复反卫公子开方。桓公内不量力，外不量交，而力伐四邻。公薨，六子皆求立，易牙与卫公子，内与竖刁，因共杀群吏而立公子无亏，故公死七日不敛，九月不葬，孝公奔宋，宋襄公率诸侯以伐齐，战于甗，大败齐师，杀公子无亏，立孝公而还。襄公立十三年，桓公立四十二年。",
],
}
GuanZiBookPageModule[27]={
"index":"管子",
"name":"地图",
"content":[
    "　　凡兵主者必先审知地图轘辕之险。滥车之水名山通谷经川陵陆丘阜之所在，苴草林木蒲苇之所茂道里之远近，城郭之大小，名邑废邑困殖之地必尽知之。地形之出入相错者尽藏之然后可以行军袭邑，举错知先后，不失地利，此地图之常也。",
"　　人之众寡，士之精粗，器之功苦尽知之，此乃知形者也，知形不如知能，知能不如知意，故主兵必参具者也，主明、相知、将能之谓参具，故将出令发士，期有日数矣，宿定所征伐之国，使群臣大吏父兄便辟左右不能议成败，人主之任也。论功劳，行赏罚，不敢蔽贤有私行，用货财供给军之求索，使百吏肃敬，不敢解怠行邪，以待君之令，相室之任也。缮器械，选练士，为教服，连什伍，遍知天下，审御机数，此兵主之事也。",
],
}
GuanZiBookPageModule[28]={
"index":"管子",
"name":"参患",
"content":[
    "　　凡人主者，猛毅则伐，懦弱则杀，猛毅者何也？轻诛杀人之谓猛毅。懦弱者何也，重诛杀人之谓懦弱。此皆有失彼此。凡轻诛者杀不辜，而重诛者失有皋，故上杀不辜，则道正者不安；上失有皋，则行邪者不变。道正者不安，则才能之人去亡；行邪者不变，则群臣朋党；才能之人去亡，则宜有外难，群臣朋党，则宜有内乱。故曰猛毅者伐，懦弱者杀也。",
"　　君之所以卑尊，国之所以安危者，莫要于兵。故诛暴国必以兵，禁辟民必以刑。然则兵者外以诛暴，内以禁邪。故兵者尊主安国之经也，不可废也。若夫世主则不然。外不以兵，而欲诛暴，则地必亏矣。内不以刑，而欲禁邪，则国必乱矣。",
"　　故凡用兵之计，三惊当一至，三至当一军，三军当一战；故一期之师，十年之蓄积殚；一战之费，累代之功尽；今交刃接兵而后利之，则战之自胜者也。攻城围邑，主人易子而食之，析骸而爨之，则攻之自拔者也。是以圣人小征而大匡，不失天时，不空地利，用日维梦，其数不出于计。故计必先定而兵出于竟，计未定而兵出于竟，则战之自败，攻之自毁者也。",
"　　得众而不得其心，则与独行者同实。兵不完利，与无操者同实，甲不坚密，与俴者同实。弩不可以及远，与短兵同实。射而不能中，与无矢者同实。中而不能入，与无鏃者同实。将徒人，与俴者同实。短兵待远矢，与坐而待死者同实。故凡兵有大论。必先论其器，论其士，论其将，论其主，故曰：“器滥恶不利者，以其士予人也，士不可用者，以其将予人也；将不知兵者，以其主予人也；主不积务于兵者，以其国予人也；故一器成，往夫具，而天下无战心。二器成，惊夫具，而天下无守城。三器成，游夫具，而天下无聚众。”所谓无战心者，知战必不胜，故曰无战心。所谓无守城者，知城必拔，故曰无守城。所谓无聚众者，知众必散，故曰无聚众。",
],
}
GuanZiBookPageModule[29]={
"index":"管子",
"name":"制分",
"content":[
    "　　凡兵之所以先争，圣人贤士，不为爱尊爵。道术知能，不为爱官职。巧伎勇力，不为爱重禄。聪耳明目，不为爱金财。故伯夷叔齐，非于死之日而后有名也，其前行多修矣。武王非于甲子之朝而后胜也，其前政多善矣。故小征千里遍知之，筑堵之墙，十人之聚，日五闲之。大征遍知天下。日一闲之。散金财，用聪明也，故善用兵者，无沟垒而有耳目。兵不呼儆，不茍聚，不妄行，不强进，呼儆则敌人戒。茍聚则众不用。妄行则群卒困，强进则锐士挫，故凡用兵者，攻坚则軔乘瑕则神，攻坚则瑕者坚乘瑕则坚者瑕。故坚其坚者，瑕其瑕者。屠牛坦朝解九牛，而刀可以莫铁，则刃游闲也。故天道不行，屈不足从。人事荒乱，以十破百。器备不行，以且击倍。故军争者不行于完城，有道者不行于无君。故莫知其将至也，至而不可圉。莫知其将去也，去而不可止。敌人虽众，不能止待。",
"　　治者所道富也，而治未必富也，必知富之事，然后能富。富者所道强也，而富未必强也，必知强之数，然后能强。强者所道胜也，而强未必胜也，必知胜之理；然后能胜。胜者所道制也，而胜未必制也，必知制之分，然后能制。是故治国有器，富国有事，强国有数，胜国有理，制天下有分。",
],
}
GuanZiBookPageModule[30]={
"index":"管子",
"name":"君臣上",
"content":[
    "　　为人君者，修官上之道，而不言其中；为人臣者，比官中之事，而不言其外。君道不明，则受令者疑；权度不一，则修义者惑。民有疑惑贰豫之心而上不能匡，则百姓之与间，犹揭表而令之止也。是故能象其道于国家，加之于百姓，而足以饰官化下者，明君也。能上尽言于主，下致力于民，而足以修义从令者，忠臣也。上惠其道，下敦其业，上下相希，若望参表，则邪者可知也。",
"　　吏啬夫任事，人啬夫任教。教在百姓，论在不挠，赏在信诚，体之以君臣，其诚也以守战。如此，则人啬夫之事究矣。吏啬夫尽有訾程事律，论法辟、衡权、斗斛、文劾，不以私论，而以事为正。如此，则吏啬夫之事究矣。人啬夫成教、吏啬夫成律之后，则虽有敦悫忠信者不得善也；而戏豫怠傲者不得败也。如此，则人君之事究矣。是故为人君者因其业，乘其事，而稽之以度。有善者，赏之以列爵之尊、田地之厚，而民不慕也。有过者，罚之以废亡之辱、僇死之刑，而民不疾也。杀生不违，而民莫遗其亲者，此唯上有明法，而下有常事也。",
"　　天有常象，地有常形，人有常礼。一设而不更，此谓三常。兼而一之，人君之道也；分而职之，人臣之事也。君失其道，无以有其国；臣失其事，无以有其位。然则上之畜下不妄，而下之事上不虚矣。上之畜下不妄，则所出法制度者明也；下之事上不虚，则循义从令者审也。上明下审，上下同德，代相序也。君不失其威，下不旷其产，而莫相德也。是以上之人务德，而下之人守节。义礼成形于上，而善下通于民，则百姓上归亲于主，而下尽力于农矣。故曰：君明、相信、五官肃、士廉、农愚、商工愿、则上下体而外内别也，民性因而三族制也。",
"　　夫为人君者，荫德于人者也；为人臣者，仰生于上者也。为人上者，量功而食之以足；为人臣者，受任而处之以教。布政有均，民足于产，则国家丰矣。以劳受禄，则民不幸生；刑罚不颇，则下无怨心；名正分明，则民不惑于道。道也者，上之所以导民也。是故道德出于君，制令传于相，事业程于官，百姓之力也，胥令而动者也。是故君人也者，无贵如其言；人臣也者，无爱如其力。言下力上，而臣主之道毕矣。是故主画之，相守之；相画之，官守之；官画之，民役之；则又有符节、印玺、典法、策籍以相揆也。此明公道而灭奸伪之术也。",
"　　论材量能，谋德而举之，上之道也；专意一心，守职而不劳，下之事也。为人君者，下及官中之事，则有司不任；为人臣者，上共专于上，则人主失威。是故有道之君，正其德以莅民，而不言智能聪明。智能聪明者，下之职也；所以用智能聪明者，上之道也。上之人明其道，下之人守其职，上下之分不同任，而复合为一体。",
"　　是故知善，人君也；身善，人役也。君身善，则不公矣。人君不公，常惠于赏，而不忍于刑，是国无法也。治国无法，则民朋党而下比，饰巧以成其私。法制有常，则民不散而上合，竭情以纳其忠。是以不言智能，而顺事治、国患解，大臣之任也。不言于聪明，而善人举，奸伪诛、视听者众也。",
"　　是以为人君者，坐万物之原，而官诸生之职者也。选贤论材，而待之以法。举而得其人，坐而收其福，不可胜收也。官不胜任，奔走而奉其败事，不可胜救也。而国未尝乏于胜任之士，上之明适不足以知之。是以明君审知胜任之臣者也。故曰：主道得，贤材遂，百姓治。治乱在主而已矣。",
"　　故曰：主身者，正德之本也；官（治）者，耳目之制也。身立而民化，德正而官治。治官化民，其要在上。是故君子不求于民。是以上及下之事谓之矫，下及上之事谓之胜。为上而矫，悖也；为下而胜，逆也。国家有悖逆反迕之行，有土主民者失其纪也。是故别交正分之谓理，顺理而不失之谓道，道德定而民有轨矣。有道之君者，善明设法，而不以私防者也。而无道之君，既已设法，则舍法而行私者也。为人上者释法而行私，则为人臣者援私以为公。公道不违，则是私道不违者也。行公道而托其私焉，寖久而不知，奸心得无积乎？奸心之积也，其大者有侵逼杀上之祸、其小者有比周内争之乱。此其所以然者，由主德不立，而国无常法也。主德不立，则妇人能食其意；国无常法，则大臣敢侵其势。大臣假于女之能，以规主情；妇人嬖宠假于男之知，以援外权。于是乎外夫人而危太子，兵乱内作，以召外寇。此危君之征也。",
"　　是故有道之君，上有五官以牧其民，则众不敢逾轨而行矣；下有五横以揆其官，则有司不敢离法而使矣。朝有定度衡仪，以尊主位，衣服緷絻，尽有法度，则君体法而立矣。君据法而出令，有司奉命而行事，百姓顺上而成俗，著久而为常，犯俗离教者，众共奸之，则为上者佚矣。",
"　　天子出令于天下，诸侯受令于天子，大夫受令于君，子受令于父母，下听其上，弟听其兄，此至顺矣。衡石一称，斗斛一量，丈尺一綧制，戈兵一度，书同名，车同轨，此至正也。从顺独逆，从正独辟，此犹夜有求而得火也，奸伪之人，无所伏矣。此先王之所以一民心也。是故天子有善，让德于天；诸侯有善，庆之于天子；大夫有善，纳之于君；民有善，本于父，庆之于长老。此道法之所从来，是治本也。是故岁一言者，君也；时省者，相也；月稽者，官也；务四支之力，修耕农之业以待令者，庶人也。是故百姓量其力于父兄之间，听其言于君臣之义，而官论其德能而待之。大夫比官中之事，不言其外；而相为常具以给之。相总要，者官谋士，量实义美，匡请所疑。而君发其明府之法瑞以稽之，立三阶之上，南面而受要。是以上有余日，而官胜其任；时令不淫，而百姓肃给。唯此上有法制，下有分职也。",
"　　道者，诚人之姓也，非在人也。而圣王明君，善知而道之者也。是故治民有常道，而生财有常法。道也者，万物之要也。为人君者，执要而待之，则下虽有奸伪之心，不敢杀也。夫道者虚设，其人在则通，其人亡则塞者也。非兹是无以理人，非兹是无以生财，民治财育，其福归于上。是以知明君之重道法而轻其国也。故君一国者，其道君之也。王天下者，其道王之也。大王天下，小君一国，其道临之也。是以其所欲者能得诸民，其所恶者能除诸民。所欲者能得诸民，故贤材遂；所恶者能除诸民，故奸伪省。如冶之于金，陶之于埴，制在工也。",
"　　是故将与之，惠厚不能供；将杀之，严威不能振。严威不能振，惠厚不能供，声实有间也。有善者不留其赏，故民不私其利；有过者不宿其罚，故民不疾其威。威罚之制，无逾于民，则人归亲于上矣。如天雨然，泽下尺，生上尺。",
"　　是以官人不官，事人不事，独立而无稽者，人主之位也。先王之在天下也，民比之神明之德。先王善牧之于民者也。夫民别而听之则愚，合而听之则圣。虽有汤武之德，复合于市人之言。是以明君顺人心，安情性，而发于众心之所聚。是以令出而不稽，刑设而不用。先王善与民为一体。与民为一体，则是以国守国，以民守民也。然则民不便为非矣。",
"　　虽有明君，百步之外，听而不闻；间之堵墙，窥而不见也。而名为明君者，君善用其臣，臣善纳其忠也。信以继信，善以传善。是以四海之内，可得而治。是以明君之举其下也，尽知其短长，知其所不能益，若任之以事。贤人之臣其主也，尽知短长与身力之所不至，若量能而授官。上以此畜下，下以此事上，上下交期于正，则百姓男女皆与治焉。",
],
}
GuanZiBookPageModule[31]={
"index":"管子",
"name":"君臣下",
"content":[
    "　　古者未有君臣上下之别，未有夫妇妃匹之合，兽处群居，以力相征。于是智者诈愚，强者凌弱，老幼孤独不得其所。故智者假众力以禁强虐，而暴人止。为民兴利除害，正民之德，而民师之。是故道术德行，出于贤人。其从义理兆形于民心，则民反道矣。名物处，违是非之分，则赏罚行矣。上下设，民生体，而国都立矣。是故国之所以为国者，民体以为国；君之所以为君者，赏罚以为君。",
"　　致赏则匮，致罚则虐。财匮而令虐，所以失其民也。是故明君审居处之教，而民可使居治、战胜、守固者也。夫赏重，则上不给也；罚虐，则下不信也。是故明君饰食饮吊伤之礼，而物属之者也。是故厉之以八政，旌之以衣服，富之以国裹，贵之以王禁，则民亲君可用也。民用，则天下可致也。天下道其道则至，不道其道则不至也。夫水波而上，尽其摇而复下，其势固然者也。故德之以怀也，威之以畏也，则天下归之矣。有道之国，发号出令，而夫妇尽归亲于上矣；布法出宪，而贤人列士尽功能于上矣。千里之内，束布之罚，一亩之赋，尽可知也。治斧钺者不敢让刑，治轩冕者不敢让赏，坟然若一父之子，若一家之实，义礼明也。",
"　　夫下不戴其上，臣不戴其君，则贤人不来。贤人不来，则百姓不用。百姓不用，则天下不至。故曰：德侵则君危，论侵则有功者危，令侵则官危，刑侵则百姓危。而明君者，审禁淫侵者也。上无淫侵之论，则下无异幸之心矣。",
"　　为人君者，倍道弃法，而好行私，谓之乱。为人臣者，变故易常，而巧官以谄上，谓之腾。乱至则虐，腾至则北。四者有一至，败敌人谋之。则故施舍优犹以济乱，则百姓悦。选贤遂材，而礼孝弟，则奸伪止。要淫佚，别男女，则通乱隔。贵贱有义，伦等不逾，则有功者劝。国有常式，故法不隐，则下无怨心。此五者，兴德匡过、存国定民之道也。",
"　　夫君人者有大过，臣人者有大罪，国所有也，民所君也，有国君民而使民所恶制之，此一过也。民有三务，不布其民，非其民也。民非其民，则不可以守战。此君人者二过也。夫臣人者，受君高爵重禄，治大官。倍其官，遗其事，穆君之色，从其欲，阿而胜之，此臣人之大罪也。君有过而不改，谓之倒；臣当罪而不诛，谓之乱。君为倒君，臣为乱臣，国家之衰也，可坐而待之。是故有道之君者执本，相执要，大夫执法以牧其群臣，群臣尽智竭力以役其上。四守者得则治，易则乱。故不可不明设而守固。",
"　　昔者，圣王本厚民生，审知祸福之所生。是故慎小事微，违非索辩以根之。然则躁作、奸邪、伪诈之人，不敢试也。此礼正民之道也。",
"　　古者有二言：“墙有耳，伏寇在侧。”墙有耳者，微谋外泄之谓也；伏寇在侧者，沈疑得民之道也。微谋之泄也，狡妇袭主之请而资游慝也。沈疑之得民也者，前贵而后贱者为之驱也。明君在上，便僻不能食其意，刑罚亟近也；大臣不能侵其势，比党者诛，明也。为人君者，能远谗谄，废比党，淫悖行食之徒，无爵列于朝者，此止诈拘奸、厚国存身之道也。",
"　　为人上者，制群臣百姓通，中央之人和，是以中央之人，臣主之参。制令之布于民也，必由中央之人。中央之人，以缓为急，急可以取威；以急为缓，缓可以惠民。威惠迁于下，则为人上者危矣。贤不肖之知于上，必由中央之人。财力之贡于上，必由中央之人。能易贤不肖而可威党于下。有能以民之财力上陷其主，而可以为劳于下。兼上下以环其私，爵制而不可加，则为人上者危矣。先其君以善者，侵其赏而夺之实者也；先其君以恶者，侵其刑而夺之威者也；讹言于外者，胁其君者也；郁令而不出者，幽其君者也。四者一作而上（下）不知也，则国之危，可坐而待也。",
"　　神圣者王，仁智者君，武勇者长，此天之道，人之情也。天道人情，通者质，宠者从，此数之因也。是故始于患者，不与其事；亲其事者，不规其道。是以为人上者患而不劳也，百姓劳而不患也。君臣上下之分索，则礼制立矣。是故以人役上，以力役明，以刑役心，此物之理也。心道进退，而形道滔赶。进退者主制，滔赶者主劳。主劳者方，主制者圆。圆者运，运者通，通则和。方者执，执者固，固则信。君以利和，臣以节信，则上下无邪矣。故曰：君人者制仁，臣人者守信。此言上下之礼也。",
"　　君之在国都也，若心之在身体也。道德定于上，则百姓化于下矣。戒心形于内，则容貌动于外矣，正也者，所以明其德。知得诸己，知得诸民，从其理也。知失诸民，退而修诸己，反其本也。所求于己者多，故德行立。所求于人者少，故民轻给之。故君人者上注，臣人者下注。上注者，纪天时，务民力。下注者，发地利，足财用也。故能饰大义，审时节，上以礼神明，下以义辅佐者，明君之道。能据法而不阿，上以匡主之过，下以振民之病者，忠臣之所行也。",
"　　君子食于道，则义审而礼明，义审而礼明，则伦等不逾，虽有偏卒之大夫，不敢有幸心，则上无危矣。齐民食于力则作本，作本者众，农以听命。是以明君立世，民之制于上，犹草木之制于时也。故民迂则流之，民流通则迂之。决之则行，塞之则止。虽有明君，能决之，又能塞之。决之则君子行于礼，塞之则小人笃于农。君子行于礼，则上尊而民顺；小民笃于农，则财厚而备足。上尊而民顺，财厚而备足，四者备体，顷时而王不难矣。",
"　　四肢六道，身之体也。四正五官，国之体也。四肢不通，六道不达，曰失。四正不正，五官不官，曰乱。是故国君聘妻于异姓，设为姪娣、命妇、宫女，尽有法制，所以治其内也。明男女之别，昭嫌疑之节，所以防其奸也。是以中外不通，谗慝不生；妇言不及官中之事，而诸臣子弟无宫中之交，此先王所以明德圉奸，昭公威私也。",
"　　明立宠设，不以逐子伤义。礼私爱欢，势不并论。爵位虽尊，礼无不行。选为都佼，冒之以衣服，旌之以章旗，所以重其威也。然则兄弟无间郄，谗人不敢作矣。",
"　　故其立相也，陈功而加之以德，论劳而昭之以法，参伍相德而周举之，尊势而明信之。是以下之人无谏死之誋，而聚立者无郁怨之心，如此，则国平而民无慝矣。其选贤遂材也，举德以就列，不类无德；举能以就官，不类无能；以德弇劳，不以伤年。如此，则上无困，而民不幸生矣。",
"　　国之所以乱者四，其所以亡者二。内有疑妻之妾，此宫乱也；庶有疑適之子，此家乱也；朝有疑相之臣，此国乱也；任官无能，此众乱也。四者无别，主失其体。群官朋党，以怀其私，则失族矣；国之几臣，阴约闭谋以相待也，则失援矣。失族于内，失援于外，此二亡也。故妻必定，子必正，相必直立以听，官必中信以敬。故曰：有宫中之乱，有兄弟之乱，有大臣之乱，有中民之乱，有小人之乱。五者一作，则为人上者危矣。宫中乱曰妒纷，兄弟乱曰党偏，大臣乱曰称述、中民乱曰詟谆，小民乱曰财匮。财匮生薄，詟谆生慢，称述、党偏、妒纷生变。",
"　　故正名稽疑，刑杀亟近，则内定矣。顺大臣以功，顺中民以行，顺小民以务、则国丰矣。审天时，物地生，以辑民力；禁淫务：劝农功，以职其无事，则小民治矣。上稽之以数，下十伍以征，近其罪伏，以固其意。乡树之师，以遂其学。官之以其能，及年而举，则士反行矣。称德度功，劝其所能，若稽之以众风，若任以社稷之任。若此，则土反于情矣。",
],
}
GuanZiBookPageModule[32]={
"index":"管子",
"name":"小称",
"content":[
    "　　管子曰：“身不善之患，毋患人莫己知。丹青在山，民知而取之；美珠在渊，民知而取之。是以我有过为，而民毋过命。民之观也察矣，不可遁逃以为不善。故我有善，则立誉我；我有过，则立毁我。当民之毁誉也，则莫归问于家矣，故先王畏民。操名从人，无不强也；操名去人，无不弱也。虽有天子诸侯，民皆操名而去之，则捐其地而走矣，故先王畏民。在于身者孰为利？气与目为利。圣人得利而托焉，故民重而名遂。我亦托焉，圣人托可好，我托可恶，以来美名，又可得乎？我托可恶，爱且不能为我能也，毛嫱、西施，天下之美人也，盛怨气于面，不能以为可好。我且恶面而盛怨气焉，怨气见于面，恶言出于口，去恶充以求美名，又可得乎？甚矣，百姓之恶人之有余忌也，是以长者断之，短者续之，满者洫之，虚者实之。”",
"　　管子曰：“善罪身者，民不得罪也；不能罪身者，民罪之。故称身之过者，强也；洽身之节者，惠也；不以不善归人者，仁也。故明王有过则反之于身，有善则归之于民。有过而反之身则身惧，有善而归之民则民喜。往喜民，来惧身，此明王之所以治民也。今夫桀纣不然，有善则反之于身，有过则归之于民。归之于民则民怒，反之于身则身骄。往怒民，来骄身，此其所以失身也。故明王惧声以感耳，惧气以感目。以此二者有天下矣，可毋慎乎？匠人有以感斤，故绳可得断也，羿有以感弓矢，故彀可得中也。造父有以感辔策，故遬兽可及，远道可致。天下者，无常乱，无常治。不善人在则乱，善人在则治，在于既善，所以感之也。”",
"　　管子曰：“修恭逊、敬爱、辞让、除怨、无争以相逆也，则不失于人矣。尝试多怨争利，相为不逊，则不得其身。大哉！恭逊敬爱之道。吉事可以入察，凶事可以居丧。大以理天下而不益也，小以治一人而不损也。尝试往之中国、诸夏、蛮夷之国，以及禽兽昆虫、皆待此而为治乱。泽之身则荣，去之身则辱。审行之身毋怠，虽夷貉之民，可化而使之爱。审去之身，虽兄弟父母，可化而使之恶。故之身者，使之爱恶；名者，使之荣辱。此其变名物也，如天如地，故先王曰道。”",
"　　管仲有病，桓公往问之曰：“仲父之病病矣，若不可讳而不起此病也，仲父亦将何以诏寡人？“管仲对曰：“微君之命臣也，故臣且谒之，虽然，君犹不能行也。”公曰：“仲父命寡人东，寡人东；令寡人西，寡人西。仲父之命于寡人，寡人敢不从乎？”管仲摄衣冠起，对曰：“臣愿君之远易牙、竖刁、堂巫、公子开方。夫易牙以调和事公，公曰：惟烝婴儿之未尝。于是烝其首子而献之公。人情非不爱其子也，于子之不爱，将何有于公？公喜宫而妒，竖刁自刑而为公治内。人情非不爱其身也，于身之不爱，将何有于公？公子开方事公，十五年不归视其亲，齐卫之间，不容数日之行。于亲之不爱，焉能有子公？臣闻之，务为不久，盖虚不长。其生不长者，其死必不终。”桓公曰：“善。”管仲死，已葬。公憎四子者，废之官。逐堂巫而苛病起兵，逐易牙而味不至，逐竖刁而宫中乱，逐公子开方而朝不治。桓公曰：“嗟！圣人固有悖乎！”乃复四子者。处期年，四子作难，围公一室不得出。有一妇人、遂从窦入，得至公所。公曰：“吾饥而欲食，渴而欲饮，不可得，其故何也？”妇人对曰：“易牙、竖刁、堂巫、公子开方四人分齐国，涂十日不通矣。公子开方以书社七百下卫矣，食将不得矣。”公曰：“嗟兹乎！圣人之言长乎哉！死者无知则已，若有知，吾何面目以见仲父于地下！”乃援素幭以裹首而绝。死十一日，虫出于户，乃知桓公之死也。葬以杨门之扇。桓公之所以身死十一日，虫出户而不收者，以不终用贤也。",
"　　桓公、管仲、鲍叔牙、宁戚四人饮，饮酣，桓公谓鲍叔牙曰：“阖不起为寡人寿乎？“鲍叔牙奉杯而起曰：“使公毋忘出如莒时也，使管子毋忘束缚在鲁也，使宁戚毋忘饭牛车下也。”桓公辟席再拜曰：“寡人与二大夫能无忘夫子之言，则国之社稷必不危矣。”",
],
}
GuanZiBookPageModule[33]={
"index":"管子",
"name":"四称",
"content":[
    "　　桓公问于管子曰：“寡人幼弱惛愚，不通诸侯四邻之义，仲父不当尽语我昔者有道之君乎？吾亦鉴焉。”管子对曰：“夷吾之所能与所不能，尽在君所矣，君胡有辱令？”桓公又问曰：“仲父，寡人幼弱惛愚，不通四邻诸侯之义，仲父不当尽告我昔者有道之君乎？吾亦鉴焉。”管子对曰：“夷吾闻之于徐伯曰，昔者有道之君，敬其山川、宗庙、社稷，及至先故之大臣，收聚以忠而大富之。固其武臣，宣用其力。圣人在前，贞廉在侧，竟称于义，上下皆饰。形正明察，四时不贷，民亦不忧，五谷蕃殖。外内均和，诸侯臣伏，国家安宁，不用兵革。受币帛，以怀其德；昭受其令，以为法式。此亦可谓昔者有道之君也。”桓公曰：“善哉！”",
"　　桓公曰：“仲父既己语我昔者有道之君矣，不当尽语我昔者无道之君乎？吾亦鉴焉。”管子对曰：“今若君之美好而宣通也，既官职美道，又何以闻恶为？”桓公曰：“是何言邪？以繬缁缘繬，吾何以知其美也？以素缘素，吾何以知其善也？仲父已语我其善，而不语我其恶，吾岂知善之为善也？”管子对曰：“夷吾闻之徐伯曰，昔者无道之君，大其宫室，高其台榭，良臣不使，谗贼是舍。有家不治，借人为图，政令不善，墨墨若夜，辟若野兽，无所朝处，不修天道，不鉴四方，有家不治，辟若生狂，众所怨诅，希不灭亡。进其谀优，繁其钟鼓，流于博塞，戏其工瞽。诛其良臣，敖其妇女，撩猎毕弋，暴遇诸父，驰骋无度，戏乐笑语。式政既輮，刑罚则烈。内削其民，以为攻伐，辟犹漏釜，岂能无竭。此亦可谓昔者无道之君矣。”桓公曰：“善哉！”",
"　　桓公曰：“仲父既已语我昔者有道之君与昔者无道之君矣，仲父不当尽语我昔者有道之臣乎？吾以鉴焉。”管子对曰：“夷吾闻之于徐伯曰，昔者有道之臣，委质为臣，不宾事左右；君知则仕，不知则已。若有事，必图国家，遍其发挥。循其祖德，辩其顺逆，推育贤人，谗慝不作。事君有义，使下有礼，贵贱相亲，若兄若弟，忠于国家，上下得体。居处则思义，语言则谋谟，动作则事。居国则富，处军则克，临难据事，虽死不悔。近君为拂，远君为辅，义以与交，廉以与处。临官则治，酒食则慈，不谤其君，不毁其辞。君若有过，进谏不疑；君若有忧，则臣服之。此亦可谓昔者有道之臣矣。”桓公曰：“善哉！”",
"　　桓公曰：“仲父既以语我昔者有道之臣矣，不当尽语我昔者无道之臣乎？吾亦鉴焉。”管子对曰：“夷吾闻之于徐伯曰，昔者无道之臣，委质为臣，宾事左右；执说以进，不蕲亡己；遂进不退，假宠鬻贵。尊其货贿，卑其爵位；进曰辅之，退曰不可，以败其君，皆曰非我。不仁群处，以攻贤者，见贤若货，见贱若过。贪于货贿，竟于酒食，不与善人，唯其所事。倨敖不恭，不友善士，谗贼与斗，不弥人争，唯趣人诏。湛湎于酒，行义不从。不修先故，变易国常，擅创为令，迷或其君，生夺之政，保贵宠矜。迁损善士，捕援货人，入则乘等，出则党骈，货贿相入，酒食相亲，俱乱其君。君若有过，各奉其身。此亦谓昔者无道之臣。”桓公曰：“善哉！”",
],
}
GuanZiBookPageModule[34]={
"index":"管子",
"name":"正言",
"content":[""],
}
GuanZiBookPageModule[35]={
"index":"管子",
"name":"侈靡",
"content":[
    "　　问曰：“古之时与今之时同乎？”曰：“同。”“其人同乎？不同乎？”曰：“不同。”可与？政其诛。俈尧之时，混吾之美在下，其道非独出人也。山不童而用赡，泽不獘而养足。耕以自养，以其余应良天子，故平。牛马之牧不相及，人民之俗不相知，不出百里而来足，故卿而不理，静也。其狱一踦腓一踦屦而当死。今周公断指满稽，断首满稽，断足满稽，而死民不服，非人性也，敝也。地重人载，毁敝而养不足，事末作而民兴之；是以下名而上实也，圣人者，省诸本而游诸乐，大昏也，博夜也。",
"　　问曰：“兴时化若何？”莫善于侈靡；贱有实，敬无用，则人可刑也。故贱粟米而如敬珠玉，好礼乐而如贱事业。本之殆也，珠者阴之阳也，故胜火。玉者阴之阴也，故胜水。其化如神。故天子臧珠玉，诸侯臧金石，大夫畜狗马，百姓臧布帛。不然，则强者能守之，智者能牧之，贱所贵而贵所贱。不然，鳏寡独老不与得焉，均之始也。",
"　　政与教庸急？管子曰：夫政教相似而殊方，若夫教者，标然若秋云之远，动人心之悲；蔼然若夏之静云，乃及人之体，□然若謞之静。动人意以怨，荡荡若流水，使人思之。人所生往，教之始也，身必备之。辟之若秋云之始见，贤者不肖者化焉。敬而待之，爱而使之，若樊神山祭之。贤者少。不肖者多。使其贤，不肖恶得不化。今夫政则少则，若夫成形之征者也，去则少可使人乎。",
"　　用贫与富，何如而可，曰：甚富不可使，甚贫不知耻，水平而不流，无源则遫竭，云平而雨不甚，无委云，雨则遫已。政平而无威，则不行。爱而无亲则流。亲左有用，无用则辟之，若相为有兆怨。上短下长，无度而用，则危本不称。",
"　　而祀谭次祖，犯诅渝盟伤言。敬祖祢，尊始也。齐约之信，论行也。尊天地之理，所以论威也。薄德之君之府囊也。必因成形而论于人，此政行也，可以王乎？",
"　　请问用之若何？必辨于天地之道，然后功名可以殖。辨于地利，而民可富。通于侈靡，而士可戚。君亲自好事，强以立断，仁以好任。人君寿以政年，百姓不夭厉，六畜鞍育，五谷鞍熟，然后民力可得用。邻国之君俱不贤，然后得王。",
"　　俱贤若何？曰：忽然易卿而移，忽然易事而化，变而足以成名。承獘而民劝之，慈种而民富，应言待感，与物俱长，故日月之明，应风雨而种。天之所覆，地之所载，斯民之良也，不有而丑天地，非天子之事也。民变而不能变，是棁之傅革，有革而不能革，不可服。民死信，诸侯死化。",
"　　请问诸侯之化獘，獘也者，家也。家也者，以因人之所重而行之。吾君长来猎君长虎豹之皮用。功力之君上金玉币，好战之君上甲兵。甲兵之本，必先于田宅。今吾君战，则请行民之所重。",
"　　饮食者也，侈乐者也，民之所愿也，足其所欲，赡其所愿，则能用之耳。今使衣皮而冠角食野草，饮野水，庸能用之？伤心者不可以致功。故尝至味，而罢至乐。而雕卵然后瀹之，雕橑然后爨之。丹沙之穴不塞，则商贾不处。富者靡之，贫者为之，此百姓之怠生百振而食非，独自为也，为之畜化。",
"　　用其臣者，予而夺之，使而辍之，徒以而富之，父系而伏之，予虚爵而骄之。收其春秋之时而消之，有集礼我而居之。时举其强者以誉之。强而可使服事。辩以辩辞，智以招请，廉以摽人，坚强以乘六，广其德以轻上，位不能使之而流徙，此谓国亡之郤。故法而守常，尊礼而变俗，上信而贱文，好缘而好駔，此谓成国之法也。为国者，反民性，然后可以与民戚，民欲佚，而教以劳。民欲生，而教以死。劳教定而国富，死教定而威行。",
"　　圣人者，阴阳理，故平外而险中；故信其情者伤其神，美其质者伤其文，化之美者应其名，变其美者应其时，不能兆其端者菑及之。故缘地之利，承从天之指，辱举其死，开国闭辱，知其缘地之利者，所以参天地之吉纲也；承从天之指者，动必明。辱举其死者，与其失人同公事，则道必行。开其国门者，玩之以善言。柰其斝辱，知神次者，操牺牲与其珪璧，以执其斝。家小害，以小胜大。员其中，辰其外。而复畏强，长其虚，而物正以视其中情。",
"　　公曰：国门则塞，百姓谁敢敖，胡以备之？择天下之所宥，择鬼之所当，择人天之所戴，而前付其身，此所以安之也。强与短而立，齐国之若何？高予之名而举之，重予之官而危之，因责其能以随之，犹傶则疏之，毋使人图之，犹疏则数之，毋使人曲之，此所以为之也。",
"　　大有臣甚大，将反为害，吾欲优患除害，将小能察大，为之奈何？潭根之毋伐，固蒂之毋乂，深黎之毋涸，不仪之毋助，章明之毋灭，生荣之毋失。十言者不胜此一，虽凶必吉，故平以满。",
"　　无事而总，以待有事，而为之若何？积者立余日而侈，美车马而驰，多酒醴而靡，千岁毋出食，此谓本事。县人有主，人此治用，然而不治，积之市，一人积之下，一人积之上，此谓利无常。百姓无宝，以利为首。一上一下，唯利所处。利然后能通，通然后成国。利静而不化，观其所出，从而移之。",
"　　视其不可使，因以为民等。择其好名，因使长民；好而不已，是以为国纪。功未成者，不可以独名；事未道者，不可以言名。成功然后可以独名，事道然后可以言名，然后可以承致酢。",
"　　先其士者之为自犯，后其民者之为自赡。轻国位者国必败，疏贵戚者谋将泄。毋仕异国之人，是为失经。毋数变易，是为败成。大臣得罪，勿出封外，是为漏情。毋数据大臣之家而饮酒，是为使国大消。三尧在，臧于县，返于连，比若是者，必从是儡亡乎！辟之若尊觯，未胜其本，亡流而下不平。令苟下不治，高下者不足以相待，此谓杀。",
"　　事立而坏，何也？兵远而畏，何也？民已聚而散，何也？辍安而危，何也？功成而不信者，殆；兵强而无义者，残；不谨于附近而欲求远者，兵不信。略近臣合于其远者，立。亡国之起，毁国之族，则兵远而不畏。国小而修大，仁而不利，犹有争名者，累哉是也！乐聚之力，以兼人之强，以待其害，虽聚必散。大王不恃众而自恃，百姓自聚；供而后利之，成而无害。疏戚而好外，企以仁而谋泄，贱寡而好大，此所以危。",
"　　众而约，实取而言让，行阴而言阳，利人之有祸，言人之无患，吾欲独有是，若何？是故之时，陈财之道可以行。今也利散而民察，必放之身然后行。公曰：谓何？长丧以毁其时，重送葬以起身财，一亲往，一亲来，所以合亲也。此谓众约。问，用之若何？巨瘗堷，所以使贫民也；美垄墓，所以使文明也；巨棺椁，所以起木工也；多衣衾，所以起女工也。犹不尽，故有次浮也，有差樊，有瘗藏。作此相食，然后民相利，守战之备合矣。",
"　　乡殊俗，国异礼，则民不流矣；不同法，则民不困；乡丘老不通睹，诛流散，则人不眺安乡乐宅，享祭而讴吟称号者皆诛，所以留民俗也。断方井田之数，乘马甸之众，制之。陵溪立鬼神而谨祭。皆以能别以为食数，示重本也。",
"　　故地广千里者，禄重而祭尊。其君无余地与他若一者，从而艾之。君始者艾若一者，从乎杀。与于杀若，一者从者艾若一者，从于杀。与于杀若，一者从无封始，王者上事，霸者生功，言重本。是为十禺，分免而不争，言先人而自后也。",
"　　官礼之司，昭穆之离先后功器事之治，尊鬼而守故；战事之任，高功而下死；本事，食功而省利；劝臣，上义而不能与小利。五官者，人争其职，然后君闻。",
"　　祭之，时上贤者也，故君臣掌。君臣掌则上下均，此以知上贤无益也，其亡兹适。上贤者亡，而役贤者昌。上义以禁暴，尊祖以敬祖，聚宗以朝杀，示不轻为主也。载祭明置，高子闻之，以告中寝诸子，中寝诸子告寡人，舍朝不鼎馈，中寝诸子告宫中女子曰，公将有行，故不送公，公言无行，女安闻之，曰：闻之中寝诸子，索中寝诸子而问之，寡人无行，女安闻之，吾闻之先人，诸侯舍于朝不鼎馈者，非有外事，必有内忧。公曰：吾不欲与汝及若。女言至焉，不得毋与女及若言，吾欲致诸侯，诸侯不至若何哉？女子不辩于致诸侯，自吾不为污杀之事人，布织不可得而衣，故虽有圣人恶用之。",
"　　能摩故道新道，定国家，然后化时乎？国贫而鄙富，苴美于朝市国；国富而鄙贫，莫尽如市。市也者，劝也。劝者，所以起。本善而末事起。不侈，本事不得立。",
"　　贤举能不可得，恶得伐不服？用百夫无长，不可临也；干乘有道，不可修也。夫纣在上，恶得伐不得？钧则战，守则攻，百盖无筑，千聚无社，谓之陋，一举而取。天下有一事之时也，万诸侯钧，万民无听，上位不能为功更制，其能王乎？",
"　　缘故修法，以政治道，则约杀子吾君，故取夷吾谓替。公曰：何若？对曰：以同。其日久临，可立而待。鬼神不明，囊橐之食无报，明厚德也。沈浮，示轻财也。先立象而定期，则民从之；故为祷朝缕绵，明轻财而重名。公曰：同临？所谓同者，其以先后智渝者也。钧同财争，依则说，十则从服，万则化。成功而不能识，而民期然后，成形而更名，则临矣。",
"　　请问为边若何？对曰：夫边日变，不可以常知观也。民未始变而是变，是为自乱。请问诸边而参其乱，任之以事，因其谋。方百里之地，树表相望者，丈夫走祸，妇人备食，内外相备。春秋一日，败曰千金，称本而动。候人不可重也，唯交于上，能必于边之辞。行人可不有私，不有私，所以为内因也。使能者有主，矣而内事。",
"　　万世之国，必有万世之实。必因天地之道，无使其内使其外，使其小毋使其大。弃其国宝使其大，贵一与而圣；称其宝使其小，可以为道。能则专，专则佚。椽能逾，则椽于逾。能宫，则不守而不散。众能，伯；不然，将见对。",
"　　君子者，勉于糺人者也，非见糺者也。故轻者轻，重者重，前后不慈。凡轻者操实也，以轻则可使；重不可起轻，轻重有齐。重以为国，轻以为死。毋全禄，贫国而用不足；毋全赏，好德恶亡使常。",
"　　请问先合于天下而无私怨，犯强而无私害，为之若何？对曰：国虽强，令必忠以义；国虽弱，令必敬以哀。强弱不犯，则人欲听矣。先人而自后而无以为仁也，加功于人而勿得，所橐者远矣，所争者外矣。明无私交，则无内怨；与大则胜，私交众则怨杀。",
"　　夷吾也，如以予人财者，不如毋夺时；如以予人食者，不如毋夺其事，此谓无外内之患。事故也，君臣之际也；礼义者，人君之神也。且君臣之属，也；亲戚之爱，性也。使君亲之察同索，属故也。使人君不安者，属际也，不可不谨也。",
"　　贤不可威，能不可留，杜事之于前，易也。水鼎之汩也，人聚之；壤地之美也，人死之。若江湖之大也，求珠贝者，不令也。逐神而远热，交觯者不处，兄遗利夫！事左中国之人，观危国过君而弋其能者，岂不几于危社主哉！",
"　　利不可法，故民流；神不可法，故事之。天地不可留，故动，化故从新。是故得天者高而不崩，得人者卑而不可胜。是故圣人重之，人君重之。故至贞生至信，至言往至绞。生至自有道，不务以文胜情，不务以多胜少，不动则望有廧，旬身行。",
"　　法制度量，王者典器也；执故义道，畏变也。天地若夫神之动。化变者也，天地之极也。能与化起而王用，则不可以道山也。仁者善用，智者善用，非其人，则与神往矣。",
"　　衣食之于人也，不可以一日违也，亲戚可以时大也。是故圣人万民艰处而立焉。人死则易云，生则难合也。故一为赏，再为常，三为固然。其小行之则俗也，久之则礼义。故无使下当上必行之，然后移商人于国，非用人也，不择乡而处，不择君而使，出则从利，入则不守。国之山林也，则而利之。市塵之所及，二依其本。故上侈而下靡，而君臣相上下相亲，则君臣之财不私藏。然则贪动枳而得食矣。徙邑移市，亦为数一。",
"　　问曰：多贤可云？对曰：鱼鳖之不食咡者，不出其渊；树木之胜霜雪者，不听于天；士能自治者，不从圣人，岂云哉？夷吾之闻之也，不欲，强能不服，智而不牧。若旬虚期于月，津若出于一，明然，则可以虚矣。故阨其道而薄其所予，则士云矣。不择人而予之，谓之好人；不择人而取之，谓之好利。审此两者，以为处行，则云矣。",
"　　不方之政，不可以为国；曲静之言，不可以为道。节时于政，与时往矣。不动以为道，齐以为行，避世之道，不可以进取。",
"　　阳者进谋，几者应感，再杀则齐，然后运可请也。对曰：夫运谋者，天地之虚满也，合离也，春秋冬夏之胜也，然有知强弱之所尤，然后应诸侯取交，故知安危国之所存。以时事天，以天事神，以神事鬼，故国无罪而君寿，而民不杀智运谋而杂橐刃焉。",
"　　其满为感，其虚为亡，满虚之合，有时而为实，时而为动。地阳时贷，其冬厚则夏热，其阳厚则阴寒。是故王者谨于日至，故知虚满之所在，以为政令。已杀生，其合而未散，可以决事。将合，可以禺其随行以为兵，分其多少以为曲政。",
"　　请问形有时而变乎？对曰：阴阳之分定，则甘苦之草生也。从其宜，则酸咸和焉，而形色定焉，以为声乐。夫阴阳进退，满虚亡时，其散合可以视岁。唯圣人不为岁，能知满虚，夺余满，补不足，以通政事，以赡民常。地之变气，应其所出；水之变气，应之以精，受之以豫；天之变气，应之以正。且夫天地精气有五，不必为沮，其亟而反，其重陔动毁之进退，即此数之难得者也，此形之时变也。",
"　　沮平气之阳，若如辞静。余气之潜然而动，爱气之潜然而哀，胡得而治动？对曰：得之衰时，位而观之，佁美然后有辉。修之心，其杀以相待，故有满虚哀乐之气也。故书之帝八，神农不与存，为其无位，不能相用。",
"　　问：运之合满安臧？二十岁而可广，十二岁而聂广，百岁伤神。周郑之礼移矣，则周律之废矣，则中国之草木有移于不通之野者。然则人君声服变矣，则臣有依驷之禄，妇人为政，铁之重反旅金。而声好下曲，食好咸苦，则人君日退。亟则溪陵山谷之神之祭更，应国之称号亦更矣。",
"　　视之示变，观之风气。古之祭，有时而星，有时而星熺，有时而熰，有时而朐。鼠应广之实，阴阳之数也。华若落之名，祭之号也。是故天子之为国，图具其树物也。",
],
}
GuanZiBookPageModule[36]={
"index":"管子",
"name":"心术上",
"content":[
    "　　心之在体，君之位也；九窍之有职，官之分也。心处其道。九窍循理；嗜欲充益，目不见色，耳不闻声。故曰上离其道，下失其事。毋代马走，使尽其力；毋代鸟飞，使弊其羽翼；毋先物动，以观其则。动则失位，静乃自得。",
"　　道，不远而难极也，与人并处而难得也。虚其欲，神将入舍；扫除不洁，神乃留处。人皆欲智而莫索其所以智乎。智乎，智乎，投之海外无自夺，求之者不得处之者。夫正人无求之也，故能虚无。",
"　　虚无无形谓之道，化育万物谓之德，君臣父子人间之事谓之义，登降揖让、贵贱有等、亲疏之体谓之礼，简物、小未一道。杀僇禁诛谓之法。",
"　　大道可安而不可说。直人之言不义不颇，不出于口，不见于色，四海之人，又孰知其则？",
"　　天曰虚，地曰静，乃不伐。洁其宫，开其门，去私毋言，神明若存。纷乎其若乱，静之而自治。强不能遍立，智不能尽谋。物固有形，形固有名，名当，谓之圣人。故必知不言，无为之事，然后知道之纪。殊形异埶，不与万物异理，故可以为天下始。",
"　　人之可杀，以其恶死也；其可不利，以其好利也。是以君子不休乎好，不迫乎恶，恬愉无为，去智与故。其应也，非所设也；其动也，非所取也。过在自用，罪在变化。是故有道之君，其处也若无知，其应物也若偶之。静因之道也。",
"　　“心之在体，君之位也；九窍之有职，官之分也。”耳目者。视听之官也，心而无与于视听之事，则官得守其分矣。夫心有欲者，物过而目不见，声至而耳不闻也。故曰：“上离其道，下失其事。”故曰：心术者，无为而制窍者也。故曰“君”。“毋代马走”，“毋代鸟飞”，此言不夺能能，不与下诚也。“毋先物动”者，摇者不走，趮者不静，言动之不可以观也。“位”者”，谓其所立也。人主者立于阴，阴者静，故曰“动则失位”。阴则能制阳矣，静则能制动矣，攸曰，‘静乃自得。”",
"　　道在天地之间也，其大无外，其小无内，故曰“不远而难极也”。虚之与人也无间，唯圣人得虚道，故曰“并处而难得”。世人之所职者精也。去欲则宣，宣则静矣，静则精。精则独立矣，独则明，明则神矣。神者至贵也，故馆不辟除，则贵人不舍焉。故曰“不洁则神不处”。“人皆欲知而莫索之”，其所（以）知，彼也；其所以知，此也。不修之此，焉能知彼？修之此，莫能虚矣。虚者，无藏也。故曰去知则奚率求矣，无藏则奚设矣。无求无设则无虑，无虑则反复虚矣。",
"　　天之道，虚其无形。虚则不屈，无形则无所位迕，无所位迕，故遍流万物而不变，德者，道之舍，物得以生生，知得以职道之精。故德者得也。得也者，其谓所得以然也。以无为之谓道，舍之之谓德。故道之与德无间，故言之者不别也。间之理者，谓其所以舍也。义者，谓各处其宜也。礼者，因人之情，缘义之理，而为之节文者也，故礼者谓有理也。理也者，明分以谕义之意也。故礼出乎义，义出乎理，理因乎宜者也。法者所以同出，不得不然者也，故杀僇禁诛以一之也。故事督乎法，法出乎权，权出于道。",
"　　道也者、动不见其形，施不见其德，万物皆以得，然莫知其极。故曰“可以安而不可说”也。莫人，言至也。不宜，言应也。应也者，非吾所设，故能无宜也。不顾，言因也。因也者，非吾所顾，故无顾也。“不出于口，不见于色”，言无形也；“四海之人，孰知其则”，言深囿也。",
"　　天之道虚，地之道静。虚则不屈，静则不变，不变则无过，故曰“不伐”。“洁其宫，阙其门”：宫者，谓心也。心也者，智之舍也，故曰“宫”。洁之者，去好过也。门者，谓耳目也。耳目者，所以闻见也。“物固有形，形固有各”，此言不得过实、实不得延名。姑形以形，以形务名，督言正名，故曰“圣人”。“不言之言”，应也。应也者，以其为之人者也。执其名，务其应，所以成，之应之道也。“无为之道，因也。因也者，无益无损也。以其形因为之名，此因之术也。名者，圣人之所以纪万物也。人者立于强，务于善，未于能，动于故者也。圣人无之，无之则与物异矣。异则虚，虚者万物之始也，故曰“可以为天下始”。",
"　　人迫于恶，则失其所好；怵于好，则忘其所恶。非道也。故曰：“不怵乎好，不迫乎恶。”恶不失其理，欲不过其情，故曰：“君子”。“恬愉无为，去智与故”，言虚素也。“其应非所设也，其动非所取也”，此言因也。因也者，舍己而以物为法者也。感而后应，非所设也；缘理而动，非所取也，“过在自用，罪在变化”：自用则不虚，不虚则仵于物矣；变化则为生，为生则乱矣。故道贵因。因者，因其能者，言所用也。“君子之处也若无知”，言至虚也；“其应物也若偶之”，言时适也、若影之象形，响之应声也。故物至则应，过则舍矣。舍矣者，言复所于虚也。",
],
}
GuanZiBookPageModule[37]={
"index":"管子",
"name":"心术下",
"content":[
    "　　形不正者，德不来；中不精者，心不冶。正形饰德，万物毕得，翼然自来，神莫知其极，昭知天下，通于四极。是故曰：无以物乱官，毋以官乱心，此之谓内德。是故意气定，然后反正。气者身之充也，行者正之义也。充不美则心不得，行不正则民不服。是故圣人若天然，无私覆也；若地然，无私载也。私者，乱天下者也。",
"　　凡物载名而来，圣人因而财之，而天下治。实不伤，不乱于天下，而天下治。专于意，一于心，耳目端，知远之证。能专乎？能一乎？能毋卜筮而知凶吉乎？能止乎？能已乎？能毋问于人而自得之于己乎？故曰，思之。思之不得，鬼神教之。非鬼神之力也。其精气之极也。",
"　　一气能变曰精、一事能变曰智。慕选者，所以等事也；极变者，所以应物也。慕选而不乱，极变而不烦，执一之君子执一而不失，能君万物，日月之与同光，天地之与同理。",
"　　圣人裁物，不为物使。心安，是国安也；心治，是国治也。治也者心也，安也者心也。治心在于中，治言出于口，治事加于民，故功作而民从，则百姓治矣。所以操者非刑也，所以危者非怒也。民人操，百姓治，道其本至也，至不至无，非所人而乱。",
"　　凡在有司执制者之利，非道也。圣人之道，若存若亡，援而用之，殁世不亡。与时变而不化，应物而不移，日用之而不化。",
"　　人能正静者，筋肕而骨强；能戴大圆者，体乎大方；镜大清者，视乎大明。正静不失，日新其德，昭知天下，通于四极。金心在中不可匿，外见于形容，可知于颜色。善气迎人，亲如弟兄；恶气迎人，害于戈兵。不言之言，闻于雷鼓。全心之形，明于日月，察于父母。昔者明王之爱天下，故天下可附；暴王之恶天下，故天下可离。故货之不足以为爱，刑之不足以为恶。货者爱之末也，刑者恶之末也。",
"　　凡民之生也，必以正平；所以失之者，必以喜乐哀怒，节怒莫若乐，节乐莫若礼，守礼莫若敬。外敬而内静者，必反其性。",
"　　岂无利事哉？我无利心。岂无安处哉？我无安心。心之中又有心。意以先言，意然后形，形然后思，思然后知。凡心之形，过知失生。",
"　　是故内聚以为原。泉之不竭，表里遂通；泉之不涸，四支坚固。能令用之，被及四固。",
"　　是故圣人一言解之，上察于天，下察于地。",
],
}
GuanZiBookPageModule[38]={
"index":"管子",
"name":"白心",
"content":[
    "　　建当立有，以靖为宗，以时为宝，以政为仪，和则能久。非吾仪虽利不为，非吾当虽利不行，非吾道虽利不取。上之随天，其次随人。人不倡不和，天不始不随。故其言也不废，其事也不随。",
"　　原始计实，本其所生。知其象则索其形，缘其理则知其情，索其端则知其名。故苞物众者，莫大于天地；化物多者，莫多于日月；民之所急，莫急于水火。然而，天不为一物在其时，明君圣人亦不为一人枉其法。天行其所行而万物被其利，圣人亦行其所行而百姓被其利。是故万物均、既夸众百姓平矣。是以圣人之治也，静身以待之，物至而名自治之。正名自治之，奇身名废。名正法备，则圣人无事。不可常居也，不可废舍也。随变断事也，知时以为度。大者宽，小者局，物有所余有所不足。",
"　　兵之出，出于人；其人入，入于身。兵之胜，从于适；德之来，从于身。故曰：祥于鬼者义于人，兵不义不可，强而骄者损其强，弱而骄者亟死亡；强而卑义信其强，弱而卑义免于罪。是故骄之余卑，卑之余骄。",
"　　道者，一人用之，不闻有余；天下行之，不闻不足。此谓道矣。小取焉则小得福，大取焉则大得福，尽行之而天下服，殊无取焉则民反，其身不免于贼。左者，出者也；右者，人者也。出者而不伤人，入者自伤也。不日不月，而事以从；不卜不筮，而谨知吉凶。是谓宽乎形，徒居而致名。去善之言，为善之事，事成而顾反无名。能者无名，从事无事。审量出入，而观物所载。",
"　　孰能法无法乎？始无始乎？终无终乎？弱无弱乎？故曰：美哉岪岪。故曰有中有中，孰能得夫中之衷乎？故曰功成者隳，名成者亏。故曰，孰能弃名与功而还与众人同？孰能弃功与名而还反无成？无成有贵其成也，有成贵其无成也。日极则仄，月满则亏。极之徒仄，满之徒亏，巨之徒灭。孰能己无乎？效夫天地之纪。",
"　　人言善亦勿听，人言恶亦勿听，持而待之，空然勿两之，淑然自清。无以旁言为事成，察而征之，无听辩，万物归之，美恶乃自见。",
"　　天或维之，地或载之。天莫之维，则天以坠矣；地莫之载，则地以沉矣。夫天不坠，地不沉，夫或维而载之也夫！又况于人？人有治之，辟之若夫雷鼓之动也。夫不能自摇者，夫或摇之。夫或者何？若然者也。视则不见，听则不闻，洒乎天下满，不见其塞。集于颜色，知于肌肤，责其往来，莫知其时。薄乎其方也，韕乎其圜也，韕韕乎莫得其门。故口为声也，耳为听也，目有视也，手有指也，足有履也，事物有所比也。",
"　　“当生者生，当死者死”，言有西有东，各死其乡。置常立仪，能守贞乎？常事通道，能官人乎？故书其恶者，言其薄者。上圣之人，口无虚习也，手无虚指也，物至而命之耳。发于名声，凝于体色，此其可谕者也。不发于名声，不凝于体色，此其不可谕者也。及至于至者，教存可也，教亡可也。故曰：济于舟者和于水矣，义于人者祥其神矣。",
"　　事有适，而无适，若有适；觿解，不可解而后解。故善举事者，国人莫知其解。为善乎，毋提提；为不善乎，将陷于刑。善不善，取信而止矣。若左若右，正中而已矣。县乎日月无已也。愕愕者不以天下为忧，剌剌者不以万物为策，孰能弃剌剌而为愕愕乎？",
"　　难言宪术，须同而出。无益言，无损言，近可以免。故曰：知何知乎？谋何谋乎？审而出者彼自来。自知曰稽，知人曰济。知苟适，可为天下周。内固之，一可为长久。论而用之，可以为天下王。",
"　　天之视而精，四璧而知请，壤土而与生。能若夫风与波乎？唯其所欲适。故子而代其父，曰义也，臣而代其君，曰篡也。篡何能歌？武王是也。故曰：孰能去辩与巧，而还与众人同道？故曰：思索精者明益衰，德行修者王道狭，卧名利者写生危，知周于六合之内者，吾知生之有为阻也。持而满之，乃其殆也。名满于天下，不若其已也。名进而身退，天之道也。满盛之国，不可以仕任；满盛之家，不可以嫁子；骄倨傲暴之人，不可与交。",
"　　道之大如天，其广如地，其重如石，其轻如羽。民之所以，知者寡。故曰：何道之近而莫之与能服也，弃近而就远何以费力也。故曰：欲爱吾身，先知吾情，君亲六合，以考内身。以此知象，乃知行情。既知行情，乃知养生。左右前后，周而复所。执仪服象，敬迎来者。今夫来者，必道其道，无迁无衍，命乃长久。和以反中，形性相葆。一以无贰，是谓知道。将欲服之，必一其端，而固其所守。责其往来，莫知其时，索之于天，与之为期，不失其期，乃能得之。故曰：吾语若大明之极，大明之明非爱人不予也。同则相从，反则相距也。吾察反相距，吾以故知古从之同也。",
],
}
GuanZiBookPageModule[39]={
"index":"管子",
"name":"水地",
"content":[
    "　　地者，万物之本原，诸生之根菀也，美恶、贤不官、愚俊之所生也。水者，地之血气，如筋脉之通流者也。故曰：水，具材也。",
"　　何以知其然也？曰：夫水淖弱以清，而好洒人之恶，仁也；视之黑而白，精也；量之不可使概，至满而止，正也；唯无不流，至平而止，义也；人皆赴高，己独赴下，卑也。卑也者，道之室，王者之器也，而水以为都居。",
"　　准也者，五量之宗也；素也者，五色之质也；淡也者，五味之中也。是以水者，万物之准也，诸生之淡也，违非得失之质也，是以无不满，无不居也，集于天地而藏于万物，产于金石，集于诸生，故曰水神。集于草木，根得其度，华得其数，实得其量，乌鲁得之，形体肥大，羽毛丰茂，文理明著。万物莫不尽其几、反其常者，水之内度适也。",
"　　夫玉之所贵者，九德出焉。夫玉温润以泽，仁也；邻以理者，知也；坚而不蹙，义也；廉而不刿，行也；鲜而不垢，洁也；折而不挠，勇也；瑕适皆见，精也；茂华光泽，并通而不相陵，容也；叩之，其音清搏彻远，纯而不杀，辞也；是以人主贵之，藏以为室，剖以为符瑞，九德出焉。",
"　　人，水也。男女精气合，而水流形。三月如咀。咀者何？曰五味。五昧者何？曰五藏。酸主脾，咸主肺，辛主肾，苦主肝，甘主心。五藏已具，而后生肉。脾生隔，肺生骨，肾生脑，肝生革，心生肉。五内已具，而后发为九窍。脾发为鼻，肝发为目，肾发为耳，肺发为窍。五月而成，十月而生。生而目视，耳听，心虑。目之所以视，非特山陵之见也，察于荒忽。耳之所听，非特雷鼓之闻也，察干淑湫。心之所虑，非特知于粗粗也，察于微眇，故修要之精。",
"　　是以水集于玉而九德出焉。凝蹇而为人，而九窍五虑出焉。此乃其精也精粗浊蹇能存而不能亡者也。",
"　　伏暗能存而能亡者，蓍龟与龙是也。龟生于水，发之于火，于是为万物先，为祸福正。龙生干水，被五色而游，故神。欲小则化如蚕蠋，欲大则藏于天下，欲尚则凌于云气，欲下则入千深泉；变化无日，上下无时，谓之神。龟与龙，伏暗能存而能亡者也。",
"　　或世见，或世不见者，牛蟡与庆忌。故涸泽数百岁，谷之不徙，水之不绝者，生庆忌。庆忌者，其状若人，其长四寸，衣黄衣，冠黄冠，戴黄盖，乘小马，好疾驰，以其名呼之，可使千里外一日反报，此涸泽之精也。涸川之精者，生于蟡。蟡者，一头而两身，其形若蛇，其长八尺，以其名呼之，可以取鱼鳖。此涸川水之精也。",
"　　是以水之精粗浊蹇，能存而不能亡者，生人与玉。伏暗能存而亡者，蓍龟与龙。或世见或不见者、蟡与庆忌。故人皆服之，而管子则之。人皆有之，而管子以之。",
"　　是故具者何也？水是也。万物莫不以生，唯知其托者能为之正。具者，水是也，故曰：水者何也？万物之本原也，诸生之宗室也，美恶、贤不肖、愚俊之所产也。何以知其然也？夫齐之水道躁而复，故其民贪粗而好勇；楚之水淖弱而清，故其民轻果而贼；越之水浊重而洎，故其民愚疾而垢；秦之水泔冣而稽，淤滞而杂，故其民贪戾罔而好事；齐晋之水枯旱而运，淤滞而杂，故其民谄谀葆诈，巧佞而好利；燕之水萃下而弱，沈滞而杂，故其民愚戆而好贞，轻疾而易死；宋之水轻劲而清，故其民闲易而好正。是以圣人之化世也，其解在水。故水一则人心正，水清则民心易。一则欲不污，民心易则行无邪。是以圣人之治于世也，不人告也，不户说也，其枢在水。",
],
}
GuanZiBookPageModule[40]={
"index":"管子",
"name":"四时",
"content":[
    "　　管子曰：令有时。无时则必视，顺天之所以来，五漫漫，六惛惛，孰知之哉？唯圣人知四时。不知四时，乃失国之基。不知五谷之故，国家乃路。故天曰信明，地曰信圣，四时曰正。其王信明圣，其臣乃正。何以知其王之信明信圣也？曰：慎使能而善听信之。使能之谓明，听信之谓圣。信明圣者，皆受天赏。使不能为惛，惛而忘也者，皆受天祸。是故上见成事而贵功，则民事接劳而不谋。上见功而贱，则为人下者直，为人上者骄。是故阴阳者，天地之大理也；四时者，阴阳之大经也；刑德者，四时之合也。刑德合于时则生福，诡则生祸。",
"　　然则春夏秋冬将何行？东方曰星，其时曰春，其气曰风，风生木与骨。其德喜嬴，而发出节时。其事：号令修除神位，谨祷弊梗，宗正阳，治堤防，耕芸树艺，正津梁，修沟渎，甃屋行水，解怨赦罪，通四方。然则柔风甘雨乃至，百姓乃寿，百虫乃蕃，此谓星德。星者掌发，为风。是故春行冬政则雕，行秋政则霜，行夏政则欲。是故春三月以甲乙之日发五政。一政曰：论幼孤，舍有罪；二政曰：赋爵列，授禄位；三政曰：冻解修沟渎，复亡人；四政曰：端险阻，修封疆，正千伯；五政曰：无杀麑夭，毋蹇华绝芋。五政苟时，春雨乃来。",
"　　南方曰日，其时曰夏，其气曰阳，阳生火与气。其德施舍修乐。其事：号令赏赐赋爵，受禄顺乡，谨修神祀，量功赏贤，以动阳气。九暑乃至，时雨乃降，五谷百果乃登，此谓日德。日掌赏，赏为暑，夏行春政则风，行秋政则水，行冬政则落。是故夏三月以丙丁之日发五政。一政曰：求有功发劳力者而举之；二政曰：开久墳，发故屋，辟故卵以假贷；三政曰：令禁扇去笠，毋扱免，除急漏田庐；四政曰：求有德赐布施于民者而赏之；五政曰：令禁罝设禽兽，毋杀飞鸟。五政苟时，夏雨乃至也。",
"　　中央曰土，土德实辅四时入出，以风雨节，土益力。土生皮肌肤。其德和平用均，中正无私，实辅四时：春嬴育，夏养长。秋聚收，冬闭藏。大寒乃极，国家乃昌，四方乃服，此谓岁德。岁掌和，和为雨。",
"　　西方曰辰，其时曰秋，其气曰阴，阴生金与甲。其德忧哀、静正、严顺，居不敢淫佚。其事：号令毋使民淫暴，顺旅聚收，量民资以畜聚。赏彼群干，聚彼群材，百物乃收，使民毋怠。所恶其察，所欲必得，我信则克。此谓辰德。辰掌收，收为阴。秋行春政则荣，行夏政则水，行冬政则耗。是故秋三月以庚辛之日发五政：一政曰：禁博塞，圉小辩，斗译跽。二政曰：毋见五兵之刃；三政曰：慎旅农，趣聚收；四政曰：补缺塞坼；五政曰：修墙垣，周门闾。五政苟时，五谷皆入。",
"　　北方曰月，其时曰冬，其气曰寒，寒生水与血。其德淳越、温怒、周密。其事，号令修禁徙民，令静止，地乃不泄，断刑致罚，无赦有罪，以符阴气。大寒乃至，甲兵乃强，五谷乃熟，国家乃昌，四方乃备，此谓月德。月掌罚，罚为寒。冬行春政则泄，行夏政则雷，行秋政则旱。是故冬三月以壬癸之日发五政。一政曰：论孤独，恤长老；二政曰：善顺阴，修神祀，赋爵禄，授备位；三政曰：效肢计，毋发山川之藏；四政曰：捕奸遁，得盗贼者有赏；五政曰：禁迁徙，止流民，圉分异。五政苟时，冬事不过，所求必得，所恶必伏。",
"　　是故春凋，秋荣，冬雷，夏有霜雪，此皆气之贼也。刑德易节失次，则贼气遬至；贼气遬至，则国多灾殃。是故圣王务时而寄政焉，作教而寄武，作祀而寄德焉。此三者圣王所以合于天地之行也。日掌阳，月掌阴，星掌和。阳为德，阴为刑，和为事。是故日食，则失德之国恶之；月食，则失刑之国恶之；彗星见，则失和之国恶之；风与日争明，则失生之国恶之。是故，圣王日食则修德，月食则修刑，彗星见则修和，风与日争明则修生。此四者，圣王所以免于天地之诛也。信能行之，五谷蕃息，六畜殖，而甲兵强。治积则昌，暴虐积则亡。",
"　　道生天地，德出贤人。道生德，德生正，正生事。是以圣王治天下，穷则反，终则始。德始于春，长于夏；刑始于秋，流于冬。刑德不失，四时如一。刑德离乡，时乃逆行。作事不成，必有大殃。月有三政，王事必理，以为久长。不中者死，失理者亡。国有四时，固执王事，四守有所，三政执辅。",
],
}
GuanZiBookPageModule[41]={
"index":"管子",
"name":"五行",
"content":[
    "　　一者本也，二者器也，三者充也，治者四也，教者五也，守者六也，立者七也，前者八也，终者九也，十者然后具五官于六府也，五声于六律也。",
"　　六月日至，是故人有六多，六多所以街天地也。天道以九制，地理以八制，人道以六制。以天为父，以地为母，以开乎万物，以总一统。通乎九制、六府、三充，而为明天子。修槩水上，以待乎天堇；反五藏，以视不亲；治祀之下，以观地位；货曋神庐，合于精气。已合而有常，有常而有经。审合其声，修十二钟，以律人情。人情已得，万物有极，然后有德。",
"　　故通乎阳气，所以事天也，经纬日月，用之于民。通乎阴气，所以事地也，经纬星历，以视其离。通若道然后有行，然则神筮不灵，神龟不卜，黄帝泽参，治之至也。昔者黄帝得蚩尤而明于天道，得大常而察于地利，得奢龙而辩于东方，得祝融而辩于南方，得大封而辩于西方，得后土而辩于北方。黄帝得六相而天地治，神明至。蚩尤明乎天道，故使为当时；大常察乎地利，故使为廪者：奢龙辩乎东方，故使为土师，祝融辩乎南方，故使为司徒；大封辩于西方，故使为司马；后土辩乎北方，故使为李。是故春者土师也，夏者司徒也，秋者司马也，冬者李也。",
"　　昔黄帝以其缓急作五声，以政五钟。令其五钟，一曰青钟大音，二曰赤钟重心，三曰黄钟洒光，四曰景钟昧其明，五曰黑钟隐其常。五声既调，然后作立五行以正天时，五官以正人位。人与天调，然后天地之美生。",
"　　日至，睹甲子木行御。天子出令，命左右士师内御。总别列爵，论贤不肖士吏。赋秘，赐赏于四境之内，发故粟以田数。出国，衡顺山林，禁民斩木，所以爱草木也。然则冰解而冻释，草木区萌，赎蛰虫卵菱。春辟勿时，苗足本。不疠雏鷇，不夭麑□，毋傅速。亡伤襁褓。时则不调。七十二日而毕。",
"　　睹丙子火行御。天子出令，命行人内御。令掘沟浍，津旧涂。发藏，任君赐赏。君子修游驰，以发地气。出皮币，命行人修春秋之礼于天下诸侯，通天下遇者兼和。然则天无疾风，草木发奋，郁气息，民不疾而荣华蕃。七十二日而毕。",
"　　睹戊子土行御。天子出令，命左右司徒内御。不诛不贞，农事为敬。大扬惠言，宽刑死，缓罪人。出国，司徒令，命顺民之功力，以养五谷。君子之静居，而农夫修其功力极。然则天为粤宛，草木养长，五谷蕃实秀大，六畜牺牲具，民足财，国富，上下亲，诸侯和。七十二日而毕。",
"　　睹庚子金行御。天子出令，命祝宗选禽兽之禁、五谷之先熟者，而荐之祖庙与五祀，鬼神享其气焉，君子食其味焉。然则凉风至，白露下，天子出令，命左右司马（衍）组甲厉兵，合什为伍，以修于四境之内，谀然告民有事，所以待天地之杀敛也。然则昼炙阳，夕下露，地竞环，五谷邻熟，草木茂实，岁农丰年大茂。七十二日而毕。",
"　　睹王子水行御。天子出令，命左右使人内御。御其气足，则发而止；其气不足，则发撊渎盗贼。数劋竹箭，伐檀柘，令民出猎，禽兽不释巨少而杀之，所以贵天地之所闭藏也。然则羽卵者不段，毛胎者不贕，孕妇不销弃，草木根本美。七十二日而毕。",
"　　睹甲子木行御。天子不赋不赐赏，而大斩伐伤，君危，不杀太子危；家人夫人死，不然则长子死。七十二日而毕。睹丙子火行御。天子敬行急政，旱札，苗死，民厉。七十二日而毕。睹戊子土行御。天子修宫室，筑台榭，君危；外筑城郭，臣死。七十二日而毕。睹庚子金行御。天子攻山击石，有兵作战而败，士死，丧执政。七十二日而毕。睹壬子水行御。天子决塞，动大水，王后夫人薨，不然则羽卵者段，毛胎者贕，孕妇销弃，草木根本不美。七十二日而毕。",
],
}
GuanZiBookPageModule[42]={
"index":"管子",
"name":"势",
"content":[
    "　　战而惧水，此谓澹灭。小事不从，大事不吉。战而惧险，此谓迷中。分其师众，人既迷芒，必其将亡之道。",
"　　动静者比于死，动作者比于丑，动信者比于距，动诎者比于避。夫静与作，时以为主人，时以为客，贵得度。知静之修，居而自利；知作之从，每动有功。故曰，无为者帝，其此之谓矣。",
"　　逆节萌生，天地未形，先为之政，其事乃不成，缪受其刑。天因人，圣人因天。天时不作勿为客，人事不起勿为始。慕和其众，以修天地之从。人先生之，天地刑之，圣人成之，则与天同极。正静不争，动作不贰，素质不留，与地同极。未得天极，则隐于德；已得天极，则致其力。既成其功，顺守其从，人不能代。",
"　　成功之道，嬴缩为宝。毋亡天极，究数而止。事若未成，毋改其形，毋失其始，静民观时，待令而起。故曰，修阴阳之从，而道天地之常。嬴嬴缩缩，因而为当；死死生生，因天地之形。天地之形，圣人成之。小取者小利，大取者大利，尽行之者有天下。",
"　　故贤者诚信以仁之，慈惠以爱之，端政象不敢以先人，中静不留，裕德无求，形于女色。其所处者，柔安静乐，行德而不争，以待天下之濆作也。故贤者安徐正静，柔节先定，行于不敢，而立于不能，守弱节而坚处之。故不犯天时，不乱民功，秉时养人，先德后刑，顺于天，微度人。",
"　　善周者，明不能见也；善明者，周不能蔽也。大明胜大周，则民无大周也；大周胜大明，则民无大明也。大周之先，可以奋信；大明之祖，可以代天。下索而不得，求之招摇之下。",
"　　兽厌走，而有伏网罟。一偃一侧，不然不得。大文三曾，而贵义与德；大武三曾，而偃武与力。",
],
}
GuanZiBookPageModule[43]={
"index":"管子",
"name":"正",
"content":[
    "　　制断五刑，各当其名，罪人不怨，善人不惊，曰刑。正之、服之、胜之、饰之，必严其令，而民则之，曰政。如四时之不貣，如垦辰之不变，如宵如昼，如阴如阳，如日月之明，曰法。爱之、生之、养之、成之，利民不德，天下亲之，曰德。无德无怨，无好无恶，万物崇一，阴阳同度，曰道，刑以弊之，政以命之，法以遏之，德以养之，道以明之。刑以弊之，毋失民命；令之以终其欲，明之毋径；遏之以绝其志意，毋使民幸；养之以化其恶，必自身始；明之以察其生，必修其理。致刑，其民庸心以蔽；致政，其民服信以听；致德，其民和平以静；致道，其民付而不争，罪人当名曰刑，出令时当曰政，当故不改曰法，爱民无私曰德，会民所聚曰道。",
"　　立常行政，能服信乎？中和慎敬，能日新乎？正衡一静，能守慎乎？废私立公，能举人乎？临政官民，能后其身乎？能服信政，此谓正纪。能服日新，此谓行理。守慎正名，伪诈自止。举人无私，臣德威道。能后其身，上佐天子。",
],
}
GuanZiBookPageModule[44]={
"index":"管子",
"name":"九变",
"content":[
    "　　凡民之所以守战至死而不德其上者，有数以至焉。曰：大者亲戚坟墓之所在也，田宅富厚足居也。不然，则州县乡党与宗族足怀乐也。不然，则上之教训、习俗，慈爱之于民也厚，无所往而得之。不然，则山林泽谷之利足生也。不然，则地形险阻，易守而难攻也。不然，则罚严而可畏也。不然，则赏明而足劝也。不然，则有深怨于敌人也。不然，则有厚功干上也。此民之所以守战至死而不德其上者也。",
"　　今恃不信之人，而求以智；用不守之民，而欲以固；将不战之卒，而幸以胜，此兵之三暗也。",
],
}
GuanZiBookPageModule[45]={
"index":"管子",
"name":"任法",
"content":[
    "　　圣君任法而不任智，任数而不任说，任公而不任私，任大道而不任小物，然后身佚而天下治。失君则不然，合法而任智，故民舍事而好誉；舍数而任说，故民舍实而好言；舍公而好私，故民离法而妄行；舍大道而任小物，故上劳烦，百姓迷惑，而国家不治。圣君则不然，守道要，处佚乐，驰骋弋猎，钟鼓竽瑟，宫中之乐，无禁圉也。不思不虑，不忧不图，利身体，便形躯，养寿命，垂拱而天下治。是敌人主有能用其道者，不事心，不劳意，不动力，而土地自辟，囷仓自实，蓄积自多，甲兵自强，群臣无诈伪，百官无奸邪，奇术技艺之人莫敢高言孟行以过其情、以遇其主矣。",
    "　　昔者尧之治天下也，犹埴之在埏也，唯陶之所以为；犹金之在垆；恣冶之所以铸。其民引之而来，推之而往，使之而成，禁之而止。故尧之治也，善明法禁之令而已矣。黄帝之治天下也，其民不引而来，不推而往，不使而成，不禁而止。故黄帝之治也，置法而不变，使民安其法者也。",
    "　　所谓仁义礼乐者，皆出于法。此先圣之所以一民者也。《周书》曰：“国法，法不一，则有国者不祥；民不道法，则不祥；国更立法以典民，则不祥；群臣不用礼义教训，则不祥；百官服事者离法而治，则不祥。”故曰：法者不可不恒也，存亡治乱之所以出，圣君所以为天下大仪也。君臣上下贵贱皆发焉，故曰“法”。",
    "　　古之法也，世无请谒任举之人，无间识博学辩说之士，无伟服，无奇行，皆囊于法以事其主。故明王之所恒者二：一曰明法而固守之，二曰禁民私而收使之，此二者主之所恒也，夫法者，上之所以一民使下也；私者，下之所以侵法乱主也。故圣君置仪设法而固守之，然故谌杵习士闻识博学之人不可乱也，众强富贵私勇者不能侵也，信近亲爱者不能离也，珍怪奇物不能惑也，万物百事非在法之中者不能动也。故法者，天下之至道也，圣君之实用也。",
    "　　今天下则不然，皆有善法而不能守也。然故谌杵习士闻识博学之士能以其智乱法惑上，众强富贵私勇者能以其威犯法侵陵，邻国诸侯能以其权置子立相，大臣能以其私附百姓，剪公财以禄私士。凡如是而求法之行，国之治，不可得也。",
    "　　圣君则不然，卿相不得剪其私，群臣不得辟其所亲爱，圣君亦明其法而固守之，群臣修通辐凑以事其主，百姓辑睦听令道法以从其事。故曰：有生法，有守法，有法于法。夫生法者，君也；守法者，臣也；法于法者，民也。君臣上下贵贱皆从法，此谓为大治。",
    "　　故主有三术：夫爱人不私赏也，恶人不私罚也，置仪设法以度量断者，上主也。爱人而私赏之，恶人而私罚之，倍大臣，离左右，专以其心断者，中主也。臣有所爱而为私赏之，有所恶而为私罚之，倍其公法，损其正心，专听其大臣者，危主也。故为人主者，不重爱人，不重恶人；重爱曰失德，重恶曰失威。威德皆失，则主危也。",
    "　　故明王之所操者六：生之、杀之、富之、贫之、贵之、贱之。此六柄者，主之所操也。主之所处者四：一曰文，二曰武，三曰威，四曰德。此四位者，主之所处也。借人以其所操，命曰夺柄；借人以其所处，命曰失位。夺柄失位，而求令之行，不可得也。法不平，令不全，是亦夺柄失位之道也。故有为枉法，有为毁令，此圣君之所以自禁也。故贵不能威，富不能禄，贱不能事，近不能亲，美不能淫也。植固而不动，奇邪乃恐，奇革而邪化，令往而民移。故圣君失度量，置仪法，如天地之坚，如列星之固，如日月之明，如四时之信，然故令往而民从之。而失君则不然，法立而还废之，令出而后反之，枉法而从私，毁令而不全。是贵能威之，富能禄之，贱能事之，近能亲之，美能淫之也。此五者不禁于身，是以群臣百姓人挟其私而幸其主，彼幸而得之，则主日侵。彼幸而不得，则怨日产。夫日侵而产怨，此失君之所慎也。",
    "　　凡为主而不得用其法，不适其意，顾臣而行，离法而听贵臣，此所谓贵而威之也。富人用金玉事主而来焉，主离法而听之，此所谓富而禄之也。贱人以服约卑敬悲色告诉其主，主因离法而听之，所谓贱而事之也。近者以逼近亲爱有求其主，主因离法而听之，此谓近而亲之也。美者以巧言令色请其主，主因离法而听之，此所谓美而淫之也。",
    "　　治世则不然，不知亲疏、远近、贵贱、美恶，以度量断之。其杀戮人者不怨也，其赏赐人者不德也。以法制行之，如天地之无私也，是以官无私论，士无私议，民无私说，皆虚其匈以听于上。上以公正论，以法制断，故任天下而不重也。今乱君则不然，有私视也，故有不见也；有私听也，故有不闻也；有私虑也，故有不知也。夫私者，壅蔽失位之道也。上舍公法而听私说，故群臣百姓皆设私立方以教于国，群党比周以立其私，请谒任举以乱公法，人用其心以幸于上。上无度量以禁之，是以私说日益，而公法日损，国之不冶，从此产矣。",
    "　　夫君臣者，天地之位也；民者，众物之象也。各立其所职以待君令，群臣百姓安得各用其心而立私乎？故遵主令而行之，虽有伤败，无罚；非主令而行之，虽有功利，罪死。然故下之事上也，如响之应声也；臣之事主也，如影之从形也。故上令而下应，主行而臣从，此治之道也。夫非主令而行，有功利，因赏之，是教妄举也；遵主令而行之，有伤败，而罚之，是使民虑利害而离法也。群臣百姓人虑利害，而以其私心举措，则法制毁而令不行矣。",
],
}
GuanZiBookPageModule[46]={
"index":"管子",
"name":"明法",
"content":[
    "　　所谓治国者，主道明也；所谓乱国者，臣术胜也。夫尊君卑臣，非计亲也，以势胜也；百官识，非惠也，刑罚必也。故君臣共道则乱，专授则失。夫国有四亡：令求不出谓之灭，出而道留谓之拥，下情求不上通谓之塞，下情上而道止谓之侵。故夫灭、侵、塞、拥之所生，从法之不立也。是故先王之治国也，不淫意于法之外，不为惠于法之内也。动无非法者，所以禁过而外私也。威不两错，政不二门。以法治国则举错而已。是故有法度之制者，不可巧以诈伪；有权衡之称者，不可欺以轻重；有寻丈之数者，不可差以长短。今主释法以誉进能，则臣离上而下比周矣；以党举官，则民务交而不求用矣。是故官之失其治也，是主以誉为赏，以毁为罚也。然则喜赏恶罚之人，离公道而行私木矣。比周以相为慝，是忘主私佼，以进其誉。故交众者誉多，外内朋党，虽有大奸，其蔽主多矣。是以忠臣死于非罪，而邪臣起于非功。所死者非罪，所起者非功也，然则为人臣者重私而轻公矣。十至私人之门，不一至于庭；百虑其家，不一图国。属数虽众，非以尊君也；百官虽具，非以任国也；此之谓国无人。国无人者，非朝臣之衰也，家与家务于相益，不务尊君也；大臣务相贵，而不任国；小臣持禄养交，不以官为事，故官失其能。是故先王之治国也，使法择人，不自举也；使法量功，不自度也。故能匿而不可蔽，败而不可饰也；誉者不能进，而诽者不能退也。然则君臣之间明别，明别则易治也，主虽不身下为，而守法为之可也。",
],
}
GuanZiBookPageModule[47]={
"index":"管子",
"name":"第四十七章·不为而成",
"content":["不出户，知天下﹔不窥牖，见天道。其出弥远，其知弥少。是以圣人不行而知，不见而名，不为而成。"],
}
GuanZiBookPageModule[48]={
"index":"管子",
"name":"第四十八章·为学日益",
"content":["为学日益，为道日损，损之又损，以至于无为，无为而无不为。取天下常以无事，及其有事，不足以取天下。"],
}
GuanZiBookPageModule[49]={
"index":"管子",
"name":"第四十九章·圣无常心",
"content":["圣人无常心，以百姓心为心。善者吾善之，不善者吾亦善之，德善。信者吾信之，不信者亦信之，德信。圣人在天下歙歙，为天下浑其心，圣人皆孩之。"],
}
GuanZiBookPageModule[50]={
"index":"管子",
"name":"第五十章·出生入死",
"content":["出生入死，生之徒十有三，死之徒十有三。人之生，动之于死地亦十有三。夫何故。以其生之厚。盖闻善摄生者，陆行不遇兕[sì]虎，入军不被甲兵。兕无所投其角，虎无所措其爪，兵无所容其刃。夫何故，以其无死地。"],
}
GuanZiBookPageModule[51]={
"index":"管子",
"name":"第五十一章·尊道贵德",
"content":["道生之，德畜之，物形之，势成之，是以万物莫不尊道而贵德。道之尊，德之贵，夫莫之命而常自然。故道生之，德畜之，长之育之，亭之毒之，养之覆之。生而不有，为而不恃，长而不宰，是谓元德。"],
}
GuanZiBookPageModule[52]={
"index":"管子",
"name":"第五十二章·天下有始",
"content":["天下有始，以为天下母。既得其母，以知其子；既知其子，复守其母，没身不殆。塞其兑，闭其门，终身不勤；开其兑，济其事，终身不救。见小曰明，守柔曰强。用其光，复归其明，无遗身殃﹔是谓习常。"],
}
GuanZiBookPageModule[53]={
"index":"管子",
"name":"第五十三章·行于大道",
"content":["使我介然有知，行于大道，惟施是畏。大道甚夷，而民好径。朝甚除，田甚芜，仓甚虚。服文彩，带利剑，厌饮食，财货有余，是为盗夸，非道也哉。"],
}
GuanZiBookPageModule[54]={
"index":"管子",
"name":"第五十四章·善抱大道",
"content":["善建者不拔，善抱者不脱，子孙以祭祀[sì]不辍[chuò]。修之于身，其德乃真﹔修之于家，其德乃余﹔修之于乡，其德乃长﹔修之于国，其德乃丰﹔修之于天下，其德乃普。故以身观身，以家观家，以乡观乡，以国观国，以天下观天下。吾何以知天下然哉？以此。"],
}
GuanZiBookPageModule[55]={
"index":"管子",
"name":"第五十五章·物壮则老",
"content":["含德之厚，比于赤子。蜂虿[chài]虺[huǐ]蛇不螫[zhē]，猛兽不据，攫[jué]鸟不搏。骨弱筋柔而握固，未知牝[pìn]牡[mǔ]之合而全作，精之至也。终日号而不嗄[shà]，和之至也。知和曰常，知常曰明，益生曰祥。心使气曰强。物壮则老，谓之不道，不道早已。"],
}
GuanZiBookPageModule[56]={
"index":"管子",
"name":"第五十六章·知者不言",
"content":["知者不言，言者不知。塞其兑，闭其门，挫其锐，解其纷，和其光，同其尘，是谓玄同。故不可得而亲，不可得而疏，不可得而利，不可得而害，不可得而贵，不可得而贱。故为天下贵。"],
}
GuanZiBookPageModule[57]={
"index":"管子",
"name":"第五十七章·以正治国",
"content":["以正治国，以奇用兵，以无事取天下。吾何以知其然哉？以此。天下多忌讳，而民弥贫。民多利器，国家滋昏。人多伎[jì]巧，奇物滋起。法令滋彰，盗贼多有。故圣人云我无为而民自化，我好静而民自正，我无事而民自富，我无欲而民自朴。"],
}
GuanZiBookPageModule[58]={
"index":"管子",
"name":"第五十八章·福祸相倚",
"content":["其政闷闷，其民淳淳﹔其政察察，其民缺缺。祸兮福之所倚，福兮祸之所伏。孰知其极，其无正。正复为奇，善复为妖，人之迷，其日固久。是以圣人方而不割，廉而不刿[guì]，直而不肆，光而不耀。"],
}
GuanZiBookPageModule[59]={
"index":"管子",
"name":"第五十九章·长生久视",
"content":["治人事天，莫若啬。夫唯啬，是谓早服。早服谓之重积德，重积德，则无不克。无不克，则莫知其极。莫知其极，可以有国，有国之母，可以长久。是谓深根固柢[dǐ]，长生久视之道。"],
}
GuanZiBookPageModule[60]={
"index":"管子",
"name":"第六十章·治国烹鲜",
"content":["治大国若烹小鲜，以道莅天下，其鬼不神﹔非其鬼不神，其神不伤人﹔非其神不伤人，圣人亦不伤人。夫两不相伤，故德交归焉。"],
}
GuanZiBookPageModule[61]={
"index":"管子",
"name":"第六十一章·各得其所",
"content":["大国者下流，天下之交，天下之牝。牝常以静胜牡，以静为下。故大国以下小国，则取小国﹔小国以下大国，则取大国邦。故或下以取，或下而取。大国不过欲兼畜人，小国不过欲入事人。夫两者各得所欲，大者宜为下。"],
}
GuanZiBookPageModule[62]={
"index":"管子",
"name":"第六十二章·万物之奥",
"content":["道者，万物之奥，善人之宝，不善人之所保。美言可以市，尊行可以加人。人之不善，何弃之有？故立天子，置三公，虽有拱璧以先驷马，不如坐进此道。古之所以贵此道者何，不曰以求得，有罪以免邪，故为天下贵。"],
}
GuanZiBookPageModule[63]={
"index":"管子",
"name":"第六十三章·为大于细",
"content":["为无为，事无事，味无味。大小多少，报怨以德，图难于其易，为大于其细。天下难事，必作于易；天下大事，必作于细。是以圣人终不为大，故能成其大。夫轻诺必寡信，多易必多难。是以圣人犹难之，故终无难矣。"],
}
GuanZiBookPageModule[64]={
"index":"管子",
"name":"第六十四章·慎终如始",
"content":["其安易持，其未兆易谋。其脆易泮[pàn]，其微易散。为之于未有，治之于未乱。合抱之木生于毫末，九层之台起于累土，千里之行始于足下。民之从事，长于几成而败之，慎终如始则无败事。是以圣人欲不欲，不贵难得之货；学不学，复众人之所过，以辅万物之自然，而不敢为。"],
}
GuanZiBookPageModule[65]={
"index":"管子",
"name":"第六十五章·善为道者",
"content":["古之善为道者，非以明民，将以愚之。民之难治，以其智多。故以智治国国之贼，不以智治国国之福。知此两者亦楷式，常知楷式，是谓玄德。玄德深矣，远矣，与物反矣。然后乃至大顺。"],
}
GuanZiBookPageModule[66]={
"index":"管子",
"name":"第六十六章·不争之争",
"content":["江海之所以能为百谷王者，以其善下之，故能为百谷王。是以欲上民，必以言下之﹔欲先民，必以身后之。是以圣人处上而民不重，处前而民不害，是以天下乐推而不厌。以其不争，故天下莫能与之争。"],
}
GuanZiBookPageModule[67]={
"index":"管子",
"name":"第六十七章·持保三宝",
"content":["天下皆谓我道大，似不肖。夫唯大，故似不肖。若肖，久矣其细也夫。我有三宝，持而保之：一曰慈，二曰俭，三曰不敢为天下先。慈故能勇，俭故能广，不敢为天下先，故能成器长。今舍慈且勇，舍俭且广，舍后且先，死矣。夫慈，以战则胜，以守则固。天将救之，以慈卫之。"],
}
GuanZiBookPageModule[68]={
"index":"管子",
"name":"第六十八章·不争之德",
"content":["善为士者不武，善战者不怒，善胜敌者不与，善用人者为之下。是谓不争之德，是谓用人之力，是谓配天，古之极。"],
}
GuanZiBookPageModule[69]={
"index":"管子",
"name":"第六十九章·哀者胜矣",
"content":["用兵有言：吾不敢为主而为客，不敢进寸而退尺。是谓行无行，攘无臂，执无兵，扔无敌。祸莫大于轻敌，轻敌几丧吾宝。故抗兵相若，哀者胜矣。"],
}
GuanZiBookPageModule[70]={
"index":"管子",
"name":"第七十章·被褐怀玉",
"content":["吾言甚易知，甚易行。天下莫能知，莫能行。言有宗，事有君。夫唯无知，是以不我知。知我者希，则我者贵。是以圣人被褐[hè]而怀玉。"],
}
GuanZiBookPageModule[71]={
"index":"管子",
"name":"第七十一章·知不知矣",
"content":["知不知上，不知知病。夫唯病病，是以不病。圣人不病，以其病病，是以不病。"],
}
GuanZiBookPageModule[72]={
"index":"管子",
"name":"第七十二章·自知自爱",
"content":["民不畏威，则大威至。无狎[xiá]其所居，无厌其所生。夫唯不厌，是以不厌。是以圣人自知不自见，自爱不自贵，故去彼取此。"],
}
GuanZiBookPageModule[73]={
"index":"管子",
"name":"第七十三章·天网恢恢",
"content":["勇于敢则杀，勇于不敢则活。此两者或利或害。天之所恶，孰知其故，是以圣人犹难之。天之道，不争而善胜，不言而善应，不召而自来，繟[chǎn]然而善谋。天网恢恢，疏而不失。"],
}
GuanZiBookPageModule[74]={
"index":"管子",
"name":"第七十四章·民不畏死",
"content":["民不畏死，奈何以死惧之。若使民常畏死，而为奇者，吾得执而杀之，孰敢。常有司杀者杀，夫代司杀者杀，是谓代大匠斲[zhuó]，夫代大匠斲者，希有不伤其手矣。"],
}
GuanZiBookPageModule[75]={
"index":"管子",
"name":"第七十五章·民之轻死",
"content":["民之饥，以其上食税之多，是以饥。民之难治，以其上之有为，是以难治。民之轻死，以其上求生之厚，是以轻死。夫唯无以生为者，是贤于贵生。"],
}
GuanZiBookPageModule[76]={
"index":"管子",
"name":"第七十六章·柔弱处上",
"content":["人之生也柔弱，其死也坚强。万物草木之生也柔脆，其死也枯槁。故坚强者死之徒，柔弱者生之徒。是以兵强则不胜，木强则兵。强大处下，柔弱处上。"],
}
GuanZiBookPageModule[77]={
"index":"管子",
"name":"第七十七章·功成不处",
"content":["天之道，其犹张弓欤[yú]。高者抑之，下者举之﹔有余者损之，不足者补之。天之道，损有余而补不足；人之道则不然，损不足以奉有余。孰能有余以奉天下？唯有道者。是以圣人为而不恃，功成而不处，其不欲见贤。"],
}
GuanZiBookPageModule[78]={
"index":"管子",
"name":"第七十八章·柔之胜刚",
"content":["天下莫柔弱于水，而攻坚强者莫之能胜，以其无以易之。弱之胜强，柔之胜刚，天下莫不知，莫能行。是以圣人云：受国之垢，是谓社稷主﹔受国不祥，是为天下王。正言若反。"],
}
GuanZiBookPageModule[79]={
"index":"管子",
"name":"第七十九章·报怨以德",
"content":["和大怨，必有余怨，安可以为善。是以圣人执左契，而不责于人。有德司契，无德司彻。天道无亲，常与善人。"],
}
GuanZiBookPageModule[80]={
"index":"管子",
"name":"第八十章·小国寡民",
"content":["小国寡民。使有什伯之器而不用﹔使民重死而不远徙。虽有舟舆[yú]，无所乘之；虽有甲兵，无所陈之；使民复结绳而用之。甘其食，美其服，安其居，乐其俗。邻国相望，鸡犬之声相闻，民至老死不相往来。"],
}
GuanZiBookPageModule[81]={
"index":"管子",
"name":"第八十一章·为而不争",
"content":["信言不美，美言不信。善者不辩，辩者不善。知者不博，博者不知。圣人不积，既以为人己愈有，既以与人己愈多。天之道，利而不害﹔圣人之道，为而不争。"],
}
module.exports={GuanZiBookPageModule:GuanZiBookPageModule}