
import React, {Component} from 'react';
import {AppRegistry,View,Text} from 'react-native';


var JiBookPageModule = new Array()



JiBookPageModule[0] = {"index":"三十六计","name":"三十六计",
"content":["《三十六计》或称“三十六策”，是指中国古代三十六个兵法策略，语源于南北朝，成书于明清。它是根据我国古代卓越的军事思想和丰富的斗争经验总结而成的兵书，是中华民族悠久文化遗产之一。"
],
}

JiBookPageModule[1]={
"index":"三十六计",
"name":"胜战计·瞒天过海",
"content":["　　备周则意怠，常见则不疑。阴在阳之内，不在阳之对。太阳，太阴。"],
}
JiBookPageModule[2]={
"index":"三十六计",
"name":"胜战计·围魏救赵",
"content":["　　共敌不如分敌，敌阳不如敌阴。"],
}
JiBookPageModule[3]={
"index":"三十六计",
"name":"胜战计·借刀杀人",
"content":["　　敌已明，友未定，引友杀敌。不自出力，以《损》推演。"],
}
JiBookPageModule[4]={
"index":"三十六计",
"name":"胜战计·以逸待劳",
"content":["　　困敌之势，不以战。损刚益柔。"],
}
JiBookPageModule[5]={
"index":"三十六计",
"name":"胜战计·趁火打劫",
"content":["　　敌之害大，就势取利，刚决柔也。"],
}
JiBookPageModule[6]={
"index":"三十六计",
"name":"胜战计·声东击西",
"content":["　　敌志乱萃，不虞。坤下兑上之象，利其不自主而取之。"],
}
JiBookPageModule[7]={
"index":"三十六计",
"name":"敌战计·无中生有",
"content":["　　诳也，非诳也，实其所诳也。少阴、太阴、太阳。"],
}
JiBookPageModule[8]={
"index":"三十六计",
"name":"敌战计·暗渡陈仓",
"content":["　　示之以动，利其静而有主，“益动而巽”。"],
}
JiBookPageModule[9]={
"index":"三十六计",
"name":"敌战计·隔岸观火",
"content":["　　阳乖序乱，阴以待逆。暴戾恣睢，其势自毙。顺以动豫，豫顺以动。"],
}
JiBookPageModule[10]={
"index":"三十六计",
"name":"敌战计·笑里藏刀",
"content":["　　信而安之，阴以图之。备而后动，勿使有变。刚中柔外也。"],
}
JiBookPageModule[11]={
"index":"三十六计",
"name":"敌战计·李代桃僵",
"content":["　　势必有损，损阴以益阳。"],
}
JiBookPageModule[12]={
"index":"三十六计",
"name":"敌战计·顺手牵羊",
"content":["　　微隙在所必乘，微利在所必得。少阴，少阳。"],
}
JiBookPageModule[13]={
"index":"三十六计",
"name":"攻战计·打草惊蛇",
"content":["　　疑以叩实，察而后动。复者，阴之媒也。"],
}
JiBookPageModule[14]={
"index":"三十六计",
"name":"攻战计·借尸还魂",
"content":["　　有用者，不可借；不能用者，求借。借不能用者而用之。匪我求童蒙，童蒙求我。"],
}
JiBookPageModule[15]={
"index":"三十六计",
"name":"攻战计·调虎离山",
"content":["　　待天以困之，用人以诱之，往蹇来连。"],
}
JiBookPageModule[16]={
"index":"三十六计",
"name":"攻战计·欲擒故纵",
"content":["　　逼则反兵，走则减势。紧随勿迫，累其气力，消其斗志，散而后擒，兵不血刃。需，有孚，光。"],
}
JiBookPageModule[17]={
"index":"三十六计",
"name":"攻战计·抛砖引玉",
"content":["　　类以诱之，击蒙也。"],
}
JiBookPageModule[18]={
"index":"三十六计",
"name":"攻战计·擒贼擒王",
"content":["　　摧其坚，夺其魁，以解其体。龙战于野，其道穷也。"],
}
JiBookPageModule[19]={
"index":"三十六计",
"name":"混战计·釜底抽薪",
"content":["　　不敌其力，而消其势，兑下乾上之象。"],
}
JiBookPageModule[20]={
"index":"三十六计",
"name":"混战计·混水摸鱼",
"content":["　　乘其阴乱，利其弱而无主，随，以向晦入宴息。"],
}
JiBookPageModule[21]={
"index":"三十六计",
"name":"混战计·金蝉脱壳",
"content":["　　存其形，完其势；友不疑，敌不动。巽而止蛊。"],
}
JiBookPageModule[22]={
"index":"三十六计",
"name":"混战计·关门捉贼",
"content":["　　小敌困之。剥，不利有攸往。"],
}
JiBookPageModule[23]={
"index":"三十六计",
"name":"混战计·远交近攻",
"content":["　　形禁势格，利从近取，害以远隔。上火下泽。"],
}
JiBookPageModule[24]={
"index":"三十六计",
"name":"混战计·假道伐虢",
"content":["　　两大之间，敌胁以从，我假以势。困，有言不信。"],
}
JiBookPageModule[25]={
"index":"三十六计",
"name":"并战计·偷梁换柱",
"content":["　　频更其阵，抽其劲旅，待其自败，而后乘之。曳其轮也。"],
}
JiBookPageModule[26]={
"index":"三十六计",
"name":"并战计·指桑骂槐",
"content":["　　大凌小者，警以诱之。刚中而应，行险而顺。"],
}
JiBookPageModule[27]={
"index":"三十六计",
"name":"并战计·假痴不癫",
"content":["　　宁伪作不知不为，不伪作假知妄为。静不露机，云雷屯也。"],
}
JiBookPageModule[28]={
"index":"三十六计",
"name":"并战计·上屋抽梯",
"content":["　　假之以便，唆之使前，断其援应，陷之死地。遇毒，位不当也。"],
}
JiBookPageModule[29]={
"index":"三十六计",
"name":"并战计·树上开花",
"content":["　　借局布势，力小势大。鸿渐于陆，其羽可以为仪也。"],
}
JiBookPageModule[30]={
"index":"三十六计",
"name":"并战计·反客为主",
"content":["　　乘隙插足，扼其主机，渐之进也。"],
}
JiBookPageModule[31]={
"index":"三十六计",
"name":"败战计·美人计",
"content":["　　兵强者，攻其将；将智者，伐其情。将弱兵颓，其势自萎。利用御寇，顺相保也。"],
}
JiBookPageModule[32]={
"index":"三十六计",
"name":"败战计·空城计",
"content":["　　虚者虚之，疑中生疑。刚柔之际，奇而复奇。"],
}
JiBookPageModule[33]={
"index":"三十六计",
"name":"败战计·反间计",
"content":["　　疑中之疑。比之自内，不自失也。"],
}
JiBookPageModule[34]={
"index":"三十六计",
"name":"败战计·苦肉计",
"content":["　　人不自害，受害必真。假真真假，间以得行。童蒙之吉，顺以巽也。"],
}
JiBookPageModule[35]={
"index":"三十六计",
"name":"败战计·连环计",
"content":["　　将多兵众，不可以敌，使其自累，以杀其势。在师中吉，承天宠也。"],
}
JiBookPageModule[36]={
    "index":"三十六计",
    "name":"败战计·走为上计",
    "content":["　　全师避敌。左次无咎，未失常也。"],
}
JiBookPageModule[37]={
"index":"三十六计",
"name":"第三十七章·道常无为",
"content":["道常无为而无不为，侯王若能守之，万物将自化。化而欲作，吾将镇之以无名之朴。无名之朴，夫亦将不欲。不欲以静，天下将自定。"],
}
JiBookPageModule[38]={
"index":"三十六计",
"name":"第三十八章·处实去华",
"content":["上德不德，是以有德，下德不失德，是以无德。上德无为而无以为，下德为之而有以为。上仁为之而无以为，上义为之而有以为。上礼为之而莫之应，则攘[rǎng]臂而扔之。故失道而后德，失德而后仁，失仁而后义，失义而后礼。夫礼者，忠信之薄，而乱之首。前识者，道之华，而愚之始。是以大丈夫处其厚，不居其薄，处其实，不居其华。故去彼取此。"],
}
JiBookPageModule[39]={
"index":"三十六计",
"name":"第三十九章·贱为贵本",
"content":["昔之得一者，天得一以清，地得一以宁，神得一以灵，谷得一以盈，万物得一以生，候王得一以为天下贞。其致之，天无以清将恐裂，地无以宁将恐发，神无以灵将恐歇，谷无以盈将恐竭[jié]，万物无以生将恐灭，候王无以贵高将恐蹶[jué]。故贵以贱为本，高以下为基。是以侯王自称孤、寡、不谷，此非以贱为本邪？非乎！故致数舆无舆。是不欲琭琭[lù]如玉，珞珞[luò]如石。"],
}
JiBookPageModule[40]={
"index":"三十六计",
"name":"第四十章·有生于无",
"content":["反者道之动，弱者道之用。天下万物生于有，有生于无。"],
}
JiBookPageModule[41]={
"index":"三十六计",
"name":"第四十一章·大器晚成",
"content":["上士闻道，勤而行之﹔中士闻道，若存若亡﹔下士闻道，大笑之。不笑不足以为道。故建言有之，明道若昧，进道若退﹔夷道若颣[lèi]。上德若谷，大白若辱，广德若不足，建德若偷，质真若渝。大方无隅，大器晚成，大音希声，大象无形。道隐无名，夫唯道，善贷且成。"],
}
JiBookPageModule[42]={
"index":"三十六计",
"name":"第四十二章·或损或益",
"content":["道生一，一生二，二生三，三生万物。万物负阴而抱阳，冲气以为和。人之所恶，唯孤寡不谷，而王公以为称。故物或损之而益，或益之而损。人之所教，我亦教之。强梁者不得其死，吾将以为教父。"],
}
JiBookPageModule[43]={
"index":"三十六计",
"name":"第四十三章·无为之益",
"content":["天下之至柔，驰骋天下之至坚。无有入无间，吾是以知无为之有益。不言之教，无为之益，天下希及之。"],
}
JiBookPageModule[44]={
"index":"三十六计",
"name":"第四十四章·知足不辱",
"content":["名与身孰亲。身与货孰多。得与亡孰病。甚爱必大费﹔多藏必厚亡。故知足不辱，知止不殆，可以长久。"],
}
JiBookPageModule[45]={
"index":"三十六计",
"name":"第四十五章·大成若缺",
"content":["大成若缺，其用不弊。大盈若冲，其用不穷。大直若屈，大巧若拙，大辩若讷。躁胜寒，静胜热，清静为天下正。"],
}
JiBookPageModule[46]={
"index":"三十六计",
"name":"第四十六章·知足常足",
"content":["天下有道，却走马以粪；天下无道，戎马生于郊。祸莫大于不知足，咎莫大于欲得。故知足之足，常足矣。"],
}
JiBookPageModule[47]={
"index":"三十六计",
"name":"第四十七章·不为而成",
"content":["不出户，知天下﹔不窥牖，见天道。其出弥远，其知弥少。是以圣人不行而知，不见而名，不为而成。"],
}
JiBookPageModule[48]={
"index":"三十六计",
"name":"第四十八章·为学日益",
"content":["为学日益，为道日损，损之又损，以至于无为，无为而无不为。取天下常以无事，及其有事，不足以取天下。"],
}
JiBookPageModule[49]={
"index":"三十六计",
"name":"第四十九章·圣无常心",
"content":["圣人无常心，以百姓心为心。善者吾善之，不善者吾亦善之，德善。信者吾信之，不信者亦信之，德信。圣人在天下歙歙，为天下浑其心，圣人皆孩之。"],
}
JiBookPageModule[50]={
"index":"三十六计",
"name":"第五十章·出生入死",
"content":["出生入死，生之徒十有三，死之徒十有三。人之生，动之于死地亦十有三。夫何故。以其生之厚。盖闻善摄生者，陆行不遇兕[sì]虎，入军不被甲兵。兕无所投其角，虎无所措其爪，兵无所容其刃。夫何故，以其无死地。"],
}
JiBookPageModule[51]={
"index":"三十六计",
"name":"第五十一章·尊道贵德",
"content":["道生之，德畜之，物形之，势成之，是以万物莫不尊道而贵德。道之尊，德之贵，夫莫之命而常自然。故道生之，德畜之，长之育之，亭之毒之，养之覆之。生而不有，为而不恃，长而不宰，是谓元德。"],
}
JiBookPageModule[52]={
"index":"三十六计",
"name":"第五十二章·天下有始",
"content":["天下有始，以为天下母。既得其母，以知其子；既知其子，复守其母，没身不殆。塞其兑，闭其门，终身不勤；开其兑，济其事，终身不救。见小曰明，守柔曰强。用其光，复归其明，无遗身殃﹔是谓习常。"],
}
JiBookPageModule[53]={
"index":"三十六计",
"name":"第五十三章·行于大道",
"content":["使我介然有知，行于大道，惟施是畏。大道甚夷，而民好径。朝甚除，田甚芜，仓甚虚。服文彩，带利剑，厌饮食，财货有余，是为盗夸，非道也哉。"],
}
JiBookPageModule[54]={
"index":"三十六计",
"name":"第五十四章·善抱大道",
"content":["善建者不拔，善抱者不脱，子孙以祭祀[sì]不辍[chuò]。修之于身，其德乃真﹔修之于家，其德乃余﹔修之于乡，其德乃长﹔修之于国，其德乃丰﹔修之于天下，其德乃普。故以身观身，以家观家，以乡观乡，以国观国，以天下观天下。吾何以知天下然哉？以此。"],
}
JiBookPageModule[55]={
"index":"三十六计",
"name":"第五十五章·物壮则老",
"content":["含德之厚，比于赤子。蜂虿[chài]虺[huǐ]蛇不螫[zhē]，猛兽不据，攫[jué]鸟不搏。骨弱筋柔而握固，未知牝[pìn]牡[mǔ]之合而全作，精之至也。终日号而不嗄[shà]，和之至也。知和曰常，知常曰明，益生曰祥。心使气曰强。物壮则老，谓之不道，不道早已。"],
}
JiBookPageModule[56]={
"index":"三十六计",
"name":"第五十六章·知者不言",
"content":["知者不言，言者不知。塞其兑，闭其门，挫其锐，解其纷，和其光，同其尘，是谓玄同。故不可得而亲，不可得而疏，不可得而利，不可得而害，不可得而贵，不可得而贱。故为天下贵。"],
}
JiBookPageModule[57]={
"index":"三十六计",
"name":"第五十七章·以正治国",
"content":["以正治国，以奇用兵，以无事取天下。吾何以知其然哉？以此。天下多忌讳，而民弥贫。民多利器，国家滋昏。人多伎[jì]巧，奇物滋起。法令滋彰，盗贼多有。故圣人云我无为而民自化，我好静而民自正，我无事而民自富，我无欲而民自朴。"],
}
JiBookPageModule[58]={
"index":"三十六计",
"name":"第五十八章·福祸相倚",
"content":["其政闷闷，其民淳淳﹔其政察察，其民缺缺。祸兮福之所倚，福兮祸之所伏。孰知其极，其无正。正复为奇，善复为妖，人之迷，其日固久。是以圣人方而不割，廉而不刿[guì]，直而不肆，光而不耀。"],
}
JiBookPageModule[59]={
"index":"三十六计",
"name":"第五十九章·长生久视",
"content":["治人事天，莫若啬。夫唯啬，是谓早服。早服谓之重积德，重积德，则无不克。无不克，则莫知其极。莫知其极，可以有国，有国之母，可以长久。是谓深根固柢[dǐ]，长生久视之道。"],
}
JiBookPageModule[60]={
"index":"三十六计",
"name":"第六十章·治国烹鲜",
"content":["治大国若烹小鲜，以道莅天下，其鬼不神﹔非其鬼不神，其神不伤人﹔非其神不伤人，圣人亦不伤人。夫两不相伤，故德交归焉。"],
}
JiBookPageModule[61]={
"index":"三十六计",
"name":"第六十一章·各得其所",
"content":["大国者下流，天下之交，天下之牝。牝常以静胜牡，以静为下。故大国以下小国，则取小国﹔小国以下大国，则取大国邦。故或下以取，或下而取。大国不过欲兼畜人，小国不过欲入事人。夫两者各得所欲，大者宜为下。"],
}
JiBookPageModule[62]={
"index":"三十六计",
"name":"第六十二章·万物之奥",
"content":["道者，万物之奥，善人之宝，不善人之所保。美言可以市，尊行可以加人。人之不善，何弃之有？故立天子，置三公，虽有拱璧以先驷马，不如坐进此道。古之所以贵此道者何，不曰以求得，有罪以免邪，故为天下贵。"],
}
JiBookPageModule[63]={
"index":"三十六计",
"name":"第六十三章·为大于细",
"content":["为无为，事无事，味无味。大小多少，报怨以德，图难于其易，为大于其细。天下难事，必作于易；天下大事，必作于细。是以圣人终不为大，故能成其大。夫轻诺必寡信，多易必多难。是以圣人犹难之，故终无难矣。"],
}
JiBookPageModule[64]={
"index":"三十六计",
"name":"第六十四章·慎终如始",
"content":["其安易持，其未兆易谋。其脆易泮[pàn]，其微易散。为之于未有，治之于未乱。合抱之木生于毫末，九层之台起于累土，千里之行始于足下。民之从事，长于几成而败之，慎终如始则无败事。是以圣人欲不欲，不贵难得之货；学不学，复众人之所过，以辅万物之自然，而不敢为。"],
}
JiBookPageModule[65]={
"index":"三十六计",
"name":"第六十五章·善为道者",
"content":["古之善为道者，非以明民，将以愚之。民之难治，以其智多。故以智治国国之贼，不以智治国国之福。知此两者亦楷式，常知楷式，是谓玄德。玄德深矣，远矣，与物反矣。然后乃至大顺。"],
}
JiBookPageModule[66]={
"index":"三十六计",
"name":"第六十六章·不争之争",
"content":["江海之所以能为百谷王者，以其善下之，故能为百谷王。是以欲上民，必以言下之﹔欲先民，必以身后之。是以圣人处上而民不重，处前而民不害，是以天下乐推而不厌。以其不争，故天下莫能与之争。"],
}
JiBookPageModule[67]={
"index":"三十六计",
"name":"第六十七章·持保三宝",
"content":["天下皆谓我道大，似不肖。夫唯大，故似不肖。若肖，久矣其细也夫。我有三宝，持而保之：一曰慈，二曰俭，三曰不敢为天下先。慈故能勇，俭故能广，不敢为天下先，故能成器长。今舍慈且勇，舍俭且广，舍后且先，死矣。夫慈，以战则胜，以守则固。天将救之，以慈卫之。"],
}
JiBookPageModule[68]={
"index":"三十六计",
"name":"第六十八章·不争之德",
"content":["善为士者不武，善战者不怒，善胜敌者不与，善用人者为之下。是谓不争之德，是谓用人之力，是谓配天，古之极。"],
}
JiBookPageModule[69]={
"index":"三十六计",
"name":"第六十九章·哀者胜矣",
"content":["用兵有言：吾不敢为主而为客，不敢进寸而退尺。是谓行无行，攘无臂，执无兵，扔无敌。祸莫大于轻敌，轻敌几丧吾宝。故抗兵相若，哀者胜矣。"],
}
JiBookPageModule[70]={
"index":"三十六计",
"name":"第七十章·被褐怀玉",
"content":["吾言甚易知，甚易行。天下莫能知，莫能行。言有宗，事有君。夫唯无知，是以不我知。知我者希，则我者贵。是以圣人被褐[hè]而怀玉。"],
}
JiBookPageModule[71]={
"index":"三十六计",
"name":"第七十一章·知不知矣",
"content":["知不知上，不知知病。夫唯病病，是以不病。圣人不病，以其病病，是以不病。"],
}
JiBookPageModule[72]={
"index":"三十六计",
"name":"第七十二章·自知自爱",
"content":["民不畏威，则大威至。无狎[xiá]其所居，无厌其所生。夫唯不厌，是以不厌。是以圣人自知不自见，自爱不自贵，故去彼取此。"],
}
JiBookPageModule[73]={
"index":"三十六计",
"name":"第七十三章·天网恢恢",
"content":["勇于敢则杀，勇于不敢则活。此两者或利或害。天之所恶，孰知其故，是以圣人犹难之。天之道，不争而善胜，不言而善应，不召而自来，繟[chǎn]然而善谋。天网恢恢，疏而不失。"],
}
JiBookPageModule[74]={
"index":"三十六计",
"name":"第七十四章·民不畏死",
"content":["民不畏死，奈何以死惧之。若使民常畏死，而为奇者，吾得执而杀之，孰敢。常有司杀者杀，夫代司杀者杀，是谓代大匠斲[zhuó]，夫代大匠斲者，希有不伤其手矣。"],
}
JiBookPageModule[75]={
"index":"三十六计",
"name":"第七十五章·民之轻死",
"content":["民之饥，以其上食税之多，是以饥。民之难治，以其上之有为，是以难治。民之轻死，以其上求生之厚，是以轻死。夫唯无以生为者，是贤于贵生。"],
}
JiBookPageModule[76]={
"index":"三十六计",
"name":"第七十六章·柔弱处上",
"content":["人之生也柔弱，其死也坚强。万物草木之生也柔脆，其死也枯槁。故坚强者死之徒，柔弱者生之徒。是以兵强则不胜，木强则兵。强大处下，柔弱处上。"],
}
JiBookPageModule[77]={
"index":"三十六计",
"name":"第七十七章·功成不处",
"content":["天之道，其犹张弓欤[yú]。高者抑之，下者举之﹔有余者损之，不足者补之。天之道，损有余而补不足；人之道则不然，损不足以奉有余。孰能有余以奉天下？唯有道者。是以圣人为而不恃，功成而不处，其不欲见贤。"],
}
JiBookPageModule[78]={
"index":"三十六计",
"name":"第七十八章·柔之胜刚",
"content":["天下莫柔弱于水，而攻坚强者莫之能胜，以其无以易之。弱之胜强，柔之胜刚，天下莫不知，莫能行。是以圣人云：受国之垢，是谓社稷主﹔受国不祥，是为天下王。正言若反。"],
}
JiBookPageModule[79]={
"index":"三十六计",
"name":"第七十九章·报怨以德",
"content":["和大怨，必有余怨，安可以为善。是以圣人执左契，而不责于人。有德司契，无德司彻。天道无亲，常与善人。"],
}
JiBookPageModule[80]={
"index":"三十六计",
"name":"第八十章·小国寡民",
"content":["小国寡民。使有什伯之器而不用﹔使民重死而不远徙。虽有舟舆[yú]，无所乘之；虽有甲兵，无所陈之；使民复结绳而用之。甘其食，美其服，安其居，乐其俗。邻国相望，鸡犬之声相闻，民至老死不相往来。"],
}
JiBookPageModule[81]={
"index":"三十六计",
"name":"第八十一章·为而不争",
"content":["信言不美，美言不信。善者不辩，辩者不善。知者不博，博者不知。圣人不积，既以为人己愈有，既以与人己愈多。天之道，利而不害﹔圣人之道，为而不争。"],
}
module.exports={JiBookPageModule:JiBookPageModule}