
import React, {Component} from 'react';
import {AppRegistry,View,Text} from 'react-native';


var ZhanGuoBookPageModule = new Array()



ZhanGuoBookPageModule[0] = {"index":"战国策","name":"战国策",
"content":["《战国策》（Intrigues of the Warring States），是一部国别体史书。主要记述了战国时期的纵横家的政治主张和策略，展示了战国时代的历史特点和社会风貌，是研究战国历史的重要典籍。作者并非一人，成书并非一时，书中文章作者大多不知是谁。西汉末刘向编定为三十三篇，书名亦为刘向所拟定。宋时已有缺失，由曾巩作了订补。有东汉高诱注，今残缺。宋鲍彪改变原书次序，作新注。吴师道作《校注》，近代人金正炜有《补释》，今人缪文远有《战国策新注》。"
],
}

ZhanGuoBookPageModule[1]={
"index":"战国策",
"name":"东周·秦兴师临周而求九鼎",
"content":[
    "　　秦兴师临周而求九鼎，周君患之，以告颜率。颜率曰：“大王勿忧，臣请东借救于齐。”颜率至齐，谓齐王曰：“夫秦之为无道也，欲兴兵临周而求九鼎，周之君臣内自画计，与秦，不若归之大国。夫存危国，美名也；得九鼎，厚宝也。愿大王图之。”齐王大悦，发师五万人，使陈臣思将，以救周，而秦兵罢。",
"　　齐将求九鼎，周君又患之。颜率曰：“大王勿忧，臣请东解之。”颜率至齐，谓齐王曰：“周赖大国之义，得君臣父子相保也，愿献九鼎，不识大国何途之从而致之齐?”齐王曰：“寡人将寄径于梁。”颜率曰：“不可。夫梁之君臣欲得九鼎，谋之晖台之下，少海之上，其日久矣。鼎入梁，必不出。”齐王曰：“寡人将寄径于楚。”对曰：“不可。楚之君臣欲得九鼎，谋之于叶庭之中，其日久矣。若入楚，鼎必不出。”王曰：“寡人终何途之从而致之齐?”颜率曰：“弊邑固窃为大王患之。夫鼎者，非效醯壶酱甀耳，可怀挟提挈以至齐者；非效鸟集乌飞，兔兴马逝，漓然止于齐者。昔周之伐殷，得九鼎，凡一鼎而九万人輓之，九九八十一万人，士卒师徒，器械被具，所以备者称此。今大王纵有其人，何途之从而出?臣窃为大王私忧之。”齐王曰：“子之数来者，犹无与耳。”颜率曰：“不敢欺大国，疾定所从出，弊邑迁鼎以待命。”齐王乃止。",
],
}
ZhanGuoBookPageModule[2]={
"index":"战国策",
"name":"东周·秦攻宜阳",
"content":[
    "　　秦攻宜阳，周君谓赵累曰：“子以为何如?”对曰：“宜阳必拔也。”君曰：“宜阳城方八里，材士十万，粟支数年，公仲之军二十万，景翠以楚之众，临山而救之，秦必无功。”对曰：“甘茂，羁旅也，攻宜阳而有功，则周公旦也；无功，则削迹于秦。秦王不听群臣父兄之义而攻宜阳，宜阳不拔，秦王耻之。臣故曰拔。”君曰 :“子为寡人谋，且奈何?”对曰：“君谓景翠曰:‘公爵为执圭，官为柱国，战而胜，则无加焉矣；不胜，则死。不如背秦援宜阳。公进兵，秦恐公之乘其弊也，必以宝事公，公中慕公之为己乘秦也，亦必尽其宝。”秦拔宜阳，景翠果进兵。秦惧，遽效煮枣，韩氏果亦效重宝。景翠得城于秦，受宝于韩，而德东周。",
],
}
ZhanGuoBookPageModule[3]={
"index":"战国策",
"name":"东周·东周与西周战",
"content":[
    "　　东周与西周战，韩救西周。为东周谓韩王曰:“西周者，故天子之国也，多名器重宝，案兵而勿出，可以德东周，西周之宝可尽矣。”",
],
}
ZhanGuoBookPageModule[4]={
"index":"战国策",
"name":"东周·东周与西周争",
"content":[
    "　　东周与西周争，西周欲和于楚、韩。齐明谓东周君曰：“臣恐西周之与楚、韩宝，令之为己求地于东周也。不如谓楚、韩曰，西周之欲入宝，持二端。今东周之兵不急西周，西周之宝不入楚、韩。楚、韩欲得宝，即且趣我攻西周。西周宝出，是我为楚、韩取宝以德之也。西周弱矣。”",
],
}
ZhanGuoBookPageModule[5]={
"index":"战国策",
"name":"东周·东周欲为稻",
"content":[
    "　　东周欲为稻，西周不下水，东周患之。苏子谓东周君曰：“臣请使西周下水,可乎?”乃往见西周之君曰：“君之谋过矣!今不下水，所以富东周也。今其民皆种麦，无他种矣。君若欲害之，不若一为下水，以病其所种。下水，东周必复种稻；种稻而复夺之。若是，则东周之民可令一仰西周，而受命于君矣。”西周君曰：“善。”遂下水，苏子亦得两国之金也。",
],
}
ZhanGuoBookPageModule[6]={
"index":"战国策",
"name":"东周·昭献在阳翟",
"content":["昭献在阳翟，周君将令相国往，相国将不欲。苏厉为之谓周君曰：“楚王与魏王遇也，主君令陈封之楚，令向公之魏。楚、韩之遇也，主君令许公之楚，令向公之韩。今昭献非人主也，而主君令相国往；若其王在阳翟，主君将令谁往?”周君曰：“善。”乃止其行。"],
}
ZhanGuoBookPageModule[7]={
"index":"战国策",
"name":"东周·秦假道于周以伐韩",
"content":["　　秦假道于周以伐韩，周恐假之而恶于韩，不假而恶于秦。史黶谓周君曰：“君何不令人谓韩公叔曰：‘秦敢绝塞而伐韩者，信东周也。公何不与周地，发重使使之楚，秦必疑，不信周，是韩不伐也。’又谓秦王曰：‘韩强与周地，将以疑周于秦，寡人不敢弗受。’秦必无辞而令周弗受，是得地于韩而听于秦也。”"],
}
ZhanGuoBookPageModule[8]={
"index":"战国策",
"name":"东周·楚攻雍氏",
"content":["　　楚攻雍氏，周粻秦、韩，楚王怒周，周之君患之。为周谓楚王曰：“以王之强而怒周，周恐，必以国合于所与粟之国，则是劲王之敌也。故王不如速解周恐，彼前得罪而后得解，必厚事王矣。”"],
}
ZhanGuoBookPageModule[9]={
"index":"战国策",
"name":"东周·周最谓吕礼",
"content":["　　周最谓石礼曰：“子何不以秦攻齐？臣请令齐相子，子以齐事秦，必无处矣。子因令周最居魏以共之，是天下制于子也。子东重于齐，西贵于秦，秦、齐合，则子常重矣。”"],
}
ZhanGuoBookPageModule[10]={
"index":"战国策",
"name":"东周·周相吕仓见客于周君",
"content":["　　周相吕仓见客于周君。前相工师藉恐客之伤己也，因令人谓周君曰：“客者，辩士也，然而所以不可者，好毁人。”"],
}
ZhanGuoBookPageModule[11]={
"index":"战国策",
"name":"东周·周文君免士工师藉",
"content":[
    "　　周文君免士工师藉，相吕仓，国人不说也。君有闵闵之心。",
"　　谓周文君曰：“国必有诽誉，忠臣令诽在己，誉在上。宋君夺民时以为台，而民非之，无忠臣以掩盖之也。子罕释相为司空，民非子罕而善其君。齐桓公宫中七市，女闾七百，国人非之。管仲故为三归之家，以掩桓公，非自伤于民也?《春秋》记臣弑君者以百数，皆大臣见誉者也。故大臣得誉，非国家之美也。故众庶成疆，增积成山。”周君遂不免。",
],
}
ZhanGuoBookPageModule[12]={
"index":"战国策",
"name":"东周·温人之周",
"content":["　　温人之周，周不纳。客即对曰：“主人也。”问其巷而不知也，吏因囚之。君使人问之曰：“子非周人，而自谓非客，何也?”对曰：“臣少而诵诗，诗曰：‘普天之下，莫非王土；率土之滨，莫非王臣。’今周君天下，则我天子之臣，而又为客哉?故曰主人。”君乃使吏出之。"],
}
ZhanGuoBookPageModule[13]={
"index":"战国策",
"name":"东周·或为周最谓金投",
"content":["　　或为周最谓金投曰：“秦以周最之齐疑天下，而又知赵之难子齐人战，恐齐、韩之合，必先合于秦。秦、齐合，则公之国虚矣。公不如救齐，因佐秦而伐韩、魏，上党长子赵之有。公东收宝于秦，南取地于韩，魏因以困，徐为之东，则有合矣。”"],
}
ZhanGuoBookPageModule[14]={
"index":"战国策",
"name":"东周·周最谓金投",
"content":["　　周最谓金投曰：“公负令秦与强齐战。战胜，秦且收齐而封之，使无多割，而听天下之战；不胜，国大伤，不得不听秦。秦尽韩、魏之上党太原，西止秦之有已。秦地，天下之半也，制齐、楚、三晋之命，复国且身危，是何计之道也。”"],
}
ZhanGuoBookPageModule[15]={
"index":"战国策",
"name":"东周·石行秦谓大梁造",
"content":["　　石行秦谓大梁造曰：“欲决霸王之名，不如备两周辩知之士。”谓周君曰：“君不如令辩知之士，为君争于秦。”"],
}
ZhanGuoBookPageModule[16]={
"index":"战国策",
"name":"东周·谓薛公",
"content":["　　谓薛公曰：“周最于齐王也而逐之，听祝弗，相吕礼者，欲取秦。秦、齐合，弗与礼重矣。有周齐，秦必轻君。君弗如急北兵趋赵取秦、魏，收周最以为后行，且反齐王之信，又禁天下之率。齐无秦，天下果，弗必走，齐王谁与为其国？”"],
}

ZhanGuoBookPageModule[17]={
"index":"战国策",
"name":"东周·齐听祝弗",
"content":["　　齐听祝弗，外周最。谓齐王曰：“逐周最、听祝弗、相吕礼者，欲深取秦也。秦得天下，则伐齐深矣。夫齐合，则赵恐伐，故急兵以示秦。秦以赵攻，与之齐伐赵，其实同理，必不处矣。故用祝弗，即天下之理也。”"],
}
ZhanGuoBookPageModule[18]={
"index":"战国策",
"name":"东周·苏厉为周最谓苏秦",
"content":["　　苏厉为周最谓苏秦曰：“君不如令王听最，以地合於魏、赵，故必怒合於齐，是君以合齐与强楚吏产子。君若欲因最之事，则合齐者，君也；割地者，最也。”"],
}
ZhanGuoBookPageModule[19]={
"index":"战国策",
"name":"东周·谓周最曰仇赫之相宋",
"content":["　　谓周最曰：“仇赫之相宋，将以观秦之应赵、宋，败三国。三国不败，将兴赵、宋合于东方以孤秦。亦将观韩、魏之于齐也。不固，则将与宋败三国，则卖赵、宋于三国。公何不令人谓韩、魏之王曰：‘欲秦、赵之相卖乎?何不合周最兼相，视之不可离，则秦、赵必相卖以合于王也。”’"],
}
ZhanGuoBookPageModule[20]={
"index":"战国策",
"name":"东周·为周最谓魏王",
"content":["　　为周最谓魏王曰：“秦知赵之难与齐战也，将恐齐、赵之合也，必阴劲之。赵不敢战，恐秦不己收也，先合于齐。秦、赵争齐，而王无人焉，不可。王不去周最，合与收齐，而以兵之急则伐齐，无因事也。”"],
}
ZhanGuoBookPageModule[21]={
"index":"战国策",
"name":"东周·谓周最曰魏王以国与先生",
"content":["　　谓周最曰：“魏王以国与先生，贵合于秦以伐齐。薛公故主，轻忘其薛，不顾其先君之丘墓，而公独帽虚信为茂行，明群臣据故主，不与伐齐者，产以忿强秦，不可。公不如谓魏王、薛公曰：‘请为王入齐，天下不能伤齐。而有变，臣请为救之；无变，王遂伐之。且臣齐级也，如累王之交於天下，不可。王为臣赐厚矣，臣入齐，则王亦无齐之累也’。”"],
}
ZhanGuoBookPageModule[22]={
"index":"战国策",
"name":"东周·赵取周之祭地",
"content":["　　赵取周之祭地，周君患之，告于郑朝。郑朝曰：“君勿患也，臣请以三十金复取之。”周君予之。郑朝献之赵太卜，因告以祭地事。及王病，使卜之。太卜谴之曰：“周之祭地为祟。”赵乃还之。"],
}
ZhanGuoBookPageModule[23]={
"index":"战国策",
"name":"东周·杜赫欲重景翠于周",
"content":["　　杜赫欲重景翠于周，谓周君曰：“君之国小，尽君子重宝珠玉以事诸侯，不可不察也。譬之如张罗者，张于无鸟之所，则终日无所得矣；张于多鸟处，则又骇鸟矣；必张于有鸟无鸟之际，然后能多得鸟矣。今君将施于大人，大人轻君；施于小人，小人无可以求，又费财焉。君必施于今之穷士，不必且为大人者，故能得欲矣。”"],
}
ZhanGuoBookPageModule[24]={
"index":"战国策",
"name":"东周·周共太子死",
"content":["　　周共太子死，有五庶子，皆爱之，而无适立也。司马翥谓楚王曰：“何不封公子咎，而为之请太子?”左成谓司马翥曰：“周君不听，是公之知困而交绝于周也。不如谓周君曰：‘孰欲立也?微告翥，翥令楚王资之以地。’公若欲为太子，因令人谓相国御展子，廧夫空曰：‘王类欲令若为之，此健士也，居中不便于相国。’”相国令之为太子。"],
}
ZhanGuoBookPageModule[25]={
"index":"战国策",
"name":"东周·三国隘秦",
"content":["　　三国隘秦，周令其相之秦，以秦之轻也，留其行。有人谓相国曰：“秦之轻重，未可知也。秦欲知三国之情，公不如遂见秦王曰：‘请谓王听东方之处’。秦必重公。是公重周，重用以取秦也。齐重故有周，而已取齐，是周常不失重国之交也。”"],
}
ZhanGuoBookPageModule[26]={
"index":"战国策",
"name":"东周·昌他亡西周",
"content":["　　昌他亡西周，之东周，尽输西周之情于东周。东周大喜，西周大怒。冯且曰：“臣能杀之。”君予金三十斤。冯且使人操金与书，间遗昌他书曰：“告昌他，事可成，勉成之；不可成，亟亡来亡来。事久且泄，自令身死。”因使人告东周之候曰：“今夕有奸人当入者矣。”侯得而献东周，东周立杀昌他。"],
}
ZhanGuoBookPageModule[27]={
"index":"战国策",
"name":"东周·昭翥与东周恶",
"content":["　　昭翥与东周恶，或谓昭翥曰：“为公画阴计。”昭翥曰：“何也?”“西周甚憎东周，尝欲东周与楚恶，西周必令贼贼公，因宣言东周也，以西周之于王也。”照翥曰：“善。吾又恐东周之贼己，而以轻西周恶之于楚。”遽和东周。"],
}
ZhanGuoBookPageModule[28]={
"index":"战国策",
"name":"东周·严氏为贼",
"content":["　　严氏为贼，而阳竖与焉。道周，周君留之十四日，载以乘车驷马而遣之。韩使人让周，周君患之。客谓周君曰：“正语之曰：‘寡人知严氏之为贼，而阳竖与之，故留之十四日以待命也。小国不足亦以容贼，君之使又不至，是以遣之也。’”"],
}
ZhanGuoBookPageModule[29]={
"index":"战国策",
"name":"西周·薛公以齐为韩魏攻楚",
"content":["　　薛公以齐为韩魏攻楚。薛公以齐为韩、魏攻楚，又与韩、魏攻秦，而籍兵乞食于西周。韩庆为西周谓薛公曰：“君以齐为韩、魏攻楚，九年而取宛、叶以北以强韩、魏，今又攻秦以益之。韩、魏南无楚忧，西无秦患，则地广而益重，齐必轻矣。夫本末更盛，虚实有时，窃为君危之。君不如令弊邑阴合于秦而君无攻，又无籍兵乞食。君临函谷而无攻，令弊邑以君之情谓秦王曰：‘薛公必破秦以张韩、魏，所以进兵者，欲王令楚割东国以与齐也。’秦王出楚王以为和，君令弊邑以此忠秦，秦得无破，而以楚之东国自免也，必欲之。楚王出，必德齐，齐得东国而益强，而薛世世无患。秦不大弱，而处之三晋之西，三晋必重齐。”薛公曰：“善。”因令韩庆入秦，而使三国无攻秦，而使不籍兵乞食于西周。"],
}
ZhanGuoBookPageModule[30]={
    "index":"战国策",
    "name":"西周·秦攻魏将犀武军于伊阙",
    "content":["　　秦攻魏将犀武军于伊阙，进兵而攻周。为周最谓李兑曰：“君不如禁秦之攻周。赵之上计，莫如令秦、魏复战。今秦攻周而得之，则众必多伤矣。秦欲待周之得，必不攻魏；秦若攻周而不得，前有胜魏之劳，后有攻周之败，又必不攻魏。今君禁之，而秦未与魏讲也。而全赵令其止，必不敢不听，是君却秦而定周也。秦去周，必复攻魏，魏不能支，必因君而讲，则君重矣。若魏不讲，而疾支之，是君存周而战秦、魏也。重亦尽在赵。”"],
    }
ZhanGuoBookPageModule[31]={
"index":"战国策",
"name":"西周·秦令樗里疾以车百乘入周",
"content":["　　秦令樗里疾以车百乘入周，周君迎之以卒，甚敬。楚王怒，让周，以其重秦客。游腾谓楚王曰：“昔智伯欲伐厹由，遗之大钟，载以广车，因随以兵，杂由卒亡，无备故也。桓公伐蔡也，号言伐楚，其实袭蔡。今秦者，虎狼之国也，兼有吞周之意；使樗里疾以车百乘入周，周君惧焉，以蔡杂由戒之，故使长兵在前，强弩在后，名曰卫疾，而实囚之也。周君岂能无爱国哉?恐一日之亡国，而忧大王。”楚王乃悦。"],
}
ZhanGuoBookPageModule[32]={
"index":"战国策",
"name":"西周·雍氏之役",
"content":["　　雍氏之役，韩征甲与粟于周。周君患之，告苏代。苏代曰：“何患焉?代能为君令韩不征甲与粟于周，又能为君得高都。”周君大悦曰：“子苟能，寡人请以国听。”苏代遂往见韩相国公中曰：“公不闻楚计乎?昭应谓楚王曰：‘韩氏罢于兵，仓廪空，无以守城，吾收之以饥，不过一月必拔之。”今围雍氏五月不能拔，是楚病也。楚王始不信昭应之计矣，今公乃征甲及粟于周，此告楚病也。昭应闻此，必劝楚王益兵守雍氏，雍氏必拔。”公中曰：“善。然吾使者已行矣。”代曰：“公何不以高都与周。”公中怒曰：“吾无征甲与粟于周，亦已多矣。何为与高都?”代曰：“与之高都，则周必折而入于韩，秦闻之必大怒，而焚周之节，不通其使，是公以弊高都得完周也，何不与也?”公中曰：“善。”不征甲与粟于周而与高都，楚卒不拔雍氏而去。"],
}

ZhanGuoBookPageModule[33]={
"index":"战国策",
"name":"西周·周君之秦",
"content":["　　周君之秦。谓周最曰：“不如誉秦王之孝也，因以应为太后养地。秦王、太后必喜，是公有秦也。交善，周君必以为公功；交恶，劝周君入秦者，必有罪矣。”"],
}
ZhanGuoBookPageModule[34]={
"index":"战国策",
"name":"西周·苏厉谓周君",
"content":["　　苏厉谓周君曰：“败韩、魏，杀犀武，攻赵，取蔺、离石、祁者，皆白起。是攻用兵，又有天命也。今攻梁，梁必破，破则周危，君不若止之。谓白起曰：‘楚有养由基者，善射；去柳叶者百步而射之，百发百中。左右皆曰善。有一人过曰，善射，可教射也矣。养由基曰，人皆善，子乃曰可教射，子何不代我射之也。客曰，我不能教子支左屈右。夫射柳叶者，百发百中，而不已善息，少焉气力倦，弓拨矢钩，一发不中，前功尽矣。今公破韩、魏，杀厚武，而北攻赵，取蔺、离石、祁者，公也。公之功甚多。今公又以秦兵出塞，过两周，践韩而以攻梁，一攻而不得，前功尽灭，公不若称病不出也。”"],
}
ZhanGuoBookPageModule[35]={
"index":"战国策",
"name":"西周·楚兵在山南",
"content":["　　楚兵在山南，吾得将为楚王属怒于周。或谓周君曰：“不如令太子将军正迎吾得于境，而君自郊迎，令天下皆知君之重吾得也。因泄之楚，曰：‘周君所以事吾得者器，必名曰谋楚。’王必求之，而吾得无效也，王必罪之。”"],
}
ZhanGuoBookPageModule[36]={
"index":"战国策",
"name":"西周·楚请道于二周之间",
"content":["　　楚请道于二周之间，以临韩、魏，周君患之。苏秦谓周君曰：“除道属之于河，韩、魏必恶之。齐、秦恐楚之取九鼎也，必救韩、魏而攻楚。楚不能守方城之外，安能道二周之间。若四国弗恶，君虽不欲与也，楚必将自取之矣。”"],
}
ZhanGuoBookPageModule[37]={
"index":"战国策",
"name":"西周·司寇布为周最谓周君",
"content":["　　司寇布为周最谓周君曰：“君使人告齐王以周最不肯为太子也，臣为君不取也。函冶氏为齐太公买良剑，公不知善，归其剑而责之金。越人请买之干金，折而不卖。将死，而属其子曰：‘必无独知。’今君之使最为太子，独知之契也，天下未有信之者也。臣恐齐王之为君实立果而让之於最，以嫁之齐也。君为多巧，最为多诈，君何不买信货哉?奉养无有爱于最也，使天下见之。”"],
}
ZhanGuoBookPageModule[38]={
"index":"战国策",
"name":"西周·秦召周君",
"content":["　　秦召周君，周君难往。或为周君谓魏王曰：“秦召周君，将以使攻魏之南阳。王何不出于河南?周君闻之，将以为辞于秦而不往。周君不入秦，秦必不敢越河而攻南阳。”"],
}
ZhanGuoBookPageModule[39]={
"index":"战国策",
"name":"西周·犀武败于伊阙",
"content":["　　犀武败于伊阙，周君之魏求救，魏王以上党之急辞之。周君反，见梁囿而乐之也。綦母恢谓周君曰：“温囿不下此，而又近。臣能为君取之。”反见魏王，王曰：“周君怨寡人乎?”对曰：“不怨，且谁怨王?臣为王有患也。周君，谋主也。而设以国为王扞秦，而王无之扞也。臣见其必以国事秦也，秦悉塞外之兵，与周之众，以攻南阳，而两上党绝矣。”魏王曰：“然则奈何?”綦母恢曰：“周君形不小利，事秦而好小利。今王许戍三万人与温囿，周君得以为辞于父兄百姓，而利温囿以为乐，必不合于秦。臣尝闻温囿之利，岁八十金，君得温囿，其以事王者，岁百二十金，是上党每患而赢四十金。”魏王因使孟卯致温囿周君而许之戍也。"],
}
ZhanGuoBookPageModule[40]={
"index":"战国策",
"name":"西周·韩魏易地",
"content":["　　韩、魏易地，西周弗利。樊余谓楚王曰：“周必亡矣。韩、魏之易地，韩得二县，魏亡二县，所以为之者，尽包二周，多于二县，九鼎存焉。且魏有南阳、郑地、三川而包二周，则楚方城之外危；韩兼两上党以临赵，即赵羊肠以上危。故易成之日，楚、赵皆轻。”楚王恐，因赵以止易也。"],
}
ZhanGuoBookPageModule[41]={
"index":"战国策",
"name":"西周·秦欲攻周",
"content":["　　秦欲攻周，周最谓秦王曰：“为王之国计者，不攻周。攻周，实不足以利国，而声畏天下。天下以声畏秦，必东合于齐。兵弊于周，而合天下于齐，则秦孤而不王矣。是天下欲罢秦，故劝王攻周。秦与天下惧罢，则令不横行于周矣。”"],
}
ZhanGuoBookPageModule[42]={
"index":"战国策",
"name":"西周·宫他谓周君",
"content":["　　宫他谓周君曰：“宛恃秦而轻晋，秦饥而宛亡。郑恃魏而轻韩，魏攻蔡而郑亡。邾、莒亡于齐，陈、蔡亡于楚。此皆恃援国而轻近敌也。今君恃韩、魏而轻秦，国恐伤矣。君不如使周最阴合于赵以备秦，则不毁。”"],
}
ZhanGuoBookPageModule[43]={
"index":"战国策",
"name":"西周·谓齐王",
"content":["　　谓齐王曰：“王何不以地赍周最以为太子也。”齐王令司马悍以赂进周最于周。左尚谓司马悍曰：“周不听，是公之知困而交绝于周也。公不如谓周君曰：‘何欲置?令人微告悍，悍请令王进之以地。’”左尚以此得事。"],
}
ZhanGuoBookPageModule[44]={
"index":"战国策",
"name":"西周·三国攻秦反",
"content":["　　三国攻秦反，西周恐魏之藉道也。为西周谓魏王曰：“楚、宋不利秦之德三国也，彼且攻王之聚以利秦。”魏王惧，令军设舍速东。"],
}
ZhanGuoBookPageModule[45]={
"index":"战国策",
"name":"西周·犀武败",
"content":["　　犀武败，周使周足之秦。或谓周足曰：“何不谓周君曰：‘臣之秦，秦、周之交必恶。主君之臣，又秦重而欲相者，且恶臣于秦，而臣为不能使矣。臣愿免而行。君因相之，彼得相，不恶周于秦矣。’君重秦，故使相往，行而免，且轻秦也，公必不免。公言是而行，交善于秦，且公之成事也；交恶于秦，不善于公且诛矣。”"],
}
ZhanGuoBookPageModule[46]={
"index":"战国策",
"name":"秦一·卫鞅亡魏入秦",
"content":[
    "　　卫鞅亡魏入秦，孝公以为相，封之于商，号曰商君。商君治秦，法令至行，公平无私，罚不讳强大，赏不私亲近，法及太子，黥劓其傅。期年之后，道不拾遗，民不妄取，兵革大强，诸侯畏惧。然刻深寡恩，特以强服之耳。孝公行之八年，疾且不起，欲傳商君，辞不受。",
"　　孝公已死，惠王代后，莅政有顷，商君告归。人说惠王曰：“大臣太重者国危，左右太亲者身危。今秦妇人婴儿皆言商君之法，莫言大王之法。是商君反为主，大王更为臣也。且夫商君，固大王仇雠也，愿大王图之。”商君归还，惠王车裂之，而秦人不怜。",
],
}
ZhanGuoBookPageModule[47]={
"index":"战国策",
"name":"秦一·苏秦始将连横",
"content":[
    "　　苏秦始将连横，说秦惠王曰：“大王之国，西有巴、蜀、汉中之利，北有胡貉、代马之用，南有巫山、黔中之限，东有肴、函之固。田肥美，民殷富，战车万乘，奋击百万，沃野千里，蓄积饶多，地势形便，此所谓天府，天下之雄国也。以大王之贤，士民之众，车骑之用，兵法之教，可以并诸侯，吞天下，称帝而治。愿大王少留意，臣请奏其效。”秦王曰：“寡人闻之，毛羽不丰满者不可以高飞，文章不成者不可以诛罚，道德不厚者不可以使民，政教不顺者不可以烦大臣。今先生俨然不远千里面庭教之，愿以异日。” 苏秦曰：“臣固疑大王之不能用也。昔者神农伐补遂，黄帝伐涿鹿而禽蚩尤，尧伐驩兜，舜伐三苗，禹伐共工，汤伐有夏，文王伐崇，武王伐纣，齐桓任战而伯天下。由此观之，恶有不战者乎?古者使车毂击驰，言语相结，天下为一；约从连横，兵革不藏；文士并饬，诸侯乱惑；万端俱起，不可胜理；科条既备，民多伪态；书策稠浊，百姓不足；上下相愁，民无所聊；明言章理，兵甲愈起；辩言伟服，战攻不息；繁称文辞，天下不治；舌弊耳聋，不见成功；行义约信，天下不亲。于是，乃废文任武，厚养死士，缀甲厉兵，效胜于战场。夫徒处而致利，安坐而广地，虽古五帝、三王、五伯，明主贤君，常欲坐而致之，其势不能，故以战续之。宽则两军相攻，迫则杖戟相撞，然后可建大功。是故兵胜于外，义强于内；威立于上，民服于下。今欲并天下，凌万乘，诎敌国，制海内，子元元，臣诸侯，非兵不可。今之嗣主，忽於至道，皆悯于教，乱于治，迷于言，惑于语，沈于辩，溺于辞。以此论之，王固不能行也。”",
    "　　说秦王书十上而说不行。黑貂之裘弊，黄金百斤尽，资用乏绝，去秦而归。羸滕履蹻，负书担櫜，形容枯搞，面目犁黑，状有归色。归至家，妻不下紝，嫂不为炊，父母不与言。苏秦喟叹曰：“妻不以我为夫，嫂不以我为叔，父母不以我为子，是皆秦之罪也。”乃夜发书，陈箧数十，得太公阴符之谋，伏而诵之，简练以为揣摩。读书欲睡，引锥自刺其股，血流至足。曰：“安有说人主不能出其金玉锦绣，取卿相之尊者乎?”期年揣摩成，曰：“此真可以说当世之君矣 。”",
    "　　于是乃摩燕乌集阙，见说赵王于华屋之下，抵掌而谈。赵王大悦，封为武安君。受相印，革车白乘，锦绣千纯，白壁百双，黄金万溢，以随其后，约从散横，以抑强秦。",
    "　　故苏秦相于赵而关不通。当此之时，天下之大，万民之众，王侯之威，谋臣之权，皆欲决苏秦之策。不费斗粮，未烦一兵，未战一士，未绝一弦，未折一矢，诸侯相亲，贤于兄弟。夫贤人在而天下服，一轼撙衔，横历天下，廷说诸侯之王，杜左右之口，天下莫之能伉。",
    "　　将说楚王，路过洛阳，父母闻之，清宫除道，张乐设饮，郊迎三十里。妻侧目而视，倾耳而听；嫂蛇行匍伏，四拜自跪而谢。苏秦曰：“嫂何前倨而后卑也?”嫂曰：“以季子之位尊而多金。”苏秦曰：“嗟乎！贫穷则父母不子，富贵则亲戚畏惧。人生世上，势位富贵，盖可忽乎哉！”　",
],
}
ZhanGuoBookPageModule[48]={
"index":"战国策",
"name":"秦一·秦惠王谓寒泉子",
"content":["　　秦惠王谓寒泉子曰：“苏秦欺寡人，欲以一人之智，反覆东山之君，从以欺秦。赵固负其众，故先使苏秦以币帛约乎诸侯。诸侯不可一，犹连鸡之不能俱止于栖之明矣。寡人忿然，含怒日久。吾欲使武安子起往喻意焉。”寒泉子曰：“不可。夫攻城堕邑，请使武安子。善我国家使诸侯，请使客卿张仪。”秦惠王曰：“受命。”"],
}

ZhanGuoBookPageModule[49]={
"index":"战国策",
"name":"秦一·泠向谓秦王",
"content":["　　泠向谓秦王曰：“向欲以齐事王，使攻宋也。宋破，晋国危，安邑，王之有也。燕、赵恶齐、秦之合，必割地以交于王矣。齐必重于王，则向之攻宋也，且以恐齐而重王。王何恶向之攻宋乎?向以王之明为先知之，故不言。”"],
}
ZhanGuoBookPageModule[50]={
"index":"战国策",
"name":"秦一·张仪说秦王",
"content":[
    "　　张仪说秦王曰：“臣闻之，弗知而言为不智，知而不言为不忠。为人臣不忠当死，言不审亦当死。虽然，臣愿悉言所闻，大王裁其罪。臣闻，天下阴燕阳魏，连荆固齐，收余韩成从，将西南以与秦为难。臣窃笑之。世有三亡，而天下得之，其此之谓乎!臣闻之曰：‘以乱攻治者亡，以邪攻正者亡，以逆攻顺者亡。’今天下之府库不盈，囷仓空虚，悉其士民，张军数千百万，白刃在前，斧质在后，而皆去走，不能死，罪其百姓不能死也，其上不能杀也。言赏则不与，言罚则不行，赏罚不行，故民不死也。",
    "　　“今秦出号令而行赏罚，不攻无功相事也。出其父母怀衽之中，生未尝见寇也，闻战顿足徒裼，犯白刃，蹈煨炭，断死于前者比是也。夫断死与断生也不同，而民为之者是贵奋也。一可以胜十，十可以胜百，百可以胜千，千可以胜万，万可以胜天下矣。今秦地形，断长续短，方数千里，名师数百万，秦之号令赏罚，地形利害，天下莫如也。以此与天下，天下不足兼而有也。是知秦战未尝不胜，攻未尝不取，所当未尝不破也。开地数千里，此甚大功也。然而甲兵顿，士民病，蓄积索，田畴荒，囷仓虚，四邻诸侯不服，伯王之名不成，此无异故，谋臣皆不尽其忠也。",
    "　　“臣敢言往昔。昔者齐南破荆，中破宋，西服秦，北破燕，中使韩、魏之君，地广而兵强，战胜攻取，诏令天下，济清河浊，足以为限，长城、钜坊，足以为塞。齐，五战之国也，一战不胜而无齐。故由此观之，夫战者万乘之存亡也。",
    "　　且臣闻之曰：‘削株掘根，无与祸邻，祸乃不存。’秦与荆人战，大破荆，袭郢，取洞庭、五都、江南。荆王亡奔走，东伏于陈。当是之时，随荆以兵，则荆可举。举荆，则其民足贪也，地足利也。东以强齐、燕，中陵三晋。然则是一举而伯王之名可成也，四邻诸侯可朝也。而谋臣不为，引军而退，与荆人和。今荆人收亡国，聚散民，立社主，置宗庙， 令帅天下西面以与秦为难，此固已无伯王之道一矣。天下有比志而军华下，大王以诈破之，兵至梁郭，围梁数旬，则梁可拔。拔梁，则魏可举。举魏，则荆、赵之志绝。荆、赵之志绝，则赵危。赵危而荆孤。东以强齐、燕，中陵三晋，然则是一举而伯王之名可成也，四邻诸侯可朝也。而谋臣不为，引军而退。与魏氏和，令魏氏收亡国，聚散民，立社主，置宗庙，此固已无伯王之道二矣。前者穰侯之治秦也，用一国之兵，而欲以成两国之功。是故兵终暴灵于外，士民潞病于内，伯王之名不成，此固已无伯王之道三矣。",
    "　　“赵氏，中央之国也，杂民之所居也。其民轻而难用，号令不治，赏罚不信，地形不便，上非能尽其民力。彼固亡国之形也，而不忧民氓，悉其士民，军于长平之下，以争韩之上党，大王以诈破之，拔武安。当是时，赵氏上下不相亲也，贵贱不相信，然则是邯郸不守，拔邯郸，完河间，引军而去，西攻修武，逾羊肠，降代、上党。代三十六县，上党十七县，不用一领甲，不苦一民，皆秦之有也。代、上党不战而已为秦矣，东阳河外不战而已反为齐矣，中呼池以北不战而已为燕矣。然则是举赵则韩必亡，韩亡则荆、魏不能独立。荆、魏不能独立，则是一举而坏韩，蠹魏，挟荆，以东弱齐、燕，决白马之口，以流魏氏。一举而三晋亡，从者败。大王拱手以须，天下遍随而伏，伯王之名可成也。而谋臣不为，引军而退，与赵氏为和。以大王之明，秦兵之强，伯王之业，地尊不可得，乃取欺于亡国，是谋臣之拙也。且夫赵当亡不亡，秦当伯不伯，天下固量秦之谋臣一矣。乃复悉卒乃攻邯郸，不能拔也，弃甲兵怒，战慄而却，天下固量秦力二矣，军乃引退，并于李下，大王又并军而致与战，非能厚胜之也，又交罢却，天下固量秦力三矣。内者量吾谋臣，外者极吾兵力。由是观之，臣以天下之从，岂其难矣。内者吾甲兵顿，士民病，蓄积索，田畴荒，囷仓虚；外者天下比志甚固。愿大王有以虑之也。",
    "　　“且臣闻之，战战慄慄，日慎一日。苟慎其道，天下可有也。何以知其然也?昔者纣为天子，帅天下将甲百万，左饮于淇谷，有饮于洹水，淇水竭而洹水不流，以与周武为难。武王将素甲三干领，战一日，破纣之国，禽其身，据其地，而有其民，天下莫不伤。智伯帅三国之众，以攻赵襄主于晋阳，决水灌之，三年，城且拔矣。襄主错龟，数策占兆，以视利害，何国可降，而使张孟谈。于是潜行而出，反智伯之约，得两国之众，以攻智伯之国，禽其身，以成襄子之功。今秦地断长续短，方数千里，名师数百万，秦国号令赏罚，地形利害，天下莫如也。以此与天下，天下可兼而有也。",
    "　　“臣昧死望见大王，言所以举破天下之从，举赵亡韩，臣荆、魏，亲齐、燕，以成伯王之名，朝四邻诸侯之道。大王试听其说，一举而天下之从不破，赵不举，韩不亡，荆、魏不臣，齐、燕不亲，伯王之名不成，四邻诸侯不朝，大王斩臣以徇于国，以主为谋不忠者。”　",
],
}
ZhanGuoBookPageModule[51]={
"index":"战国策",
"name":"秦一·张仪欲假秦兵以救魏",
"content":["　　张仪欲假秦兵以救魏。左成谓首茂曰：“子不予之。魏不反秦兵，张子不反秦。魏若反秦兵，张子得志于魏，不敢反于秦矣。张子不去秦，张子必高子。”’"],
}
ZhanGuoBookPageModule[52]={
"index":"战国策",
"name":"秦一·司马错与张仪争论于秦惠王前",
"content":[
"　　司马错与张仪争论于秦惠王前。司马错欲伐蜀，张仪曰：“不如伐韩。”王曰：“请闻其说。”",
"　　对曰：“亲魏善楚，下兵三川，塞轘辕、缑氏之口，当屯留之道，魏绝南阳，楚临南郑，秦攻新城、宜阳，以临二周之郊，诛周主之罪，侵楚、魏之地。周自知不救，九鼎宝器必出。据九鼎，按图籍，挟天子以令天下，天下莫敢不听，此王业也。今夫蜀，西辟之国，而戎狄之长也，弊兵劳众，不足以成名，得其地，不足以为利。臣闻：‘争名者于朝，争利者于市。’今三川、周室，天下之市朝也，而王不争焉，顾争于戎狄，去王业远矣。”",
"　　司马错曰：“不然。臣闻之，欲富国者，务广其地；欲强兵者，务富其民；欲王者，务博其德。三资者备，而王随之矣。今王之地小民贫，故臣愿从事于易。夫蜀，西辟之国也，而戎狄之长也，而有桀、纣之乱。以秦攻之，譬如使豺狼逐群羊也。取其地，足以广国也；得其财，足以富民；缮兵不伤众，而彼已服矣。故拔一国，而天下不以为暴；利尽西海，诸侯不以为贪。是我一举而名实两附，而又有禁暴正乱之名。今攻韩劫天子，劫天子，恶名也，而未必利也，又有不义之名，而攻天下之所不欲，危!臣请谒其故：周，天下之宗室也；齐，韩、周之与国也。周自知失九鼎，韩自知亡三川，则必将二国并力合谋，以因于齐、赵，而求解乎楚、魏。以鼎与楚，以地与魏，王不能禁。此臣所谓‘危’，不如伐蜀之完也。”惠王曰：“善!寡人听子。”",
"　　卒起兵伐蜀，十月取之，遂定蜀。蜀主更号为侯，而使陈庄相蜀。蜀既属，秦益强富厚，轻诸侯。",],
}
ZhanGuoBookPageModule[53]={
"index":"战国策",
"name":"秦一·张仪之残樗里疾",
"content":["　　张仪之残樗里疾也，重而使之楚。因令楚王为之请相于秦。张子谓秦王曰：“重樗里疾而使之者，将以为国交也。今身在楚，楚王因为请相于秦。臣闻其言曰：‘王欲穷仪于秦乎?臣请助王。’楚王以为然，故为请相也。今王诚听之，彼必以国事楚王。”秦王大怒，樗里疾出走。"],
}
ZhanGuoBookPageModule[54]={
"index":"战国策",
"name":"秦一·张仪欲以汉中与楚",
"content":["　　张仪欲以汉中与楚，请秦王曰：“有汉中，蠹。种树不处者，人必害之；家有不宜之财，则伤本。汉中南边为楚利，此国累也。”甘茂谓王曰：“地大者，固多忧乎!天下有变，王割汉中以为和楚，楚必畔天下而与王。王今以汉中与楚，即天下有变，王何以市楚也?”　"],
}
ZhanGuoBookPageModule[55]={
"index":"战国策",
"name":"秦一·楚攻魏张仪谓秦王",
"content":["　　楚攻魏。张仪谓秦王曰：“不如与魏以劲之，魏战胜，复听于秦，必入西河之外；不胜，魏不能守，王必取之。”王用仪言，取皮氏卒万人，车百乘。以与魏。犀首战胜威王，魏兵罢弊，恐畏秦，果献西河之外。"],
}
ZhanGuoBookPageModule[56]={
"index":"战国策",
"name":"秦一·田莘之为陈轸说秦惠王",
"content":["　　田莘之为陈轸说秦惠王曰：“臣恐王之如郭君。夫晋献公欲伐郭，而惮舟之侨存，荀息曰：‘周书有言，美女破舌。’乃遗之女乐，以乱其政。舟之侨谏而不听，遂去。因而伐郭，遂破之。又欲伐虞，而惮宫之奇存。荀息曰：‘周书有言，美男破老。’乃遗之美男，教之恶宫之奇。宫之奇以谏而不听，遂亡。因而伐虞，遂取之。今秦自以为王，能害王者之国者，楚也。楚智横君之善用兵，用兵与陈轸之智，故骄张仪以五国。来，必恶是二人。愿王勿听也。”张仪果来辞，因言轸也，王怒而不听。"],
}
ZhanGuoBookPageModule[57]={
"index":"战国策",
"name":"秦一·张仪又恶陈轸于秦王",
"content":["　　张仪又恶陈轸于秦王。曰：“轸驰楚、秦之间，今楚不加善秦而善轸，然则是轸自为而不为国也。且轸欲去秦而之楚，王何不听乎?”王谓陈轸曰：“吾闻子欲去秦而之楚，信乎?”陈轸曰：“然。”王曰：“仪之言果信也。”曰：“非独仪知之也，行道之人皆知之。曰：‘孝己爱其亲，天下欲以为子；子胥忠乎其君，天下欲以为臣。卖仆妾售乎闾巷者，良仆妾也；出妇嫁乡曲者，良妇也。’吾不忠于君，楚亦何以轸为忠乎?忠且见弃，吾不之楚，何适乎?”秦王曰：“善。”乃必之也。"],
}
ZhanGuoBookPageModule[58]={
"index":"战国策",
"name":"秦一·陈轸去楚之秦",
"content":[
    "　　陈轸去楚之秦。张仪谓秦王曰：“陈轸为王臣，常以国情输楚。仪不能与从事，愿王逐之。即复之楚，愿王杀之。”王曰：“轸安敢之楚也。”",
"　　王召陈轸告之曰：“吾能听子言，子欲何之?请为子车约。”对曰：“臣愿之楚。”王曰：“仪以子为之楚，吾又自知子之楚。子非楚，且安之也!”轸曰：“臣出，必故之楚，以顺王与仪之策，而明臣之楚与不也。楚人有两妻者，人誂其长者，詈之；誂其少者，少者许之。居无几何，有两妻者死。客谓誂者曰：“汝取长者乎?少者乎?”“取长者。”客曰：“长者詈汝，少者和汝，汝何为取长者?”曰：“居彼人之所，则欲其许我也。今为我妻，则欲其为我詈人也。’今楚王明主也，而昭阳贤相也。轸为人臣，而常以国输楚王，王必不留臣，昭阳将不与臣从事矣。以此明臣之楚与不。”",
"　　轸出，张仪入，问王曰：“陈轸果安之?”王曰：“夫轸，天下之辩士也，孰视寡人曰：‘轸必之楚。’寡人遂无奈何也。寡人因问曰：‘子必之楚也，则仪之言果信矣。’轸曰：‘非独仪之言也，行道之人皆知之。昔者子胥忠其君，天下皆欲以为臣；孝己爱其亲，天下皆欲以为子。故卖仆妾不出里巷而取者，良仆妾也；出妇嫁于乡里者，善妇也。臣不忠于王，楚何以轸为?忠尚见弃，轸不之楚，而何之乎?’”王以为然，遂善待之。",
],
}
/*
ZhanGuoBookPageModule[59]={
"index":"战国策",
"name":"第五十九章·长生久视",
"content":["治人事天，莫若啬。夫唯啬，是谓早服。早服谓之重积德，重积德，则无不克。无不克，则莫知其极。莫知其极，可以有国，有国之母，可以长久。是谓深根固柢[dǐ]，长生久视之道。"],
}
ZhanGuoBookPageModule[60]={
"index":"战国策",
"name":"第六十章·治国烹鲜",
"content":["治大国若烹小鲜，以道莅天下，其鬼不神﹔非其鬼不神，其神不伤人﹔非其神不伤人，圣人亦不伤人。夫两不相伤，故德交归焉。"],
}
ZhanGuoBookPageModule[61]={
"index":"战国策",
"name":"第六十一章·各得其所",
"content":["大国者下流，天下之交，天下之牝。牝常以静胜牡，以静为下。故大国以下小国，则取小国﹔小国以下大国，则取大国邦。故或下以取，或下而取。大国不过欲兼畜人，小国不过欲入事人。夫两者各得所欲，大者宜为下。"],
}
ZhanGuoBookPageModule[62]={
"index":"战国策",
"name":"第六十二章·万物之奥",
"content":["道者，万物之奥，善人之宝，不善人之所保。美言可以市，尊行可以加人。人之不善，何弃之有？故立天子，置三公，虽有拱璧以先驷马，不如坐进此道。古之所以贵此道者何，不曰以求得，有罪以免邪，故为天下贵。"],
}
ZhanGuoBookPageModule[63]={
"index":"战国策",
"name":"第六十三章·为大于细",
"content":["为无为，事无事，味无味。大小多少，报怨以德，图难于其易，为大于其细。天下难事，必作于易；天下大事，必作于细。是以圣人终不为大，故能成其大。夫轻诺必寡信，多易必多难。是以圣人犹难之，故终无难矣。"],
}
ZhanGuoBookPageModule[64]={
"index":"战国策",
"name":"第六十四章·慎终如始",
"content":["其安易持，其未兆易谋。其脆易泮[pàn]，其微易散。为之于未有，治之于未乱。合抱之木生于毫末，九层之台起于累土，千里之行始于足下。民之从事，长于几成而败之，慎终如始则无败事。是以圣人欲不欲，不贵难得之货；学不学，复众人之所过，以辅万物之自然，而不敢为。"],
}
ZhanGuoBookPageModule[65]={
"index":"战国策",
"name":"第六十五章·善为道者",
"content":["古之善为道者，非以明民，将以愚之。民之难治，以其智多。故以智治国国之贼，不以智治国国之福。知此两者亦楷式，常知楷式，是谓玄德。玄德深矣，远矣，与物反矣。然后乃至大顺。"],
}
ZhanGuoBookPageModule[66]={
"index":"战国策",
"name":"第六十六章·不争之争",
"content":["江海之所以能为百谷王者，以其善下之，故能为百谷王。是以欲上民，必以言下之﹔欲先民，必以身后之。是以圣人处上而民不重，处前而民不害，是以天下乐推而不厌。以其不争，故天下莫能与之争。"],
}
ZhanGuoBookPageModule[67]={
"index":"战国策",
"name":"第六十七章·持保三宝",
"content":["天下皆谓我道大，似不肖。夫唯大，故似不肖。若肖，久矣其细也夫。我有三宝，持而保之：一曰慈，二曰俭，三曰不敢为天下先。慈故能勇，俭故能广，不敢为天下先，故能成器长。今舍慈且勇，舍俭且广，舍后且先，死矣。夫慈，以战则胜，以守则固。天将救之，以慈卫之。"],
}
ZhanGuoBookPageModule[68]={
"index":"战国策",
"name":"第六十八章·不争之德",
"content":["善为士者不武，善战者不怒，善胜敌者不与，善用人者为之下。是谓不争之德，是谓用人之力，是谓配天，古之极。"],
}
ZhanGuoBookPageModule[69]={
"index":"战国策",
"name":"第六十九章·哀者胜矣",
"content":["用兵有言：吾不敢为主而为客，不敢进寸而退尺。是谓行无行，攘无臂，执无兵，扔无敌。祸莫大于轻敌，轻敌几丧吾宝。故抗兵相若，哀者胜矣。"],
}
ZhanGuoBookPageModule[70]={
"index":"战国策",
"name":"第七十章·被褐怀玉",
"content":["吾言甚易知，甚易行。天下莫能知，莫能行。言有宗，事有君。夫唯无知，是以不我知。知我者希，则我者贵。是以圣人被褐[hè]而怀玉。"],
}
ZhanGuoBookPageModule[71]={
"index":"战国策",
"name":"第七十一章·知不知矣",
"content":["知不知上，不知知病。夫唯病病，是以不病。圣人不病，以其病病，是以不病。"],
}
ZhanGuoBookPageModule[72]={
"index":"战国策",
"name":"第七十二章·自知自爱",
"content":["民不畏威，则大威至。无狎[xiá]其所居，无厌其所生。夫唯不厌，是以不厌。是以圣人自知不自见，自爱不自贵，故去彼取此。"],
}
ZhanGuoBookPageModule[73]={
"index":"战国策",
"name":"第七十三章·天网恢恢",
"content":["勇于敢则杀，勇于不敢则活。此两者或利或害。天之所恶，孰知其故，是以圣人犹难之。天之道，不争而善胜，不言而善应，不召而自来，繟[chǎn]然而善谋。天网恢恢，疏而不失。"],
}
ZhanGuoBookPageModule[74]={
"index":"战国策",
"name":"第七十四章·民不畏死",
"content":["民不畏死，奈何以死惧之。若使民常畏死，而为奇者，吾得执而杀之，孰敢。常有司杀者杀，夫代司杀者杀，是谓代大匠斲[zhuó]，夫代大匠斲者，希有不伤其手矣。"],
}
ZhanGuoBookPageModule[75]={
"index":"战国策",
"name":"第七十五章·民之轻死",
"content":["民之饥，以其上食税之多，是以饥。民之难治，以其上之有为，是以难治。民之轻死，以其上求生之厚，是以轻死。夫唯无以生为者，是贤于贵生。"],
}
ZhanGuoBookPageModule[76]={
"index":"战国策",
"name":"第七十六章·柔弱处上",
"content":["人之生也柔弱，其死也坚强。万物草木之生也柔脆，其死也枯槁。故坚强者死之徒，柔弱者生之徒。是以兵强则不胜，木强则兵。强大处下，柔弱处上。"],
}
ZhanGuoBookPageModule[77]={
"index":"战国策",
"name":"第七十七章·功成不处",
"content":["天之道，其犹张弓欤[yú]。高者抑之，下者举之﹔有余者损之，不足者补之。天之道，损有余而补不足；人之道则不然，损不足以奉有余。孰能有余以奉天下？唯有道者。是以圣人为而不恃，功成而不处，其不欲见贤。"],
}
ZhanGuoBookPageModule[78]={
"index":"战国策",
"name":"第七十八章·柔之胜刚",
"content":["天下莫柔弱于水，而攻坚强者莫之能胜，以其无以易之。弱之胜强，柔之胜刚，天下莫不知，莫能行。是以圣人云：受国之垢，是谓社稷主﹔受国不祥，是为天下王。正言若反。"],
}
ZhanGuoBookPageModule[79]={
"index":"战国策",
"name":"第七十九章·报怨以德",
"content":["和大怨，必有余怨，安可以为善。是以圣人执左契，而不责于人。有德司契，无德司彻。天道无亲，常与善人。"],
}
ZhanGuoBookPageModule[80]={
"index":"战国策",
"name":"第八十章·小国寡民",
"content":["小国寡民。使有什伯之器而不用﹔使民重死而不远徙。虽有舟舆[yú]，无所乘之；虽有甲兵，无所陈之；使民复结绳而用之。甘其食，美其服，安其居，乐其俗。邻国相望，鸡犬之声相闻，民至老死不相往来。"],
}
ZhanGuoBookPageModule[81]={
"index":"战国策",
"name":"第八十一章·为而不争",
"content":["信言不美，美言不信。善者不辩，辩者不善。知者不博，博者不知。圣人不积，既以为人己愈有，既以与人己愈多。天之道，利而不害﹔圣人之道，为而不争。"],
}
*/
module.exports={ZhanGuoBookPageModule:ZhanGuoBookPageModule}