
import React, { Component } from 'react';
import { AppRegistry, View, Text } from 'react-native';


var ZhanGuoBookPageModule = new Array()



ZhanGuoBookPageModule[0] = {
    "index": "战国策", "name": "战国策",
    "content": ["《战国策》（Intrigues of the Warring States），是一部国别体史书。主要记述了战国时期的纵横家的政治主张和策略，展示了战国时代的历史特点和社会风貌，是研究战国历史的重要典籍。作者并非一人，成书并非一时，书中文章作者大多不知是谁。西汉末刘向编定为三十三篇，书名亦为刘向所拟定。宋时已有缺失，由曾巩作了订补。有东汉高诱注，今残缺。宋鲍彪改变原书次序，作新注。吴师道作《校注》，近代人金正炜有《补释》，今人缪文远有《战国策新注》。"
    ],
}

ZhanGuoBookPageModule[1] = {
    "index": "战国策",
    "name": "东周·秦兴师临周而求九鼎",
    "content": [
        "　　秦兴师临周而求九鼎，周君患之，以告颜率。颜率曰：“大王勿忧，臣请东借救于齐。”颜率至齐，谓齐王曰：“夫秦之为无道也，欲兴兵临周而求九鼎，周之君臣内自画计，与秦，不若归之大国。夫存危国，美名也；得九鼎，厚宝也。愿大王图之。”齐王大悦，发师五万人，使陈臣思将，以救周，而秦兵罢。",
        "　　齐将求九鼎，周君又患之。颜率曰：“大王勿忧，臣请东解之。”颜率至齐，谓齐王曰：“周赖大国之义，得君臣父子相保也，愿献九鼎，不识大国何途之从而致之齐?”齐王曰：“寡人将寄径于梁。”颜率曰：“不可。夫梁之君臣欲得九鼎，谋之晖台之下，少海之上，其日久矣。鼎入梁，必不出。”齐王曰：“寡人将寄径于楚。”对曰：“不可。楚之君臣欲得九鼎，谋之于叶庭之中，其日久矣。若入楚，鼎必不出。”王曰：“寡人终何途之从而致之齐?”颜率曰：“弊邑固窃为大王患之。夫鼎者，非效醯壶酱甀耳，可怀挟提挈以至齐者；非效鸟集乌飞，兔兴马逝，漓然止于齐者。昔周之伐殷，得九鼎，凡一鼎而九万人輓之，九九八十一万人，士卒师徒，器械被具，所以备者称此。今大王纵有其人，何途之从而出?臣窃为大王私忧之。”齐王曰：“子之数来者，犹无与耳。”颜率曰：“不敢欺大国，疾定所从出，弊邑迁鼎以待命。”齐王乃止。",
    ],
}
ZhanGuoBookPageModule[2] = {
    "index": "战国策",
    "name": "东周·秦攻宜阳",
    "content": [
        "　　秦攻宜阳，周君谓赵累曰：“子以为何如?”对曰：“宜阳必拔也。”君曰：“宜阳城方八里，材士十万，粟支数年，公仲之军二十万，景翠以楚之众，临山而救之，秦必无功。”对曰：“甘茂，羁旅也，攻宜阳而有功，则周公旦也；无功，则削迹于秦。秦王不听群臣父兄之义而攻宜阳，宜阳不拔，秦王耻之。臣故曰拔。”君曰 :“子为寡人谋，且奈何?”对曰：“君谓景翠曰:‘公爵为执圭，官为柱国，战而胜，则无加焉矣；不胜，则死。不如背秦援宜阳。公进兵，秦恐公之乘其弊也，必以宝事公，公中慕公之为己乘秦也，亦必尽其宝。”秦拔宜阳，景翠果进兵。秦惧，遽效煮枣，韩氏果亦效重宝。景翠得城于秦，受宝于韩，而德东周。",
    ],
}
ZhanGuoBookPageModule[3] = {
    "index": "战国策",
    "name": "东周·东周与西周战",
    "content": [
        "　　东周与西周战，韩救西周。为东周谓韩王曰:“西周者，故天子之国也，多名器重宝，案兵而勿出，可以德东周，西周之宝可尽矣。”",
    ],
}
ZhanGuoBookPageModule[4] = {
    "index": "战国策",
    "name": "东周·东周与西周争",
    "content": [
        "　　东周与西周争，西周欲和于楚、韩。齐明谓东周君曰：“臣恐西周之与楚、韩宝，令之为己求地于东周也。不如谓楚、韩曰，西周之欲入宝，持二端。今东周之兵不急西周，西周之宝不入楚、韩。楚、韩欲得宝，即且趣我攻西周。西周宝出，是我为楚、韩取宝以德之也。西周弱矣。”",
    ],
}
ZhanGuoBookPageModule[5] = {
    "index": "战国策",
    "name": "东周·东周欲为稻",
    "content": [
        "　　东周欲为稻，西周不下水，东周患之。苏子谓东周君曰：“臣请使西周下水,可乎?”乃往见西周之君曰：“君之谋过矣!今不下水，所以富东周也。今其民皆种麦，无他种矣。君若欲害之，不若一为下水，以病其所种。下水，东周必复种稻；种稻而复夺之。若是，则东周之民可令一仰西周，而受命于君矣。”西周君曰：“善。”遂下水，苏子亦得两国之金也。",
    ],
}
ZhanGuoBookPageModule[6] = {
    "index": "战国策",
    "name": "东周·昭献在阳翟",
    "content": ["昭献在阳翟，周君将令相国往，相国将不欲。苏厉为之谓周君曰：“楚王与魏王遇也，主君令陈封之楚，令向公之魏。楚、韩之遇也，主君令许公之楚，令向公之韩。今昭献非人主也，而主君令相国往；若其王在阳翟，主君将令谁往?”周君曰：“善。”乃止其行。"],
}
ZhanGuoBookPageModule[7] = {
    "index": "战国策",
    "name": "东周·秦假道于周以伐韩",
    "content": ["　　秦假道于周以伐韩，周恐假之而恶于韩，不假而恶于秦。史黶谓周君曰：“君何不令人谓韩公叔曰：‘秦敢绝塞而伐韩者，信东周也。公何不与周地，发重使使之楚，秦必疑，不信周，是韩不伐也。’又谓秦王曰：‘韩强与周地，将以疑周于秦，寡人不敢弗受。’秦必无辞而令周弗受，是得地于韩而听于秦也。”"],
}
ZhanGuoBookPageModule[8] = {
    "index": "战国策",
    "name": "东周·楚攻雍氏",
    "content": ["　　楚攻雍氏，周粻秦、韩，楚王怒周，周之君患之。为周谓楚王曰：“以王之强而怒周，周恐，必以国合于所与粟之国，则是劲王之敌也。故王不如速解周恐，彼前得罪而后得解，必厚事王矣。”"],
}
ZhanGuoBookPageModule[9] = {
    "index": "战国策",
    "name": "东周·周最谓吕礼",
    "content": ["　　周最谓石礼曰：“子何不以秦攻齐？臣请令齐相子，子以齐事秦，必无处矣。子因令周最居魏以共之，是天下制于子也。子东重于齐，西贵于秦，秦、齐合，则子常重矣。”"],
}
ZhanGuoBookPageModule[10] = {
    "index": "战国策",
    "name": "东周·周相吕仓见客于周君",
    "content": ["　　周相吕仓见客于周君。前相工师藉恐客之伤己也，因令人谓周君曰：“客者，辩士也，然而所以不可者，好毁人。”"],
}
ZhanGuoBookPageModule[11] = {
    "index": "战国策",
    "name": "东周·周文君免士工师藉",
    "content": [
        "　　周文君免士工师藉，相吕仓，国人不说也。君有闵闵之心。",
        "　　谓周文君曰：“国必有诽誉，忠臣令诽在己，誉在上。宋君夺民时以为台，而民非之，无忠臣以掩盖之也。子罕释相为司空，民非子罕而善其君。齐桓公宫中七市，女闾七百，国人非之。管仲故为三归之家，以掩桓公，非自伤于民也?《春秋》记臣弑君者以百数，皆大臣见誉者也。故大臣得誉，非国家之美也。故众庶成疆，增积成山。”周君遂不免。",
    ],
}
ZhanGuoBookPageModule[12] = {
    "index": "战国策",
    "name": "东周·温人之周",
    "content": ["　　温人之周，周不纳。客即对曰：“主人也。”问其巷而不知也，吏因囚之。君使人问之曰：“子非周人，而自谓非客，何也?”对曰：“臣少而诵诗，诗曰：‘普天之下，莫非王土；率土之滨，莫非王臣。’今周君天下，则我天子之臣，而又为客哉?故曰主人。”君乃使吏出之。"],
}
ZhanGuoBookPageModule[13] = {
    "index": "战国策",
    "name": "东周·或为周最谓金投",
    "content": ["　　或为周最谓金投曰：“秦以周最之齐疑天下，而又知赵之难子齐人战，恐齐、韩之合，必先合于秦。秦、齐合，则公之国虚矣。公不如救齐，因佐秦而伐韩、魏，上党长子赵之有。公东收宝于秦，南取地于韩，魏因以困，徐为之东，则有合矣。”"],
}
ZhanGuoBookPageModule[14] = {
    "index": "战国策",
    "name": "东周·周最谓金投",
    "content": ["　　周最谓金投曰：“公负令秦与强齐战。战胜，秦且收齐而封之，使无多割，而听天下之战；不胜，国大伤，不得不听秦。秦尽韩、魏之上党太原，西止秦之有已。秦地，天下之半也，制齐、楚、三晋之命，复国且身危，是何计之道也。”"],
}
ZhanGuoBookPageModule[15] = {
    "index": "战国策",
    "name": "东周·石行秦谓大梁造",
    "content": ["　　石行秦谓大梁造曰：“欲决霸王之名，不如备两周辩知之士。”谓周君曰：“君不如令辩知之士，为君争于秦。”"],
}
ZhanGuoBookPageModule[16] = {
    "index": "战国策",
    "name": "东周·谓薛公",
    "content": ["　　谓薛公曰：“周最于齐王也而逐之，听祝弗，相吕礼者，欲取秦。秦、齐合，弗与礼重矣。有周齐，秦必轻君。君弗如急北兵趋赵取秦、魏，收周最以为后行，且反齐王之信，又禁天下之率。齐无秦，天下果，弗必走，齐王谁与为其国？”"],
}

ZhanGuoBookPageModule[17] = {
    "index": "战国策",
    "name": "东周·齐听祝弗",
    "content": ["　　齐听祝弗，外周最。谓齐王曰：“逐周最、听祝弗、相吕礼者，欲深取秦也。秦得天下，则伐齐深矣。夫齐合，则赵恐伐，故急兵以示秦。秦以赵攻，与之齐伐赵，其实同理，必不处矣。故用祝弗，即天下之理也。”"],
}
ZhanGuoBookPageModule[18] = {
    "index": "战国策",
    "name": "东周·苏厉为周最谓苏秦",
    "content": ["　　苏厉为周最谓苏秦曰：“君不如令王听最，以地合於魏、赵，故必怒合於齐，是君以合齐与强楚吏产子。君若欲因最之事，则合齐者，君也；割地者，最也。”"],
}
ZhanGuoBookPageModule[19] = {
    "index": "战国策",
    "name": "东周·谓周最曰仇赫之相宋",
    "content": ["　　谓周最曰：“仇赫之相宋，将以观秦之应赵、宋，败三国。三国不败，将兴赵、宋合于东方以孤秦。亦将观韩、魏之于齐也。不固，则将与宋败三国，则卖赵、宋于三国。公何不令人谓韩、魏之王曰：‘欲秦、赵之相卖乎?何不合周最兼相，视之不可离，则秦、赵必相卖以合于王也。”’"],
}
ZhanGuoBookPageModule[20] = {
    "index": "战国策",
    "name": "东周·为周最谓魏王",
    "content": ["　　为周最谓魏王曰：“秦知赵之难与齐战也，将恐齐、赵之合也，必阴劲之。赵不敢战，恐秦不己收也，先合于齐。秦、赵争齐，而王无人焉，不可。王不去周最，合与收齐，而以兵之急则伐齐，无因事也。”"],
}
ZhanGuoBookPageModule[21] = {
    "index": "战国策",
    "name": "东周·谓周最曰魏王以国与先生",
    "content": ["　　谓周最曰：“魏王以国与先生，贵合于秦以伐齐。薛公故主，轻忘其薛，不顾其先君之丘墓，而公独帽虚信为茂行，明群臣据故主，不与伐齐者，产以忿强秦，不可。公不如谓魏王、薛公曰：‘请为王入齐，天下不能伤齐。而有变，臣请为救之；无变，王遂伐之。且臣齐级也，如累王之交於天下，不可。王为臣赐厚矣，臣入齐，则王亦无齐之累也’。”"],
}
ZhanGuoBookPageModule[22] = {
    "index": "战国策",
    "name": "东周·赵取周之祭地",
    "content": ["　　赵取周之祭地，周君患之，告于郑朝。郑朝曰：“君勿患也，臣请以三十金复取之。”周君予之。郑朝献之赵太卜，因告以祭地事。及王病，使卜之。太卜谴之曰：“周之祭地为祟。”赵乃还之。"],
}
ZhanGuoBookPageModule[23] = {
    "index": "战国策",
    "name": "东周·杜赫欲重景翠于周",
    "content": ["　　杜赫欲重景翠于周，谓周君曰：“君之国小，尽君子重宝珠玉以事诸侯，不可不察也。譬之如张罗者，张于无鸟之所，则终日无所得矣；张于多鸟处，则又骇鸟矣；必张于有鸟无鸟之际，然后能多得鸟矣。今君将施于大人，大人轻君；施于小人，小人无可以求，又费财焉。君必施于今之穷士，不必且为大人者，故能得欲矣。”"],
}
ZhanGuoBookPageModule[24] = {
    "index": "战国策",
    "name": "东周·周共太子死",
    "content": ["　　周共太子死，有五庶子，皆爱之，而无适立也。司马翥谓楚王曰：“何不封公子咎，而为之请太子?”左成谓司马翥曰：“周君不听，是公之知困而交绝于周也。不如谓周君曰：‘孰欲立也?微告翥，翥令楚王资之以地。’公若欲为太子，因令人谓相国御展子，廧夫空曰：‘王类欲令若为之，此健士也，居中不便于相国。’”相国令之为太子。"],
}
ZhanGuoBookPageModule[25] = {
    "index": "战国策",
    "name": "东周·三国隘秦",
    "content": ["　　三国隘秦，周令其相之秦，以秦之轻也，留其行。有人谓相国曰：“秦之轻重，未可知也。秦欲知三国之情，公不如遂见秦王曰：‘请谓王听东方之处’。秦必重公。是公重周，重用以取秦也。齐重故有周，而已取齐，是周常不失重国之交也。”"],
}
ZhanGuoBookPageModule[26] = {
    "index": "战国策",
    "name": "东周·昌他亡西周",
    "content": ["　　昌他亡西周，之东周，尽输西周之情于东周。东周大喜，西周大怒。冯且曰：“臣能杀之。”君予金三十斤。冯且使人操金与书，间遗昌他书曰：“告昌他，事可成，勉成之；不可成，亟亡来亡来。事久且泄，自令身死。”因使人告东周之候曰：“今夕有奸人当入者矣。”侯得而献东周，东周立杀昌他。"],
}
ZhanGuoBookPageModule[27] = {
    "index": "战国策",
    "name": "东周·昭翥与东周恶",
    "content": ["　　昭翥与东周恶，或谓昭翥曰：“为公画阴计。”昭翥曰：“何也?”“西周甚憎东周，尝欲东周与楚恶，西周必令贼贼公，因宣言东周也，以西周之于王也。”照翥曰：“善。吾又恐东周之贼己，而以轻西周恶之于楚。”遽和东周。"],
}
ZhanGuoBookPageModule[28] = {
    "index": "战国策",
    "name": "东周·严氏为贼",
    "content": ["　　严氏为贼，而阳竖与焉。道周，周君留之十四日，载以乘车驷马而遣之。韩使人让周，周君患之。客谓周君曰：“正语之曰：‘寡人知严氏之为贼，而阳竖与之，故留之十四日以待命也。小国不足亦以容贼，君之使又不至，是以遣之也。’”"],
}
ZhanGuoBookPageModule[29] = {
    "index": "战国策",
    "name": "西周·薛公以齐为韩魏攻楚",
    "content": ["　　薛公以齐为韩魏攻楚。薛公以齐为韩、魏攻楚，又与韩、魏攻秦，而籍兵乞食于西周。韩庆为西周谓薛公曰：“君以齐为韩、魏攻楚，九年而取宛、叶以北以强韩、魏，今又攻秦以益之。韩、魏南无楚忧，西无秦患，则地广而益重，齐必轻矣。夫本末更盛，虚实有时，窃为君危之。君不如令弊邑阴合于秦而君无攻，又无籍兵乞食。君临函谷而无攻，令弊邑以君之情谓秦王曰：‘薛公必破秦以张韩、魏，所以进兵者，欲王令楚割东国以与齐也。’秦王出楚王以为和，君令弊邑以此忠秦，秦得无破，而以楚之东国自免也，必欲之。楚王出，必德齐，齐得东国而益强，而薛世世无患。秦不大弱，而处之三晋之西，三晋必重齐。”薛公曰：“善。”因令韩庆入秦，而使三国无攻秦，而使不籍兵乞食于西周。"],
}
ZhanGuoBookPageModule[30] = {
    "index": "战国策",
    "name": "西周·秦攻魏将犀武军于伊阙",
    "content": ["　　秦攻魏将犀武军于伊阙，进兵而攻周。为周最谓李兑曰：“君不如禁秦之攻周。赵之上计，莫如令秦、魏复战。今秦攻周而得之，则众必多伤矣。秦欲待周之得，必不攻魏；秦若攻周而不得，前有胜魏之劳，后有攻周之败，又必不攻魏。今君禁之，而秦未与魏讲也。而全赵令其止，必不敢不听，是君却秦而定周也。秦去周，必复攻魏，魏不能支，必因君而讲，则君重矣。若魏不讲，而疾支之，是君存周而战秦、魏也。重亦尽在赵。”"],
}
ZhanGuoBookPageModule[31] = {
    "index": "战国策",
    "name": "西周·秦令樗里疾以车百乘入周",
    "content": ["　　秦令樗里疾以车百乘入周，周君迎之以卒，甚敬。楚王怒，让周，以其重秦客。游腾谓楚王曰：“昔智伯欲伐厹由，遗之大钟，载以广车，因随以兵，杂由卒亡，无备故也。桓公伐蔡也，号言伐楚，其实袭蔡。今秦者，虎狼之国也，兼有吞周之意；使樗里疾以车百乘入周，周君惧焉，以蔡杂由戒之，故使长兵在前，强弩在后，名曰卫疾，而实囚之也。周君岂能无爱国哉?恐一日之亡国，而忧大王。”楚王乃悦。"],
}
ZhanGuoBookPageModule[32] = {
    "index": "战国策",
    "name": "西周·雍氏之役",
    "content": ["　　雍氏之役，韩征甲与粟于周。周君患之，告苏代。苏代曰：“何患焉?代能为君令韩不征甲与粟于周，又能为君得高都。”周君大悦曰：“子苟能，寡人请以国听。”苏代遂往见韩相国公中曰：“公不闻楚计乎?昭应谓楚王曰：‘韩氏罢于兵，仓廪空，无以守城，吾收之以饥，不过一月必拔之。”今围雍氏五月不能拔，是楚病也。楚王始不信昭应之计矣，今公乃征甲及粟于周，此告楚病也。昭应闻此，必劝楚王益兵守雍氏，雍氏必拔。”公中曰：“善。然吾使者已行矣。”代曰：“公何不以高都与周。”公中怒曰：“吾无征甲与粟于周，亦已多矣。何为与高都?”代曰：“与之高都，则周必折而入于韩，秦闻之必大怒，而焚周之节，不通其使，是公以弊高都得完周也，何不与也?”公中曰：“善。”不征甲与粟于周而与高都，楚卒不拔雍氏而去。"],
}

ZhanGuoBookPageModule[33] = {
    "index": "战国策",
    "name": "西周·周君之秦",
    "content": ["　　周君之秦。谓周最曰：“不如誉秦王之孝也，因以应为太后养地。秦王、太后必喜，是公有秦也。交善，周君必以为公功；交恶，劝周君入秦者，必有罪矣。”"],
}
ZhanGuoBookPageModule[34] = {
    "index": "战国策",
    "name": "西周·苏厉谓周君",
    "content": ["　　苏厉谓周君曰：“败韩、魏，杀犀武，攻赵，取蔺、离石、祁者，皆白起。是攻用兵，又有天命也。今攻梁，梁必破，破则周危，君不若止之。谓白起曰：‘楚有养由基者，善射；去柳叶者百步而射之，百发百中。左右皆曰善。有一人过曰，善射，可教射也矣。养由基曰，人皆善，子乃曰可教射，子何不代我射之也。客曰，我不能教子支左屈右。夫射柳叶者，百发百中，而不已善息，少焉气力倦，弓拨矢钩，一发不中，前功尽矣。今公破韩、魏，杀厚武，而北攻赵，取蔺、离石、祁者，公也。公之功甚多。今公又以秦兵出塞，过两周，践韩而以攻梁，一攻而不得，前功尽灭，公不若称病不出也。”"],
}
ZhanGuoBookPageModule[35] = {
    "index": "战国策",
    "name": "西周·楚兵在山南",
    "content": ["　　楚兵在山南，吾得将为楚王属怒于周。或谓周君曰：“不如令太子将军正迎吾得于境，而君自郊迎，令天下皆知君之重吾得也。因泄之楚，曰：‘周君所以事吾得者器，必名曰谋楚。’王必求之，而吾得无效也，王必罪之。”"],
}
ZhanGuoBookPageModule[36] = {
    "index": "战国策",
    "name": "西周·楚请道于二周之间",
    "content": ["　　楚请道于二周之间，以临韩、魏，周君患之。苏秦谓周君曰：“除道属之于河，韩、魏必恶之。齐、秦恐楚之取九鼎也，必救韩、魏而攻楚。楚不能守方城之外，安能道二周之间。若四国弗恶，君虽不欲与也，楚必将自取之矣。”"],
}
ZhanGuoBookPageModule[37] = {
    "index": "战国策",
    "name": "西周·司寇布为周最谓周君",
    "content": ["　　司寇布为周最谓周君曰：“君使人告齐王以周最不肯为太子也，臣为君不取也。函冶氏为齐太公买良剑，公不知善，归其剑而责之金。越人请买之干金，折而不卖。将死，而属其子曰：‘必无独知。’今君之使最为太子，独知之契也，天下未有信之者也。臣恐齐王之为君实立果而让之於最，以嫁之齐也。君为多巧，最为多诈，君何不买信货哉?奉养无有爱于最也，使天下见之。”"],
}
ZhanGuoBookPageModule[38] = {
    "index": "战国策",
    "name": "西周·秦召周君",
    "content": ["　　秦召周君，周君难往。或为周君谓魏王曰：“秦召周君，将以使攻魏之南阳。王何不出于河南?周君闻之，将以为辞于秦而不往。周君不入秦，秦必不敢越河而攻南阳。”"],
}
ZhanGuoBookPageModule[39] = {
    "index": "战国策",
    "name": "西周·犀武败于伊阙",
    "content": ["　　犀武败于伊阙，周君之魏求救，魏王以上党之急辞之。周君反，见梁囿而乐之也。綦母恢谓周君曰：“温囿不下此，而又近。臣能为君取之。”反见魏王，王曰：“周君怨寡人乎?”对曰：“不怨，且谁怨王?臣为王有患也。周君，谋主也。而设以国为王扞秦，而王无之扞也。臣见其必以国事秦也，秦悉塞外之兵，与周之众，以攻南阳，而两上党绝矣。”魏王曰：“然则奈何?”綦母恢曰：“周君形不小利，事秦而好小利。今王许戍三万人与温囿，周君得以为辞于父兄百姓，而利温囿以为乐，必不合于秦。臣尝闻温囿之利，岁八十金，君得温囿，其以事王者，岁百二十金，是上党每患而赢四十金。”魏王因使孟卯致温囿周君而许之戍也。"],
}
ZhanGuoBookPageModule[40] = {
    "index": "战国策",
    "name": "西周·韩魏易地",
    "content": ["　　韩、魏易地，西周弗利。樊余谓楚王曰：“周必亡矣。韩、魏之易地，韩得二县，魏亡二县，所以为之者，尽包二周，多于二县，九鼎存焉。且魏有南阳、郑地、三川而包二周，则楚方城之外危；韩兼两上党以临赵，即赵羊肠以上危。故易成之日，楚、赵皆轻。”楚王恐，因赵以止易也。"],
}
ZhanGuoBookPageModule[41] = {
    "index": "战国策",
    "name": "西周·秦欲攻周",
    "content": ["　　秦欲攻周，周最谓秦王曰：“为王之国计者，不攻周。攻周，实不足以利国，而声畏天下。天下以声畏秦，必东合于齐。兵弊于周，而合天下于齐，则秦孤而不王矣。是天下欲罢秦，故劝王攻周。秦与天下惧罢，则令不横行于周矣。”"],
}
ZhanGuoBookPageModule[42] = {
    "index": "战国策",
    "name": "西周·宫他谓周君",
    "content": ["　　宫他谓周君曰：“宛恃秦而轻晋，秦饥而宛亡。郑恃魏而轻韩，魏攻蔡而郑亡。邾、莒亡于齐，陈、蔡亡于楚。此皆恃援国而轻近敌也。今君恃韩、魏而轻秦，国恐伤矣。君不如使周最阴合于赵以备秦，则不毁。”"],
}
ZhanGuoBookPageModule[43] = {
    "index": "战国策",
    "name": "西周·谓齐王",
    "content": ["　　谓齐王曰：“王何不以地赍周最以为太子也。”齐王令司马悍以赂进周最于周。左尚谓司马悍曰：“周不听，是公之知困而交绝于周也。公不如谓周君曰：‘何欲置?令人微告悍，悍请令王进之以地。’”左尚以此得事。"],
}
ZhanGuoBookPageModule[44] = {
    "index": "战国策",
    "name": "西周·三国攻秦反",
    "content": ["　　三国攻秦反，西周恐魏之藉道也。为西周谓魏王曰：“楚、宋不利秦之德三国也，彼且攻王之聚以利秦。”魏王惧，令军设舍速东。"],
}
ZhanGuoBookPageModule[45] = {
    "index": "战国策",
    "name": "西周·犀武败",
    "content": ["　　犀武败，周使周足之秦。或谓周足曰：“何不谓周君曰：‘臣之秦，秦、周之交必恶。主君之臣，又秦重而欲相者，且恶臣于秦，而臣为不能使矣。臣愿免而行。君因相之，彼得相，不恶周于秦矣。’君重秦，故使相往，行而免，且轻秦也，公必不免。公言是而行，交善于秦，且公之成事也；交恶于秦，不善于公且诛矣。”"],
}
ZhanGuoBookPageModule[46] = {
    "index": "战国策",
    "name": "秦一·卫鞅亡魏入秦",
    "content": [
        "　　卫鞅亡魏入秦，孝公以为相，封之于商，号曰商君。商君治秦，法令至行，公平无私，罚不讳强大，赏不私亲近，法及太子，黥劓其傅。期年之后，道不拾遗，民不妄取，兵革大强，诸侯畏惧。然刻深寡恩，特以强服之耳。孝公行之八年，疾且不起，欲傳商君，辞不受。",
        "　　孝公已死，惠王代后，莅政有顷，商君告归。人说惠王曰：“大臣太重者国危，左右太亲者身危。今秦妇人婴儿皆言商君之法，莫言大王之法。是商君反为主，大王更为臣也。且夫商君，固大王仇雠也，愿大王图之。”商君归还，惠王车裂之，而秦人不怜。",
    ],
}
ZhanGuoBookPageModule[47] = {
    "index": "战国策",
    "name": "秦一·苏秦始将连横",
    "content": [
        "　　苏秦始将连横，说秦惠王曰：“大王之国，西有巴、蜀、汉中之利，北有胡貉、代马之用，南有巫山、黔中之限，东有肴、函之固。田肥美，民殷富，战车万乘，奋击百万，沃野千里，蓄积饶多，地势形便，此所谓天府，天下之雄国也。以大王之贤，士民之众，车骑之用，兵法之教，可以并诸侯，吞天下，称帝而治。愿大王少留意，臣请奏其效。”秦王曰：“寡人闻之，毛羽不丰满者不可以高飞，文章不成者不可以诛罚，道德不厚者不可以使民，政教不顺者不可以烦大臣。今先生俨然不远千里面庭教之，愿以异日。” 苏秦曰：“臣固疑大王之不能用也。昔者神农伐补遂，黄帝伐涿鹿而禽蚩尤，尧伐驩兜，舜伐三苗，禹伐共工，汤伐有夏，文王伐崇，武王伐纣，齐桓任战而伯天下。由此观之，恶有不战者乎?古者使车毂击驰，言语相结，天下为一；约从连横，兵革不藏；文士并饬，诸侯乱惑；万端俱起，不可胜理；科条既备，民多伪态；书策稠浊，百姓不足；上下相愁，民无所聊；明言章理，兵甲愈起；辩言伟服，战攻不息；繁称文辞，天下不治；舌弊耳聋，不见成功；行义约信，天下不亲。于是，乃废文任武，厚养死士，缀甲厉兵，效胜于战场。夫徒处而致利，安坐而广地，虽古五帝、三王、五伯，明主贤君，常欲坐而致之，其势不能，故以战续之。宽则两军相攻，迫则杖戟相撞，然后可建大功。是故兵胜于外，义强于内；威立于上，民服于下。今欲并天下，凌万乘，诎敌国，制海内，子元元，臣诸侯，非兵不可。今之嗣主，忽於至道，皆悯于教，乱于治，迷于言，惑于语，沈于辩，溺于辞。以此论之，王固不能行也。”",
        "　　说秦王书十上而说不行。黑貂之裘弊，黄金百斤尽，资用乏绝，去秦而归。羸滕履蹻，负书担櫜，形容枯搞，面目犁黑，状有归色。归至家，妻不下紝，嫂不为炊，父母不与言。苏秦喟叹曰：“妻不以我为夫，嫂不以我为叔，父母不以我为子，是皆秦之罪也。”乃夜发书，陈箧数十，得太公阴符之谋，伏而诵之，简练以为揣摩。读书欲睡，引锥自刺其股，血流至足。曰：“安有说人主不能出其金玉锦绣，取卿相之尊者乎?”期年揣摩成，曰：“此真可以说当世之君矣 。”",
        "　　于是乃摩燕乌集阙，见说赵王于华屋之下，抵掌而谈。赵王大悦，封为武安君。受相印，革车白乘，锦绣千纯，白壁百双，黄金万溢，以随其后，约从散横，以抑强秦。",
        "　　故苏秦相于赵而关不通。当此之时，天下之大，万民之众，王侯之威，谋臣之权，皆欲决苏秦之策。不费斗粮，未烦一兵，未战一士，未绝一弦，未折一矢，诸侯相亲，贤于兄弟。夫贤人在而天下服，一轼撙衔，横历天下，廷说诸侯之王，杜左右之口，天下莫之能伉。",
        "　　将说楚王，路过洛阳，父母闻之，清宫除道，张乐设饮，郊迎三十里。妻侧目而视，倾耳而听；嫂蛇行匍伏，四拜自跪而谢。苏秦曰：“嫂何前倨而后卑也?”嫂曰：“以季子之位尊而多金。”苏秦曰：“嗟乎！贫穷则父母不子，富贵则亲戚畏惧。人生世上，势位富贵，盖可忽乎哉！”　",
    ],
}
ZhanGuoBookPageModule[48] = {
    "index": "战国策",
    "name": "秦一·秦惠王谓寒泉子",
    "content": ["　　秦惠王谓寒泉子曰：“苏秦欺寡人，欲以一人之智，反覆东山之君，从以欺秦。赵固负其众，故先使苏秦以币帛约乎诸侯。诸侯不可一，犹连鸡之不能俱止于栖之明矣。寡人忿然，含怒日久。吾欲使武安子起往喻意焉。”寒泉子曰：“不可。夫攻城堕邑，请使武安子。善我国家使诸侯，请使客卿张仪。”秦惠王曰：“受命。”"],
}

ZhanGuoBookPageModule[49] = {
    "index": "战国策",
    "name": "秦一·泠向谓秦王",
    "content": ["　　泠向谓秦王曰：“向欲以齐事王，使攻宋也。宋破，晋国危，安邑，王之有也。燕、赵恶齐、秦之合，必割地以交于王矣。齐必重于王，则向之攻宋也，且以恐齐而重王。王何恶向之攻宋乎?向以王之明为先知之，故不言。”"],
}
ZhanGuoBookPageModule[50] = {
    "index": "战国策",
    "name": "秦一·张仪说秦王",
    "content": [
        "　　张仪说秦王曰：“臣闻之，弗知而言为不智，知而不言为不忠。为人臣不忠当死，言不审亦当死。虽然，臣愿悉言所闻，大王裁其罪。臣闻，天下阴燕阳魏，连荆固齐，收余韩成从，将西南以与秦为难。臣窃笑之。世有三亡，而天下得之，其此之谓乎!臣闻之曰：‘以乱攻治者亡，以邪攻正者亡，以逆攻顺者亡。’今天下之府库不盈，囷仓空虚，悉其士民，张军数千百万，白刃在前，斧质在后，而皆去走，不能死，罪其百姓不能死也，其上不能杀也。言赏则不与，言罚则不行，赏罚不行，故民不死也。",
        "　　“今秦出号令而行赏罚，不攻无功相事也。出其父母怀衽之中，生未尝见寇也，闻战顿足徒裼，犯白刃，蹈煨炭，断死于前者比是也。夫断死与断生也不同，而民为之者是贵奋也。一可以胜十，十可以胜百，百可以胜千，千可以胜万，万可以胜天下矣。今秦地形，断长续短，方数千里，名师数百万，秦之号令赏罚，地形利害，天下莫如也。以此与天下，天下不足兼而有也。是知秦战未尝不胜，攻未尝不取，所当未尝不破也。开地数千里，此甚大功也。然而甲兵顿，士民病，蓄积索，田畴荒，囷仓虚，四邻诸侯不服，伯王之名不成，此无异故，谋臣皆不尽其忠也。",
        "　　“臣敢言往昔。昔者齐南破荆，中破宋，西服秦，北破燕，中使韩、魏之君，地广而兵强，战胜攻取，诏令天下，济清河浊，足以为限，长城、钜坊，足以为塞。齐，五战之国也，一战不胜而无齐。故由此观之，夫战者万乘之存亡也。",
        "　　且臣闻之曰：‘削株掘根，无与祸邻，祸乃不存。’秦与荆人战，大破荆，袭郢，取洞庭、五都、江南。荆王亡奔走，东伏于陈。当是之时，随荆以兵，则荆可举。举荆，则其民足贪也，地足利也。东以强齐、燕，中陵三晋。然则是一举而伯王之名可成也，四邻诸侯可朝也。而谋臣不为，引军而退，与荆人和。今荆人收亡国，聚散民，立社主，置宗庙， 令帅天下西面以与秦为难，此固已无伯王之道一矣。天下有比志而军华下，大王以诈破之，兵至梁郭，围梁数旬，则梁可拔。拔梁，则魏可举。举魏，则荆、赵之志绝。荆、赵之志绝，则赵危。赵危而荆孤。东以强齐、燕，中陵三晋，然则是一举而伯王之名可成也，四邻诸侯可朝也。而谋臣不为，引军而退。与魏氏和，令魏氏收亡国，聚散民，立社主，置宗庙，此固已无伯王之道二矣。前者穰侯之治秦也，用一国之兵，而欲以成两国之功。是故兵终暴灵于外，士民潞病于内，伯王之名不成，此固已无伯王之道三矣。",
        "　　“赵氏，中央之国也，杂民之所居也。其民轻而难用，号令不治，赏罚不信，地形不便，上非能尽其民力。彼固亡国之形也，而不忧民氓，悉其士民，军于长平之下，以争韩之上党，大王以诈破之，拔武安。当是时，赵氏上下不相亲也，贵贱不相信，然则是邯郸不守，拔邯郸，完河间，引军而去，西攻修武，逾羊肠，降代、上党。代三十六县，上党十七县，不用一领甲，不苦一民，皆秦之有也。代、上党不战而已为秦矣，东阳河外不战而已反为齐矣，中呼池以北不战而已为燕矣。然则是举赵则韩必亡，韩亡则荆、魏不能独立。荆、魏不能独立，则是一举而坏韩，蠹魏，挟荆，以东弱齐、燕，决白马之口，以流魏氏。一举而三晋亡，从者败。大王拱手以须，天下遍随而伏，伯王之名可成也。而谋臣不为，引军而退，与赵氏为和。以大王之明，秦兵之强，伯王之业，地尊不可得，乃取欺于亡国，是谋臣之拙也。且夫赵当亡不亡，秦当伯不伯，天下固量秦之谋臣一矣。乃复悉卒乃攻邯郸，不能拔也，弃甲兵怒，战慄而却，天下固量秦力二矣，军乃引退，并于李下，大王又并军而致与战，非能厚胜之也，又交罢却，天下固量秦力三矣。内者量吾谋臣，外者极吾兵力。由是观之，臣以天下之从，岂其难矣。内者吾甲兵顿，士民病，蓄积索，田畴荒，囷仓虚；外者天下比志甚固。愿大王有以虑之也。",
        "　　“且臣闻之，战战慄慄，日慎一日。苟慎其道，天下可有也。何以知其然也?昔者纣为天子，帅天下将甲百万，左饮于淇谷，有饮于洹水，淇水竭而洹水不流，以与周武为难。武王将素甲三干领，战一日，破纣之国，禽其身，据其地，而有其民，天下莫不伤。智伯帅三国之众，以攻赵襄主于晋阳，决水灌之，三年，城且拔矣。襄主错龟，数策占兆，以视利害，何国可降，而使张孟谈。于是潜行而出，反智伯之约，得两国之众，以攻智伯之国，禽其身，以成襄子之功。今秦地断长续短，方数千里，名师数百万，秦国号令赏罚，地形利害，天下莫如也。以此与天下，天下可兼而有也。",
        "　　“臣昧死望见大王，言所以举破天下之从，举赵亡韩，臣荆、魏，亲齐、燕，以成伯王之名，朝四邻诸侯之道。大王试听其说，一举而天下之从不破，赵不举，韩不亡，荆、魏不臣，齐、燕不亲，伯王之名不成，四邻诸侯不朝，大王斩臣以徇于国，以主为谋不忠者。”　",
    ],
}
ZhanGuoBookPageModule[51] = {
    "index": "战国策",
    "name": "秦一·张仪欲假秦兵以救魏",
    "content": ["　　张仪欲假秦兵以救魏。左成谓首茂曰：“子不予之。魏不反秦兵，张子不反秦。魏若反秦兵，张子得志于魏，不敢反于秦矣。张子不去秦，张子必高子。”’"],
}
ZhanGuoBookPageModule[52] = {
    "index": "战国策",
    "name": "秦一·司马错与张仪争论于秦惠王前",
    "content": [
        "　　司马错与张仪争论于秦惠王前。司马错欲伐蜀，张仪曰：“不如伐韩。”王曰：“请闻其说。”",
        "　　对曰：“亲魏善楚，下兵三川，塞轘辕、缑氏之口，当屯留之道，魏绝南阳，楚临南郑，秦攻新城、宜阳，以临二周之郊，诛周主之罪，侵楚、魏之地。周自知不救，九鼎宝器必出。据九鼎，按图籍，挟天子以令天下，天下莫敢不听，此王业也。今夫蜀，西辟之国，而戎狄之长也，弊兵劳众，不足以成名，得其地，不足以为利。臣闻：‘争名者于朝，争利者于市。’今三川、周室，天下之市朝也，而王不争焉，顾争于戎狄，去王业远矣。”",
        "　　司马错曰：“不然。臣闻之，欲富国者，务广其地；欲强兵者，务富其民；欲王者，务博其德。三资者备，而王随之矣。今王之地小民贫，故臣愿从事于易。夫蜀，西辟之国也，而戎狄之长也，而有桀、纣之乱。以秦攻之，譬如使豺狼逐群羊也。取其地，足以广国也；得其财，足以富民；缮兵不伤众，而彼已服矣。故拔一国，而天下不以为暴；利尽西海，诸侯不以为贪。是我一举而名实两附，而又有禁暴正乱之名。今攻韩劫天子，劫天子，恶名也，而未必利也，又有不义之名，而攻天下之所不欲，危!臣请谒其故：周，天下之宗室也；齐，韩、周之与国也。周自知失九鼎，韩自知亡三川，则必将二国并力合谋，以因于齐、赵，而求解乎楚、魏。以鼎与楚，以地与魏，王不能禁。此臣所谓‘危’，不如伐蜀之完也。”惠王曰：“善!寡人听子。”",
        "　　卒起兵伐蜀，十月取之，遂定蜀。蜀主更号为侯，而使陈庄相蜀。蜀既属，秦益强富厚，轻诸侯。",],
}
ZhanGuoBookPageModule[53] = {
    "index": "战国策",
    "name": "秦一·张仪之残樗里疾",
    "content": ["　　张仪之残樗里疾也，重而使之楚。因令楚王为之请相于秦。张子谓秦王曰：“重樗里疾而使之者，将以为国交也。今身在楚，楚王因为请相于秦。臣闻其言曰：‘王欲穷仪于秦乎?臣请助王。’楚王以为然，故为请相也。今王诚听之，彼必以国事楚王。”秦王大怒，樗里疾出走。"],
}
ZhanGuoBookPageModule[54] = {
    "index": "战国策",
    "name": "秦一·张仪欲以汉中与楚",
    "content": ["　　张仪欲以汉中与楚，请秦王曰：“有汉中，蠹。种树不处者，人必害之；家有不宜之财，则伤本。汉中南边为楚利，此国累也。”甘茂谓王曰：“地大者，固多忧乎!天下有变，王割汉中以为和楚，楚必畔天下而与王。王今以汉中与楚，即天下有变，王何以市楚也?”　"],
}
ZhanGuoBookPageModule[55] = {
    "index": "战国策",
    "name": "秦一·楚攻魏张仪谓秦王",
    "content": ["　　楚攻魏。张仪谓秦王曰：“不如与魏以劲之，魏战胜，复听于秦，必入西河之外；不胜，魏不能守，王必取之。”王用仪言，取皮氏卒万人，车百乘。以与魏。犀首战胜威王，魏兵罢弊，恐畏秦，果献西河之外。"],
}
ZhanGuoBookPageModule[56] = {
    "index": "战国策",
    "name": "秦一·田莘之为陈轸说秦惠王",
    "content": ["　　田莘之为陈轸说秦惠王曰：“臣恐王之如郭君。夫晋献公欲伐郭，而惮舟之侨存，荀息曰：‘周书有言，美女破舌。’乃遗之女乐，以乱其政。舟之侨谏而不听，遂去。因而伐郭，遂破之。又欲伐虞，而惮宫之奇存。荀息曰：‘周书有言，美男破老。’乃遗之美男，教之恶宫之奇。宫之奇以谏而不听，遂亡。因而伐虞，遂取之。今秦自以为王，能害王者之国者，楚也。楚智横君之善用兵，用兵与陈轸之智，故骄张仪以五国。来，必恶是二人。愿王勿听也。”张仪果来辞，因言轸也，王怒而不听。"],
}
ZhanGuoBookPageModule[57] = {
    "index": "战国策",
    "name": "秦一·张仪又恶陈轸于秦王",
    "content": ["　　张仪又恶陈轸于秦王。曰：“轸驰楚、秦之间，今楚不加善秦而善轸，然则是轸自为而不为国也。且轸欲去秦而之楚，王何不听乎?”王谓陈轸曰：“吾闻子欲去秦而之楚，信乎?”陈轸曰：“然。”王曰：“仪之言果信也。”曰：“非独仪知之也，行道之人皆知之。曰：‘孝己爱其亲，天下欲以为子；子胥忠乎其君，天下欲以为臣。卖仆妾售乎闾巷者，良仆妾也；出妇嫁乡曲者，良妇也。’吾不忠于君，楚亦何以轸为忠乎?忠且见弃，吾不之楚，何适乎?”秦王曰：“善。”乃必之也。"],
}
ZhanGuoBookPageModule[58] = {
    "index": "战国策",
    "name": "秦一·陈轸去楚之秦",
    "content": [
        "　　陈轸去楚之秦。张仪谓秦王曰：“陈轸为王臣，常以国情输楚。仪不能与从事，愿王逐之。即复之楚，愿王杀之。”王曰：“轸安敢之楚也。”",
        "　　王召陈轸告之曰：“吾能听子言，子欲何之?请为子车约。”对曰：“臣愿之楚。”王曰：“仪以子为之楚，吾又自知子之楚。子非楚，且安之也!”轸曰：“臣出，必故之楚，以顺王与仪之策，而明臣之楚与不也。楚人有两妻者，人誂其长者，詈之；誂其少者，少者许之。居无几何，有两妻者死。客谓誂者曰：“汝取长者乎?少者乎?”“取长者。”客曰：“长者詈汝，少者和汝，汝何为取长者?”曰：“居彼人之所，则欲其许我也。今为我妻，则欲其为我詈人也。’今楚王明主也，而昭阳贤相也。轸为人臣，而常以国输楚王，王必不留臣，昭阳将不与臣从事矣。以此明臣之楚与不。”",
        "　　轸出，张仪入，问王曰：“陈轸果安之?”王曰：“夫轸，天下之辩士也，孰视寡人曰：‘轸必之楚。’寡人遂无奈何也。寡人因问曰：‘子必之楚也，则仪之言果信矣。’轸曰：‘非独仪之言也，行道之人皆知之。昔者子胥忠其君，天下皆欲以为臣；孝己爱其亲，天下皆欲以为子。故卖仆妾不出里巷而取者，良仆妾也；出妇嫁于乡里者，善妇也。臣不忠于王，楚何以轸为?忠尚见弃，轸不之楚，而何之乎?’”王以为然，遂善待之。",
    ],
}

ZhanGuoBookPageModule[59] = {
    "index": "战国策",
    "name": "秦二·齐助楚攻秦",
    "content": [
        "　　齐助楚攻秦，取曲沃。其后，秦欲伐齐，齐、楚之交善，惠王患之，谓张仪曰：“吾欲伐齐，齐、楚方欢，子为寡人虑之，奈何?”张仪曰：“王其为臣约车并币，臣请试之。”",
        "　　张仪南见楚王曰：“弊邑之王所说甚者，无大大王；唯仪之所甚愿为臣者，亦无大大王。弊邑之王所甚憎者，亦无先齐王；唯仪之甚憎者，亦无大齐王。今齐之罪，其于弊邑之王甚厚，弊邑欲伐之，而大国与之欢，是以弊邑之王不得事令，而仪不得为臣也。大王苟能闭关绝齐，臣请使秦王献商於之地，方六百里。若此，齐必弱，齐弱则必为王役矣。则是北弱齐，西德于秦，而私商於之地以为利也，则此一计而三利俱至。”",
        "　　楚王大说，宣言之于朝廷，曰：“不穀得商於之田，方六百里。”群臣闻见者毕贺，陈轸后见，独不贺。楚王曰：“不穀不烦一兵，不伤一人，而得商於之地六百里，寡人自以为智矣!诸士大夫皆贺，子独不贺，何也?”陈轸对曰：“臣见商於之地不可得，而患必至也，故不敢妄贺。”王曰：“何也?”对曰：“夫秦所以重王者，以王有齐也。今地未可得而齐先绝，是楚孤也，秦又何重孤国?且先出地绝齐，秦计必弗为也。先绝齐后责地，且必受欺于张仪。受欺于张仪，王必惋之。是西生秦患，北绝齐交，则两国兵必至矣。”楚王不听，曰：“吾事善矣!子其弭口无言，以待吾事。”楚王使人绝齐，使者未来，又重绝之。",
        "　　张仪反，秦使人使齐，齐、秦之交阴合。楚因使一将军受地于秦。张仪至，称病不朝。楚王曰：“张子以寡人不绝齐乎?”乃使勇士往詈齐王。张仪知楚绝齐也，乃出见使者曰：“从某至某，广从六里。”使者曰：“臣闻六百里，不闻六里。”仪曰：“仪固以小人，安得六百里?”使者反报楚王，楚王大怒，欲兴师伐秦。陈轸曰：“臣可以言乎?”王曰：“可矣。”轸曰：“伐秦非计也，王不如因而赂之一名都，与之伐齐，是我亡于秦而取偿于齐也。楚国不尚全事。王今已绝齐，而责欺于秦，是吾合齐、秦之交也，固必大伤。”",
        "　　楚王不听，遂举兵伐秦。秦与齐合，韩氏从之。楚兵大败于杜陵。故楚之土壤士民非削弱，仅以救亡者，计失于陈轸，过听于张仪。",
    ],
}
ZhanGuoBookPageModule[60] = {
    "index": "战国策",
    "name": "秦二·楚绝齐齐举兵伐楚",
    "content": ["　　楚绝齐，齐举兵伐楚。陈轸谓楚王曰：“王不如以地东解于齐，西讲于秦。”楚王使陈轸之秦，秦王谓轸曰：“子，秦人也，寡人与子故也，寡人不佞，不能亲国事也，故子弃寡人，事楚王。今齐、楚相伐，或谓救之便，或谓救之不便，子独不可以忠为子主计，以其余为寡人乎?”陈轸曰：“王独不闻吴人之游楚者乎?楚王甚爱之，病，故使人问之，曰：‘诚病乎?意亦思乎?’左右曰：‘臣不知其思与不思，诚思则将吴吟。’今轸将为王吴吟。王不闻夫管与之说乎?有两虎诤人而斗者，管庄子将刺之，管与止之曰：“虎者，戾虫；人者，甘饵也。今两虎诤人而斗，小者必死，大者必伤。子待伤虎而刺之，则是一举而兼两虎也。无刺一虎之劳，而有刺两虎之名。’齐、楚今战，战必败。败，王起兵救之，有救齐之利，而无伐楚之害。计听知复逆者，唯王可也。计者，事之本也；听者，存亡之机。计失而听过，能有国者寡也。故曰：‘计有一二者难悖也，听无失本末者难惑。”　"],
}
ZhanGuoBookPageModule[61] = {
    "index": "战国策",
    "name": "秦二·秦惠王死公孙衍欲穷张仪",
    "content": ["　　秦惠王死，公孙衍欲穷张仪。李雠谓公孙衍曰：“不如召甘茂于魏，召公孙显于韩，起樗里子于国。三人者，皆张仪之雠也，公用之，则诸侯必见张仪之无秦矣。”"],
}
ZhanGuoBookPageModule[62] = {
    "index": "战国策",
    "name": "秦二·义渠君之魏",
    "content": ["　　义渠君之魏，公孙衍谓义渠君曰：“道远，臣不得复过矣，请谒事情。”义渠君口：“愿闻之。”对曰：“中国无事于秦，则秦且烧（艹热）获君之国；中国为有事于秦，则秦且轻使重币，而事君之国也。”义渠君曰：“谨闻令。” 居无几何，五国伐秦。陈圳谓秦王曰：“义渠君者，蛮夷之贤君，王不如赂之以抚其心。”秦王曰：“善。”因以文绣千匹，好女百人，遗义渠君。义渠君致群臣而谋曰：“此乃公孙衍之所谓也。”因起兵袭秦，大败秦人于李帛之下。"],
}
ZhanGuoBookPageModule[63] = {
    "index": "战国策",
    "name": "秦二·医扁鹊见秦武王",
    "content": ["　　医扁鹊见秦武王，武王示之病，扁鹊请除。左右曰：“君之病，在耳之前，目之下，除之未必已也，将使耳不聪，目不明。”君以告扁鹊。扁鹊怒而投其石：“君与知之者谋之，而与不知者败之，使此知秦国之政也，则君一举而亡国矣。”　"],
}
ZhanGuoBookPageModule[64] = {
    "index": "战国策",
    "name": "秦二·秦武王谓甘茂",
    "content": ["　　秦武王谓甘茂曰：“寡人欲车通三川，以窥周室，而寡人死不朽乎?”甘茂对曰：“请之魏，约伐韩。”王令向寿辅行。甘茂至魏，谓向寿：“子归，告王曰：‘魏听臣矣，然愿王勿攻也。’事成，尽以为子功。”向寿归以告王，王迎甘茂于息壤。甘茂至，王问其故。对曰：“宜阳，大县也，上党、南阳积之久矣，名为县，其实郡也。今王倍数险，行千里而攻之，难矣。臣闻张仪西并巴、蜀之地，北取西河之外，南取上庸，天下不以为多张仪而贤先王。魏文侯令乐羊将，攻中山，三年而拔之，乐羊反而语功，文侯示之谤书一箧，乐羊再拜稽首曰：‘此非臣之功，主君之力也。’今臣羁旅之臣也，樗里疾、公孙衍二人者，挟韩而议，王必听之，是王欺魏，而臣受公仲侈之怨也。昔者曾子处费，费人有与曾子同名族者而杀人，人告曾子母曰：‘曾参杀人。’曾子之母曰：‘吾子不杀人。’织自若。有顷焉，人又曰：‘曾参杀人。’其母尚织自若也。顷之，一人又告之曰：‘曾参杀人。’其母惧，投杼逾墙而走。夫以曾参之贤，与母之信也，而三人疑之，则慈母不能信也。今臣之贤不及曾子，而王之信臣，又未若曾子之母也，疑臣者不适三人，臣恐王为臣之投杼也。”王曰：“寡人不听也，请与子盟。”于是与之盟于息壤。 果攻宜阳，五月而不能拔也。樗里疾、公孙衍二人在，争之王，王将听之，召甘茂而告之。甘茂对曰：“息壤在彼。”王曰：“有之。”因悉起兵，复使甘茂攻之，遂拔宜阳。"],
}
ZhanGuoBookPageModule[65] = {
    "index": "战国策",
    "name": "秦二·宜阳之役冯章谓秦王",
    "content": ["　　宜阳之役，冯章谓秦王曰：“不拔宜阳，韩、楚乘吾弊，国必危矣!不如许楚汉中以欢之。楚欢而不进，韩必孤，无奈秦何矣!”王曰：“善。”果使冯章许楚汉中，而拔宜阳。楚王以其言责汉中於冯章，冯章谓秦王曰：“王遂亡臣，固谓楚王曰：‘寡人固无地而许楚王。’”"],
}
ZhanGuoBookPageModule[66] = {
    "index": "战国策",
    "name": "秦二·甘茂攻宜阳",
    "content": ["　　甘茂攻宜阳，三鼓之而卒不上。秦之右将有尉对曰：“公不论兵，必大困。”甘茂曰：“我羁旅而得相秦者，我以宜阳饵王。今攻宜阳而不拔，公孙衍、樗里疾挫我于内，而公中以韩穷我于外，是无伐之日已!请明日鼓之，而不可下，因以宜阳之郭为墓。”於是出私金以益公赏。明日鼓之，宜阳拔。"],
}
ZhanGuoBookPageModule[67] = {
    "index": "战国策",
    "name": "秦二·宜阳未得",
    "content": ["　　宜阳末得，秦死伤者众，甘茂欲息兵。左成谓甘茂曰：“公内攻于樗里疾、公孙衍，而外与韩侈为怨，今公用兵无功，公必穷矣。公不如进兵攻宜阳，宜阳拔，则公之功多矣。是樗里疾、公孙衍无事也，秦众尽怨之深矣。”"],
}
ZhanGuoBookPageModule[68] = {
    "index": "战国策",
    "name": "秦二·宜阳之役楚畔秦而合於韩",
    "content": ["　　宜阳之役，楚畔秦而合於韩。秦王惧。甘茂曰：“楚虽合韩，不为韩氏先战；韩亦恐战而楚有变其后。韩、楚必相御也。楚言与韩，而不余怨于秦，臣是以知其御也。"],
}
ZhanGuoBookPageModule[69] = {
    "index": "战国策",
    "name": "秦二·秦王谓甘茂",
    "content": [
        "　　秦王谓甘茂曰：“楚客来使者多健，与寡人争辞，寡人数穷焉，为之奈何?”甘茂对曰：",
        "　　“王勿患也!其健者来使者，则王勿听其事；其需弱者来使，．则王必听之。然则需弱者用，而健者不用矣!王因而制之。”　",
    ],
}
ZhanGuoBookPageModule[70] = {
    "index": "战国策",
    "name": "秦二·甘茂亡秦且之齐",
    "content": ["　　甘茂亡秦，且之齐，出关遇苏子，曰：“君闻夫江上之处女乎?”苏子曰：“不闻。”曰：“夫江上之处女，有家贫而无烛者，处女相与语，欲去之。家贫无烛者将去矣，谓处女曰：‘妾以无烛，故常先至，扫室布席，何爱余明之照四壁者?幸以赐妾，何妨于处女?妾自以有益于处女，何为去我?’处女相语以为然而留之。今臣不肖，弃逐于秦而出关，愿为足下扫室布席，幸无我逐也。”苏子曰：“善。请重公于齐。”乃西说秦王曰：“甘茂，贤人，非恒士也。其居秦，累世重矣，自殽塞、谿谷，地形险易尽知之。彼若以齐约韩、魏，反以谋秦，是非秦之利也。”秦王曰：“然则奈何?”苏代曰：“不如重其贽，厚其禄以迎之。彼来则置之槐谷，终身勿出，天下何从图秦。”秦王曰：“善。”与之上卿，以相迎之齐。甘茂辞不往，苏秦伪谓王曰：“甘茂，贤人也。今秦与之上卿，以相迎之，茂德王之赐，故不往，愿为王臣。今王何以礼之?王若不留，必不德王。彼以甘茂之贤，得擅用强秦之众，则难图也!”齐王曰：“善。”赐之上卿，命而处之。"],
}
ZhanGuoBookPageModule[71] = {
    "index": "战国策",
    "name": "秦二·甘茂相秦",
    "content": ["　　甘茂相秦。秦王爱公孙衍，与之间有所立，因自谓之曰：“寡人且相子。”甘茂之吏道而闻之，以告甘茂。甘茂因入见王曰：“王得贤相，敢再拜贺。”王曰：“寡人托国于子，焉更得贤相?”对曰：“王且相犀首。”王曰：“子焉闻之?”对曰：“犀首告臣。”王怒于犀首之泄也，乃逐之。"],
}
ZhanGuoBookPageModule[72] = {
    "index": "战国策",
    "name": "秦二·甘茂约秦魏而攻楚",
    "content": [
        "　　甘茂约秦、魏而攻楚。楚之相秦者屈盖，为楚和于秦，秦启关而听楚使。甘茂谓秦王曰：",
        "　　“怵于楚而不使魏制和，楚必曰‘秦鬻魏’。不悦而合于楚，楚、魏为一，国恐伤矣。王不如使魏制和，魏制和必悦。王不恶于魏，则寄地必多矣。”　",
    ],
}
ZhanGuoBookPageModule[73] = {
    "index": "战国策",
    "name": "秦二·陉山之事",
    "content": [
        "　　陉山之事，赵且与秦伐齐。齐惧，令田章以阳武合于赵，而以顺子为质。赵王喜，乃案兵告于秦曰：“齐以阳武赐弊邑而纳顺子，欲以解伐。敢告下吏。”",
        "　　秦王使公子他之赵，谓赵王曰：“齐与大国救魏而倍约，不可信恃，大国不义，以告弊邑，而赐之二社之地，以奉祭祀。今又案兵，且欲合齐而受其地，非使臣之所知也。请益甲四万，大国裁之”。",
        "　　苏代为齐献书穰侯曰：“臣闻往来之者言曰：‘秦且益赵甲四万人以伐齐。’臣窃必之弊邑之王曰：‘秦王明而熟于计，穰侯智而习于事，必不益赵甲四万人以伐齐。’是何也?夫三晋相结，秦之深雠也。三晋百背秦，百欺秦，不为不信，不为无行。今破齐以肥赵，赵，秦之深讎，不利于秦。一也。秦之谋者必曰：‘破齐弊晋，而后制晋、楚之胜。’夫齐，罢国也，以天下击之，譬犹以千钧之弩溃痈也。秦王安能制晋、楚哉!二也。秦少出兵，则晋、楚不信；多出兵，则晋、楚制于秦。齐恐，则必不走于秦且走晋、楚。三也。齐割地以实晋、楚，则晋、楚安。齐举兵而为之顿剑，则秦反受兵。四也。是晋、楚以秦破齐，以齐破秦，何晋、楚之智而齐、秦之愚!五也。秦得安邑，善齐以安之，亦必无患矣。秦有安邑，则韩、魏必无上党哉。夫取三晋之肠胃与出兵而惧其不反也，孰利?故臣窃必之弊邑之王曰：‘秦王明而熟于计，穰侯智而习于事，必不益赵甲四万人以伐齐矣。’”",
    ],
}
ZhanGuoBookPageModule[74] = {
    "index": "战国策",
    "name": "秦二·秦宣太后爱魏丑夫",
    "content": ["　　秦宣太后爱魏丑夫。太后病将死，出令曰：“为我葬，必以魏子为殉。”魏子患之。庸芮为魏子说太后曰：“以死者为有知乎?”太后曰：“无知也。”曰：“若太后之神灵，明知死者之无知矣，何为空以生所爱，葬于无知之死人哉!若死者有知，先王积怒之日久矣，太后救过不赡，何暇乃私魏丑夫乎?”太后曰：“善。”乃止。"],
}
ZhanGuoBookPageModule[75] = {
    "index": "战国策",
    "name": "秦三·薛公为魏谓魏冉",
    "content": ["　　薛公为魏谓魏冉曰：“文闻秦王欲以吕礼收齐，以济天下，君必轻矣。齐、秦相聚以临三晋，礼必并相之，是君收齐以重吕礼也。齐免于天下之兵，其雠君必深。君不如劝秦王令弊邑卒攻齐之事。齐破，文请从所得封君。齐破晋强，秦王畏晋之强也，必重君以取晋。齐予晋弊邑，而不能支秦，晋必重君以事秦。是君破齐以为功，操晋以为重也。破齐定封，而秦、晋皆重君；若齐不破，吕礼复用，子必大穷矣。”"],
}

ZhanGuoBookPageModule[76] = {
    "index": "战国策",
    "name": "秦三·秦客卿造谓穰侯",
    "content": [
        "　　秦客卿造谓穰侯曰；“秦封君以陶，藉君天下数年矣。攻齐之事成，陶为万乘，长小国，率以朝天子，天下必听，五伯之事也；攻齐不成，陶为邻恤，而莫之据也。故攻齐之于陶也，存亡之机也。",
        "　　“君欲成之，何不使人谓燕相国曰：‘圣人不能为时，时至而弗失。舜虽贤，不遇尧也，不得为天子；汤、武虽贤，不当桀、纣不王。故以舜、汤、武之贤，不遭时，不得帝王。令攻齐，此君之大时也已。因天下之力，伐雠国之齐，报惠王之耻，成昭王之功，除万世之害，此燕之长利，而君之大名也。 《书》云，树德莫如滋，除害莫如尽。吴不亡越，越故亡吴；齐不亡燕，燕故亡齐。齐亡于燕，吴亡于越，此除疾不尽也。以非此时也，成君之功，除君之害，秦卒有他事而从齐，齐、赵合，其雠君必深矣。挟君之雠以诛于燕，后虽悔之，不可得也已。君悉燕兵而疾僭之，天下之从君也，若报父子之仇。诚能亡齐，封君于河南，为万乘，达途于中国，南与陶为邻，世世无患。愿君之专志于攻齐，而无他虑也。’”",],
}
ZhanGuoBookPageModule[77] = {
    "index": "战国策",
    "name": "秦三·魏谓魏冉",
    "content": ["　　魏谓魏冉曰：“公闻东方之语乎?”曰：“弗闻也。”曰：“辛、张阳、毋泽说魏王、薛公、公叔也，曰：‘臣战，载主契国以与王约，必无患矣。若有败之者，臣请挈领。然而臣有患也。夫楚王之以其臣请挈领，然而臣有患也。夫楚王之以其国依冉也，而事臣之主，此臣之甚患也。’今公东而因言于楚，是令张仪之言为禹，而务败公之事也。公不如反公国，德楚而观薛公之为公也。观三国之所求于秦而不能得者，请以号三国以自信也。观张仪与泽之所不能得于薛公者也，而公请之以自重也。”　"],
}
ZhanGuoBookPageModule[78] = {
    "index": "战国策",
    "name": "秦三·谓魏冉曰和不成",
    "content": ["　　谓魏冉曰：“和不成，兵必出。白起者，且复将。战胜，必穷公；不胜，必事赵从公。公又轻，公不若毋多，则疾到。”"],
}
ZhanGuoBookPageModule[79] = {
    "index": "战国策",
    "name": "秦三·谓穰侯",
    "content": ["　　谓穰侯曰：“为君虑封，若于除宋罪，重齐怒；须残伐乱宋，德强齐，定身封。此亦百世之时也已。”"],
}
ZhanGuoBookPageModule[80] = {
    "index": "战国策",
    "name": "秦三·谓魏冉曰楚破秦",
    "content": ["　　谓魏冉曰：“楚破秦，不能与齐县衡矣。秦三世积节于韩、魏，而齐之德新加与。齐、秦交争，韩、魏东听，则秦伐矣。齐有东国之地，方千里。楚苞九夷，又方千里，南有符离之塞，北有甘鱼之口。权县宋、卫，宋、卫乃当阿、甄耳。利有千里者二，富擅越隶，秦乌能与齐县衡韩、魏，支分方城膏腴之地以薄郑?兵休复起，足以伤秦，不必待齐。”"],
}
ZhanGuoBookPageModule[81] = {
    "index": "战国策",
    "name": "秦三·五国罢成皋",
    "content": [
        "　　五国罢成皋，秦王欲为成阳君求相韩、魏，韩、魏弗听。秦太后为魏冉谓秦王曰：",
        "　　“成阳君以王之故，穷而居于齐，今王见其达而收之，亦能翕其心乎?”王曰：“未也。”太后曰：“穷而不收，达而报之，恐不为王用。且收成阳君，失韩、魏之道也。”",
    ],
}
ZhanGuoBookPageModule[82] = {
    "index": "战国策",
    "name": "秦三·范子因王稽入秦",
    "content": [
        "　　范子因王稽入秦，献书昭王曰：“臣闻明主莅正，有功者不得不赏，有能者不得不官；劳大者其禄厚、功多者其爵尊，能治众者其官大。故不能者不敢当其职焉，能者亦不得蔽隐。使以臣之言为可，则行而益利其道；若将弗行，则久留臣无为也。语曰：‘人主赏所爱而罚所恶。明主则不然，赏必加于有功，刑必断于有罪。’今臣之胸不足以当椹质，要不足以待斧钺，岂敢以疑事尝试于王乎?虽以臣为贱而轻辱臣，独不重任臣者后无反复于王前耶!",
        "　　“臣闻周有砥厄，宋有结绿，梁有悬黎，楚有和璞。此四宝者，工之所失也，而为天下名器。然则圣王之所弃者，独不足以厚国家乎?",
        "　　“臣闻善厚家者，取之于国；善厚国者，取之于诸侯。天下有明主，则诸侯不得擅厚矣。是何故也?为其凋荣也。良医知病人之死生，圣主明于成败之事，利则行之，害则舍之，疑则少尝之，虽尧、舜、禹、汤复生，弗能改已!语之至者，臣不敢载之于书；其浅者又不足听也。意者，臣愚而不阖于王心耶？已其言臣者，将贱而不足听耶!非若是也，则臣之志，愿少赐游观之间，望见足下而入之。”",
        "　　书上，秦王说之，因谢王稽说，使人持车召之。",
    ],
}
ZhanGuoBookPageModule[83] = {
    "index": "战国策",
    "name": "秦三·范睢至秦",
    "content": [
        "　　范睢至秦，王庭迎，谓范睢曰：“寡人宜以身受令久矣。今者义渠之事急，寡人日自请太后。今义渠之事已，寡人乃得以身受命。躬窃闵然不敏，敬执宾主之礼。”范睢辞让。",
        "　　是日见范睢，见者无不变色易容者。秦王屏左右，宫中虚无人，秦王跪而请曰：“先生何以幸教寡人?”范睢曰：“唯唯。”有间，秦王复请，范睢曰：“唯唯。”若是者三。",
        "　　秦王跽曰：“先生不幸教寡人乎?” 范睢谢曰：“非敢然也。臣闻始时吕尚之遇文王也，身为渔父而钓于渭阳之滨耳。若是者，交疏也。已一说而立为太师，载与俱归者，其言深也。故文王果收功于吕尚，卒擅天下而身立为帝王。即使文王疏吕望而弗与深言，是周无天子之德，而文、武无与成其王也。今臣，羁旅之臣也，交疏于王，而所愿陈者，皆匡君之之事，处人骨肉之间，愿以陈臣之陋忠，而未知王心也，所以王三问而不对者是也。臣非有所畏而不敢言也，知今日言之于前，而明日伏诛于后，然臣弗敢畏也。大王信行臣之言，死不足以为臣患，亡不足以为臣忧，漆身而为厉，被发而为狂，不足以为臣耻。五帝之圣而死，三王之仁而死，五伯之贤而死，乌获之力而死，奔、育之勇焉而死。死者，人之所必不免也。处必然之势，可以少有补于秦，此臣之所大愿也，臣何患乎?伍子胥櫜载而出昭关，夜行而昼伏，至于凌水，无以饵其口，坐行蒲服，乞食于吴市，卒兴吴国，阖庐为霸。使臣得进谋如伍子胥，加之以幽囚，终身不复见，是臣说之行也，臣何忧乎?箕子、接舆，漆身而为厉，被发而为狂，无益于殷、楚。使臣得同行于箕子、接舆，漆身可以补所贤之主，是臣之大荣也，臣又何耻乎?臣之所恐者，独恐臣死之后，天下见臣尽忠而身蹶也，是以杜口裹足，莫肯即秦耳。足下上畏太后之严，下惑奸臣之态；居深宫之中，不离保傅之手；终身暗惑，无与照奸；大者宗庙灭覆，小者身以孤危。此臣之所恐耳!若夫穷辱之事，死亡之患，臣弗敢畏也。臣死而秦治，贤于生也。”",
        "　　秦王跽曰：“先生是何言也!夫秦国僻远，寡人愚不肖，先生乃幸至此，此天以寡人慁先生，而存先王之庙也。寡人得受命于先生，此天所以幸先王而不弃其孤也。先生奈何而言若此!事无大小，上及太后，下至大臣，愿先生悉以教寡人，无疑寡人也。”范睢再拜，秦王亦再拜。",
        "　　范睢曰：“大王之国，北有甘泉、谷口，南带泾、渭，右陇、蜀，左关、阪；战车千乘，奋击百万。以秦卒之勇，车骑之多，以当诸侯，譬若驰韩卢而逐蹇兔也，霸王之业可致。今反闭而不敢窥兵于山东者，是穰侯为国谋不忠，而大王之计有所失也。”",
        "　　王曰：“愿闻所失计。”",
        "　　睢曰：“大王越韩、魏而攻强齐，非计也。少出师，则不足以伤齐；多之则害于秦。臣意王之计欲少出师，而悉韩、魏之兵则不义矣。今见与国之不可亲，越人之国而攻，可乎?疏于计矣!昔者齐人伐楚，战胜，破军杀将，再辟千里，肤寸之地无得者，岂齐不欲地哉，形弗能有也。诸侯见齐之罢露，君臣之不亲，举兵而伐之，主辱军破，为天下笑。所以然者，以其伐楚而肥韩、魏也。此所谓藉贼兵而赍盗食者也。王不如远交而近攻，得寸则王之寸，得尺亦王之尺也。今舍此而远攻，不亦缪乎?且昔者，中山之地，方五百里，赵独擅之，功成、名立、利附，则天下莫能害。今韩、魏，中国之处，而天下之枢也。王若欲霸，必亲中国而以为天下枢，以威楚、赵。赵彊则楚附，楚彊则赵附。楚、赵附则齐必惧，惧必卑辞重币以事秦，齐附而韩、魏可虚也。”",
        "　　王曰：“寡人欲亲魏，魏多变之国也，寡人不能亲。请问亲魏奈何?”范睢曰：“卑辞重币以事之。不可，削地而赂之。不可，举兵而伐之。”于是举兵而攻邢丘，邢丘拔而魏请附。曰：“秦、韩之地形，相错如绣。秦之有韩，若木之有蠢，人之病心腹。天下有变，为秦害者莫大于韩。王不如收韩。”王曰：“寡人欲收韩，不听，为之奈何?”",
        "　　范睢曰：“举兵而攻荥阳，则成皋之路不通；北斩太行之道，则上党之兵不下；一举而攻荥阳，则其国断而为三。魏、韩见必亡，焉得不听?韩听而霸事可成也。”王曰：“善。”",
        "　　范睢曰：“臣居山东，闻齐之内有田单，不闻其王。闻秦之有太后、穰侯、泾阳、华阳，不闻其有王。夫擅国之谓王，能专利害之谓王，制杀生之威之谓王。今太后擅行不顾，穰侯出使不报，泾阳、华阳击断无讳，四贵备而国不危者，未之有也。为此四者，下乃所谓无王已。然则权焉得不倾，而令焉得从王出乎?臣闻：‘善为国者，内固其威，而外重其权。’穰侯使者操王之重，决裂诸侯，剖符于天下，征敌伐国，莫敢不听。战胜攻取，则利归于陶；国弊，御于诸侯；战败，则怨结于百姓，而祸归社稷。《诗》曰：‘木实繁者披其枝，披其技者伤其心。大其都者危其国，尊其臣者卑其主。’淖齿管齐之权，缩闵王之筋，县之庙梁，宿昔而死。李兑用赵，减食主父，百日而饿死。今秦，太后、穰侯用事，高陵、泾阳佐之，卒无秦王，此亦淖齿、李兑之类已。臣今见王独立于庙朝矣，且臣将恐后世之有秦国者，非王之子孙也。",
        "　　秦王惧，于是乃废太后，逐穰侯，出高陵，走泾阳于关外。昭王谓范睢曰：“昔者，齐公得管仲，时以为仲父。今吾得子，亦以为父。”",
    ],
}
ZhanGuoBookPageModule[84] = {
    "index": "战国策",
    "name": "秦三·应侯谓昭王",
    "content": [
        "　　应侯谓昭王曰：“亦闻恒思有神丛与?恒思有悍少年，请与丛博，曰：‘吾胜丛，丛籍我神三日；不胜丛，丛困我。”乃左手为丛投，右手自为投，胜丛，丛籍其神。三日，丛往求之，遂弗归。五日而丛枯，七日而丛亡。今国者，王之丛；势者，王之神。籍人以此，得无危乎?臣未尝闻指大于臂，臂大于股，若有此，则病必甚矣。百人舆瓢而趋，不如一人持而走疾。百人诚舆瓢，瓢必裂。今秦国，华阳用之，穰侯用之，太后用之，王亦用之。不称瓢为器，则已；已称瓢为器，国必裂矣。臣闻之也：‘木实繁者枝必披，枝之披者伤其心。都大者危其国，臣强者危其主。’且令邑中自斗食以上，至尉、内史及王左右，有非相国之人者乎?国无事，则已；国有事，臣必闻见王独立于庭也。臣窃为王恐，恐万世之后有国者，非王子孙也。",
        "　　“臣闻古之善为政也，其威内扶，其辅外布，四治政不乱不逆，使者直道而行，不敢为非。今太后使者分裂诸侯，而符布天下，操大国之势，强征兵，伐诸侯。战胜攻取，利尽归于陶；国之币帛，竭入太后之家；竟内之利，分移华阳。古之所谓危主灭国之道，必从此起。三贵竭国以自安，然则令何得从王出，权何得毋分，是我王果处三分之一也。”",
    ],
}
ZhanGuoBookPageModule[85] = {
    "index": "战国策",
    "name": "秦三·秦攻韩围陉",
    "content": ["　　秦攻韩，围陉。范睢谓秦昭王曰：“有攻人者，有攻地者。穰侯十攻魏而不得伤者，非秦弱而魏强也，其所攻者，地也。地者，人主所甚爱也。人主者，人臣之所乐为死也。攻人主之所爱，与乐死者斗，故十攻而弗能胜也。今王将攻韩围陉，臣愿王之毋独攻其地，而攻其人也。王攻韩围陉，以张仪为言。张仪之力多，且削地而以自赎于王，几割地而韩不尽；张仪之力少，则王逐张仪，而更与不如张仪者市。则王之所以求于韩者，言可得也。”"],
}

ZhanGuoBookPageModule[86] = {
    "index": "战国策",
    "name": "秦三·应侯曰郑人谓玉未理者璞",
    "content": [
        "　　　　应侯曰：“郑人谓玉未理者璞，周人谓鼠未腊者朴。周人怀璞过郑贾曰：‘欲买朴乎?’郑贾曰：‘欲之。’出其朴，视之，乃鼠也。因谢不取。今平原君自以贤，显名于天下，然降其主父沙丘而臣之。天下之王尚犹尊之，是天下之王不如郑贾之智也，眩于名，不知其实也。”",],
}
ZhanGuoBookPageModule[87] = {
    "index": "战国策",
    "name": "秦三·天下之士合从相聚于赵",
    "content": [
        "　　天下之士，合从相聚于赵，而欲攻秦。秦相应侯曰：“王勿忧也，请令废之。秦于天下之士非有怨也，相聚而攻秦者，以己欲富贵耳。王见大王之狗，卧者卧，起者起，行者行，止者止，毋相与斗者；投之一骨，轻起相牙者，何则?有争意也。”于是唐睢载音乐，予之五十金，居武安，高会相与饮，谓：“邯郸人谁来取者?”于是其谋者固未可得予也，其可得与者，与之昆弟矣。",
        "　　“公与秦计功者，不问金之所之，金尽者功多矣。今令人复载五十金随公。”唐睢行，行至武安，散不能三千金，天下之士，大相与斗矣。",
    ],
}
ZhanGuoBookPageModule[88] = {
    "index": "战国策",
    "name": "秦三·谓应侯曰君禽马服乎",
    "content": ["　　谓应侯曰：“君禽马服乎?”曰：“然。”“又即围邯郸乎?”曰：“然。”“赵亡，秦王王矣，武安君为三公。武安君所以为秦战胜攻取者七十余城，南亡鄢郢、汉中，禽马服之军，不亡一甲，虽周吕望之功，亦不过此矣。赵亡，秦王王，武安君为三公，君能为之下乎?虽欲无为之下，固不得之矣。秦尝攻韩邢，困于上党，上党之民皆返为赵。天下之民，不乐为秦民之日固久矣。今攻赵，北地入燕，东地入齐，南地入楚、魏，则秦所得不一几何。故不如因而割之，因以为武安功。”"],
}

ZhanGuoBookPageModule[89] = {
    "index": "战国策",
    "name": "秦三·应侯失韩之汝南",
    "content": [
        "　　应侯失韩之汝南。秦昭王谓应侯曰：“君亡国，其忧乎?”应侯曰：“臣不忧。”王曰：“何也?”曰：“梁人有东门吴者，其子死而不忧，其相室曰：‘公之爱子也，天下无有，今子死不忧，何也?’东门吴曰：“吾尝无子，无子之时不忧；今子死，乃即与无子时同也。臣奚忧焉?’臣亦尝为子，为子时不忧；今亡汝南，乃与即为梁余子同也。臣何为忧?”秦王以为不然，以告蒙傲曰：“今也，寡人一城围，食不甘味，卧不便席，今应侯亡地而言不忧，此其情也?”蒙傲曰：“臣请得其情。”蒙傲乃往见应侯，曰：“傲欲死。”应侯曰：“何谓也?”曰：“秦王师君，天下莫不闻，而况于秦国乎？今傲势得秦为王将，将兵，臣以韩之细也，显逆诛，夺君地，傲尚奚生?不若死。”应侯拜蒙傲曰：“愿委之卿。”蒙傲以报于昭王。自是之后，应侯每言韩事者，秦王弗听也，以其为汝南虏也。",
    ],
}
ZhanGuoBookPageModule[90] = {
    "index": "战国策",
    "name": "秦三·秦攻邯郸",
    "content": [
        "　　秦攻邯郸，十七月不下。庄谓王稽曰：“君何不赐军吏乎?”王稽曰：“吾与王也，不用人言。”庄曰：“不然。父之于子也，令有必行者，必不行者。曰‘去贵妻，卖爱妾’，此令必行者也；因曰‘毋敢思也’，此令必不行者也。宁闾妪曰，‘其夕，某孺子内某士’。贵妻已去，爱妾已卖，而心不有。欲教之者，人心固有。今君虽幸於王，不过父子之亲；军吏虽贱，不卑于守闾妪。且君擅主轻下之日久矣。闻‘三人成虎，十夫楺椎。众口所移，毋翼而飞’。故曰，不如赐军吏而礼之。”王稽不听。军吏穷，果恶王稽、杜挚以反。’",
        "　　秦王大怒，而欲兼诛范睢。范睢曰：“臣，东鄙之贱人也，开罪于楚、魏，遁逃来奔。臣无诸侯之援，亲习之故，王举臣于羁旅之中，使职事，天下皆闻臣之身与王之举也。今遇惑或与罪人同心，而王明诛之，是王过举显于天下，而为诸侯所议也。臣愿请药赐死，而恩以相葬臣，王必不失臣之罪，而无过举之名。”王曰：“有之。”遂弗杀而善遇之。",
    ],
}
ZhanGuoBookPageModule[91] = {
    "index": "战国策",
    "name": "秦三·蔡泽见逐于赵",
    "content": [
        "　　蔡泽见逐于赵，而入韩、魏，遇夺釜鬲于涂。闻应侯任郑安平、王稽，皆负重罪，应侯内惭，乃西入秦。将见昭王，使人宣言以感怒应侯曰：“燕客蔡泽，天下骏雄弘辩之士也。彼一见秦王，秦王必相之而夺君位。”",
        "　　应侯闻之，使人召蔡泽。蔡泽入，则揖应侯，应侯固不快；及见之，又倨。应侯因让之曰：“子尝宣言代我相秦，岂有此乎？”对曰：“然。”应侯曰：“请闻其说。”蔡泽曰：“吁！何君见之晚也。夫四时之序，成功者去。夫人生手足坚强，耳目聪明，而心圣知，岂非士之所愿与？”应侯曰：“然。”蔡泽曰：“质仁秉义，行道施德于天下，天下怀乐敬爱，愿以为君王，岂不辩智之期与？”应侯曰：“然。”蔡泽复曰：“富贵显荣，成理万物，万物各得其所；生命寿长，终其年而不夭伤；天下继其统，守其业，传之无穷，名实纯粹，泽流千世，称之而毋绝，与天下终。岂非道之福，而圣人所谓吉祥善事与？”应侯曰：“然。”蔡泽曰：“若秦之商君，楚之吴起，越之大夫种，其卒亦可愿矣。”",
        "　　应侯知蔡泽之欲困己以说，复曰：“何为不可？夫公孙鞅事孝公，极身毋二，尽公不还私，信赏罚以致治，竭智能，示请素，蒙怨咎，欺旧交，虏魏公子，卒为秦禽将，破敌军，攘地千里。吴起事悼王，使死不害公，谗不蔽忠，言不取苟合，行不取苟容，行义不图毁誉，必有伯主强国，不辞祸凶。大夫种事越王，主离困辱，悉忠而不解，主虽亡绝，尽能而不离，多功而不矜，贵富不骄怠。若此三子者，义之至，忠之节也。故君子杀身以成名，义之所在。身虽死，无憾悔，何为不可哉？”",
        "　　蔡泽曰：“主圣臣贤，天下之福也；君明臣忠，国之福也；父慈子孝，夫信妇贞，家之福也。故比干忠不能存殷，子胥知不能存吴，申生孝而晋国乱。是有忠臣孝子，国家灭乱，何也？无明君贤父以听之。故天下一其君父为戮辱，怜其臣子。夫待死之后可以立忠成名，是微子不足仁，孔子不足圣，管仲不足大也。”于是应侯称善。",
        "　　蔡泽得少间，因曰：“商君、吴起、大夫种，其为人臣，尽忠致功，则可愿矣。闳夭事文王，周公辅成王也，岂不亦忠乎？以君臣论之，商君、吴起、大夫种，其可愿孰与闳夭、周公哉？”应侯曰：“商君、吴起、大夫种不若也。”蔡泽曰：“然则君之主，慈仁任忠，不欺旧故，孰与秦孝公、楚悼王、越王乎？”应侯曰：“未知何如也。”蔡泽曰：“今主固亲忠臣，不过秦孝、越王、楚悼。君者为主，正乱、披患、折难，广地、殖谷，痼国足家、强主，威盖海内，功章万里之外，不过商君、吴起、大夫种。而君之禄位贵盛，私家之富过于三子，而身不退，窃为君危之。语曰：‘日中则移，月满则亏。’物盛则衰，天之常数也；进退、盈缩、变化，圣人之常道也。昔者，齐桓公九合诸侯，一匡天下，至葵丘之会，有骄矜之色，畔者九国。吴王夫差无敌于天下，轻诸侯，凌齐、晋，遂以杀身亡国。夏育、太史启叱呼骇三军，然而身死于庸夫。此皆乘至盛不及道理也。夫商君为孝公平权衡、正度量、调轻重，决裂阡陌，教民耕战，是以兵动而地广，兵休而国富，故秦无敌于天下，立威诸侯。功已成，遂以车裂。楚地方千里，带甲百万，白起率数万之师，以与楚战，一战举鄢、郢，再战烧夷陵，南并蜀、汉，又越韩、魏攻强赵，北坑马服，诛屠四十余万之众，流血成川，沸声若雷，使秦业帝。自是之后，赵、楚慑服，四十余年不敢攻秦者，白起之势也。身所服者，七十余城。功已成矣，赐死于杜邮。吴起为楚悼罢无能，废无用，损不急之官。塞私门之请，壹楚国之俗，南攻杨越，北并陈、蔡，破横散从，使驰说之士无所开其口。功已成矣，卒支解。大夫种为越王垦草创邑，辟地殖谷，率四方之士，专上下之力，以禽劲吴，成霸功。勾践终背而杀之。此四子者，成功而不去，祸至于此。此所谓信而不能诎，往而不能反者也。范蠡知之，超然避世，长为陶朱公。君独不观博者乎？或欲大投，或欲分功。此皆君之所明知也。今君相秦，计不下衽席，某不出廊庙，坐制诸侯，利施三川，以实宜阳；决羊肠之险，塞太行之口，又斩范、中行之途，栈道千里于蜀、汉，使天下皆畏秦。秦之欲得矣，君之功极矣。此亦秦之分功之时也！如是不退，则商君、白公、吴起、大夫种是也。君何不以此时归相印，让贤者授之，必有伯夷之廉；长为应侯，世世称孤，而有乔、松之寿。孰与以祸终哉！此则君何居焉？”应侯曰善。”乃延入坐为上客。",
        "　　后数日，入朝，言于秦昭王曰：“客新有从山东来者蔡泽，其人辩士。臣之见人甚众，莫有及者，臣不如也。”秦昭王召见，与语，大说之，拜为客卿。应侯因谢病，请归相印。昭王强起应侯，应侯遂称笃，因免相。昭王新说蔡泽计画，遂拜为秦相，东收周室。蔡泽相秦王数月，人或恶之，惧诛，乃谢病归相印，号刚成君。居秦十余年，昭王、孝文王、庄襄王。卒事始皇帝。为秦使于燕，三年而燕使太子丹入质于秦。",
    ],
}
ZhanGuoBookPageModule[92] = {
    "index": "战国策",
    "name": "秦四·秦取楚汉中",
    "content": [
        "　　秦取楚汉中，再战于兰田，大败楚军。韩、魏闻楚之困，乃南袭至邓，楚王引归。后三国谋攻楚，恐秦之救也，或说薛公：“可发使告楚曰：‘今三国之兵且去楚，楚能应而共攻秦，虽兰田岂难得哉!况于楚之故地?’楚疑于秦之未必救己也，而今三国之辞去，则楚之应之也必劝，是楚与三国谋出秦兵矣。秦为知之，必不救也。三国疾攻楚，楚必走秦以急；秦愈不敢出，则是我离秦而攻楚也，兵必有功”。",
"　　薛公曰：“善。”遂发重使之楚，楚之应果劝。于是三国并力攻楚，楚果告急于秦，秦遂不敢出兵。大臣有功。",
    ]
}
ZhanGuoBookPageModule[93] = {
    "index": "战国策",
    "name": "秦四·薛公入魏而出齐女",
    "content": [
        "　　薛公入魏而出齐女。韩春谓秦王曰：“何不取为妻，以齐、秦劫魏，则上党，秦之有也。齐、秦合而立负刍，负刍立，其母在秦，则魏，秦之县也已。呡欲以齐、秦劫魏而困薛公，佐欲定其弟，臣请为王因呡与佐也。魏惧而复之，负刍必以魏殁世事秦。齐女入魏而怨薛公，终以齐奉事王也。”　",
    ],
}
ZhanGuoBookPageModule[94] = {
    "index": "战国策",
    "name": "秦四·三国攻秦入函谷",
    "content": [
        "　　三国攻秦，入函谷。秦王谓楼缓曰：“三国之兵深矣，寡人欲割河东而讲。”对曰：“割河东，大费也；免于国患，大利也。此父兄之任也。王何不召公子池而问焉?”",
"　　王召公子池而问焉，对曰：“讲亦悔，不讲亦悔。”王曰：“何也?”对曰：“王割河东而讲，三国虽去，王必曰：‘惜矣!三国且去，吾特以三城从之。’此讲之悔也。王不讲，三国入函谷，咸阳必危，王又曰：‘惜矣!吾爱三城而不讲。’此又不讲之悔也。”王曰：“钧吾悔也，宁亡三城而悔，无危咸阳而悔也。寡人决讲矣。”卒使公子池以三城讲于三国，之兵乃退。",
    ],
}
ZhanGuoBookPageModule[95] = {
    "index": "战国策",
    "name": "秦四·秦昭王谓左右",
    "content": [
        "　　秦昭王谓左右曰：“今日韩、魏，孰与始强?”对曰：“弗如也。”王曰：“今之如耳、魏齐，孰与孟尝、芒卯之贤?”对曰：“弗如也。”王曰：“以孟尝、芒卯之贤，帅强韩、魏之兵以伐秦，犹无奈寡人何也!今以无能之如耳、魏齐，帅弱韩、魏以攻秦，其无奈寡人何，亦明矣!”左右皆曰：“甚然。”",
        "　　中期推琴对曰：“三之料天下过矣。昔者六晋之时，智氏最强，灭破范、中行，帅韩、魏以围赵襄子于晋阳。决晋水以灌晋阳，城不沉者三板耳。智伯出行水，韩康子御，魏桓子骖乘。智伯曰：‘始吾不知水之可亡人之国也，乃今知之。汾水利以灌安邑，绛水利以灌平阳。’魏恒子肘韩康子，康子履魏恒子，蹑其踵。肘足接于车上，而智氏分矣。身死国亡，为天下笑。今秦之强，不能过智伯；韩、魏虽弱，尚贤在晋阳之下也。此乃方其用肘足时也，愿王之勿易也。”",
    ],
}
ZhanGuoBookPageModule[96] = {
    "index": "战国策",
    "name": "秦四·楚魏战于陉山",
    "content": ["　　楚、魏战于陉山。魏许秦以上洛，以绝秦于楚。魏战胜，楚败于南阳。秦责赂于魏，魏不与。营浅谓秦王曰：“王何不谓楚王曰，魏许寡人以地，今战胜，魏王倍寡人也。王何不与寡人遇。魏畏秦、楚之合，必与秦地矣。是魏胜楚而亡地于秦也；是王以魏地德寡人，秦之楚者多资矣。魏弱，若不出地，则王攻其南，寡人绝其西，魏必危。”秦王曰：“善。”以是告楚。楚王扬言与秦遇，魏王闻之恐，效上洛于秦。"],
}
ZhanGuoBookPageModule[97] = {
    "index": "战国策",
    "name": "秦四·楚使者景鲤在秦",
    "content": ["　　楚使者景鲤在秦，从秦王与魏王遇于境。楚怒秦合，周最为楚王曰：“魏请无与楚遇而合于秦，是以鲤与之遇也。弊邑之于与遇善之，故齐不合也。”楚王因不罪景鲤而德周、秦。"],
}
ZhanGuoBookPageModule[98] = {
    "index": "战国策",
    "name": "秦四·楚王使景鲤如秦",
    "content": [
        "　　楚王使景鲤如秦。客谓秦王曰：“景鲤，楚王使景所甚爱，王不如留之以市地。楚王听，则不用兵而得地；楚王不听，则杀景鲤，更不与不如景鲤留，是便计也。”秦王乃留景鲤。",
"　　景鲤使人说秦王曰：“臣见王之权轻天下，而地不可得也。臣来使也，闻齐、魏皆且割地以事秦。所以然者，以秦与楚为昆弟国。今大王留臣，是示天下无楚也，齐、魏有何重于孤国也。楚知秦之孤，不与地，而外结交诸侯以图，则社稷必危，不如出臣。”秦王乃出之。",
    ],
}
ZhanGuoBookPageModule[99] = {
    "index": "战国策",
    "name": "秦四·秦王欲见顿弱",
    "content": [
        "　　秦王欲见顿弱，顿弱曰：“臣之义不参拜，王能使臣无拜，即可矣。不，即不见也。”秦王许之。于是顿子曰：“天下有其实而无其名者，有无其实而有其名者，有无其名又无其实者。王知之乎?”王曰：“弗知。”顿子曰：“有其实而无其名者，商人是也。无把铫推耨之势，而有积粟之实，此有其实而无其名者也。无其实而有其名者，农夫是也。解冻而耕，暴背而耨，无积粟之实，此无其实而有其名者也。无其名又无其实者，王乃是也。已立为万乘，无孝之名；以千里养，无孝之实。”秦王悖然而怒。",
"　　顿弱曰：“山东战国有六，威不掩于山东，而掩于母，臣窃为大王不取也。”秦王曰：“山东之建国可兼与?”顿子曰：“韩，天下之咽喉；魏，天下之胸腹。王资臣万金而游，听之韩、魏，入其社稷之臣于秦，即、韩魏从。韩、魏从，而天下可图也。”秦王曰：“寡人之国贫，恐不能给也。”顿子曰：“天下未尝无事也，非从即横也。横成，则秦帝；从成，即楚王。秦帝，即以天下恭养；楚王，即王虽有万金，弗得私也。”秦王曰：“善。”乃资万金，使东游韩、魏，入其将相。北游于燕、赵，而杀李牧。齐王入朝，四国必从，顿子之说也。",
    ],
}
ZhanGuoBookPageModule[100] = {
    "index": "战国策",
    "name": "秦四·顷襄王二十年",
    "content": [
        "　　顷襄王二十年，秦白起拔楚西陵，或拔鄢、郢、夷陵，烧先王之墓。王徙东北，保于陈城。楚遂削弱，为秦所轻。于是白起又将兵来伐。楚人有黄歇者，游学博闻，襄王以为辩，故使于秦。说昭王曰：“天下莫强于秦、楚，今闻大王欲伐楚，此犹两虎相斗而驽犬受其弊，不如善楚。臣请言其说。臣闻之：‘物至而反，冬夏是也。致至而危，累棋是也。’今大国之地半天下，有二垂，此从生民以来，万乘之地未尝有也。先帝文王、庄王、王之身，三世而不接地于齐，以绝从亲之要。今王三使盛桥守事于韩，成桥以北入燕。是王不用甲，不伸威，而出百里之地，王可谓能矣。王又举甲兵而攻魏，杜大梁之门，举河内，拔燕、酸枣、虚、桃人，楚、燕之兵云翔不敢校，王之功亦多矣。王申息众二年，然后复之，又取蒲、衍、首垣，以临仁、平兵、小黄、济阳婴城，而魏氏服矣。王又割濮、磨之北属之燕，断齐、秦之要 ，绝楚、魏之脊。天下五合、六聚而不敢救也，王之威亦惮矣。王若能持功守威，省攻伐之心而肥仁义之诫，使无复后患，三王不足四，五伯不足六也。",
"　　“王若负人徒之众，材兵甲之强，壹毁魏氏之威，而欲以力臣天下之主，臣恐有后患。《诗》云：‘靡不有初，鲜克有终。’《易》曰：‘狐濡其尾。’此言始之易，终之难也。何以知其然也?智氏见伐赵之利，而不知榆次之祸也；吴见伐齐之便，而不知干隧之败也。此二国者，非无大功也，设利于前，而易患于后也。吴之信越也，从而伐齐，既胜齐人于艾陵，还为越王禽于三江之浦。智氏信韩、魏，从而伐赵，攻晋阳之城，胜有日矣，韩、魏反之，杀智伯瑶于凿台之上，今王妒楚之不毁也，而忘毁楚之强魏也。臣为大王虑而不取。《诗》云：‘大武远宅不涉。’从此观之，楚国，援也；邻国，敌也。《诗》云：‘他人有心，予忖度之。跃跃毚兔，遇犬获之。’今王中道而信韩、魏之善王也，此正吴信越也。臣闻，敌不可易，时不可失。臣恐韩、魏之卑辞虑患，而实欺大国也。此何也?王既无重世之德于韩、魏，而有累世之怨矣。韩、魏父子兄弟接踵而死于秦者，百世矣。本国残，社稷坏，宗庙隳，刳腹折颐，首身分离，暴骨草泽，头颅僵仆，相望于境；父子老弱系虏，相随于路；鬼神狐祥无所食，百姓不聊生，族类离散，流亡为臣妾，满海内矣。韩、魏之不亡，秦社稷之忧也。今王之攻楚，不亦失乎!是王攻楚之日，则恶出兵？王将藉路于仇雠之韩、魏乎!兵出之日而王忧其不反也，是王以兵资于仇雠之韩、魏。王若不藉路于仇雠之韩、魏，必攻阳、右壤，随阳、右壤，此皆广川大水，山林溪谷不食之地，王虽有之，不为得地。是王有毁楚之名，无得地之实也。且王攻楚之日，四国必应悉起应王。秦、楚之构而不离，魏氏将出兵而攻留、方与、銍、胡陵、砀、萧、相，故宋必尽。齐人南面，泗北必举。此皆平原四达，膏腴之地也，而王使之独攻。王破楚于以肥韩、魏于中国而劲齐，韩、魏之强足以校于秦矣。齐南以泗为境，东负海，北倚河，而无后患，天下之国，莫强于齐。齐、魏得地葆利，而详事下吏，一年之后，为帝若未能，于以禁王之为帝有余。夫以王壤土之博，人徒之众，兵革之强，一举众而注地于楚，诎令韩、魏，归帝重于齐，是王失计也。",
"　　“臣为王虑，莫若善楚。秦、楚合而为一，临以韩，韩必授首。王襟以山东之险，带以河曲之利，韩必为关中之候。若是，王以十成郑，梁氏寒心，许、鄢陵婴城，上蔡、召陵不往来也。如此，而魏亦关内侯矣。王一善楚，而关内二万乘之主注地于齐，齐之右壤可拱手而取也。是王之地一任两海，要绝天下也。是燕、赵无齐、楚，无燕、赵也。然后危动燕、赵，持齐、楚，此四国者，不待痛而服矣。”",
    ],
}
ZhanGuoBookPageModule[101] = {
    "index": "战国策",
    "name": "秦四·或为六国说秦王",
    "content": [
        "　　或为六国说秦王曰：“土广不足以为安，人众不足以为强。若土广者安，人众者强，则桀、纣之后将存。昔者赵氏亦尝强矣。曰赵强何若?举左案齐，举右案魏，厌案万乘之国，二国，千乘之宋也。筑刚平，工无东野，刍牧薪采莫敢窥东门。当是时，卫危于累卵，天下之士相从谋曰：‘吾将还其委质，而朝于邯郸之君乎!’于是天下有称伐邯郸者，莫不令朝行。魏伐邯郸，因退为逢泽之遇，乘夏车，称夏王，朝为天子，天下皆从。齐太公闻之，举兵伐魏，壤地两分，国家大危。梁王身抱质执璧，请为陈侯臣，天下乃释梁。郢威王闻之，寝不寐，食不饱，帅天下百姓，以与申缚遇于泗水之上，而大败申缚。赵人闻之至枝桑，燕人闻之至之格道。格道不通，平际绝。齐战败不胜，谋则不得，使陈毛释剑掫，委南听罪，西说赵，北说燕，内喻其百姓，而天下乃齐释。于是夫积薄而为厚，聚少而为多，以同言郢威王于侧纣之间。臣岂以郢威王为政衰谋乱以至于此哉?郢为强，临天下诸侯，故天下乐伐之也。”",
    ],
}
ZhanGuoBookPageModule[102] = {
    "index": "战国策",
    "name": "秦五·谓秦王",
    "content": [
        "　　谓秦王曰：“臣窃惑王之轻齐易楚，而卑畜韩也。臣闻，王兵胜而不骄，伯主约而不忿。胜而不骄，故能服世；约而不忿，故能从邻。今王广德魏、赵，而轻失齐，骄也；战胜宜阳，不恤楚交，忿也。骄忿非伯主之业也。臣窃为大主虑之而不取也。《诗》云：‘靡不有初，鲜克有终。’故先王之所重者，唯始与终。何以知其然?昔智伯瑶残范、中行，围逼晋阳，卒为三家笑。吴王夫差栖越于会稽，胜齐于艾陵，为黄池之遇，无礼于宋，遂与勾践禽，死于干隧。梁君伐楚胜齐，制赵、韩之兵，驱十二诸侯以朝天子于孟津，后子死，自布冠而拘于秦。三者非无功也，能始而不能终也。",
        "　　“今王破宜阳，残三川，而使天下之士不敢言；雍天下之国，徙西周之疆，而世主不敢交阳侯之塞；取董棘，而韩、楚之兵不敢进。王若能为此尾，则三王不足四，五伯不足六。王若不能为此尾，而有后患，则臣恐诸侯之君，河、济之士，以王为吴、智之事也。",
        "　　“《诗》云：‘行百里者半于九十。’此言末路之难。今大王皆有骄色，以臣之心观之，天下之事，依世主之心，非楚受兵，必秦也。何以知其然也?秦人援魏以拒楚，楚人援韩以拒秦，四国之兵敌，而未能复战也。齐、宋在绳墨之外以为权，故曰先得齐、宋者伐秦。秦先得齐、宋，则韩氏铄；韩氏铄，则楚孤而受兵也。楚先得齐，则魏氏铄；魏氏铄，则秦孤而受兵矣。若随此计而行之，则两国者必为天下笑矣。”",
    ],
}
ZhanGuoBookPageModule[103] = {
    "index": "战国策",
    "name": "秦五·秦王与中期争论",
    "content": [
        "　　秦王与中期争论，不胜。秦王大怒，中期徐行而去。或为中期说秦王曰：“悍人也。中期适遇明君故也，向者遇桀、纣，必杀之矣。”秦王因不罪。",
    ],
}
ZhanGuoBookPageModule[104] = {
    "index": "战国策",
    "name": "秦五·献则谓公孙消",
    "content": [
        "　　献则渭公孙消曰：“公，大臣之尊者也，数伐有功。所以不为相者，太后不善公也。辛戎者，太后之所亲也。今亡于楚，在东周。公何不以秦、楚之重，资而相之于周乎？楚必便之矣。是辛戎有秦、楚之重，太后必悦公，公相必矣。”",
    ],
}
ZhanGuoBookPageModule[105] = {
    "index": "战国策",
    "name": "秦五·楼啎约秦魏",
    "content": [
        "　　楼啎约秦、魏，魏太子为质，纷疆欲败之。谓太后曰：“国与还者也，败秦而利魏，魏必负之。负秦之日，太子为粪矣。”太后坐王而泣。王因疑于太子，令之留于酸枣。楼子患之。昭衍为周之梁，楼子告之。昭衍见梁王，梁王曰：“何闻?”曰：“闻秦且伐魏。”王曰：“为期与我约矣。”曰：“秦疑于王之约，以太子留酸枣而不之秦。秦王之计曰：‘魏不与我约，必攻我；我与其处而待之见攻，不如先伐之。’以秦强折节而下与国，臣恐其害于东周。”　",
    ],
}
ZhanGuoBookPageModule[106] = {
    "index": "战国策",
    "name": "秦五·濮阳人吕不韦贾于邯郸",
    "content": [
        "　　濮阳人吕不韦贾于邯郸，见秦质子异人，归而谓父曰：“耕田之利几倍?”曰：“十倍。”“珠玉之赢几倍?”曰：“百倍。”“立国家之主赢几倍?”曰：“无数。”曰：“今力田疾作，不得暖衣余食；今建国立君，泽可以遗世。愿往事之。”",
"　　秦之异人质于赵，处于（户卯）城。故往说之口：“子傒有承国之业，又有母在中。今子无母于中，外托于不可知之国，一日倍约，自为粪土。今子听吾计事，求归，可以有秦国。吾为子使秦，必来请子。”",
"　　乃说秦王后弟阳泉君曰：“君之罪至死，君知之乎?君之门下无不居高尊位，太子门下无贵者。君之府藏珍珠宝玉，君之骏马盈外厩，美女充后庭。王之春秋高，一日山陵崩，太子用事，君危于累卵，而不寿于朝生。说有可以一切而使君富贵千万岁，其宁于太山四维，必无危亡之患矣。”阳泉君避席，请闻其说。不韦曰：“王年高矣，王后无子，子傒有承国之业，士仓又辅之。王一日山陵崩，子傒立，士仓用事，王后之门，必生蓬蒿。子异人贤材也，弃在于赵，无母于内，引领西望，而愿一得归。王后诚请而立之，是子异人无国而有国，王后无子而有子也。”阳泉君曰：“然。”入说王后，王后乃请赵而归之。",
"　　赵未之遣，不韦说赵曰：“子异人，秦之宠子也，无母于中，王后欲取而子之。使秦而欲屠赵，不顾一子而留计，是抱空质也。若使子异人归而得立，赵厚送遣之，是不敢倍德畔施，是自为德讲。秦王老矣，一日晏驾，虽有子异人，不足以结秦。”赵乃遣之。",
"　　异人至，不韦使楚服而见。王后悦其状，高其知，曰：“吾楚人也。”而自子之，乃变其名曰楚，王使子诵，子曰：“少弃捐在外，尝无师傅所教学，不习于诵。”王罢之，乃留止。间曰：“陛下尝轫车于赵矣，赵之豪桀，得知名者不少。今大王反国，皆西面而望。大王无一公之使以存之，臣恐其皆有怨心。使边境早闭晚开。”王以为然，奇其计。王后劝立之。王乃召相，令之曰：“寡人子莫若楚。”立以为太子。",
"　　子楚立，以不韦为相，号曰文信侯，食蓝田十二县。王后为华阳太后，诸侯皆致秦邑。",
    ],
}
ZhanGuoBookPageModule[107] = {
    "index": "战国策",
    "name": "秦五·文信侯欲攻赵以广河间",
    "content": [
        "　　文信侯欲攻赵以广河间，使刚成君蔡泽事燕三年，而燕太子质于秦。文信侯因请张唐相燕，欲与燕共伐赵，以广河间之地。张唐辞曰：“燕者必径于赵，赵人得唐者，受百里之地。”文信侯去而不快。少庶子甘罗曰：“君侯何不快甚也?”文信侯曰：“吾令刚成君蔡泽事燕三年，而燕太子已入质矣。今吾自请张卿相燕，而不肯行。”甘罗曰：“臣行之。”文信侯叱去曰：“我自行之而不肯，汝安能行之也?”甘罗曰：“夫项櫜生七岁而为孔子师，今臣生十二岁于兹矣，君其试臣，奚以遽言叱也?”",
"　　甘罗见张唐曰：“卿之功，孰与武安君?”唐曰：“武安君战胜攻取，不知其数；攻城堕邑，不知其数。臣之功不如武安君也。”甘罗曰：“卿明知功之不如武安君欤?”曰：“知之。”“应侯之用秦也，孰与文信侯专?”曰：“应侯不如文信侯专。”曰：“卿明知为不如文信侯专欤?”曰：“知之。”甘罗曰：“应侯欲伐赵，武安君难之，去咸阳七里，绞而杀之。今文信侯自请卿相燕，而卿不肯行，臣不知卿所死之处矣!”唐曰：“请因孺子而行!”令库具车，厩具马，府具币，行有日矣。甘罗谓文信侯曰：“借臣车五乘，请为张唐先报赵。”",
"　　见赵王，赵王郊迎。谓赵王曰：“闻燕太子丹之入秦与?”曰：“闻之。”“闻张唐之相燕与?”曰：“闻之。”“燕太子入秦者，燕不欺秦也。张唐相燕者，秦不欺燕也。秦、燕不相欺，则伐赵，危矣。燕、秦所以不相欺者，无异故，欲攻赵而广河间也。今王资臣五城以广河间，请归燕太子，与强赵攻弱燕。”赵王立割五城以广河间，归燕太子。赵攻燕，得上谷三十六县，与秦什一。",
    ],
}
ZhanGuoBookPageModule[108] = {
    "index": "战国策",
    "name": "秦五·文信侯出走",
    "content": [
        "　　文信侯出走，与司空马之赵，赵以为守相。秦下甲而攻赵。司马空说赵王曰：“文信侯相秦，臣事之，为尚书，习秦事。今大王使守小官，习赵事。请为大王设秦、赵之战，而亲观其孰胜。赵孰与秦大?”曰：“不如。”“民孰与之众?”曰：“不如。”“金钱粟孰与之富?”曰：“弗如。”“国孰与之治?”曰：“不如。”“相孰与之贤?”曰：“不如。”“将孰与之武?”曰：“不如。”“律令孰与之明?”曰：“不如。”司空马曰：“然则大王之国，百举而无及秦者，大王之国亡。”赵王曰：“卿不远赵，而悉教以国事，愿于因计。”司空马曰：“大王裂赵之半以赂秦，秦不接刃而得赵之半，秦必悦。内恶赵之守，外恐诸侯之救，秦必受之。秦受地而卻兵，赵守半国以自存。秦衔赂以自强，山东必恐；亡赵自危，诸侯必惧。惧而相救，则从事可成。臣请大王约从。从事成，则是大王名亡赵之半，实得山东以敌秦，秦不足亡。”赵王曰：“前日秦下甲攻赵，赵赂以河间十二县，地削兵弱，卒不免秦患。今又割赵之半以强秦，力不能自存，因以亡矣。愿卿之更计。”司空马曰：“臣少为秦刀笔，以官长而守小官，未尝为兵首，请为大王悉赵兵以遇。”赵王不能将。司空马曰：“臣效愚计，大王不用，是臣无以事大王，愿自请。”",
"　　司空马去赵，渡平原。平原津令郭遗劳而问：“秦兵下赵，上客从赵来，赵事何如?”司空马言其为赵王计而弗用，赵必亡。平原令曰：“以上客料之，赵何时亡?”司空马曰：“赵将武安君，期年而亡；若杀武安君，不过半年。赵王之臣有韩仓者，以曲合于赵王，其交甚亲，其为人疾贤妒功臣。今国危亡，王必用其言，武安君必死。”",
"　　韩仓果恶之，王使人代。武安君至，使韩仓数之曰：“将军战胜，王觞将军。将军为寿于前而捍匕首，当死。”武安君曰：“繓病钩，身大臂短，不能及地，起居不敬，恐惧死罪于前，故使工人为木材以接手。上若不信，繓请以出示。”出之袖中，以示韩仓，状如振捆，缠之以布。“愿公入明之。”韩仓曰：“受命于王，赐将军死，不赦。臣不敢言。”武安君北面再拜赐死，缩剑将自诛，乃曰：“人臣不得自杀宫中。”遇司空马门，趣甚疾，出諔门也。右举剑将近自诛，臂短不能及，衔剑征之于柱以自刺。武安君死五月，赵亡。",
"　　平原令见诸公，必为言之曰：“磋嗞乎，司空马!”又以为司空马逐于秦，非不知也；去赵，非不肖也。赵去司空马而国亡。国亡者，非无贤人，不能用也。",
    ],
}
ZhanGuoBookPageModule[109] = {
    "index": "战国策",
    "name": "秦五·四国为一将以攻秦",
    "content": [
        "　　四国为一，将以攻秦。秦王召群臣宾客六十人而问焉，曰：“四国为一，将以图秦，寡人屈于内，而百姓靡于外，为之奈何?”群臣莫对。姚贾对曰：“贾愿出使四国，必绝其谋，而安其兵。”乃资车百乘，金千斤，衣以其衣，冠舞以其剑。姚贾辞行，绝其谋，止其兵，与之为交以报秦。秦王大悦，贾封千户，以为上卿。",
"　　韩非知之，曰：“贾以珍珠重宝，南使荆、吴，北使燕、代之间三年，四国之交未必合也，而珍珠重宝尽于内。是贾以王之权，国之宝，外自交于诸侯，愿王察之。且梁监门子，尝盗于梁，臣于赵而逐。取世监门子，梁之大盗，赵之逐臣，与同知社稷之计，非所以厉群臣也。”",
"　　王召姚贾而问曰：“吾闻子以寡人财交于诸侯，有诸?”对曰：“有。”王曰：“有何面目复见寡人?”对曰：“曾参孝其亲，天下愿以为子；子胥忠于君，天下愿以为臣；贞女工巧，天下愿以为妃。今贾忠王而王不知也。贾不归四国，尚焉之?使贾不忠于君，四国之王尚焉用贾之身?梁听谗而诛其良将，纣闻谗而杀其忠臣，至身死国亡。今王听谗，则无忠臣矣。”",
"　　王曰：“子监门子，梁之大盗，赵之逐臣。”姚贾曰：“太公望，齐之逐夫，朝歌之废屠，子良之逐臣，棘津之雠不庸，文王用之而王。管仲，其鄙人之贾人也，南阳之弊幽，鲁之免囚，桓公用之而伯。百里奚，虞之乞人，传卖以五羊之皮，穆公相之而朝西戎。文公用中山盗，而胜于城濮。此四士者，皆有垢丑，大诽天下，明主用之，知其可与立功。使若卞随、务光、申屠狄，人主岂得其用哉!故明主不取其汙，不听其非，察其为己用。故可以存社稷者，虽有外诽者不听；虽有高世之名，无咫尺之功者不赏。是以群臣莫敢以虚愿望于上。”",
"　　秦王曰：“然。”乃可复使姚贾而诛韩非。",
    ],
}
/*
ZhanGuoBookPageModule[110] = {
    "index": "战国策",
    "name": "东周·周相吕仓见客于周君",
    "content": ["　　周相吕仓见客于周君。前相工师藉恐客之伤己也，因令人谓周君曰：“客者，辩士也，然而所以不可者，好毁人。”"],
}
*/
module.exports = { ZhanGuoBookPageModule: ZhanGuoBookPageModule }