
import React, { Component } from 'react';
import { AppRegistry, View, Text } from 'react-native';


var ZhanGuoBookPageModule = new Array()



ZhanGuoBookPageModule[0] = {
    "index": "战国策", "name": "战国策",
    "content": ["《战国策》（Intrigues of the Warring States），是一部国别体史书。主要记述了战国时期的纵横家的政治主张和策略，展示了战国时代的历史特点和社会风貌，是研究战国历史的重要典籍。作者并非一人，成书并非一时，书中文章作者大多不知是谁。西汉末刘向编定为三十三篇，书名亦为刘向所拟定。宋时已有缺失，由曾巩作了订补。有东汉高诱注，今残缺。宋鲍彪改变原书次序，作新注。吴师道作《校注》，近代人金正炜有《补释》，今人缪文远有《战国策新注》。"
    ],
}

ZhanGuoBookPageModule[1] = {
    "index": "战国策",
    "name": "东周·秦兴师临周而求九鼎",
    "content": [
        "　　秦兴师临周而求九鼎，周君患之，以告颜率。颜率曰：“大王勿忧，臣请东借救于齐。”颜率至齐，谓齐王曰：“夫秦之为无道也，欲兴兵临周而求九鼎，周之君臣内自画计，与秦，不若归之大国。夫存危国，美名也；得九鼎，厚宝也。愿大王图之。”齐王大悦，发师五万人，使陈臣思将，以救周，而秦兵罢。",
        "　　齐将求九鼎，周君又患之。颜率曰：“大王勿忧，臣请东解之。”颜率至齐，谓齐王曰：“周赖大国之义，得君臣父子相保也，愿献九鼎，不识大国何途之从而致之齐?”齐王曰：“寡人将寄径于梁。”颜率曰：“不可。夫梁之君臣欲得九鼎，谋之晖台之下，少海之上，其日久矣。鼎入梁，必不出。”齐王曰：“寡人将寄径于楚。”对曰：“不可。楚之君臣欲得九鼎，谋之于叶庭之中，其日久矣。若入楚，鼎必不出。”王曰：“寡人终何途之从而致之齐?”颜率曰：“弊邑固窃为大王患之。夫鼎者，非效醯壶酱甀耳，可怀挟提挈以至齐者；非效鸟集乌飞，兔兴马逝，漓然止于齐者。昔周之伐殷，得九鼎，凡一鼎而九万人輓之，九九八十一万人，士卒师徒，器械被具，所以备者称此。今大王纵有其人，何途之从而出?臣窃为大王私忧之。”齐王曰：“子之数来者，犹无与耳。”颜率曰：“不敢欺大国，疾定所从出，弊邑迁鼎以待命。”齐王乃止。",
    ],
}
ZhanGuoBookPageModule[2] = {
    "index": "战国策",
    "name": "东周·秦攻宜阳",
    "content": [
        "　　秦攻宜阳，周君谓赵累曰：“子以为何如?”对曰：“宜阳必拔也。”君曰：“宜阳城方八里，材士十万，粟支数年，公仲之军二十万，景翠以楚之众，临山而救之，秦必无功。”对曰：“甘茂，羁旅也，攻宜阳而有功，则周公旦也；无功，则削迹于秦。秦王不听群臣父兄之义而攻宜阳，宜阳不拔，秦王耻之。臣故曰拔。”君曰 :“子为寡人谋，且奈何?”对曰：“君谓景翠曰:‘公爵为执圭，官为柱国，战而胜，则无加焉矣；不胜，则死。不如背秦援宜阳。公进兵，秦恐公之乘其弊也，必以宝事公，公中慕公之为己乘秦也，亦必尽其宝。”秦拔宜阳，景翠果进兵。秦惧，遽效煮枣，韩氏果亦效重宝。景翠得城于秦，受宝于韩，而德东周。",
    ],
}
ZhanGuoBookPageModule[3] = {
    "index": "战国策",
    "name": "东周·东周与西周战",
    "content": [
        "　　东周与西周战，韩救西周。为东周谓韩王曰:“西周者，故天子之国也，多名器重宝，案兵而勿出，可以德东周，西周之宝可尽矣。”",
    ],
}
ZhanGuoBookPageModule[4] = {
    "index": "战国策",
    "name": "东周·东周与西周争",
    "content": [
        "　　东周与西周争，西周欲和于楚、韩。齐明谓东周君曰：“臣恐西周之与楚、韩宝，令之为己求地于东周也。不如谓楚、韩曰，西周之欲入宝，持二端。今东周之兵不急西周，西周之宝不入楚、韩。楚、韩欲得宝，即且趣我攻西周。西周宝出，是我为楚、韩取宝以德之也。西周弱矣。”",
    ],
}
ZhanGuoBookPageModule[5] = {
    "index": "战国策",
    "name": "东周·东周欲为稻",
    "content": [
        "　　东周欲为稻，西周不下水，东周患之。苏子谓东周君曰：“臣请使西周下水,可乎?”乃往见西周之君曰：“君之谋过矣!今不下水，所以富东周也。今其民皆种麦，无他种矣。君若欲害之，不若一为下水，以病其所种。下水，东周必复种稻；种稻而复夺之。若是，则东周之民可令一仰西周，而受命于君矣。”西周君曰：“善。”遂下水，苏子亦得两国之金也。",
    ],
}
ZhanGuoBookPageModule[6] = {
    "index": "战国策",
    "name": "东周·昭献在阳翟",
    "content": ["昭献在阳翟，周君将令相国往，相国将不欲。苏厉为之谓周君曰：“楚王与魏王遇也，主君令陈封之楚，令向公之魏。楚、韩之遇也，主君令许公之楚，令向公之韩。今昭献非人主也，而主君令相国往；若其王在阳翟，主君将令谁往?”周君曰：“善。”乃止其行。"],
}
ZhanGuoBookPageModule[7] = {
    "index": "战国策",
    "name": "东周·秦假道于周以伐韩",
    "content": ["　　秦假道于周以伐韩，周恐假之而恶于韩，不假而恶于秦。史黶谓周君曰：“君何不令人谓韩公叔曰：‘秦敢绝塞而伐韩者，信东周也。公何不与周地，发重使使之楚，秦必疑，不信周，是韩不伐也。’又谓秦王曰：‘韩强与周地，将以疑周于秦，寡人不敢弗受。’秦必无辞而令周弗受，是得地于韩而听于秦也。”"],
}
ZhanGuoBookPageModule[8] = {
    "index": "战国策",
    "name": "东周·楚攻雍氏",
    "content": ["　　楚攻雍氏，周粻秦、韩，楚王怒周，周之君患之。为周谓楚王曰：“以王之强而怒周，周恐，必以国合于所与粟之国，则是劲王之敌也。故王不如速解周恐，彼前得罪而后得解，必厚事王矣。”"],
}
ZhanGuoBookPageModule[9] = {
    "index": "战国策",
    "name": "东周·周最谓吕礼",
    "content": ["　　周最谓石礼曰：“子何不以秦攻齐？臣请令齐相子，子以齐事秦，必无处矣。子因令周最居魏以共之，是天下制于子也。子东重于齐，西贵于秦，秦、齐合，则子常重矣。”"],
}
ZhanGuoBookPageModule[10] = {
    "index": "战国策",
    "name": "东周·周相吕仓见客于周君",
    "content": ["　　周相吕仓见客于周君。前相工师藉恐客之伤己也，因令人谓周君曰：“客者，辩士也，然而所以不可者，好毁人。”"],
}
ZhanGuoBookPageModule[11] = {
    "index": "战国策",
    "name": "东周·周文君免士工师藉",
    "content": [
        "　　周文君免士工师藉，相吕仓，国人不说也。君有闵闵之心。",
        "　　谓周文君曰：“国必有诽誉，忠臣令诽在己，誉在上。宋君夺民时以为台，而民非之，无忠臣以掩盖之也。子罕释相为司空，民非子罕而善其君。齐桓公宫中七市，女闾七百，国人非之。管仲故为三归之家，以掩桓公，非自伤于民也?《春秋》记臣弑君者以百数，皆大臣见誉者也。故大臣得誉，非国家之美也。故众庶成疆，增积成山。”周君遂不免。",
    ],
}
ZhanGuoBookPageModule[12] = {
    "index": "战国策",
    "name": "东周·温人之周",
    "content": ["　　温人之周，周不纳。客即对曰：“主人也。”问其巷而不知也，吏因囚之。君使人问之曰：“子非周人，而自谓非客，何也?”对曰：“臣少而诵诗，诗曰：‘普天之下，莫非王土；率土之滨，莫非王臣。’今周君天下，则我天子之臣，而又为客哉?故曰主人。”君乃使吏出之。"],
}
ZhanGuoBookPageModule[13] = {
    "index": "战国策",
    "name": "东周·或为周最谓金投",
    "content": ["　　或为周最谓金投曰：“秦以周最之齐疑天下，而又知赵之难子齐人战，恐齐、韩之合，必先合于秦。秦、齐合，则公之国虚矣。公不如救齐，因佐秦而伐韩、魏，上党长子赵之有。公东收宝于秦，南取地于韩，魏因以困，徐为之东，则有合矣。”"],
}
ZhanGuoBookPageModule[14] = {
    "index": "战国策",
    "name": "东周·周最谓金投",
    "content": ["　　周最谓金投曰：“公负令秦与强齐战。战胜，秦且收齐而封之，使无多割，而听天下之战；不胜，国大伤，不得不听秦。秦尽韩、魏之上党太原，西止秦之有已。秦地，天下之半也，制齐、楚、三晋之命，复国且身危，是何计之道也。”"],
}
ZhanGuoBookPageModule[15] = {
    "index": "战国策",
    "name": "东周·石行秦谓大梁造",
    "content": ["　　石行秦谓大梁造曰：“欲决霸王之名，不如备两周辩知之士。”谓周君曰：“君不如令辩知之士，为君争于秦。”"],
}
ZhanGuoBookPageModule[16] = {
    "index": "战国策",
    "name": "东周·谓薛公",
    "content": ["　　谓薛公曰：“周最于齐王也而逐之，听祝弗，相吕礼者，欲取秦。秦、齐合，弗与礼重矣。有周齐，秦必轻君。君弗如急北兵趋赵取秦、魏，收周最以为后行，且反齐王之信，又禁天下之率。齐无秦，天下果，弗必走，齐王谁与为其国？”"],
}

ZhanGuoBookPageModule[17] = {
    "index": "战国策",
    "name": "东周·齐听祝弗",
    "content": ["　　齐听祝弗，外周最。谓齐王曰：“逐周最、听祝弗、相吕礼者，欲深取秦也。秦得天下，则伐齐深矣。夫齐合，则赵恐伐，故急兵以示秦。秦以赵攻，与之齐伐赵，其实同理，必不处矣。故用祝弗，即天下之理也。”"],
}
ZhanGuoBookPageModule[18] = {
    "index": "战国策",
    "name": "东周·苏厉为周最谓苏秦",
    "content": ["　　苏厉为周最谓苏秦曰：“君不如令王听最，以地合於魏、赵，故必怒合於齐，是君以合齐与强楚吏产子。君若欲因最之事，则合齐者，君也；割地者，最也。”"],
}
ZhanGuoBookPageModule[19] = {
    "index": "战国策",
    "name": "东周·谓周最曰仇赫之相宋",
    "content": ["　　谓周最曰：“仇赫之相宋，将以观秦之应赵、宋，败三国。三国不败，将兴赵、宋合于东方以孤秦。亦将观韩、魏之于齐也。不固，则将与宋败三国，则卖赵、宋于三国。公何不令人谓韩、魏之王曰：‘欲秦、赵之相卖乎?何不合周最兼相，视之不可离，则秦、赵必相卖以合于王也。”’"],
}
ZhanGuoBookPageModule[20] = {
    "index": "战国策",
    "name": "东周·为周最谓魏王",
    "content": ["　　为周最谓魏王曰：“秦知赵之难与齐战也，将恐齐、赵之合也，必阴劲之。赵不敢战，恐秦不己收也，先合于齐。秦、赵争齐，而王无人焉，不可。王不去周最，合与收齐，而以兵之急则伐齐，无因事也。”"],
}
ZhanGuoBookPageModule[21] = {
    "index": "战国策",
    "name": "东周·谓周最曰魏王以国与先生",
    "content": ["　　谓周最曰：“魏王以国与先生，贵合于秦以伐齐。薛公故主，轻忘其薛，不顾其先君之丘墓，而公独帽虚信为茂行，明群臣据故主，不与伐齐者，产以忿强秦，不可。公不如谓魏王、薛公曰：‘请为王入齐，天下不能伤齐。而有变，臣请为救之；无变，王遂伐之。且臣齐级也，如累王之交於天下，不可。王为臣赐厚矣，臣入齐，则王亦无齐之累也’。”"],
}
ZhanGuoBookPageModule[22] = {
    "index": "战国策",
    "name": "东周·赵取周之祭地",
    "content": ["　　赵取周之祭地，周君患之，告于郑朝。郑朝曰：“君勿患也，臣请以三十金复取之。”周君予之。郑朝献之赵太卜，因告以祭地事。及王病，使卜之。太卜谴之曰：“周之祭地为祟。”赵乃还之。"],
}
ZhanGuoBookPageModule[23] = {
    "index": "战国策",
    "name": "东周·杜赫欲重景翠于周",
    "content": ["　　杜赫欲重景翠于周，谓周君曰：“君之国小，尽君子重宝珠玉以事诸侯，不可不察也。譬之如张罗者，张于无鸟之所，则终日无所得矣；张于多鸟处，则又骇鸟矣；必张于有鸟无鸟之际，然后能多得鸟矣。今君将施于大人，大人轻君；施于小人，小人无可以求，又费财焉。君必施于今之穷士，不必且为大人者，故能得欲矣。”"],
}
ZhanGuoBookPageModule[24] = {
    "index": "战国策",
    "name": "东周·周共太子死",
    "content": ["　　周共太子死，有五庶子，皆爱之，而无适立也。司马翥谓楚王曰：“何不封公子咎，而为之请太子?”左成谓司马翥曰：“周君不听，是公之知困而交绝于周也。不如谓周君曰：‘孰欲立也?微告翥，翥令楚王资之以地。’公若欲为太子，因令人谓相国御展子，廧夫空曰：‘王类欲令若为之，此健士也，居中不便于相国。’”相国令之为太子。"],
}
ZhanGuoBookPageModule[25] = {
    "index": "战国策",
    "name": "东周·三国隘秦",
    "content": ["　　三国隘秦，周令其相之秦，以秦之轻也，留其行。有人谓相国曰：“秦之轻重，未可知也。秦欲知三国之情，公不如遂见秦王曰：‘请谓王听东方之处’。秦必重公。是公重周，重用以取秦也。齐重故有周，而已取齐，是周常不失重国之交也。”"],
}
ZhanGuoBookPageModule[26] = {
    "index": "战国策",
    "name": "东周·昌他亡西周",
    "content": ["　　昌他亡西周，之东周，尽输西周之情于东周。东周大喜，西周大怒。冯且曰：“臣能杀之。”君予金三十斤。冯且使人操金与书，间遗昌他书曰：“告昌他，事可成，勉成之；不可成，亟亡来亡来。事久且泄，自令身死。”因使人告东周之候曰：“今夕有奸人当入者矣。”侯得而献东周，东周立杀昌他。"],
}
ZhanGuoBookPageModule[27] = {
    "index": "战国策",
    "name": "东周·昭翥与东周恶",
    "content": ["　　昭翥与东周恶，或谓昭翥曰：“为公画阴计。”昭翥曰：“何也?”“西周甚憎东周，尝欲东周与楚恶，西周必令贼贼公，因宣言东周也，以西周之于王也。”照翥曰：“善。吾又恐东周之贼己，而以轻西周恶之于楚。”遽和东周。"],
}
ZhanGuoBookPageModule[28] = {
    "index": "战国策",
    "name": "东周·严氏为贼",
    "content": ["　　严氏为贼，而阳竖与焉。道周，周君留之十四日，载以乘车驷马而遣之。韩使人让周，周君患之。客谓周君曰：“正语之曰：‘寡人知严氏之为贼，而阳竖与之，故留之十四日以待命也。小国不足亦以容贼，君之使又不至，是以遣之也。’”"],
}
ZhanGuoBookPageModule[29] = {
    "index": "战国策",
    "name": "西周·薛公以齐为韩魏攻楚",
    "content": ["　　薛公以齐为韩魏攻楚。薛公以齐为韩、魏攻楚，又与韩、魏攻秦，而籍兵乞食于西周。韩庆为西周谓薛公曰：“君以齐为韩、魏攻楚，九年而取宛、叶以北以强韩、魏，今又攻秦以益之。韩、魏南无楚忧，西无秦患，则地广而益重，齐必轻矣。夫本末更盛，虚实有时，窃为君危之。君不如令弊邑阴合于秦而君无攻，又无籍兵乞食。君临函谷而无攻，令弊邑以君之情谓秦王曰：‘薛公必破秦以张韩、魏，所以进兵者，欲王令楚割东国以与齐也。’秦王出楚王以为和，君令弊邑以此忠秦，秦得无破，而以楚之东国自免也，必欲之。楚王出，必德齐，齐得东国而益强，而薛世世无患。秦不大弱，而处之三晋之西，三晋必重齐。”薛公曰：“善。”因令韩庆入秦，而使三国无攻秦，而使不籍兵乞食于西周。"],
}
ZhanGuoBookPageModule[30] = {
    "index": "战国策",
    "name": "西周·秦攻魏将犀武军于伊阙",
    "content": ["　　秦攻魏将犀武军于伊阙，进兵而攻周。为周最谓李兑曰：“君不如禁秦之攻周。赵之上计，莫如令秦、魏复战。今秦攻周而得之，则众必多伤矣。秦欲待周之得，必不攻魏；秦若攻周而不得，前有胜魏之劳，后有攻周之败，又必不攻魏。今君禁之，而秦未与魏讲也。而全赵令其止，必不敢不听，是君却秦而定周也。秦去周，必复攻魏，魏不能支，必因君而讲，则君重矣。若魏不讲，而疾支之，是君存周而战秦、魏也。重亦尽在赵。”"],
}
ZhanGuoBookPageModule[31] = {
    "index": "战国策",
    "name": "西周·秦令樗里疾以车百乘入周",
    "content": ["　　秦令樗里疾以车百乘入周，周君迎之以卒，甚敬。楚王怒，让周，以其重秦客。游腾谓楚王曰：“昔智伯欲伐厹由，遗之大钟，载以广车，因随以兵，杂由卒亡，无备故也。桓公伐蔡也，号言伐楚，其实袭蔡。今秦者，虎狼之国也，兼有吞周之意；使樗里疾以车百乘入周，周君惧焉，以蔡杂由戒之，故使长兵在前，强弩在后，名曰卫疾，而实囚之也。周君岂能无爱国哉?恐一日之亡国，而忧大王。”楚王乃悦。"],
}
ZhanGuoBookPageModule[32] = {
    "index": "战国策",
    "name": "西周·雍氏之役",
    "content": ["　　雍氏之役，韩征甲与粟于周。周君患之，告苏代。苏代曰：“何患焉?代能为君令韩不征甲与粟于周，又能为君得高都。”周君大悦曰：“子苟能，寡人请以国听。”苏代遂往见韩相国公中曰：“公不闻楚计乎?昭应谓楚王曰：‘韩氏罢于兵，仓廪空，无以守城，吾收之以饥，不过一月必拔之。”今围雍氏五月不能拔，是楚病也。楚王始不信昭应之计矣，今公乃征甲及粟于周，此告楚病也。昭应闻此，必劝楚王益兵守雍氏，雍氏必拔。”公中曰：“善。然吾使者已行矣。”代曰：“公何不以高都与周。”公中怒曰：“吾无征甲与粟于周，亦已多矣。何为与高都?”代曰：“与之高都，则周必折而入于韩，秦闻之必大怒，而焚周之节，不通其使，是公以弊高都得完周也，何不与也?”公中曰：“善。”不征甲与粟于周而与高都，楚卒不拔雍氏而去。"],
}

ZhanGuoBookPageModule[33] = {
    "index": "战国策",
    "name": "西周·周君之秦",
    "content": ["　　周君之秦。谓周最曰：“不如誉秦王之孝也，因以应为太后养地。秦王、太后必喜，是公有秦也。交善，周君必以为公功；交恶，劝周君入秦者，必有罪矣。”"],
}
ZhanGuoBookPageModule[34] = {
    "index": "战国策",
    "name": "西周·苏厉谓周君",
    "content": ["　　苏厉谓周君曰：“败韩、魏，杀犀武，攻赵，取蔺、离石、祁者，皆白起。是攻用兵，又有天命也。今攻梁，梁必破，破则周危，君不若止之。谓白起曰：‘楚有养由基者，善射；去柳叶者百步而射之，百发百中。左右皆曰善。有一人过曰，善射，可教射也矣。养由基曰，人皆善，子乃曰可教射，子何不代我射之也。客曰，我不能教子支左屈右。夫射柳叶者，百发百中，而不已善息，少焉气力倦，弓拨矢钩，一发不中，前功尽矣。今公破韩、魏，杀厚武，而北攻赵，取蔺、离石、祁者，公也。公之功甚多。今公又以秦兵出塞，过两周，践韩而以攻梁，一攻而不得，前功尽灭，公不若称病不出也。”"],
}
ZhanGuoBookPageModule[35] = {
    "index": "战国策",
    "name": "西周·楚兵在山南",
    "content": ["　　楚兵在山南，吾得将为楚王属怒于周。或谓周君曰：“不如令太子将军正迎吾得于境，而君自郊迎，令天下皆知君之重吾得也。因泄之楚，曰：‘周君所以事吾得者器，必名曰谋楚。’王必求之，而吾得无效也，王必罪之。”"],
}
ZhanGuoBookPageModule[36] = {
    "index": "战国策",
    "name": "西周·楚请道于二周之间",
    "content": ["　　楚请道于二周之间，以临韩、魏，周君患之。苏秦谓周君曰：“除道属之于河，韩、魏必恶之。齐、秦恐楚之取九鼎也，必救韩、魏而攻楚。楚不能守方城之外，安能道二周之间。若四国弗恶，君虽不欲与也，楚必将自取之矣。”"],
}
ZhanGuoBookPageModule[37] = {
    "index": "战国策",
    "name": "西周·司寇布为周最谓周君",
    "content": ["　　司寇布为周最谓周君曰：“君使人告齐王以周最不肯为太子也，臣为君不取也。函冶氏为齐太公买良剑，公不知善，归其剑而责之金。越人请买之干金，折而不卖。将死，而属其子曰：‘必无独知。’今君之使最为太子，独知之契也，天下未有信之者也。臣恐齐王之为君实立果而让之於最，以嫁之齐也。君为多巧，最为多诈，君何不买信货哉?奉养无有爱于最也，使天下见之。”"],
}
ZhanGuoBookPageModule[38] = {
    "index": "战国策",
    "name": "西周·秦召周君",
    "content": ["　　秦召周君，周君难往。或为周君谓魏王曰：“秦召周君，将以使攻魏之南阳。王何不出于河南?周君闻之，将以为辞于秦而不往。周君不入秦，秦必不敢越河而攻南阳。”"],
}
ZhanGuoBookPageModule[39] = {
    "index": "战国策",
    "name": "西周·犀武败于伊阙",
    "content": ["　　犀武败于伊阙，周君之魏求救，魏王以上党之急辞之。周君反，见梁囿而乐之也。綦母恢谓周君曰：“温囿不下此，而又近。臣能为君取之。”反见魏王，王曰：“周君怨寡人乎?”对曰：“不怨，且谁怨王?臣为王有患也。周君，谋主也。而设以国为王扞秦，而王无之扞也。臣见其必以国事秦也，秦悉塞外之兵，与周之众，以攻南阳，而两上党绝矣。”魏王曰：“然则奈何?”綦母恢曰：“周君形不小利，事秦而好小利。今王许戍三万人与温囿，周君得以为辞于父兄百姓，而利温囿以为乐，必不合于秦。臣尝闻温囿之利，岁八十金，君得温囿，其以事王者，岁百二十金，是上党每患而赢四十金。”魏王因使孟卯致温囿周君而许之戍也。"],
}
ZhanGuoBookPageModule[40] = {
    "index": "战国策",
    "name": "西周·韩魏易地",
    "content": ["　　韩、魏易地，西周弗利。樊余谓楚王曰：“周必亡矣。韩、魏之易地，韩得二县，魏亡二县，所以为之者，尽包二周，多于二县，九鼎存焉。且魏有南阳、郑地、三川而包二周，则楚方城之外危；韩兼两上党以临赵，即赵羊肠以上危。故易成之日，楚、赵皆轻。”楚王恐，因赵以止易也。"],
}
ZhanGuoBookPageModule[41] = {
    "index": "战国策",
    "name": "西周·秦欲攻周",
    "content": ["　　秦欲攻周，周最谓秦王曰：“为王之国计者，不攻周。攻周，实不足以利国，而声畏天下。天下以声畏秦，必东合于齐。兵弊于周，而合天下于齐，则秦孤而不王矣。是天下欲罢秦，故劝王攻周。秦与天下惧罢，则令不横行于周矣。”"],
}
ZhanGuoBookPageModule[42] = {
    "index": "战国策",
    "name": "西周·宫他谓周君",
    "content": ["　　宫他谓周君曰：“宛恃秦而轻晋，秦饥而宛亡。郑恃魏而轻韩，魏攻蔡而郑亡。邾、莒亡于齐，陈、蔡亡于楚。此皆恃援国而轻近敌也。今君恃韩、魏而轻秦，国恐伤矣。君不如使周最阴合于赵以备秦，则不毁。”"],
}
ZhanGuoBookPageModule[43] = {
    "index": "战国策",
    "name": "西周·谓齐王",
    "content": ["　　谓齐王曰：“王何不以地赍周最以为太子也。”齐王令司马悍以赂进周最于周。左尚谓司马悍曰：“周不听，是公之知困而交绝于周也。公不如谓周君曰：‘何欲置?令人微告悍，悍请令王进之以地。’”左尚以此得事。"],
}
ZhanGuoBookPageModule[44] = {
    "index": "战国策",
    "name": "西周·三国攻秦反",
    "content": ["　　三国攻秦反，西周恐魏之藉道也。为西周谓魏王曰：“楚、宋不利秦之德三国也，彼且攻王之聚以利秦。”魏王惧，令军设舍速东。"],
}
ZhanGuoBookPageModule[45] = {
    "index": "战国策",
    "name": "西周·犀武败",
    "content": ["　　犀武败，周使周足之秦。或谓周足曰：“何不谓周君曰：‘臣之秦，秦、周之交必恶。主君之臣，又秦重而欲相者，且恶臣于秦，而臣为不能使矣。臣愿免而行。君因相之，彼得相，不恶周于秦矣。’君重秦，故使相往，行而免，且轻秦也，公必不免。公言是而行，交善于秦，且公之成事也；交恶于秦，不善于公且诛矣。”"],
}
ZhanGuoBookPageModule[46] = {
    "index": "战国策",
    "name": "秦一·卫鞅亡魏入秦",
    "content": [
        "　　卫鞅亡魏入秦，孝公以为相，封之于商，号曰商君。商君治秦，法令至行，公平无私，罚不讳强大，赏不私亲近，法及太子，黥劓其傅。期年之后，道不拾遗，民不妄取，兵革大强，诸侯畏惧。然刻深寡恩，特以强服之耳。孝公行之八年，疾且不起，欲傳商君，辞不受。",
        "　　孝公已死，惠王代后，莅政有顷，商君告归。人说惠王曰：“大臣太重者国危，左右太亲者身危。今秦妇人婴儿皆言商君之法，莫言大王之法。是商君反为主，大王更为臣也。且夫商君，固大王仇雠也，愿大王图之。”商君归还，惠王车裂之，而秦人不怜。",
    ],
}
ZhanGuoBookPageModule[47] = {
    "index": "战国策",
    "name": "秦一·苏秦始将连横",
    "content": [
        "　　苏秦始将连横，说秦惠王曰：“大王之国，西有巴、蜀、汉中之利，北有胡貉、代马之用，南有巫山、黔中之限，东有肴、函之固。田肥美，民殷富，战车万乘，奋击百万，沃野千里，蓄积饶多，地势形便，此所谓天府，天下之雄国也。以大王之贤，士民之众，车骑之用，兵法之教，可以并诸侯，吞天下，称帝而治。愿大王少留意，臣请奏其效。”秦王曰：“寡人闻之，毛羽不丰满者不可以高飞，文章不成者不可以诛罚，道德不厚者不可以使民，政教不顺者不可以烦大臣。今先生俨然不远千里面庭教之，愿以异日。” 苏秦曰：“臣固疑大王之不能用也。昔者神农伐补遂，黄帝伐涿鹿而禽蚩尤，尧伐驩兜，舜伐三苗，禹伐共工，汤伐有夏，文王伐崇，武王伐纣，齐桓任战而伯天下。由此观之，恶有不战者乎?古者使车毂击驰，言语相结，天下为一；约从连横，兵革不藏；文士并饬，诸侯乱惑；万端俱起，不可胜理；科条既备，民多伪态；书策稠浊，百姓不足；上下相愁，民无所聊；明言章理，兵甲愈起；辩言伟服，战攻不息；繁称文辞，天下不治；舌弊耳聋，不见成功；行义约信，天下不亲。于是，乃废文任武，厚养死士，缀甲厉兵，效胜于战场。夫徒处而致利，安坐而广地，虽古五帝、三王、五伯，明主贤君，常欲坐而致之，其势不能，故以战续之。宽则两军相攻，迫则杖戟相撞，然后可建大功。是故兵胜于外，义强于内；威立于上，民服于下。今欲并天下，凌万乘，诎敌国，制海内，子元元，臣诸侯，非兵不可。今之嗣主，忽於至道，皆悯于教，乱于治，迷于言，惑于语，沈于辩，溺于辞。以此论之，王固不能行也。”",
        "　　说秦王书十上而说不行。黑貂之裘弊，黄金百斤尽，资用乏绝，去秦而归。羸滕履蹻，负书担櫜，形容枯搞，面目犁黑，状有归色。归至家，妻不下紝，嫂不为炊，父母不与言。苏秦喟叹曰：“妻不以我为夫，嫂不以我为叔，父母不以我为子，是皆秦之罪也。”乃夜发书，陈箧数十，得太公阴符之谋，伏而诵之，简练以为揣摩。读书欲睡，引锥自刺其股，血流至足。曰：“安有说人主不能出其金玉锦绣，取卿相之尊者乎?”期年揣摩成，曰：“此真可以说当世之君矣 。”",
        "　　于是乃摩燕乌集阙，见说赵王于华屋之下，抵掌而谈。赵王大悦，封为武安君。受相印，革车白乘，锦绣千纯，白壁百双，黄金万溢，以随其后，约从散横，以抑强秦。",
        "　　故苏秦相于赵而关不通。当此之时，天下之大，万民之众，王侯之威，谋臣之权，皆欲决苏秦之策。不费斗粮，未烦一兵，未战一士，未绝一弦，未折一矢，诸侯相亲，贤于兄弟。夫贤人在而天下服，一轼撙衔，横历天下，廷说诸侯之王，杜左右之口，天下莫之能伉。",
        "　　将说楚王，路过洛阳，父母闻之，清宫除道，张乐设饮，郊迎三十里。妻侧目而视，倾耳而听；嫂蛇行匍伏，四拜自跪而谢。苏秦曰：“嫂何前倨而后卑也?”嫂曰：“以季子之位尊而多金。”苏秦曰：“嗟乎！贫穷则父母不子，富贵则亲戚畏惧。人生世上，势位富贵，盖可忽乎哉！”　",
    ],
}
ZhanGuoBookPageModule[48] = {
    "index": "战国策",
    "name": "秦一·秦惠王谓寒泉子",
    "content": ["　　秦惠王谓寒泉子曰：“苏秦欺寡人，欲以一人之智，反覆东山之君，从以欺秦。赵固负其众，故先使苏秦以币帛约乎诸侯。诸侯不可一，犹连鸡之不能俱止于栖之明矣。寡人忿然，含怒日久。吾欲使武安子起往喻意焉。”寒泉子曰：“不可。夫攻城堕邑，请使武安子。善我国家使诸侯，请使客卿张仪。”秦惠王曰：“受命。”"],
}

ZhanGuoBookPageModule[49] = {
    "index": "战国策",
    "name": "秦一·泠向谓秦王",
    "content": ["　　泠向谓秦王曰：“向欲以齐事王，使攻宋也。宋破，晋国危，安邑，王之有也。燕、赵恶齐、秦之合，必割地以交于王矣。齐必重于王，则向之攻宋也，且以恐齐而重王。王何恶向之攻宋乎?向以王之明为先知之，故不言。”"],
}
ZhanGuoBookPageModule[50] = {
    "index": "战国策",
    "name": "秦一·张仪说秦王",
    "content": [
        "　　张仪说秦王曰：“臣闻之，弗知而言为不智，知而不言为不忠。为人臣不忠当死，言不审亦当死。虽然，臣愿悉言所闻，大王裁其罪。臣闻，天下阴燕阳魏，连荆固齐，收余韩成从，将西南以与秦为难。臣窃笑之。世有三亡，而天下得之，其此之谓乎!臣闻之曰：‘以乱攻治者亡，以邪攻正者亡，以逆攻顺者亡。’今天下之府库不盈，囷仓空虚，悉其士民，张军数千百万，白刃在前，斧质在后，而皆去走，不能死，罪其百姓不能死也，其上不能杀也。言赏则不与，言罚则不行，赏罚不行，故民不死也。",
        "　　“今秦出号令而行赏罚，不攻无功相事也。出其父母怀衽之中，生未尝见寇也，闻战顿足徒裼，犯白刃，蹈煨炭，断死于前者比是也。夫断死与断生也不同，而民为之者是贵奋也。一可以胜十，十可以胜百，百可以胜千，千可以胜万，万可以胜天下矣。今秦地形，断长续短，方数千里，名师数百万，秦之号令赏罚，地形利害，天下莫如也。以此与天下，天下不足兼而有也。是知秦战未尝不胜，攻未尝不取，所当未尝不破也。开地数千里，此甚大功也。然而甲兵顿，士民病，蓄积索，田畴荒，囷仓虚，四邻诸侯不服，伯王之名不成，此无异故，谋臣皆不尽其忠也。",
        "　　“臣敢言往昔。昔者齐南破荆，中破宋，西服秦，北破燕，中使韩、魏之君，地广而兵强，战胜攻取，诏令天下，济清河浊，足以为限，长城、钜坊，足以为塞。齐，五战之国也，一战不胜而无齐。故由此观之，夫战者万乘之存亡也。",
        "　　且臣闻之曰：‘削株掘根，无与祸邻，祸乃不存。’秦与荆人战，大破荆，袭郢，取洞庭、五都、江南。荆王亡奔走，东伏于陈。当是之时，随荆以兵，则荆可举。举荆，则其民足贪也，地足利也。东以强齐、燕，中陵三晋。然则是一举而伯王之名可成也，四邻诸侯可朝也。而谋臣不为，引军而退，与荆人和。今荆人收亡国，聚散民，立社主，置宗庙， 令帅天下西面以与秦为难，此固已无伯王之道一矣。天下有比志而军华下，大王以诈破之，兵至梁郭，围梁数旬，则梁可拔。拔梁，则魏可举。举魏，则荆、赵之志绝。荆、赵之志绝，则赵危。赵危而荆孤。东以强齐、燕，中陵三晋，然则是一举而伯王之名可成也，四邻诸侯可朝也。而谋臣不为，引军而退。与魏氏和，令魏氏收亡国，聚散民，立社主，置宗庙，此固已无伯王之道二矣。前者穰侯之治秦也，用一国之兵，而欲以成两国之功。是故兵终暴灵于外，士民潞病于内，伯王之名不成，此固已无伯王之道三矣。",
        "　　“赵氏，中央之国也，杂民之所居也。其民轻而难用，号令不治，赏罚不信，地形不便，上非能尽其民力。彼固亡国之形也，而不忧民氓，悉其士民，军于长平之下，以争韩之上党，大王以诈破之，拔武安。当是时，赵氏上下不相亲也，贵贱不相信，然则是邯郸不守，拔邯郸，完河间，引军而去，西攻修武，逾羊肠，降代、上党。代三十六县，上党十七县，不用一领甲，不苦一民，皆秦之有也。代、上党不战而已为秦矣，东阳河外不战而已反为齐矣，中呼池以北不战而已为燕矣。然则是举赵则韩必亡，韩亡则荆、魏不能独立。荆、魏不能独立，则是一举而坏韩，蠹魏，挟荆，以东弱齐、燕，决白马之口，以流魏氏。一举而三晋亡，从者败。大王拱手以须，天下遍随而伏，伯王之名可成也。而谋臣不为，引军而退，与赵氏为和。以大王之明，秦兵之强，伯王之业，地尊不可得，乃取欺于亡国，是谋臣之拙也。且夫赵当亡不亡，秦当伯不伯，天下固量秦之谋臣一矣。乃复悉卒乃攻邯郸，不能拔也，弃甲兵怒，战慄而却，天下固量秦力二矣，军乃引退，并于李下，大王又并军而致与战，非能厚胜之也，又交罢却，天下固量秦力三矣。内者量吾谋臣，外者极吾兵力。由是观之，臣以天下之从，岂其难矣。内者吾甲兵顿，士民病，蓄积索，田畴荒，囷仓虚；外者天下比志甚固。愿大王有以虑之也。",
        "　　“且臣闻之，战战慄慄，日慎一日。苟慎其道，天下可有也。何以知其然也?昔者纣为天子，帅天下将甲百万，左饮于淇谷，有饮于洹水，淇水竭而洹水不流，以与周武为难。武王将素甲三干领，战一日，破纣之国，禽其身，据其地，而有其民，天下莫不伤。智伯帅三国之众，以攻赵襄主于晋阳，决水灌之，三年，城且拔矣。襄主错龟，数策占兆，以视利害，何国可降，而使张孟谈。于是潜行而出，反智伯之约，得两国之众，以攻智伯之国，禽其身，以成襄子之功。今秦地断长续短，方数千里，名师数百万，秦国号令赏罚，地形利害，天下莫如也。以此与天下，天下可兼而有也。",
        "　　“臣昧死望见大王，言所以举破天下之从，举赵亡韩，臣荆、魏，亲齐、燕，以成伯王之名，朝四邻诸侯之道。大王试听其说，一举而天下之从不破，赵不举，韩不亡，荆、魏不臣，齐、燕不亲，伯王之名不成，四邻诸侯不朝，大王斩臣以徇于国，以主为谋不忠者。”　",
    ],
}
ZhanGuoBookPageModule[51] = {
    "index": "战国策",
    "name": "秦一·张仪欲假秦兵以救魏",
    "content": ["　　张仪欲假秦兵以救魏。左成谓首茂曰：“子不予之。魏不反秦兵，张子不反秦。魏若反秦兵，张子得志于魏，不敢反于秦矣。张子不去秦，张子必高子。”’"],
}
ZhanGuoBookPageModule[52] = {
    "index": "战国策",
    "name": "秦一·司马错与张仪争论于秦惠王前",
    "content": [
        "　　司马错与张仪争论于秦惠王前。司马错欲伐蜀，张仪曰：“不如伐韩。”王曰：“请闻其说。”",
        "　　对曰：“亲魏善楚，下兵三川，塞轘辕、缑氏之口，当屯留之道，魏绝南阳，楚临南郑，秦攻新城、宜阳，以临二周之郊，诛周主之罪，侵楚、魏之地。周自知不救，九鼎宝器必出。据九鼎，按图籍，挟天子以令天下，天下莫敢不听，此王业也。今夫蜀，西辟之国，而戎狄之长也，弊兵劳众，不足以成名，得其地，不足以为利。臣闻：‘争名者于朝，争利者于市。’今三川、周室，天下之市朝也，而王不争焉，顾争于戎狄，去王业远矣。”",
        "　　司马错曰：“不然。臣闻之，欲富国者，务广其地；欲强兵者，务富其民；欲王者，务博其德。三资者备，而王随之矣。今王之地小民贫，故臣愿从事于易。夫蜀，西辟之国也，而戎狄之长也，而有桀、纣之乱。以秦攻之，譬如使豺狼逐群羊也。取其地，足以广国也；得其财，足以富民；缮兵不伤众，而彼已服矣。故拔一国，而天下不以为暴；利尽西海，诸侯不以为贪。是我一举而名实两附，而又有禁暴正乱之名。今攻韩劫天子，劫天子，恶名也，而未必利也，又有不义之名，而攻天下之所不欲，危!臣请谒其故：周，天下之宗室也；齐，韩、周之与国也。周自知失九鼎，韩自知亡三川，则必将二国并力合谋，以因于齐、赵，而求解乎楚、魏。以鼎与楚，以地与魏，王不能禁。此臣所谓‘危’，不如伐蜀之完也。”惠王曰：“善!寡人听子。”",
        "　　卒起兵伐蜀，十月取之，遂定蜀。蜀主更号为侯，而使陈庄相蜀。蜀既属，秦益强富厚，轻诸侯。",],
}
ZhanGuoBookPageModule[53] = {
    "index": "战国策",
    "name": "秦一·张仪之残樗里疾",
    "content": ["　　张仪之残樗里疾也，重而使之楚。因令楚王为之请相于秦。张子谓秦王曰：“重樗里疾而使之者，将以为国交也。今身在楚，楚王因为请相于秦。臣闻其言曰：‘王欲穷仪于秦乎?臣请助王。’楚王以为然，故为请相也。今王诚听之，彼必以国事楚王。”秦王大怒，樗里疾出走。"],
}
ZhanGuoBookPageModule[54] = {
    "index": "战国策",
    "name": "秦一·张仪欲以汉中与楚",
    "content": ["　　张仪欲以汉中与楚，请秦王曰：“有汉中，蠹。种树不处者，人必害之；家有不宜之财，则伤本。汉中南边为楚利，此国累也。”甘茂谓王曰：“地大者，固多忧乎!天下有变，王割汉中以为和楚，楚必畔天下而与王。王今以汉中与楚，即天下有变，王何以市楚也?”　"],
}
ZhanGuoBookPageModule[55] = {
    "index": "战国策",
    "name": "秦一·楚攻魏张仪谓秦王",
    "content": ["　　楚攻魏。张仪谓秦王曰：“不如与魏以劲之，魏战胜，复听于秦，必入西河之外；不胜，魏不能守，王必取之。”王用仪言，取皮氏卒万人，车百乘。以与魏。犀首战胜威王，魏兵罢弊，恐畏秦，果献西河之外。"],
}
ZhanGuoBookPageModule[56] = {
    "index": "战国策",
    "name": "秦一·田莘之为陈轸说秦惠王",
    "content": ["　　田莘之为陈轸说秦惠王曰：“臣恐王之如郭君。夫晋献公欲伐郭，而惮舟之侨存，荀息曰：‘周书有言，美女破舌。’乃遗之女乐，以乱其政。舟之侨谏而不听，遂去。因而伐郭，遂破之。又欲伐虞，而惮宫之奇存。荀息曰：‘周书有言，美男破老。’乃遗之美男，教之恶宫之奇。宫之奇以谏而不听，遂亡。因而伐虞，遂取之。今秦自以为王，能害王者之国者，楚也。楚智横君之善用兵，用兵与陈轸之智，故骄张仪以五国。来，必恶是二人。愿王勿听也。”张仪果来辞，因言轸也，王怒而不听。"],
}
ZhanGuoBookPageModule[57] = {
    "index": "战国策",
    "name": "秦一·张仪又恶陈轸于秦王",
    "content": ["　　张仪又恶陈轸于秦王。曰：“轸驰楚、秦之间，今楚不加善秦而善轸，然则是轸自为而不为国也。且轸欲去秦而之楚，王何不听乎?”王谓陈轸曰：“吾闻子欲去秦而之楚，信乎?”陈轸曰：“然。”王曰：“仪之言果信也。”曰：“非独仪知之也，行道之人皆知之。曰：‘孝己爱其亲，天下欲以为子；子胥忠乎其君，天下欲以为臣。卖仆妾售乎闾巷者，良仆妾也；出妇嫁乡曲者，良妇也。’吾不忠于君，楚亦何以轸为忠乎?忠且见弃，吾不之楚，何适乎?”秦王曰：“善。”乃必之也。"],
}
ZhanGuoBookPageModule[58] = {
    "index": "战国策",
    "name": "秦一·陈轸去楚之秦",
    "content": [
        "　　陈轸去楚之秦。张仪谓秦王曰：“陈轸为王臣，常以国情输楚。仪不能与从事，愿王逐之。即复之楚，愿王杀之。”王曰：“轸安敢之楚也。”",
        "　　王召陈轸告之曰：“吾能听子言，子欲何之?请为子车约。”对曰：“臣愿之楚。”王曰：“仪以子为之楚，吾又自知子之楚。子非楚，且安之也!”轸曰：“臣出，必故之楚，以顺王与仪之策，而明臣之楚与不也。楚人有两妻者，人誂其长者，詈之；誂其少者，少者许之。居无几何，有两妻者死。客谓誂者曰：“汝取长者乎?少者乎?”“取长者。”客曰：“长者詈汝，少者和汝，汝何为取长者?”曰：“居彼人之所，则欲其许我也。今为我妻，则欲其为我詈人也。’今楚王明主也，而昭阳贤相也。轸为人臣，而常以国输楚王，王必不留臣，昭阳将不与臣从事矣。以此明臣之楚与不。”",
        "　　轸出，张仪入，问王曰：“陈轸果安之?”王曰：“夫轸，天下之辩士也，孰视寡人曰：‘轸必之楚。’寡人遂无奈何也。寡人因问曰：‘子必之楚也，则仪之言果信矣。’轸曰：‘非独仪之言也，行道之人皆知之。昔者子胥忠其君，天下皆欲以为臣；孝己爱其亲，天下皆欲以为子。故卖仆妾不出里巷而取者，良仆妾也；出妇嫁于乡里者，善妇也。臣不忠于王，楚何以轸为?忠尚见弃，轸不之楚，而何之乎?’”王以为然，遂善待之。",
    ],
}

ZhanGuoBookPageModule[59] = {
    "index": "战国策",
    "name": "秦二·齐助楚攻秦",
    "content": [
        "　　齐助楚攻秦，取曲沃。其后，秦欲伐齐，齐、楚之交善，惠王患之，谓张仪曰：“吾欲伐齐，齐、楚方欢，子为寡人虑之，奈何?”张仪曰：“王其为臣约车并币，臣请试之。”",
        "　　张仪南见楚王曰：“弊邑之王所说甚者，无大大王；唯仪之所甚愿为臣者，亦无大大王。弊邑之王所甚憎者，亦无先齐王；唯仪之甚憎者，亦无大齐王。今齐之罪，其于弊邑之王甚厚，弊邑欲伐之，而大国与之欢，是以弊邑之王不得事令，而仪不得为臣也。大王苟能闭关绝齐，臣请使秦王献商於之地，方六百里。若此，齐必弱，齐弱则必为王役矣。则是北弱齐，西德于秦，而私商於之地以为利也，则此一计而三利俱至。”",
        "　　楚王大说，宣言之于朝廷，曰：“不穀得商於之田，方六百里。”群臣闻见者毕贺，陈轸后见，独不贺。楚王曰：“不穀不烦一兵，不伤一人，而得商於之地六百里，寡人自以为智矣!诸士大夫皆贺，子独不贺，何也?”陈轸对曰：“臣见商於之地不可得，而患必至也，故不敢妄贺。”王曰：“何也?”对曰：“夫秦所以重王者，以王有齐也。今地未可得而齐先绝，是楚孤也，秦又何重孤国?且先出地绝齐，秦计必弗为也。先绝齐后责地，且必受欺于张仪。受欺于张仪，王必惋之。是西生秦患，北绝齐交，则两国兵必至矣。”楚王不听，曰：“吾事善矣!子其弭口无言，以待吾事。”楚王使人绝齐，使者未来，又重绝之。",
        "　　张仪反，秦使人使齐，齐、秦之交阴合。楚因使一将军受地于秦。张仪至，称病不朝。楚王曰：“张子以寡人不绝齐乎?”乃使勇士往詈齐王。张仪知楚绝齐也，乃出见使者曰：“从某至某，广从六里。”使者曰：“臣闻六百里，不闻六里。”仪曰：“仪固以小人，安得六百里?”使者反报楚王，楚王大怒，欲兴师伐秦。陈轸曰：“臣可以言乎?”王曰：“可矣。”轸曰：“伐秦非计也，王不如因而赂之一名都，与之伐齐，是我亡于秦而取偿于齐也。楚国不尚全事。王今已绝齐，而责欺于秦，是吾合齐、秦之交也，固必大伤。”",
        "　　楚王不听，遂举兵伐秦。秦与齐合，韩氏从之。楚兵大败于杜陵。故楚之土壤士民非削弱，仅以救亡者，计失于陈轸，过听于张仪。",
    ],
}
ZhanGuoBookPageModule[60] = {
    "index": "战国策",
    "name": "秦二·楚绝齐齐举兵伐楚",
    "content": ["　　楚绝齐，齐举兵伐楚。陈轸谓楚王曰：“王不如以地东解于齐，西讲于秦。”楚王使陈轸之秦，秦王谓轸曰：“子，秦人也，寡人与子故也，寡人不佞，不能亲国事也，故子弃寡人，事楚王。今齐、楚相伐，或谓救之便，或谓救之不便，子独不可以忠为子主计，以其余为寡人乎?”陈轸曰：“王独不闻吴人之游楚者乎?楚王甚爱之，病，故使人问之，曰：‘诚病乎?意亦思乎?’左右曰：‘臣不知其思与不思，诚思则将吴吟。’今轸将为王吴吟。王不闻夫管与之说乎?有两虎诤人而斗者，管庄子将刺之，管与止之曰：“虎者，戾虫；人者，甘饵也。今两虎诤人而斗，小者必死，大者必伤。子待伤虎而刺之，则是一举而兼两虎也。无刺一虎之劳，而有刺两虎之名。’齐、楚今战，战必败。败，王起兵救之，有救齐之利，而无伐楚之害。计听知复逆者，唯王可也。计者，事之本也；听者，存亡之机。计失而听过，能有国者寡也。故曰：‘计有一二者难悖也，听无失本末者难惑。”　"],
}
ZhanGuoBookPageModule[61] = {
    "index": "战国策",
    "name": "秦二·秦惠王死公孙衍欲穷张仪",
    "content": ["　　秦惠王死，公孙衍欲穷张仪。李雠谓公孙衍曰：“不如召甘茂于魏，召公孙显于韩，起樗里子于国。三人者，皆张仪之雠也，公用之，则诸侯必见张仪之无秦矣。”"],
}
ZhanGuoBookPageModule[62] = {
    "index": "战国策",
    "name": "秦二·义渠君之魏",
    "content": ["　　义渠君之魏，公孙衍谓义渠君曰：“道远，臣不得复过矣，请谒事情。”义渠君口：“愿闻之。”对曰：“中国无事于秦，则秦且烧（艹热）获君之国；中国为有事于秦，则秦且轻使重币，而事君之国也。”义渠君曰：“谨闻令。” 居无几何，五国伐秦。陈圳谓秦王曰：“义渠君者，蛮夷之贤君，王不如赂之以抚其心。”秦王曰：“善。”因以文绣千匹，好女百人，遗义渠君。义渠君致群臣而谋曰：“此乃公孙衍之所谓也。”因起兵袭秦，大败秦人于李帛之下。"],
}
ZhanGuoBookPageModule[63] = {
    "index": "战国策",
    "name": "秦二·医扁鹊见秦武王",
    "content": ["　　医扁鹊见秦武王，武王示之病，扁鹊请除。左右曰：“君之病，在耳之前，目之下，除之未必已也，将使耳不聪，目不明。”君以告扁鹊。扁鹊怒而投其石：“君与知之者谋之，而与不知者败之，使此知秦国之政也，则君一举而亡国矣。”　"],
}
ZhanGuoBookPageModule[64] = {
    "index": "战国策",
    "name": "秦二·秦武王谓甘茂",
    "content": ["　　秦武王谓甘茂曰：“寡人欲车通三川，以窥周室，而寡人死不朽乎?”甘茂对曰：“请之魏，约伐韩。”王令向寿辅行。甘茂至魏，谓向寿：“子归，告王曰：‘魏听臣矣，然愿王勿攻也。’事成，尽以为子功。”向寿归以告王，王迎甘茂于息壤。甘茂至，王问其故。对曰：“宜阳，大县也，上党、南阳积之久矣，名为县，其实郡也。今王倍数险，行千里而攻之，难矣。臣闻张仪西并巴、蜀之地，北取西河之外，南取上庸，天下不以为多张仪而贤先王。魏文侯令乐羊将，攻中山，三年而拔之，乐羊反而语功，文侯示之谤书一箧，乐羊再拜稽首曰：‘此非臣之功，主君之力也。’今臣羁旅之臣也，樗里疾、公孙衍二人者，挟韩而议，王必听之，是王欺魏，而臣受公仲侈之怨也。昔者曾子处费，费人有与曾子同名族者而杀人，人告曾子母曰：‘曾参杀人。’曾子之母曰：‘吾子不杀人。’织自若。有顷焉，人又曰：‘曾参杀人。’其母尚织自若也。顷之，一人又告之曰：‘曾参杀人。’其母惧，投杼逾墙而走。夫以曾参之贤，与母之信也，而三人疑之，则慈母不能信也。今臣之贤不及曾子，而王之信臣，又未若曾子之母也，疑臣者不适三人，臣恐王为臣之投杼也。”王曰：“寡人不听也，请与子盟。”于是与之盟于息壤。 果攻宜阳，五月而不能拔也。樗里疾、公孙衍二人在，争之王，王将听之，召甘茂而告之。甘茂对曰：“息壤在彼。”王曰：“有之。”因悉起兵，复使甘茂攻之，遂拔宜阳。"],
}
ZhanGuoBookPageModule[65] = {
    "index": "战国策",
    "name": "秦二·宜阳之役冯章谓秦王",
    "content": ["　　宜阳之役，冯章谓秦王曰：“不拔宜阳，韩、楚乘吾弊，国必危矣!不如许楚汉中以欢之。楚欢而不进，韩必孤，无奈秦何矣!”王曰：“善。”果使冯章许楚汉中，而拔宜阳。楚王以其言责汉中於冯章，冯章谓秦王曰：“王遂亡臣，固谓楚王曰：‘寡人固无地而许楚王。’”"],
}
ZhanGuoBookPageModule[66] = {
    "index": "战国策",
    "name": "秦二·甘茂攻宜阳",
    "content": ["　　甘茂攻宜阳，三鼓之而卒不上。秦之右将有尉对曰：“公不论兵，必大困。”甘茂曰：“我羁旅而得相秦者，我以宜阳饵王。今攻宜阳而不拔，公孙衍、樗里疾挫我于内，而公中以韩穷我于外，是无伐之日已!请明日鼓之，而不可下，因以宜阳之郭为墓。”於是出私金以益公赏。明日鼓之，宜阳拔。"],
}
ZhanGuoBookPageModule[67] = {
    "index": "战国策",
    "name": "秦二·宜阳未得",
    "content": ["　　宜阳末得，秦死伤者众，甘茂欲息兵。左成谓甘茂曰：“公内攻于樗里疾、公孙衍，而外与韩侈为怨，今公用兵无功，公必穷矣。公不如进兵攻宜阳，宜阳拔，则公之功多矣。是樗里疾、公孙衍无事也，秦众尽怨之深矣。”"],
}
ZhanGuoBookPageModule[68] = {
    "index": "战国策",
    "name": "秦二·宜阳之役楚畔秦而合於韩",
    "content": ["　　宜阳之役，楚畔秦而合於韩。秦王惧。甘茂曰：“楚虽合韩，不为韩氏先战；韩亦恐战而楚有变其后。韩、楚必相御也。楚言与韩，而不余怨于秦，臣是以知其御也。"],
}
ZhanGuoBookPageModule[69] = {
    "index": "战国策",
    "name": "秦二·秦王谓甘茂",
    "content": [
        "　　秦王谓甘茂曰：“楚客来使者多健，与寡人争辞，寡人数穷焉，为之奈何?”甘茂对曰：",
        "　　“王勿患也!其健者来使者，则王勿听其事；其需弱者来使，．则王必听之。然则需弱者用，而健者不用矣!王因而制之。”　",
    ],
}
ZhanGuoBookPageModule[70] = {
    "index": "战国策",
    "name": "秦二·甘茂亡秦且之齐",
    "content": ["　　甘茂亡秦，且之齐，出关遇苏子，曰：“君闻夫江上之处女乎?”苏子曰：“不闻。”曰：“夫江上之处女，有家贫而无烛者，处女相与语，欲去之。家贫无烛者将去矣，谓处女曰：‘妾以无烛，故常先至，扫室布席，何爱余明之照四壁者?幸以赐妾，何妨于处女?妾自以有益于处女，何为去我?’处女相语以为然而留之。今臣不肖，弃逐于秦而出关，愿为足下扫室布席，幸无我逐也。”苏子曰：“善。请重公于齐。”乃西说秦王曰：“甘茂，贤人，非恒士也。其居秦，累世重矣，自殽塞、谿谷，地形险易尽知之。彼若以齐约韩、魏，反以谋秦，是非秦之利也。”秦王曰：“然则奈何?”苏代曰：“不如重其贽，厚其禄以迎之。彼来则置之槐谷，终身勿出，天下何从图秦。”秦王曰：“善。”与之上卿，以相迎之齐。甘茂辞不往，苏秦伪谓王曰：“甘茂，贤人也。今秦与之上卿，以相迎之，茂德王之赐，故不往，愿为王臣。今王何以礼之?王若不留，必不德王。彼以甘茂之贤，得擅用强秦之众，则难图也!”齐王曰：“善。”赐之上卿，命而处之。"],
}
ZhanGuoBookPageModule[71] = {
    "index": "战国策",
    "name": "秦二·甘茂相秦",
    "content": ["　　甘茂相秦。秦王爱公孙衍，与之间有所立，因自谓之曰：“寡人且相子。”甘茂之吏道而闻之，以告甘茂。甘茂因入见王曰：“王得贤相，敢再拜贺。”王曰：“寡人托国于子，焉更得贤相?”对曰：“王且相犀首。”王曰：“子焉闻之?”对曰：“犀首告臣。”王怒于犀首之泄也，乃逐之。"],
}
ZhanGuoBookPageModule[72] = {
    "index": "战国策",
    "name": "秦二·甘茂约秦魏而攻楚",
    "content": [
        "　　甘茂约秦、魏而攻楚。楚之相秦者屈盖，为楚和于秦，秦启关而听楚使。甘茂谓秦王曰：",
        "　　“怵于楚而不使魏制和，楚必曰‘秦鬻魏’。不悦而合于楚，楚、魏为一，国恐伤矣。王不如使魏制和，魏制和必悦。王不恶于魏，则寄地必多矣。”　",
    ],
}
ZhanGuoBookPageModule[73] = {
    "index": "战国策",
    "name": "秦二·陉山之事",
    "content": [
        "　　陉山之事，赵且与秦伐齐。齐惧，令田章以阳武合于赵，而以顺子为质。赵王喜，乃案兵告于秦曰：“齐以阳武赐弊邑而纳顺子，欲以解伐。敢告下吏。”",
        "　　秦王使公子他之赵，谓赵王曰：“齐与大国救魏而倍约，不可信恃，大国不义，以告弊邑，而赐之二社之地，以奉祭祀。今又案兵，且欲合齐而受其地，非使臣之所知也。请益甲四万，大国裁之”。",
        "　　苏代为齐献书穰侯曰：“臣闻往来之者言曰：‘秦且益赵甲四万人以伐齐。’臣窃必之弊邑之王曰：‘秦王明而熟于计，穰侯智而习于事，必不益赵甲四万人以伐齐。’是何也?夫三晋相结，秦之深雠也。三晋百背秦，百欺秦，不为不信，不为无行。今破齐以肥赵，赵，秦之深讎，不利于秦。一也。秦之谋者必曰：‘破齐弊晋，而后制晋、楚之胜。’夫齐，罢国也，以天下击之，譬犹以千钧之弩溃痈也。秦王安能制晋、楚哉!二也。秦少出兵，则晋、楚不信；多出兵，则晋、楚制于秦。齐恐，则必不走于秦且走晋、楚。三也。齐割地以实晋、楚，则晋、楚安。齐举兵而为之顿剑，则秦反受兵。四也。是晋、楚以秦破齐，以齐破秦，何晋、楚之智而齐、秦之愚!五也。秦得安邑，善齐以安之，亦必无患矣。秦有安邑，则韩、魏必无上党哉。夫取三晋之肠胃与出兵而惧其不反也，孰利?故臣窃必之弊邑之王曰：‘秦王明而熟于计，穰侯智而习于事，必不益赵甲四万人以伐齐矣。’”",
    ],
}
ZhanGuoBookPageModule[74] = {
    "index": "战国策",
    "name": "秦二·秦宣太后爱魏丑夫",
    "content": ["　　秦宣太后爱魏丑夫。太后病将死，出令曰：“为我葬，必以魏子为殉。”魏子患之。庸芮为魏子说太后曰：“以死者为有知乎?”太后曰：“无知也。”曰：“若太后之神灵，明知死者之无知矣，何为空以生所爱，葬于无知之死人哉!若死者有知，先王积怒之日久矣，太后救过不赡，何暇乃私魏丑夫乎?”太后曰：“善。”乃止。"],
}
ZhanGuoBookPageModule[75] = {
    "index": "战国策",
    "name": "秦三·薛公为魏谓魏冉",
    "content": ["　　薛公为魏谓魏冉曰：“文闻秦王欲以吕礼收齐，以济天下，君必轻矣。齐、秦相聚以临三晋，礼必并相之，是君收齐以重吕礼也。齐免于天下之兵，其雠君必深。君不如劝秦王令弊邑卒攻齐之事。齐破，文请从所得封君。齐破晋强，秦王畏晋之强也，必重君以取晋。齐予晋弊邑，而不能支秦，晋必重君以事秦。是君破齐以为功，操晋以为重也。破齐定封，而秦、晋皆重君；若齐不破，吕礼复用，子必大穷矣。”"],
}

ZhanGuoBookPageModule[76] = {
    "index": "战国策",
    "name": "秦三·秦客卿造谓穰侯",
    "content": [
        "　　秦客卿造谓穰侯曰；“秦封君以陶，藉君天下数年矣。攻齐之事成，陶为万乘，长小国，率以朝天子，天下必听，五伯之事也；攻齐不成，陶为邻恤，而莫之据也。故攻齐之于陶也，存亡之机也。",
        "　　“君欲成之，何不使人谓燕相国曰：‘圣人不能为时，时至而弗失。舜虽贤，不遇尧也，不得为天子；汤、武虽贤，不当桀、纣不王。故以舜、汤、武之贤，不遭时，不得帝王。令攻齐，此君之大时也已。因天下之力，伐雠国之齐，报惠王之耻，成昭王之功，除万世之害，此燕之长利，而君之大名也。 《书》云，树德莫如滋，除害莫如尽。吴不亡越，越故亡吴；齐不亡燕，燕故亡齐。齐亡于燕，吴亡于越，此除疾不尽也。以非此时也，成君之功，除君之害，秦卒有他事而从齐，齐、赵合，其雠君必深矣。挟君之雠以诛于燕，后虽悔之，不可得也已。君悉燕兵而疾僭之，天下之从君也，若报父子之仇。诚能亡齐，封君于河南，为万乘，达途于中国，南与陶为邻，世世无患。愿君之专志于攻齐，而无他虑也。’”",],
}
ZhanGuoBookPageModule[77] = {
    "index": "战国策",
    "name": "秦三·魏谓魏冉",
    "content": ["　　魏谓魏冉曰：“公闻东方之语乎?”曰：“弗闻也。”曰：“辛、张阳、毋泽说魏王、薛公、公叔也，曰：‘臣战，载主契国以与王约，必无患矣。若有败之者，臣请挈领。然而臣有患也。夫楚王之以其臣请挈领，然而臣有患也。夫楚王之以其国依冉也，而事臣之主，此臣之甚患也。’今公东而因言于楚，是令张仪之言为禹，而务败公之事也。公不如反公国，德楚而观薛公之为公也。观三国之所求于秦而不能得者，请以号三国以自信也。观张仪与泽之所不能得于薛公者也，而公请之以自重也。”　"],
}
ZhanGuoBookPageModule[78] = {
    "index": "战国策",
    "name": "秦三·谓魏冉曰和不成",
    "content": ["　　谓魏冉曰：“和不成，兵必出。白起者，且复将。战胜，必穷公；不胜，必事赵从公。公又轻，公不若毋多，则疾到。”"],
}
ZhanGuoBookPageModule[79] = {
    "index": "战国策",
    "name": "秦三·谓穰侯",
    "content": ["　　谓穰侯曰：“为君虑封，若于除宋罪，重齐怒；须残伐乱宋，德强齐，定身封。此亦百世之时也已。”"],
}
ZhanGuoBookPageModule[80] = {
    "index": "战国策",
    "name": "秦三·谓魏冉曰楚破秦",
    "content": ["　　谓魏冉曰：“楚破秦，不能与齐县衡矣。秦三世积节于韩、魏，而齐之德新加与。齐、秦交争，韩、魏东听，则秦伐矣。齐有东国之地，方千里。楚苞九夷，又方千里，南有符离之塞，北有甘鱼之口。权县宋、卫，宋、卫乃当阿、甄耳。利有千里者二，富擅越隶，秦乌能与齐县衡韩、魏，支分方城膏腴之地以薄郑?兵休复起，足以伤秦，不必待齐。”"],
}
ZhanGuoBookPageModule[81] = {
    "index": "战国策",
    "name": "秦三·五国罢成皋",
    "content": [
        "　　五国罢成皋，秦王欲为成阳君求相韩、魏，韩、魏弗听。秦太后为魏冉谓秦王曰：",
        "　　“成阳君以王之故，穷而居于齐，今王见其达而收之，亦能翕其心乎?”王曰：“未也。”太后曰：“穷而不收，达而报之，恐不为王用。且收成阳君，失韩、魏之道也。”",
    ],
}
ZhanGuoBookPageModule[82] = {
    "index": "战国策",
    "name": "秦三·范子因王稽入秦",
    "content": [
        "　　范子因王稽入秦，献书昭王曰：“臣闻明主莅正，有功者不得不赏，有能者不得不官；劳大者其禄厚、功多者其爵尊，能治众者其官大。故不能者不敢当其职焉，能者亦不得蔽隐。使以臣之言为可，则行而益利其道；若将弗行，则久留臣无为也。语曰：‘人主赏所爱而罚所恶。明主则不然，赏必加于有功，刑必断于有罪。’今臣之胸不足以当椹质，要不足以待斧钺，岂敢以疑事尝试于王乎?虽以臣为贱而轻辱臣，独不重任臣者后无反复于王前耶!",
        "　　“臣闻周有砥厄，宋有结绿，梁有悬黎，楚有和璞。此四宝者，工之所失也，而为天下名器。然则圣王之所弃者，独不足以厚国家乎?",
        "　　“臣闻善厚家者，取之于国；善厚国者，取之于诸侯。天下有明主，则诸侯不得擅厚矣。是何故也?为其凋荣也。良医知病人之死生，圣主明于成败之事，利则行之，害则舍之，疑则少尝之，虽尧、舜、禹、汤复生，弗能改已!语之至者，臣不敢载之于书；其浅者又不足听也。意者，臣愚而不阖于王心耶？已其言臣者，将贱而不足听耶!非若是也，则臣之志，愿少赐游观之间，望见足下而入之。”",
        "　　书上，秦王说之，因谢王稽说，使人持车召之。",
    ],
}
ZhanGuoBookPageModule[83] = {
    "index": "战国策",
    "name": "秦三·范睢至秦",
    "content": [
        "　　范睢至秦，王庭迎，谓范睢曰：“寡人宜以身受令久矣。今者义渠之事急，寡人日自请太后。今义渠之事已，寡人乃得以身受命。躬窃闵然不敏，敬执宾主之礼。”范睢辞让。",
        "　　是日见范睢，见者无不变色易容者。秦王屏左右，宫中虚无人，秦王跪而请曰：“先生何以幸教寡人?”范睢曰：“唯唯。”有间，秦王复请，范睢曰：“唯唯。”若是者三。",
        "　　秦王跽曰：“先生不幸教寡人乎?” 范睢谢曰：“非敢然也。臣闻始时吕尚之遇文王也，身为渔父而钓于渭阳之滨耳。若是者，交疏也。已一说而立为太师，载与俱归者，其言深也。故文王果收功于吕尚，卒擅天下而身立为帝王。即使文王疏吕望而弗与深言，是周无天子之德，而文、武无与成其王也。今臣，羁旅之臣也，交疏于王，而所愿陈者，皆匡君之之事，处人骨肉之间，愿以陈臣之陋忠，而未知王心也，所以王三问而不对者是也。臣非有所畏而不敢言也，知今日言之于前，而明日伏诛于后，然臣弗敢畏也。大王信行臣之言，死不足以为臣患，亡不足以为臣忧，漆身而为厉，被发而为狂，不足以为臣耻。五帝之圣而死，三王之仁而死，五伯之贤而死，乌获之力而死，奔、育之勇焉而死。死者，人之所必不免也。处必然之势，可以少有补于秦，此臣之所大愿也，臣何患乎?伍子胥櫜载而出昭关，夜行而昼伏，至于凌水，无以饵其口，坐行蒲服，乞食于吴市，卒兴吴国，阖庐为霸。使臣得进谋如伍子胥，加之以幽囚，终身不复见，是臣说之行也，臣何忧乎?箕子、接舆，漆身而为厉，被发而为狂，无益于殷、楚。使臣得同行于箕子、接舆，漆身可以补所贤之主，是臣之大荣也，臣又何耻乎?臣之所恐者，独恐臣死之后，天下见臣尽忠而身蹶也，是以杜口裹足，莫肯即秦耳。足下上畏太后之严，下惑奸臣之态；居深宫之中，不离保傅之手；终身暗惑，无与照奸；大者宗庙灭覆，小者身以孤危。此臣之所恐耳!若夫穷辱之事，死亡之患，臣弗敢畏也。臣死而秦治，贤于生也。”",
        "　　秦王跽曰：“先生是何言也!夫秦国僻远，寡人愚不肖，先生乃幸至此，此天以寡人慁先生，而存先王之庙也。寡人得受命于先生，此天所以幸先王而不弃其孤也。先生奈何而言若此!事无大小，上及太后，下至大臣，愿先生悉以教寡人，无疑寡人也。”范睢再拜，秦王亦再拜。",
        "　　范睢曰：“大王之国，北有甘泉、谷口，南带泾、渭，右陇、蜀，左关、阪；战车千乘，奋击百万。以秦卒之勇，车骑之多，以当诸侯，譬若驰韩卢而逐蹇兔也，霸王之业可致。今反闭而不敢窥兵于山东者，是穰侯为国谋不忠，而大王之计有所失也。”",
        "　　王曰：“愿闻所失计。”",
        "　　睢曰：“大王越韩、魏而攻强齐，非计也。少出师，则不足以伤齐；多之则害于秦。臣意王之计欲少出师，而悉韩、魏之兵则不义矣。今见与国之不可亲，越人之国而攻，可乎?疏于计矣!昔者齐人伐楚，战胜，破军杀将，再辟千里，肤寸之地无得者，岂齐不欲地哉，形弗能有也。诸侯见齐之罢露，君臣之不亲，举兵而伐之，主辱军破，为天下笑。所以然者，以其伐楚而肥韩、魏也。此所谓藉贼兵而赍盗食者也。王不如远交而近攻，得寸则王之寸，得尺亦王之尺也。今舍此而远攻，不亦缪乎?且昔者，中山之地，方五百里，赵独擅之，功成、名立、利附，则天下莫能害。今韩、魏，中国之处，而天下之枢也。王若欲霸，必亲中国而以为天下枢，以威楚、赵。赵彊则楚附，楚彊则赵附。楚、赵附则齐必惧，惧必卑辞重币以事秦，齐附而韩、魏可虚也。”",
        "　　王曰：“寡人欲亲魏，魏多变之国也，寡人不能亲。请问亲魏奈何?”范睢曰：“卑辞重币以事之。不可，削地而赂之。不可，举兵而伐之。”于是举兵而攻邢丘，邢丘拔而魏请附。曰：“秦、韩之地形，相错如绣。秦之有韩，若木之有蠢，人之病心腹。天下有变，为秦害者莫大于韩。王不如收韩。”王曰：“寡人欲收韩，不听，为之奈何?”",
        "　　范睢曰：“举兵而攻荥阳，则成皋之路不通；北斩太行之道，则上党之兵不下；一举而攻荥阳，则其国断而为三。魏、韩见必亡，焉得不听?韩听而霸事可成也。”王曰：“善。”",
        "　　范睢曰：“臣居山东，闻齐之内有田单，不闻其王。闻秦之有太后、穰侯、泾阳、华阳，不闻其有王。夫擅国之谓王，能专利害之谓王，制杀生之威之谓王。今太后擅行不顾，穰侯出使不报，泾阳、华阳击断无讳，四贵备而国不危者，未之有也。为此四者，下乃所谓无王已。然则权焉得不倾，而令焉得从王出乎?臣闻：‘善为国者，内固其威，而外重其权。’穰侯使者操王之重，决裂诸侯，剖符于天下，征敌伐国，莫敢不听。战胜攻取，则利归于陶；国弊，御于诸侯；战败，则怨结于百姓，而祸归社稷。《诗》曰：‘木实繁者披其枝，披其技者伤其心。大其都者危其国，尊其臣者卑其主。’淖齿管齐之权，缩闵王之筋，县之庙梁，宿昔而死。李兑用赵，减食主父，百日而饿死。今秦，太后、穰侯用事，高陵、泾阳佐之，卒无秦王，此亦淖齿、李兑之类已。臣今见王独立于庙朝矣，且臣将恐后世之有秦国者，非王之子孙也。",
        "　　秦王惧，于是乃废太后，逐穰侯，出高陵，走泾阳于关外。昭王谓范睢曰：“昔者，齐公得管仲，时以为仲父。今吾得子，亦以为父。”",
    ],
}
ZhanGuoBookPageModule[84] = {
    "index": "战国策",
    "name": "秦三·应侯谓昭王",
    "content": [
        "　　应侯谓昭王曰：“亦闻恒思有神丛与?恒思有悍少年，请与丛博，曰：‘吾胜丛，丛籍我神三日；不胜丛，丛困我。”乃左手为丛投，右手自为投，胜丛，丛籍其神。三日，丛往求之，遂弗归。五日而丛枯，七日而丛亡。今国者，王之丛；势者，王之神。籍人以此，得无危乎?臣未尝闻指大于臂，臂大于股，若有此，则病必甚矣。百人舆瓢而趋，不如一人持而走疾。百人诚舆瓢，瓢必裂。今秦国，华阳用之，穰侯用之，太后用之，王亦用之。不称瓢为器，则已；已称瓢为器，国必裂矣。臣闻之也：‘木实繁者枝必披，枝之披者伤其心。都大者危其国，臣强者危其主。’且令邑中自斗食以上，至尉、内史及王左右，有非相国之人者乎?国无事，则已；国有事，臣必闻见王独立于庭也。臣窃为王恐，恐万世之后有国者，非王子孙也。",
        "　　“臣闻古之善为政也，其威内扶，其辅外布，四治政不乱不逆，使者直道而行，不敢为非。今太后使者分裂诸侯，而符布天下，操大国之势，强征兵，伐诸侯。战胜攻取，利尽归于陶；国之币帛，竭入太后之家；竟内之利，分移华阳。古之所谓危主灭国之道，必从此起。三贵竭国以自安，然则令何得从王出，权何得毋分，是我王果处三分之一也。”",
    ],
}
ZhanGuoBookPageModule[85] = {
    "index": "战国策",
    "name": "秦三·秦攻韩围陉",
    "content": ["　　秦攻韩，围陉。范睢谓秦昭王曰：“有攻人者，有攻地者。穰侯十攻魏而不得伤者，非秦弱而魏强也，其所攻者，地也。地者，人主所甚爱也。人主者，人臣之所乐为死也。攻人主之所爱，与乐死者斗，故十攻而弗能胜也。今王将攻韩围陉，臣愿王之毋独攻其地，而攻其人也。王攻韩围陉，以张仪为言。张仪之力多，且削地而以自赎于王，几割地而韩不尽；张仪之力少，则王逐张仪，而更与不如张仪者市。则王之所以求于韩者，言可得也。”"],
}

ZhanGuoBookPageModule[86] = {
    "index": "战国策",
    "name": "秦三·应侯曰郑人谓玉未理者璞",
    "content": [
        "　　　　应侯曰：“郑人谓玉未理者璞，周人谓鼠未腊者朴。周人怀璞过郑贾曰：‘欲买朴乎?’郑贾曰：‘欲之。’出其朴，视之，乃鼠也。因谢不取。今平原君自以贤，显名于天下，然降其主父沙丘而臣之。天下之王尚犹尊之，是天下之王不如郑贾之智也，眩于名，不知其实也。”",],
}
ZhanGuoBookPageModule[87] = {
    "index": "战国策",
    "name": "秦三·天下之士合从相聚于赵",
    "content": [
        "　　天下之士，合从相聚于赵，而欲攻秦。秦相应侯曰：“王勿忧也，请令废之。秦于天下之士非有怨也，相聚而攻秦者，以己欲富贵耳。王见大王之狗，卧者卧，起者起，行者行，止者止，毋相与斗者；投之一骨，轻起相牙者，何则?有争意也。”于是唐睢载音乐，予之五十金，居武安，高会相与饮，谓：“邯郸人谁来取者?”于是其谋者固未可得予也，其可得与者，与之昆弟矣。",
        "　　“公与秦计功者，不问金之所之，金尽者功多矣。今令人复载五十金随公。”唐睢行，行至武安，散不能三千金，天下之士，大相与斗矣。",
    ],
}
ZhanGuoBookPageModule[88] = {
    "index": "战国策",
    "name": "秦三·谓应侯曰君禽马服乎",
    "content": ["　　谓应侯曰：“君禽马服乎?”曰：“然。”“又即围邯郸乎?”曰：“然。”“赵亡，秦王王矣，武安君为三公。武安君所以为秦战胜攻取者七十余城，南亡鄢郢、汉中，禽马服之军，不亡一甲，虽周吕望之功，亦不过此矣。赵亡，秦王王，武安君为三公，君能为之下乎?虽欲无为之下，固不得之矣。秦尝攻韩邢，困于上党，上党之民皆返为赵。天下之民，不乐为秦民之日固久矣。今攻赵，北地入燕，东地入齐，南地入楚、魏，则秦所得不一几何。故不如因而割之，因以为武安功。”"],
}

ZhanGuoBookPageModule[89] = {
    "index": "战国策",
    "name": "秦三·应侯失韩之汝南",
    "content": [
        "　　应侯失韩之汝南。秦昭王谓应侯曰：“君亡国，其忧乎?”应侯曰：“臣不忧。”王曰：“何也?”曰：“梁人有东门吴者，其子死而不忧，其相室曰：‘公之爱子也，天下无有，今子死不忧，何也?’东门吴曰：“吾尝无子，无子之时不忧；今子死，乃即与无子时同也。臣奚忧焉?’臣亦尝为子，为子时不忧；今亡汝南，乃与即为梁余子同也。臣何为忧?”秦王以为不然，以告蒙傲曰：“今也，寡人一城围，食不甘味，卧不便席，今应侯亡地而言不忧，此其情也?”蒙傲曰：“臣请得其情。”蒙傲乃往见应侯，曰：“傲欲死。”应侯曰：“何谓也?”曰：“秦王师君，天下莫不闻，而况于秦国乎？今傲势得秦为王将，将兵，臣以韩之细也，显逆诛，夺君地，傲尚奚生?不若死。”应侯拜蒙傲曰：“愿委之卿。”蒙傲以报于昭王。自是之后，应侯每言韩事者，秦王弗听也，以其为汝南虏也。",
    ],
}
ZhanGuoBookPageModule[90] = {
    "index": "战国策",
    "name": "秦三·秦攻邯郸",
    "content": [
        "　　秦攻邯郸，十七月不下。庄谓王稽曰：“君何不赐军吏乎?”王稽曰：“吾与王也，不用人言。”庄曰：“不然。父之于子也，令有必行者，必不行者。曰‘去贵妻，卖爱妾’，此令必行者也；因曰‘毋敢思也’，此令必不行者也。宁闾妪曰，‘其夕，某孺子内某士’。贵妻已去，爱妾已卖，而心不有。欲教之者，人心固有。今君虽幸於王，不过父子之亲；军吏虽贱，不卑于守闾妪。且君擅主轻下之日久矣。闻‘三人成虎，十夫楺椎。众口所移，毋翼而飞’。故曰，不如赐军吏而礼之。”王稽不听。军吏穷，果恶王稽、杜挚以反。’",
        "　　秦王大怒，而欲兼诛范睢。范睢曰：“臣，东鄙之贱人也，开罪于楚、魏，遁逃来奔。臣无诸侯之援，亲习之故，王举臣于羁旅之中，使职事，天下皆闻臣之身与王之举也。今遇惑或与罪人同心，而王明诛之，是王过举显于天下，而为诸侯所议也。臣愿请药赐死，而恩以相葬臣，王必不失臣之罪，而无过举之名。”王曰：“有之。”遂弗杀而善遇之。",
    ],
}
ZhanGuoBookPageModule[91] = {
    "index": "战国策",
    "name": "秦三·蔡泽见逐于赵",
    "content": [
        "　　蔡泽见逐于赵，而入韩、魏，遇夺釜鬲于涂。闻应侯任郑安平、王稽，皆负重罪，应侯内惭，乃西入秦。将见昭王，使人宣言以感怒应侯曰：“燕客蔡泽，天下骏雄弘辩之士也。彼一见秦王，秦王必相之而夺君位。”",
        "　　应侯闻之，使人召蔡泽。蔡泽入，则揖应侯，应侯固不快；及见之，又倨。应侯因让之曰：“子尝宣言代我相秦，岂有此乎？”对曰：“然。”应侯曰：“请闻其说。”蔡泽曰：“吁！何君见之晚也。夫四时之序，成功者去。夫人生手足坚强，耳目聪明，而心圣知，岂非士之所愿与？”应侯曰：“然。”蔡泽曰：“质仁秉义，行道施德于天下，天下怀乐敬爱，愿以为君王，岂不辩智之期与？”应侯曰：“然。”蔡泽复曰：“富贵显荣，成理万物，万物各得其所；生命寿长，终其年而不夭伤；天下继其统，守其业，传之无穷，名实纯粹，泽流千世，称之而毋绝，与天下终。岂非道之福，而圣人所谓吉祥善事与？”应侯曰：“然。”蔡泽曰：“若秦之商君，楚之吴起，越之大夫种，其卒亦可愿矣。”",
        "　　应侯知蔡泽之欲困己以说，复曰：“何为不可？夫公孙鞅事孝公，极身毋二，尽公不还私，信赏罚以致治，竭智能，示请素，蒙怨咎，欺旧交，虏魏公子，卒为秦禽将，破敌军，攘地千里。吴起事悼王，使死不害公，谗不蔽忠，言不取苟合，行不取苟容，行义不图毁誉，必有伯主强国，不辞祸凶。大夫种事越王，主离困辱，悉忠而不解，主虽亡绝，尽能而不离，多功而不矜，贵富不骄怠。若此三子者，义之至，忠之节也。故君子杀身以成名，义之所在。身虽死，无憾悔，何为不可哉？”",
        "　　蔡泽曰：“主圣臣贤，天下之福也；君明臣忠，国之福也；父慈子孝，夫信妇贞，家之福也。故比干忠不能存殷，子胥知不能存吴，申生孝而晋国乱。是有忠臣孝子，国家灭乱，何也？无明君贤父以听之。故天下一其君父为戮辱，怜其臣子。夫待死之后可以立忠成名，是微子不足仁，孔子不足圣，管仲不足大也。”于是应侯称善。",
        "　　蔡泽得少间，因曰：“商君、吴起、大夫种，其为人臣，尽忠致功，则可愿矣。闳夭事文王，周公辅成王也，岂不亦忠乎？以君臣论之，商君、吴起、大夫种，其可愿孰与闳夭、周公哉？”应侯曰：“商君、吴起、大夫种不若也。”蔡泽曰：“然则君之主，慈仁任忠，不欺旧故，孰与秦孝公、楚悼王、越王乎？”应侯曰：“未知何如也。”蔡泽曰：“今主固亲忠臣，不过秦孝、越王、楚悼。君者为主，正乱、披患、折难，广地、殖谷，痼国足家、强主，威盖海内，功章万里之外，不过商君、吴起、大夫种。而君之禄位贵盛，私家之富过于三子，而身不退，窃为君危之。语曰：‘日中则移，月满则亏。’物盛则衰，天之常数也；进退、盈缩、变化，圣人之常道也。昔者，齐桓公九合诸侯，一匡天下，至葵丘之会，有骄矜之色，畔者九国。吴王夫差无敌于天下，轻诸侯，凌齐、晋，遂以杀身亡国。夏育、太史启叱呼骇三军，然而身死于庸夫。此皆乘至盛不及道理也。夫商君为孝公平权衡、正度量、调轻重，决裂阡陌，教民耕战，是以兵动而地广，兵休而国富，故秦无敌于天下，立威诸侯。功已成，遂以车裂。楚地方千里，带甲百万，白起率数万之师，以与楚战，一战举鄢、郢，再战烧夷陵，南并蜀、汉，又越韩、魏攻强赵，北坑马服，诛屠四十余万之众，流血成川，沸声若雷，使秦业帝。自是之后，赵、楚慑服，四十余年不敢攻秦者，白起之势也。身所服者，七十余城。功已成矣，赐死于杜邮。吴起为楚悼罢无能，废无用，损不急之官。塞私门之请，壹楚国之俗，南攻杨越，北并陈、蔡，破横散从，使驰说之士无所开其口。功已成矣，卒支解。大夫种为越王垦草创邑，辟地殖谷，率四方之士，专上下之力，以禽劲吴，成霸功。勾践终背而杀之。此四子者，成功而不去，祸至于此。此所谓信而不能诎，往而不能反者也。范蠡知之，超然避世，长为陶朱公。君独不观博者乎？或欲大投，或欲分功。此皆君之所明知也。今君相秦，计不下衽席，某不出廊庙，坐制诸侯，利施三川，以实宜阳；决羊肠之险，塞太行之口，又斩范、中行之途，栈道千里于蜀、汉，使天下皆畏秦。秦之欲得矣，君之功极矣。此亦秦之分功之时也！如是不退，则商君、白公、吴起、大夫种是也。君何不以此时归相印，让贤者授之，必有伯夷之廉；长为应侯，世世称孤，而有乔、松之寿。孰与以祸终哉！此则君何居焉？”应侯曰善。”乃延入坐为上客。",
        "　　后数日，入朝，言于秦昭王曰：“客新有从山东来者蔡泽，其人辩士。臣之见人甚众，莫有及者，臣不如也。”秦昭王召见，与语，大说之，拜为客卿。应侯因谢病，请归相印。昭王强起应侯，应侯遂称笃，因免相。昭王新说蔡泽计画，遂拜为秦相，东收周室。蔡泽相秦王数月，人或恶之，惧诛，乃谢病归相印，号刚成君。居秦十余年，昭王、孝文王、庄襄王。卒事始皇帝。为秦使于燕，三年而燕使太子丹入质于秦。",
    ],
}
ZhanGuoBookPageModule[92] = {
    "index": "战国策",
    "name": "秦四·秦取楚汉中",
    "content": [
        "　　秦取楚汉中，再战于兰田，大败楚军。韩、魏闻楚之困，乃南袭至邓，楚王引归。后三国谋攻楚，恐秦之救也，或说薛公：“可发使告楚曰：‘今三国之兵且去楚，楚能应而共攻秦，虽兰田岂难得哉!况于楚之故地?’楚疑于秦之未必救己也，而今三国之辞去，则楚之应之也必劝，是楚与三国谋出秦兵矣。秦为知之，必不救也。三国疾攻楚，楚必走秦以急；秦愈不敢出，则是我离秦而攻楚也，兵必有功”。",
        "　　薛公曰：“善。”遂发重使之楚，楚之应果劝。于是三国并力攻楚，楚果告急于秦，秦遂不敢出兵。大臣有功。",
    ]
}
ZhanGuoBookPageModule[93] = {
    "index": "战国策",
    "name": "秦四·薛公入魏而出齐女",
    "content": [
        "　　薛公入魏而出齐女。韩春谓秦王曰：“何不取为妻，以齐、秦劫魏，则上党，秦之有也。齐、秦合而立负刍，负刍立，其母在秦，则魏，秦之县也已。呡欲以齐、秦劫魏而困薛公，佐欲定其弟，臣请为王因呡与佐也。魏惧而复之，负刍必以魏殁世事秦。齐女入魏而怨薛公，终以齐奉事王也。”　",
    ],
}
ZhanGuoBookPageModule[94] = {
    "index": "战国策",
    "name": "秦四·三国攻秦入函谷",
    "content": [
        "　　三国攻秦，入函谷。秦王谓楼缓曰：“三国之兵深矣，寡人欲割河东而讲。”对曰：“割河东，大费也；免于国患，大利也。此父兄之任也。王何不召公子池而问焉?”",
        "　　王召公子池而问焉，对曰：“讲亦悔，不讲亦悔。”王曰：“何也?”对曰：“王割河东而讲，三国虽去，王必曰：‘惜矣!三国且去，吾特以三城从之。’此讲之悔也。王不讲，三国入函谷，咸阳必危，王又曰：‘惜矣!吾爱三城而不讲。’此又不讲之悔也。”王曰：“钧吾悔也，宁亡三城而悔，无危咸阳而悔也。寡人决讲矣。”卒使公子池以三城讲于三国，之兵乃退。",
    ],
}
ZhanGuoBookPageModule[95] = {
    "index": "战国策",
    "name": "秦四·秦昭王谓左右",
    "content": [
        "　　秦昭王谓左右曰：“今日韩、魏，孰与始强?”对曰：“弗如也。”王曰：“今之如耳、魏齐，孰与孟尝、芒卯之贤?”对曰：“弗如也。”王曰：“以孟尝、芒卯之贤，帅强韩、魏之兵以伐秦，犹无奈寡人何也!今以无能之如耳、魏齐，帅弱韩、魏以攻秦，其无奈寡人何，亦明矣!”左右皆曰：“甚然。”",
        "　　中期推琴对曰：“三之料天下过矣。昔者六晋之时，智氏最强，灭破范、中行，帅韩、魏以围赵襄子于晋阳。决晋水以灌晋阳，城不沉者三板耳。智伯出行水，韩康子御，魏桓子骖乘。智伯曰：‘始吾不知水之可亡人之国也，乃今知之。汾水利以灌安邑，绛水利以灌平阳。’魏恒子肘韩康子，康子履魏恒子，蹑其踵。肘足接于车上，而智氏分矣。身死国亡，为天下笑。今秦之强，不能过智伯；韩、魏虽弱，尚贤在晋阳之下也。此乃方其用肘足时也，愿王之勿易也。”",
    ],
}
ZhanGuoBookPageModule[96] = {
    "index": "战国策",
    "name": "秦四·楚魏战于陉山",
    "content": ["　　楚、魏战于陉山。魏许秦以上洛，以绝秦于楚。魏战胜，楚败于南阳。秦责赂于魏，魏不与。营浅谓秦王曰：“王何不谓楚王曰，魏许寡人以地，今战胜，魏王倍寡人也。王何不与寡人遇。魏畏秦、楚之合，必与秦地矣。是魏胜楚而亡地于秦也；是王以魏地德寡人，秦之楚者多资矣。魏弱，若不出地，则王攻其南，寡人绝其西，魏必危。”秦王曰：“善。”以是告楚。楚王扬言与秦遇，魏王闻之恐，效上洛于秦。"],
}
ZhanGuoBookPageModule[97] = {
    "index": "战国策",
    "name": "秦四·楚使者景鲤在秦",
    "content": ["　　楚使者景鲤在秦，从秦王与魏王遇于境。楚怒秦合，周最为楚王曰：“魏请无与楚遇而合于秦，是以鲤与之遇也。弊邑之于与遇善之，故齐不合也。”楚王因不罪景鲤而德周、秦。"],
}
ZhanGuoBookPageModule[98] = {
    "index": "战国策",
    "name": "秦四·楚王使景鲤如秦",
    "content": [
        "　　楚王使景鲤如秦。客谓秦王曰：“景鲤，楚王使景所甚爱，王不如留之以市地。楚王听，则不用兵而得地；楚王不听，则杀景鲤，更不与不如景鲤留，是便计也。”秦王乃留景鲤。",
        "　　景鲤使人说秦王曰：“臣见王之权轻天下，而地不可得也。臣来使也，闻齐、魏皆且割地以事秦。所以然者，以秦与楚为昆弟国。今大王留臣，是示天下无楚也，齐、魏有何重于孤国也。楚知秦之孤，不与地，而外结交诸侯以图，则社稷必危，不如出臣。”秦王乃出之。",
    ],
}
ZhanGuoBookPageModule[99] = {
    "index": "战国策",
    "name": "秦四·秦王欲见顿弱",
    "content": [
        "　　秦王欲见顿弱，顿弱曰：“臣之义不参拜，王能使臣无拜，即可矣。不，即不见也。”秦王许之。于是顿子曰：“天下有其实而无其名者，有无其实而有其名者，有无其名又无其实者。王知之乎?”王曰：“弗知。”顿子曰：“有其实而无其名者，商人是也。无把铫推耨之势，而有积粟之实，此有其实而无其名者也。无其实而有其名者，农夫是也。解冻而耕，暴背而耨，无积粟之实，此无其实而有其名者也。无其名又无其实者，王乃是也。已立为万乘，无孝之名；以千里养，无孝之实。”秦王悖然而怒。",
        "　　顿弱曰：“山东战国有六，威不掩于山东，而掩于母，臣窃为大王不取也。”秦王曰：“山东之建国可兼与?”顿子曰：“韩，天下之咽喉；魏，天下之胸腹。王资臣万金而游，听之韩、魏，入其社稷之臣于秦，即、韩魏从。韩、魏从，而天下可图也。”秦王曰：“寡人之国贫，恐不能给也。”顿子曰：“天下未尝无事也，非从即横也。横成，则秦帝；从成，即楚王。秦帝，即以天下恭养；楚王，即王虽有万金，弗得私也。”秦王曰：“善。”乃资万金，使东游韩、魏，入其将相。北游于燕、赵，而杀李牧。齐王入朝，四国必从，顿子之说也。",
    ],
}
ZhanGuoBookPageModule[100] = {
    "index": "战国策",
    "name": "秦四·顷襄王二十年",
    "content": [
        "　　顷襄王二十年，秦白起拔楚西陵，或拔鄢、郢、夷陵，烧先王之墓。王徙东北，保于陈城。楚遂削弱，为秦所轻。于是白起又将兵来伐。楚人有黄歇者，游学博闻，襄王以为辩，故使于秦。说昭王曰：“天下莫强于秦、楚，今闻大王欲伐楚，此犹两虎相斗而驽犬受其弊，不如善楚。臣请言其说。臣闻之：‘物至而反，冬夏是也。致至而危，累棋是也。’今大国之地半天下，有二垂，此从生民以来，万乘之地未尝有也。先帝文王、庄王、王之身，三世而不接地于齐，以绝从亲之要。今王三使盛桥守事于韩，成桥以北入燕。是王不用甲，不伸威，而出百里之地，王可谓能矣。王又举甲兵而攻魏，杜大梁之门，举河内，拔燕、酸枣、虚、桃人，楚、燕之兵云翔不敢校，王之功亦多矣。王申息众二年，然后复之，又取蒲、衍、首垣，以临仁、平兵、小黄、济阳婴城，而魏氏服矣。王又割濮、磨之北属之燕，断齐、秦之要 ，绝楚、魏之脊。天下五合、六聚而不敢救也，王之威亦惮矣。王若能持功守威，省攻伐之心而肥仁义之诫，使无复后患，三王不足四，五伯不足六也。",
        "　　“王若负人徒之众，材兵甲之强，壹毁魏氏之威，而欲以力臣天下之主，臣恐有后患。《诗》云：‘靡不有初，鲜克有终。’《易》曰：‘狐濡其尾。’此言始之易，终之难也。何以知其然也?智氏见伐赵之利，而不知榆次之祸也；吴见伐齐之便，而不知干隧之败也。此二国者，非无大功也，设利于前，而易患于后也。吴之信越也，从而伐齐，既胜齐人于艾陵，还为越王禽于三江之浦。智氏信韩、魏，从而伐赵，攻晋阳之城，胜有日矣，韩、魏反之，杀智伯瑶于凿台之上，今王妒楚之不毁也，而忘毁楚之强魏也。臣为大王虑而不取。《诗》云：‘大武远宅不涉。’从此观之，楚国，援也；邻国，敌也。《诗》云：‘他人有心，予忖度之。跃跃毚兔，遇犬获之。’今王中道而信韩、魏之善王也，此正吴信越也。臣闻，敌不可易，时不可失。臣恐韩、魏之卑辞虑患，而实欺大国也。此何也?王既无重世之德于韩、魏，而有累世之怨矣。韩、魏父子兄弟接踵而死于秦者，百世矣。本国残，社稷坏，宗庙隳，刳腹折颐，首身分离，暴骨草泽，头颅僵仆，相望于境；父子老弱系虏，相随于路；鬼神狐祥无所食，百姓不聊生，族类离散，流亡为臣妾，满海内矣。韩、魏之不亡，秦社稷之忧也。今王之攻楚，不亦失乎!是王攻楚之日，则恶出兵？王将藉路于仇雠之韩、魏乎!兵出之日而王忧其不反也，是王以兵资于仇雠之韩、魏。王若不藉路于仇雠之韩、魏，必攻阳、右壤，随阳、右壤，此皆广川大水，山林溪谷不食之地，王虽有之，不为得地。是王有毁楚之名，无得地之实也。且王攻楚之日，四国必应悉起应王。秦、楚之构而不离，魏氏将出兵而攻留、方与、銍、胡陵、砀、萧、相，故宋必尽。齐人南面，泗北必举。此皆平原四达，膏腴之地也，而王使之独攻。王破楚于以肥韩、魏于中国而劲齐，韩、魏之强足以校于秦矣。齐南以泗为境，东负海，北倚河，而无后患，天下之国，莫强于齐。齐、魏得地葆利，而详事下吏，一年之后，为帝若未能，于以禁王之为帝有余。夫以王壤土之博，人徒之众，兵革之强，一举众而注地于楚，诎令韩、魏，归帝重于齐，是王失计也。",
        "　　“臣为王虑，莫若善楚。秦、楚合而为一，临以韩，韩必授首。王襟以山东之险，带以河曲之利，韩必为关中之候。若是，王以十成郑，梁氏寒心，许、鄢陵婴城，上蔡、召陵不往来也。如此，而魏亦关内侯矣。王一善楚，而关内二万乘之主注地于齐，齐之右壤可拱手而取也。是王之地一任两海，要绝天下也。是燕、赵无齐、楚，无燕、赵也。然后危动燕、赵，持齐、楚，此四国者，不待痛而服矣。”",
    ],
}
ZhanGuoBookPageModule[101] = {
    "index": "战国策",
    "name": "秦四·或为六国说秦王",
    "content": [
        "　　或为六国说秦王曰：“土广不足以为安，人众不足以为强。若土广者安，人众者强，则桀、纣之后将存。昔者赵氏亦尝强矣。曰赵强何若?举左案齐，举右案魏，厌案万乘之国，二国，千乘之宋也。筑刚平，工无东野，刍牧薪采莫敢窥东门。当是时，卫危于累卵，天下之士相从谋曰：‘吾将还其委质，而朝于邯郸之君乎!’于是天下有称伐邯郸者，莫不令朝行。魏伐邯郸，因退为逢泽之遇，乘夏车，称夏王，朝为天子，天下皆从。齐太公闻之，举兵伐魏，壤地两分，国家大危。梁王身抱质执璧，请为陈侯臣，天下乃释梁。郢威王闻之，寝不寐，食不饱，帅天下百姓，以与申缚遇于泗水之上，而大败申缚。赵人闻之至枝桑，燕人闻之至之格道。格道不通，平际绝。齐战败不胜，谋则不得，使陈毛释剑掫，委南听罪，西说赵，北说燕，内喻其百姓，而天下乃齐释。于是夫积薄而为厚，聚少而为多，以同言郢威王于侧纣之间。臣岂以郢威王为政衰谋乱以至于此哉?郢为强，临天下诸侯，故天下乐伐之也。”",
    ],
}
ZhanGuoBookPageModule[102] = {
    "index": "战国策",
    "name": "秦五·谓秦王",
    "content": [
        "　　谓秦王曰：“臣窃惑王之轻齐易楚，而卑畜韩也。臣闻，王兵胜而不骄，伯主约而不忿。胜而不骄，故能服世；约而不忿，故能从邻。今王广德魏、赵，而轻失齐，骄也；战胜宜阳，不恤楚交，忿也。骄忿非伯主之业也。臣窃为大主虑之而不取也。《诗》云：‘靡不有初，鲜克有终。’故先王之所重者，唯始与终。何以知其然?昔智伯瑶残范、中行，围逼晋阳，卒为三家笑。吴王夫差栖越于会稽，胜齐于艾陵，为黄池之遇，无礼于宋，遂与勾践禽，死于干隧。梁君伐楚胜齐，制赵、韩之兵，驱十二诸侯以朝天子于孟津，后子死，自布冠而拘于秦。三者非无功也，能始而不能终也。",
        "　　“今王破宜阳，残三川，而使天下之士不敢言；雍天下之国，徙西周之疆，而世主不敢交阳侯之塞；取董棘，而韩、楚之兵不敢进。王若能为此尾，则三王不足四，五伯不足六。王若不能为此尾，而有后患，则臣恐诸侯之君，河、济之士，以王为吴、智之事也。",
        "　　“《诗》云：‘行百里者半于九十。’此言末路之难。今大王皆有骄色，以臣之心观之，天下之事，依世主之心，非楚受兵，必秦也。何以知其然也?秦人援魏以拒楚，楚人援韩以拒秦，四国之兵敌，而未能复战也。齐、宋在绳墨之外以为权，故曰先得齐、宋者伐秦。秦先得齐、宋，则韩氏铄；韩氏铄，则楚孤而受兵也。楚先得齐，则魏氏铄；魏氏铄，则秦孤而受兵矣。若随此计而行之，则两国者必为天下笑矣。”",
    ],
}
ZhanGuoBookPageModule[103] = {
    "index": "战国策",
    "name": "秦五·秦王与中期争论",
    "content": [
        "　　秦王与中期争论，不胜。秦王大怒，中期徐行而去。或为中期说秦王曰：“悍人也。中期适遇明君故也，向者遇桀、纣，必杀之矣。”秦王因不罪。",
    ],
}
ZhanGuoBookPageModule[104] = {
    "index": "战国策",
    "name": "秦五·献则谓公孙消",
    "content": [
        "　　献则渭公孙消曰：“公，大臣之尊者也，数伐有功。所以不为相者，太后不善公也。辛戎者，太后之所亲也。今亡于楚，在东周。公何不以秦、楚之重，资而相之于周乎？楚必便之矣。是辛戎有秦、楚之重，太后必悦公，公相必矣。”",
    ],
}
ZhanGuoBookPageModule[105] = {
    "index": "战国策",
    "name": "秦五·楼啎约秦魏",
    "content": [
        "　　楼啎约秦、魏，魏太子为质，纷疆欲败之。谓太后曰：“国与还者也，败秦而利魏，魏必负之。负秦之日，太子为粪矣。”太后坐王而泣。王因疑于太子，令之留于酸枣。楼子患之。昭衍为周之梁，楼子告之。昭衍见梁王，梁王曰：“何闻?”曰：“闻秦且伐魏。”王曰：“为期与我约矣。”曰：“秦疑于王之约，以太子留酸枣而不之秦。秦王之计曰：‘魏不与我约，必攻我；我与其处而待之见攻，不如先伐之。’以秦强折节而下与国，臣恐其害于东周。”　",
    ],
}
ZhanGuoBookPageModule[106] = {
    "index": "战国策",
    "name": "秦五·濮阳人吕不韦贾于邯郸",
    "content": [
        "　　濮阳人吕不韦贾于邯郸，见秦质子异人，归而谓父曰：“耕田之利几倍?”曰：“十倍。”“珠玉之赢几倍?”曰：“百倍。”“立国家之主赢几倍?”曰：“无数。”曰：“今力田疾作，不得暖衣余食；今建国立君，泽可以遗世。愿往事之。”",
        "　　秦之异人质于赵，处于（户卯）城。故往说之口：“子傒有承国之业，又有母在中。今子无母于中，外托于不可知之国，一日倍约，自为粪土。今子听吾计事，求归，可以有秦国。吾为子使秦，必来请子。”",
        "　　乃说秦王后弟阳泉君曰：“君之罪至死，君知之乎?君之门下无不居高尊位，太子门下无贵者。君之府藏珍珠宝玉，君之骏马盈外厩，美女充后庭。王之春秋高，一日山陵崩，太子用事，君危于累卵，而不寿于朝生。说有可以一切而使君富贵千万岁，其宁于太山四维，必无危亡之患矣。”阳泉君避席，请闻其说。不韦曰：“王年高矣，王后无子，子傒有承国之业，士仓又辅之。王一日山陵崩，子傒立，士仓用事，王后之门，必生蓬蒿。子异人贤材也，弃在于赵，无母于内，引领西望，而愿一得归。王后诚请而立之，是子异人无国而有国，王后无子而有子也。”阳泉君曰：“然。”入说王后，王后乃请赵而归之。",
        "　　赵未之遣，不韦说赵曰：“子异人，秦之宠子也，无母于中，王后欲取而子之。使秦而欲屠赵，不顾一子而留计，是抱空质也。若使子异人归而得立，赵厚送遣之，是不敢倍德畔施，是自为德讲。秦王老矣，一日晏驾，虽有子异人，不足以结秦。”赵乃遣之。",
        "　　异人至，不韦使楚服而见。王后悦其状，高其知，曰：“吾楚人也。”而自子之，乃变其名曰楚，王使子诵，子曰：“少弃捐在外，尝无师傅所教学，不习于诵。”王罢之，乃留止。间曰：“陛下尝轫车于赵矣，赵之豪桀，得知名者不少。今大王反国，皆西面而望。大王无一公之使以存之，臣恐其皆有怨心。使边境早闭晚开。”王以为然，奇其计。王后劝立之。王乃召相，令之曰：“寡人子莫若楚。”立以为太子。",
        "　　子楚立，以不韦为相，号曰文信侯，食蓝田十二县。王后为华阳太后，诸侯皆致秦邑。",
    ],
}
ZhanGuoBookPageModule[107] = {
    "index": "战国策",
    "name": "秦五·文信侯欲攻赵以广河间",
    "content": [
        "　　文信侯欲攻赵以广河间，使刚成君蔡泽事燕三年，而燕太子质于秦。文信侯因请张唐相燕，欲与燕共伐赵，以广河间之地。张唐辞曰：“燕者必径于赵，赵人得唐者，受百里之地。”文信侯去而不快。少庶子甘罗曰：“君侯何不快甚也?”文信侯曰：“吾令刚成君蔡泽事燕三年，而燕太子已入质矣。今吾自请张卿相燕，而不肯行。”甘罗曰：“臣行之。”文信侯叱去曰：“我自行之而不肯，汝安能行之也?”甘罗曰：“夫项櫜生七岁而为孔子师，今臣生十二岁于兹矣，君其试臣，奚以遽言叱也?”",
        "　　甘罗见张唐曰：“卿之功，孰与武安君?”唐曰：“武安君战胜攻取，不知其数；攻城堕邑，不知其数。臣之功不如武安君也。”甘罗曰：“卿明知功之不如武安君欤?”曰：“知之。”“应侯之用秦也，孰与文信侯专?”曰：“应侯不如文信侯专。”曰：“卿明知为不如文信侯专欤?”曰：“知之。”甘罗曰：“应侯欲伐赵，武安君难之，去咸阳七里，绞而杀之。今文信侯自请卿相燕，而卿不肯行，臣不知卿所死之处矣!”唐曰：“请因孺子而行!”令库具车，厩具马，府具币，行有日矣。甘罗谓文信侯曰：“借臣车五乘，请为张唐先报赵。”",
        "　　见赵王，赵王郊迎。谓赵王曰：“闻燕太子丹之入秦与?”曰：“闻之。”“闻张唐之相燕与?”曰：“闻之。”“燕太子入秦者，燕不欺秦也。张唐相燕者，秦不欺燕也。秦、燕不相欺，则伐赵，危矣。燕、秦所以不相欺者，无异故，欲攻赵而广河间也。今王资臣五城以广河间，请归燕太子，与强赵攻弱燕。”赵王立割五城以广河间，归燕太子。赵攻燕，得上谷三十六县，与秦什一。",
    ],
}
ZhanGuoBookPageModule[108] = {
    "index": "战国策",
    "name": "秦五·文信侯出走",
    "content": [
        "　　文信侯出走，与司空马之赵，赵以为守相。秦下甲而攻赵。司马空说赵王曰：“文信侯相秦，臣事之，为尚书，习秦事。今大王使守小官，习赵事。请为大王设秦、赵之战，而亲观其孰胜。赵孰与秦大?”曰：“不如。”“民孰与之众?”曰：“不如。”“金钱粟孰与之富?”曰：“弗如。”“国孰与之治?”曰：“不如。”“相孰与之贤?”曰：“不如。”“将孰与之武?”曰：“不如。”“律令孰与之明?”曰：“不如。”司空马曰：“然则大王之国，百举而无及秦者，大王之国亡。”赵王曰：“卿不远赵，而悉教以国事，愿于因计。”司空马曰：“大王裂赵之半以赂秦，秦不接刃而得赵之半，秦必悦。内恶赵之守，外恐诸侯之救，秦必受之。秦受地而卻兵，赵守半国以自存。秦衔赂以自强，山东必恐；亡赵自危，诸侯必惧。惧而相救，则从事可成。臣请大王约从。从事成，则是大王名亡赵之半，实得山东以敌秦，秦不足亡。”赵王曰：“前日秦下甲攻赵，赵赂以河间十二县，地削兵弱，卒不免秦患。今又割赵之半以强秦，力不能自存，因以亡矣。愿卿之更计。”司空马曰：“臣少为秦刀笔，以官长而守小官，未尝为兵首，请为大王悉赵兵以遇。”赵王不能将。司空马曰：“臣效愚计，大王不用，是臣无以事大王，愿自请。”",
        "　　司空马去赵，渡平原。平原津令郭遗劳而问：“秦兵下赵，上客从赵来，赵事何如?”司空马言其为赵王计而弗用，赵必亡。平原令曰：“以上客料之，赵何时亡?”司空马曰：“赵将武安君，期年而亡；若杀武安君，不过半年。赵王之臣有韩仓者，以曲合于赵王，其交甚亲，其为人疾贤妒功臣。今国危亡，王必用其言，武安君必死。”",
        "　　韩仓果恶之，王使人代。武安君至，使韩仓数之曰：“将军战胜，王觞将军。将军为寿于前而捍匕首，当死。”武安君曰：“繓病钩，身大臂短，不能及地，起居不敬，恐惧死罪于前，故使工人为木材以接手。上若不信，繓请以出示。”出之袖中，以示韩仓，状如振捆，缠之以布。“愿公入明之。”韩仓曰：“受命于王，赐将军死，不赦。臣不敢言。”武安君北面再拜赐死，缩剑将自诛，乃曰：“人臣不得自杀宫中。”遇司空马门，趣甚疾，出諔门也。右举剑将近自诛，臂短不能及，衔剑征之于柱以自刺。武安君死五月，赵亡。",
        "　　平原令见诸公，必为言之曰：“磋嗞乎，司空马!”又以为司空马逐于秦，非不知也；去赵，非不肖也。赵去司空马而国亡。国亡者，非无贤人，不能用也。",
    ],
}
ZhanGuoBookPageModule[109] = {
    "index": "战国策",
    "name": "秦五·四国为一将以攻秦",
    "content": [
        "　　四国为一，将以攻秦。秦王召群臣宾客六十人而问焉，曰：“四国为一，将以图秦，寡人屈于内，而百姓靡于外，为之奈何?”群臣莫对。姚贾对曰：“贾愿出使四国，必绝其谋，而安其兵。”乃资车百乘，金千斤，衣以其衣，冠舞以其剑。姚贾辞行，绝其谋，止其兵，与之为交以报秦。秦王大悦，贾封千户，以为上卿。",
        "　　韩非知之，曰：“贾以珍珠重宝，南使荆、吴，北使燕、代之间三年，四国之交未必合也，而珍珠重宝尽于内。是贾以王之权，国之宝，外自交于诸侯，愿王察之。且梁监门子，尝盗于梁，臣于赵而逐。取世监门子，梁之大盗，赵之逐臣，与同知社稷之计，非所以厉群臣也。”",
        "　　王召姚贾而问曰：“吾闻子以寡人财交于诸侯，有诸?”对曰：“有。”王曰：“有何面目复见寡人?”对曰：“曾参孝其亲，天下愿以为子；子胥忠于君，天下愿以为臣；贞女工巧，天下愿以为妃。今贾忠王而王不知也。贾不归四国，尚焉之?使贾不忠于君，四国之王尚焉用贾之身?梁听谗而诛其良将，纣闻谗而杀其忠臣，至身死国亡。今王听谗，则无忠臣矣。”",
        "　　王曰：“子监门子，梁之大盗，赵之逐臣。”姚贾曰：“太公望，齐之逐夫，朝歌之废屠，子良之逐臣，棘津之雠不庸，文王用之而王。管仲，其鄙人之贾人也，南阳之弊幽，鲁之免囚，桓公用之而伯。百里奚，虞之乞人，传卖以五羊之皮，穆公相之而朝西戎。文公用中山盗，而胜于城濮。此四士者，皆有垢丑，大诽天下，明主用之，知其可与立功。使若卞随、务光、申屠狄，人主岂得其用哉!故明主不取其汙，不听其非，察其为己用。故可以存社稷者，虽有外诽者不听；虽有高世之名，无咫尺之功者不赏。是以群臣莫敢以虚愿望于上。”",
        "　　秦王曰：“然。”乃可复使姚贾而诛韩非。",
    ],
}

ZhanGuoBookPageModule[110] = {
    "index": "战国策",
    "name": "齐一·楚威王战胜于徐州",
    "content": ["　　楚威王战胜于徐州，欲逐婴子于齐。婴子恐，张丑谓楚王曰：“王战胜于徐州也，盼子不用也。盼子有功于国，百姓为之用。婴子不善，而用申缚。申缚者，大臣与百姓弗为用，故王胜之也。今婴子逐，盼子必用，复整其士卒以与王遇，必不便于王也。”楚王因弗逐。"],
}

ZhanGuoBookPageModule[111] = {
    "index": "战国策",
    "name": "齐一·齐将封田婴于薛",
    "content": [
        "　　齐将封田婴于薛。楚王闻之，大怒，将伐齐。齐王有辍志。公孙閈曰：“封之成与不，非在齐也，又将在楚。閈说楚王，令其欲封公也又甚于齐。”婴子曰：“愿委之于子。”",
        "　　公孙閈为谓楚王曰：“鲁、宋事楚而齐不事者，齐大而鲁、宋小。王独利鲁、宋之小，不恶齐大，何也?夫齐削地而封田婴，是其所以弱也。愿勿止。”楚王曰：“善。”因不止。",
    ],
}
ZhanGuoBookPageModule[112] = {
    "index": "战国策",
    "name": "齐一·靖郭君将城薛",
    "content": ["　　靖郭君将城薛，客多以谏。靖郭君谓谒者，无为客通。齐人有请者曰：“臣请三言而已矣!益一言，臣请烹。”靖郭君因见之。客趋而进曰：“海大鱼。”因反走。君曰：“客有于此。”客曰：“鄙臣不敢以死为戏。”君曰：“亡，更言之。”对曰：“君不闻大鱼乎?网不能止，钩不能牵，荡而失水，则蝼蚁得意焉。今夫齐，亦君之水也，君长有齐阴，奚以薛为?夫齐，虽隆薛之城到于天，犹之无益也。”君曰：“善。”乃辍城薛。"],
}
ZhanGuoBookPageModule[113] = {
    "index": "战国策",
    "name": "齐一·靖郭君谓齐王",
    "content": ["　　靖郭君谓齐王曰：“五官之计，不可不日听也而数览。”王曰：“说五而厌之。”今与靖郭君。"],
}
ZhanGuoBookPageModule[114] = {
    "index": "战国策",
    "name": "齐一·靖郭君善齐貌辨",
    "content": [
        "　　靖郭君善齐貌辨。齐貌辨之为人也多疵，门人弗说。士尉以证靖郭君，靖郭君不听，士尉辞而去。孟尝君又窃以谏，靖郭君大怒曰：“刬而类，破吾家。苟可慊齐貌辨者，吾无辞为之。”于是舍之上舍，令长子御，旦暮进食。",
        "　　数年，威王薨，宣王立。靖郭君之交，大不善于宣王，辞而之薛，与齐貌辨俱留。无几何，齐貌辨辞而行，请见宣王。靖郭君曰：“王之不说婴甚，公往必得死焉。”齐貌辨曰：“固不求生也，请必行。”靖郭君不能止。",
        "　　齐貌辨行至齐，宣王闻之，藏怒以待之。齐貌辨见宣王，王曰：“子，靖郭君之所听爱夫。”齐貌辨曰：“爱则有之，听则无有。王之方为太子之时，辨谓靖郭君曰：‘太子相不仁，过颐豕视，若是者信反。不若废太子，更立卫姬婴儿郊师。’靖郭君泣而曰：‘不可，吾不忍也。’若听辨而为之，必无今日之患也。此为一。至于薛，昭阳请以数倍之地易薛，辨又曰：‘必听之。’靖郭君曰：‘受薛于先王，虽恶于后王，吾独谓先王何乎!且先王之庙在薛，吾岂可以先王之庙与楚乎!’又不肯听辨。此为二。”宣王大息，动于颜色，曰：“靖郭君之于寡人，一至此乎！寡人少，殊不知此。客肯为寡人来靖郭君乎?”齐貌辨对曰：“敬诺。”",
        "　　靖郭君衣威王之衣，冠舞其剑，宣王自迎靖郭君于郊，望之而泣。靖郭君至，因请相之。靖郭君辞，不得已而受。七日，谢病强辞。靖郭君辞不得，三日而听。",
        "　　当是时，靖郭君可谓能自知人矣!能自知人，故人非之不为沮。此齐貌辨之所以外生乐患趣难者也。",
    ],
}
ZhanGuoBookPageModule[115] = {
    "index": "战国策",
    "name": "齐一·邯郸之难",
    "content": ["　　邯郸之难，赵求救于齐。田侯召大臣而谋曰：“救赵孰与勿救?”邹子曰：“不如勿救。”段干纶曰：“弗救，则我不利。”田侯曰：“何哉?”“夫魏氏兼邯郸，其于齐何利哉？”田侯曰：“善。”乃起兵，曰：“军于邯郸之郊。”段干纶曰：“臣之求利且不利者，非此也。夫救邯郸，军于其郊，是赵不拔而魏全也。故不如南攻襄陵以弊魏，邯郸拔而承魏之弊，是赵破而魏弱也。”田侯曰：“善。”乃起兵南攻襄陵。七月，邯郸拔。齐因承魏之弊，大破之桂陵。"],
}
ZhanGuoBookPageModule[116] = {
    "index": "战国策",
    "name": "齐一·南梁之难",
    "content": ["　　南梁之难，韩氏请救于齐。田侯召大臣而谋曰：“早救之，孰与晚救之便?”张丐对曰：“晚救之，韩且折而入于魏，不如早救之。”田臣思曰 ：“不可。夫韩、魏之兵未弊，而我救之，我代韩而受魏之兵，顾反听命于韩也。且夫魏有破韩之志，韩见且亡，必东诉于齐。我因阴结韩之亲，而晚承魏之弊，则国可重，利可得，名可尊矣。”田侯曰：“善。”乃阴告韩使者而遣之。韩自以专有齐国，五战五不胜，东诉于齐，齐因起兵击魏，大破之马陵。魏破韩弱，韩、魏之君因田婴北面而朝田侯。"],
}

ZhanGuoBookPageModule[117] = {
    "index": "战国策",
    "name": "齐一·成侯邹忌为齐相",
    "content": ["　　成侯邹忌为齐相，田忌为将，不相说。公孙閈谓邹忌曰：“公何不为王谋伐魏?胜，则是君之谋也，君可以有功；战不胜，田忌不进，战而不死，曲挠而诛。”邹忌以为然，乃说王而使田忌伐魏。田忌三战三胜，邹忌以告公孙閈，公孙閈乃使人操十金而往卜于市，曰：“我田忌之人也，吾三战而三胜，声威天下，欲为大事，亦吉否?”卜者出，因令人捕为人卜者，亦验其辞于王前。田忌遂走。"],
}
ZhanGuoBookPageModule[118] = {
    "index": "战国策",
    "name": "齐一·田忌为齐将",
    "content": ["　　田忌为齐将，系梁太子申，禽庞涓。孙子谓田忌曰：“将军可以为大事乎?”田忌曰：“奈何?”孙子曰：“将军无解兵而入齐。使彼罢弊于先弱守于主。主者，循轶之途也，辖击摩车而相过。使彼罢弊先弱守于主，必一而当十，十而当百，百而当千。然后背太山，左济，右天唐，军重踵高宛，使轻车锐骑冲雍门。若是，则齐君可正，而成侯可走。不然，则将军不得入于齐矣。”田忌不听，果不入齐。"],
}
ZhanGuoBookPageModule[119] = {
    "index": "战国策",
    "name": "齐一·田忌亡齐而之楚",
    "content": [
        "　　田忌亡齐而之楚，邹忌代之相。齐恐田忌欲以楚权复于齐，杜赫曰：“臣请为留楚。”",
        "　　谓楚王曰：“邹忌所以不善楚者，恐田忌之以楚权复于齐也。王不如封田忌于江南，以示田忌之不返齐也，邹忌以齐厚事楚。田忌亡人也，而得封，必德王。若复于齐，必以齐事楚。此用二忌之道也。”楚果封之于江南。",
    ],
}
ZhanGuoBookPageModule[120] = {
    "index": "战国策",
    "name": "齐一·邹忌事宣王",
    "content": ["　　邹忌事宣王，仕人众，宣王不悦。晏首贵而仕人寡，王悦之。邹忌谓宣王曰：“忌闻以为有—子之孝，不如有五子之孝。今首之所进仕者，以几何人?”宣王因以晏首壅塞之。"],
}
ZhanGuoBookPageModule[121] = {
    "index": "战国策",
    "name": "齐三·孟尝君讌坐",
    "content": [
        "　　邹忌修八尺有余，身体昳丽。朝服衣冠窥镜，谓其妻曰：“我孰与城北徐公美?”其妻曰：“君美甚，徐公何能及公也！”城北徐公，齐国之美丽者也。忌不自信，而复问其妾曰：“吾孰与徐公美?”妾曰：“徐公何能及君也！”旦日，客从外来，与坐谈，问之客曰：“吾、徐公孰美?”客曰：“徐公不若君之美也！”",
        "　　明日，徐公来。孰视之，自以为不如；窥镜而自视，又弗如远甚。暮，寝而思之曰：“吾妻之美我者，私我也；妾之美我者，畏我也；客之美我者，欲有求于我也。”",
        "　　于是入朝见威王曰：“臣诚知不如徐公美，臣之妻私臣，臣之妾畏臣，臣之客欲有求于臣，皆以美于徐公。今齐地方千里，百二十城，宫妇左右，莫不私王；朝廷之臣，莫不畏王；四境之内，莫不有求于王。由此观之，王之蔽甚矣！”王曰：“善。”乃下令：“群臣吏民，能面刺寡人之过者，受上赏；上书谏寡人者，受中赏；能谤议于市朝，闻寡人之耳者，受下赏。”",
        "　　令初下，群臣进谏，门庭若市。数月之后，时时而间进。期年之后，虽欲言，无可进者。燕、赵、韩、魏闻之，皆朝于齐。此所谓战胜于朝廷。",
    ],
}
ZhanGuoBookPageModule[122] = {
    "index": "战国策",
    "name": "齐一·秦假道韩魏以攻齐",
    "content": [
        "　　秦假道韩、魏以攻齐，齐威王使章子将而应之。与秦交合而舍，使者数相往来，章子为变其徽章，以杂秦军。候者言章子以齐入秦，威王不应。顷之间，候者复言章子以齐兵降秦，威王不应。而此者三。有司请曰：“言章子之败者，异人而同辞。王何不发将而击之?”王曰：“此不叛寡人明矣，曷为击之？”",
        "　　倾间，言齐兵大胜，秦军大败，于是秦王拜西藩之臣而谢于齐。左右曰：“何以知之?”曰：“章子之母启得罪其父，其父杀之而埋马栈之下。吾使者章子将也，勉之曰：‘夫子之强，全兵而还，必更葬将军之母。’对曰：‘臣非不能更葬先妾也。臣之母启得罪臣之父。臣之父未教而死。夫不得父之教而更葬母，是欺死父也。故不敢。’夫为人子而不欺死父，岂为人臣欺生君哉?”",
    ],
}
ZhanGuoBookPageModule[123] = {
    "index": "战国策",
    "name": "齐一·楚将伐齐",
    "content": [
        "　　楚将伐齐，鲁亲之，齐王患之。张丐曰：“臣请令鲁中立。”乃为齐见鲁君。鲁君曰：",
        "　　“齐王惧乎?”。曰：“非臣所知也，臣来吊足下。”鲁君曰：“何吊?”曰：“君之谋过矣。君不与胜者而与不胜者，何故也?”鲁君曰：“子以齐、楚为孰胜哉?”对曰：“鬼且不知也。”“然则予何以吊寡人?”曰：“齐、楚之权敌也，不用有鲁与无鲁。足下岂如令众而合二国之后哉!楚大胜齐，其良士选卒必殪，其余兵足以待天下；齐为胜，其良士选卒亦殪。而君以鲁众合战胜后，此其为德也亦大矣，其见恩德亦其大也。”鲁君以为然，身退师。",
    ],
}
ZhanGuoBookPageModule[124] = {
    "index": "战国策",
    "name": "齐一·秦伐魏",
    "content": [
        "　　秦伐魏，陈轸合三晋而东谓齐王曰：“古之王者之伐也。欲以正天下而立功名，以为后世也。今齐、楚、燕、赵、韩、梁六国之递甚也，不足以立功名，适足以强秦而自弱也，非山东之上计也。能危山东者，强秦也。不忧强秦，而递相罢弱，而两归其国于秦，此臣之所以为山东之患。天下为秦相割，秦曾不出力；天下为秦相烹，秦曾不出薪。何秦之智而山东之愚耶?愿大王之察也。",
        "　　“古之五帝、三王、五伯之伐也，伐不道者。今秦之伐天下不然，必欲反之，主必死辱，民必死虏。今韩、梁之目未尝干，而齐民独不也，非齐亲而韩、梁疏也，齐远秦而韩、梁近。今齐将近矣!今秦欲攻梁绛、安邑，秦得绛、安邑以东下河，必表里河而东攻齐，举齐属之海，南面而孤楚、韩、梁，北向而孤燕、赵，齐无所出其计矣，愿王熟虑之! 今三晋已合矣，复为兄弟约，而出锐师以成梁绛、安邑，此万世之计也。齐非急以锐师合三晋，必有后忧。三晋合，秦必不敢攻梁，必南攻楚。楚、秦构难，三晋怒齐不与己也，必东攻齐。此臣之所谓齐必有大忧，不如急以兵合于三晋。”",
        "　　齐王敬诺，果以兵合于三晋。",
    ],
}
ZhanGuoBookPageModule[125] = {
    "index": "战国策",
    "name": "齐一·苏秦为赵合从说齐宣王",
    "content": [
        "　　苏秦为赵合从，说齐宣王曰：“齐南有太山，东有琅邪，西有清河，北有渤海，此所谓四塞之国也。齐地方二千里，带甲数十万，粟如丘山。齐车之良，五家之兵，疾如锥矢，战如雷电，解如风雨，即有军役，未尝倍太山、绝清河、涉渤海也。临淄之中七万户，臣窃度之，下户三男子，三七二十一万，不待发于远县，而临淄之卒，固以二十一万矣。临淄甚富而实，其民无不吹竽、鼓瑟、击筑、弹琴、斗鸡、走犬、六博、（足翕）踘者；临淄之途，车辇击，人肩摩，连衽成帷，举袂成幕，挥汗成雨；家敦而富，志高而扬。夫以大王之贤与齐之强，天下不能当。今乃西面事秦，窃为大王羞之。",
        "　　“且夫韩、魏之所以畏秦者，以与秦接界也。兵出而相当，不至十日，而战胜存亡之机决矣。韩、魏战而胜秦，则兵半折，四境不守；战而不胜，以亡随其后。是故韩、魏之所以重与秦战而轻为之臣也。今秦攻齐则不然，倍韩、魏之地，至闱阳晋之道，径亢父之险，车不得方轨，马不得并行，百人守险，千人不能过也。秦虽欲深入，则狼顾，恐韩、魏之议其后也。是古恫疑虚猲，高跃而不敢进，则秦不能害齐，亦已明矣。夫不深料秦之不奈我何也，而欲西面事秦，是群臣之计过也。今无臣事秦之名，而有强国之实，臣固愿大王之少留计。”",
        "　　齐王曰：“寡人不敏，今主君以赵王之教诏之，敬奉社稷以从。”",
    ],
}
ZhanGuoBookPageModule[126] = {
    "index": "战国策",
    "name": "齐一·张仪为秦连横齐王",
    "content": [
        "　　张仪为秦连横齐王曰：“天下强国无过齐者，大臣父兄殷众富乐，无过齐者。然而为大王计者，皆为一时说而不顾万世之利。从人说大王者，必谓齐西有强赵，南有韩、魏，负海之国也，地广人众，兵强士勇，虽有百秦，将无奈我何!大王览其说，而不察其至实。",
        "　　“夫从人朋党比周，莫不以从为可。臣闻之，齐与鲁三战而鲁三胜，国已危，亡随其后，虽有胜名而有亡之实，是何故也?齐大而鲁小。今赵之与秦也，犹齐之于鲁也。秦、赵战于河漳之上，再战而再胜秦；战於番吾之下，再战而再胜秦。四战之后，赵亡卒数十万，邯郸仅存。虽有胜秦之名，而国破矣!是何故也?秦强而赵弱也。今秦、楚嫁子取妇，为昆弟之国；韩献宜阳，魏效河外，赵入朝黾池，割河间以事秦。大王不事秦，秦驱韩、魏攻齐之南地，悉赵涉河关，指搏关，临淄、即墨非王之有也。国一日被攻，虽欲事秦，不可得也。是故愿大王熟计之。”齐王曰：“齐僻陋隐居，托于东海之上，未尝闻社稷之长利。今大客幸而教之，请奉社稷以事秦。”献鱼盐之地三百于秦也。",
    ],
}
ZhanGuoBookPageModule[127] = {
    "index": "战国策",
    "name": "齐二·韩齐为与国",
    "content": [
        "　　韩、齐为与国。张仪以秦、魏伐韩。齐王曰：“韩，吾与国也。秦伐之，吾将救之。”田臣思曰：“王之谋过矣，不如听之。子哙与子之国，百姓不戴，诸侯弗与。秦伐韩，楚、赵必救之，是天下以燕赐我也。”王曰：“善。”乃许韩使者而遣之。",
        "　　韩自以得交于齐，遂与秦战。楚、赵果速起兵而救韩，齐因起兵攻燕，三十日而举燕国。",
    ],
}
ZhanGuoBookPageModule[128] = {
    "index": "战国策",
    "name": "齐二·张仪事秦惠王",
    "content": [
        "　　张仪事秦惠王。惠王死，武王立。左右恶张仪，曰：“仪事先王不忠。”言未已，齐让又至。",
        "　　张仪闻之，谓武王曰：“仪有愚计，愿效之王。”王曰：“奈何?”曰：“为社稷计者，东方有大变，然后王可以多割地。今齐王甚憎张仪，仪之所在，必举兵而伐之。故仪愿乞不肖身而之梁，齐必举兵而伐之。齐、梁之兵连于城下，不能相去，王以其间伐韩，入三川，出兵函谷而无伐，以临周，祭器必出，挟天子，案图籍，此王业也。”王曰：“善。”乃具革车三十乘，纳之梁。",
        "　　齐果举兵伐之。梁王大怒。张仪曰：“王勿患，请令罢齐兵。”乃使其舍人冯喜之楚，藉使之齐。齐、楚之事已毕，因谓齐王：“王甚憎张仪，虽然，厚矣王之托仪于秦王也。”齐王曰：“寡人甚憎张仪，仪之所在，必举兵伐之，何以托仪也?”对曰：“是乃王之托仪也。仪之出秦，因与秦王约曰：‘为王计者，东方有大变，然后王可以多割地。齐王甚憎仪，仪之所在，必举兵伐之。故仪愿乞不肖身而之梁，齐必举兵伐梁。梁、齐之兵连于城下不能去，王以其间伐韩，入三川，出兵函谷而无伐，以临周，祭器必出，挟天子，案图籍，是王业也。’秦王以为然，与革车三十乘而纳仪于梁。而果伐之，是王内自罢而伐与国，广邻敌以 自临，而信仪于秦王也。此臣之所谓托仪也。”王曰：“善。”乃止。",
    ],
}
ZhanGuoBookPageModule[129] = {
    "index": "战国策",
    "name": "齐二·犀首以梁为齐战于承匡而不胜",
    "content": ["　　犀首以梁为齐战于承匡而不胜。张仪谓梁王不用臣言以危国。梁王因相仪，仪以秦、梁之齐合横亲。犀首欲败，谓卫君曰：“衍非有怨于仪也，值所以为国者不同耳。君必解衍。”卫君为告仪，仪许诺，因与之参坐于卫君之前。犀首跪行，为仪千秋之祝。明日张子行，犀首送之至于齐疆。齐王闻之，怒于仪，曰：“衍也吾雠，而仪与之俱，是必与衍鬻吾国矣。”遂不听。"],
}
ZhanGuoBookPageModule[130] = {
    "index": "战国策",
    "name": "齐二·昭阳为楚伐魏",
    "content": ["　　昭阳为楚伐魏，覆军杀将得八城，移兵而攻齐。陈轸为齐王使，见昭阳，再拜贺战胜，起而问：“楚之法，覆军杀将，其官爵何也?”昭阳曰：“官为上柱国，爵为上执珪。”陈轸曰：“异贵于此者何也?”曰：“唯令尹耳。”陈轸曰：“令尹贵矣!王非置两令尹也，臣窃为公譬可也。楚有祠者，赐其舍人卮酒。舍人相谓曰：‘数人饮之不足，一人饮之有余。请画地为蛇，先成者饮酒。’一人蛇先成，引酒且饮之，乃左手持卮，右手画蛇，曰：‘吾能为之足。’未成，一人之蛇成，夺其卮曰：‘蛇固无足，子安能为之足。’遂饮其酒。为蛇足者，终亡其酒。今君相楚而攻魏，破军杀将得八城，不弱兵，欲攻齐，齐畏公甚，公以是为名居足矣，官之上非可重也。战无不胜而不知止者，身且死，爵且后归，犹为蛇足也。”昭阳以为然，解军而去。"],
}
ZhanGuoBookPageModule[131] = {
    "index": "齐二·秦攻赵",
    "name": "西周·秦令樗里疾以车百乘入周",
    "content": ["　　秦攻赵。赵令楼缓以五城求讲于秦，而与之伐齐。齐主恐，因使人以十城求讲于秦。楼子恐，因以上党二十四县许秦王。赵足之齐，谓齐王曰：“王欲秦、赵之解乎?不如从合于赵，赵必倍秦。倍秦则齐无患矣。”"],
}
ZhanGuoBookPageModule[132] = {
    "index": "战国策",
    "name": "齐二·权之难齐燕战",
    "content": ["　　权之难，齐、燕战。秦使魏冉之赵，出兵助燕击齐。薛公使魏处之赵，谓李向曰：“君助燕击齐，齐必急。急必以地和于燕，而身与赵战矣。然则是君自为燕东兵，为燕取地也。故为君计者，不如按兵匆出。齐必缓，缓必复与燕战。战而胜，兵罢弊，赵可取唐、曲逆；战而不胜，命悬于赵。然则吾中立而割穷齐与疲燕也，两国之权，归于君矣。”"],
}

ZhanGuoBookPageModule[133] = {
    "index": "战国策",
    "name": "齐二·秦攻赵长平",
    "content": [
        "　　秦攻赵长平，齐、楚救之。秦计曰：“齐、楚救赵，亲，则将退兵；不亲，则且遂攻之。”",
        "　　赵无以食，请粟于齐，而齐不听。苏秦谓齐王曰：“不如听之以却秦兵，不听则秦兵不却，是秦之计中，而齐、燕之计过矣。且赵之于燕、齐，隐蔽也，齿之有唇也，唇亡则齿寒。今日亡赵，则明日及齐、楚矣。且夫救赵之务，宜若奉漏壅，沃焦釜。夫救赵，高义也；却秦兵，显名也。义救亡赵，威却强秦兵，不务为此，而务爱粟，则为国计者过矣。”",
    ],
}
ZhanGuoBookPageModule[134] = {
    "index": "战国策",
    "name": "齐二·或谓齐王",
    "content": ["　　或谓齐王曰：“周、韩西有强秦，东有赵、魏。秦伐周、韩之西，赵、魏不伐，周、韩为割，韩却周害也。及韩却周割之，赵、魏亦不免与秦为患矣。今齐、秦伐赵、魏，则亦不果于赵、魏之应秦而伐周、韩。令齐入于秦而伐赵、魏，赵、魏亡之后，秦东面而伐齐，齐安得救天下乎!”"],
}
ZhanGuoBookPageModule[135] = {
    "index": "战国策",
    "name": "齐三·楚王死",
    "content": [
        "　　楚王死，太子在齐质。苏秦谓薛公曰：“君何不留楚太子，以市其下东国。”薛公曰：“不可。我留太子，郢中立王，然则是我抱空质而行不义于于下也。”苏秦曰：“不然。郢中立王，君因谓其新王曰：‘与我下东国，吾为王杀太子。不然，吾将与三国共立之。’然则下东国必可得也。”",
        "　　苏秦之事，可以请行；可以令楚王亟入下东国；可以益割于楚；可以忠太子而使楚益入地；可以为楚王走太子；可以忠太子使之亟去；可以恶苏秦于薛公；可以为苏秦请封于楚；可以使说薛公以善苏子；可以使苏子自解于薛公。",
        "　　苏秦谓薛公曰：“臣闻谋泄者事无功，计不决者名不成。今君留太子者，以市下东国也。非亟得下东国者，则楚之计变，变则是君抱空质而负名于天下也。”薛公曰：“善。为之奈何?”对曰：“臣请为君之楚，使亟入下东国之地。楚得成，则君无败矣。”薛公曰：“善。”因遣之。",
        "　　谓楚王曰：“齐欲奉太子而立之。臣观薛公之留太子者，以市下东国也。今王不亟入下东国，则太子且倍王之割而使齐奉己。”楚王曰：“谨受命。”因献下东国。故曰可以使楚亟入地也。",
        "　　谓薛公曰：“楚之势可多割也。”薛公曰：“奈何?”“请告太子其故，使太子谒之君，以忠太子，使楚王闻之，可以益入地。”故曰可以益割于楚。",
        "　　谓太子曰：“齐奉太子而立之，楚王请割地以留太子，齐少其地。太子何不倍楚之割地而资齐，齐必奉太子。”太子曰：“善。”倍楚之割而延齐。楚王闻之恐，益割地而献之，尚恐事不成。故曰可以使楚益入地也。",
        "　　谓楚王曰：“齐之所以敢多割地者，挟太子也。今已得地面求不止者，以太子权王也。故臣能去太子。太子去，齐无辞，必不倍于王也。王因驰强齐而为交，齐辞，必听王。然则是王去仇而得齐交也。”楚王大悦，曰：“请以国因。”故曰可以为楚王使太子亟去也。",
        "　　谓太子曰：“夫剬楚者王也，以空名市者太子也，齐未必信太子之言也，而楚功见矣。楚交成，太子必危矣。太子其图之。”太子曰：“谨受命。”乃约车而暮去。故曰可以使太子急去也。",
        "　　苏秦使人请薛公曰：“夫劝留太子者苏秦也。苏秦非诚以为君也，且以便楚也。苏秦恐君之知之，故多割楚以灭迹也。今劝太子者又苏秦也，而君弗知，臣窃为君疑之。”薛公大怒于苏秦。故曰可使人恶苏秦于薛公也。",
        "　　又使人谓楚王曰：“夫使薛公留太子者苏秦也。奉王而代立楚太子者又苏秦也，割地固约者又苏秦也，忠王而走太子者又苏秦也。今人恶苏秦于薛公，以其为齐薄而为楚厚也。愿王之知之。”楚王曰：“谨受命。”因封苏秦为武贞君。故曰可以为苏秦请封于楚也。",
        "　　又使景鲤请薛公曰：“君之所以重于天下者，以能得天下之士而有齐权也。今苏秦天下之辩士也，世与少有。君因不善苏秦，则是围塞天下士而不利说途也。夫不善君者且奉苏秦，而于君之事殆矣。今苏秦善于楚王，而君不蚤亲，则是身与楚为仇也。故君不如因而亲之，贵而重之，是君有楚也。”薛公因善苏秦。故曰可以为苏秦说薛公以善苏秦。",
    ],
}
ZhanGuoBookPageModule[136] = {
    "index": "战国策",
    "name": "齐三·齐王夫人死",
    "content": ["　　齐王夫人死，有七孺子皆近。薛公欲知所欲立，乃献七珥，美其一，明日视美珥所在，劝王立为夫人。"],
}
ZhanGuoBookPageModule[137] = {
    "index": "战国策",
    "name": "齐三·孟尝君将入秦",
    "content": [
        "　　孟尝君将入秦，止者千数而弗听。苏秦欲止之，孟尝曰：“人事者，吾已尽知之矣；吾所未闻者，独鬼事耳。”苏秦曰：“臣之来也，固不敢言人事也，固且以鬼事见君。”",
        "　　孟尝君见之。谓孟尝君曰：“今者臣来，过于淄上，有土偶人与桃梗相与语。桃梗谓土偶人曰：‘子，西岸之土也，挺子以为人，至岁八月，降雨下，淄水至，则汝残矣。’土偶曰：‘不然。吾西岸之土也，土则复西岸耳。今子，东国之桃梗也，刻削子以为人，降雨下，淄水至，流子而去，则子漂漂者将何如耳。’今秦四塞之国，譬若虎口，而君入之，则臣不知君所出矣。”孟尝君乃止。",
    ],
}
ZhanGuoBookPageModule[138] = {
    "index": "战国策",
    "name": "齐三·孟尝君在薛",
    "content": [
        "　　孟尝君在薛，荆人攻之。淳于髡为齐使于荆，还反过薛。而孟尝令人体貌而亲郊迎之。谓淳于髡曰：“荆人攻薛，夫子弗忧，文无以复侍矣。”淳于髡曰：“敬闻命。”",
        "　　至于齐，毕报。王曰：“何见于荆?”对曰：“荆甚固，而薛亦不量其力。”王曰：“何谓也?”对曰：“薛不量其力，而为先王立清庙。荆固而攻之，清庙必危。故曰薛不量力，而荆亦甚固。”齐王和其颜色曰：“嘻!先君之庙在焉!”疾兴兵救之。",
        "　　颠蹶之请，望拜之谒，虽得则薄矣。善说者，陈其势，言其方，人之急也，若自在隘窘之中，岂用强力哉!",
    ],
}
ZhanGuoBookPageModule[139] = {
    "index": "战国策",
    "name": "齐三·孟尝君奉夏侯章",
    "content": ["　　孟尝君奉夏侯章以四马百人之食，遇之甚欢。夏侯章每言未尝不毁孟尝君也。或以告孟尝君，孟尝君曰：“文有以事夏侯公矣，勿言。”董之繁菁以问夏侯公，夏侯公曰：“孟尝君重非诸侯也，而奉我四马百人之食。我无分寸之功而得此，然吾毁之以为之也。君所以得为长者，以吾毁之者也。吾以身为孟尝君，岂得持言也。”"],
}
ZhanGuoBookPageModule[140] = {
    "index": "战国策",
    "name": "齐三·孟尝君讌坐",
    "content": [
        "　　孟尝君讌坐，谓三先生曰：“愿闻先生有以补之阙者。”一人曰：“訾天下之主，有侵君者，臣请以臣之血湔其衽。”田瞀曰：“车轶之所能至，请掩足下之短者，诵足下之长；千乘之君与万乘之相，其欲有君也，如使而弗及也。”胜（股目）曰：“臣愿以足下之府库财物，收天下之士，能为君决疑应卒，若魏文侯之有田子方、段干木也。此臣之所为君取矣。”",
    ],
}
ZhanGuoBookPageModule[141] = {
    "index": "战国策",
    "name": "齐三·孟尝君舍人有与君之夫人相爱者",
    "content": [
        "　　孟尝君舍人有与君之夫人相爱者。或以问孟尝君曰：“为君舍人而内与夫人相爱，亦甚不义矣，君其杀之。”君曰：“睹貌而相悦者，人之情也，其错之勿言也。”",
        "　　居期年，君召爱夫人者而谓之曰：“子与文游久矣，大官未可得，小官公又弗欲。卫君与文布衣交，请具车马皮币，愿君以此从卫君游。”于卫甚重。",
        "　　齐、卫之交恶，卫君甚欲约天下之兵以攻齐。是人谓卫君曰：“孟尝君不知臣不肖，以臣欺君。且臣闻齐、卫先君，刑马压羊，盟曰：‘齐、卫后世无相攻伐，有相攻伐者，令其命如此。’今君约天下之兵以攻齐，是足下倍先君盟约而欺孟尝君也。愿君勿以齐为心。君听臣则可；不听臣，若臣不肖也，臣辄以颈血湔足下衿。”卫君乃止。",
        "　　齐人闻之曰：“孟尝君可语善为事矣，转祸为功。”",
    ],
}
ZhanGuoBookPageModule[142] = {
    "index": "战国策",
    "name": "齐三·孟尝君有舍人而弗悦",
    "content": ["　　孟尝君有舍人而弗悦，欲逐之。鲁连谓孟尝君曰：“猿猕猴错木据水，则不若鱼鳖；历险乘危，则骐骥不如狐狸。曹沫之奋三尺之剑，一军不能当；使曹沫释其三尺之剑，而操铫鎒与农夫居垅亩之中，则不若农夫。故物舍其所长，之其所短，尧亦有所不及矣。今使人而不能，则谓之不肖；教人而不能，则谓之拙。拙则罢之，不肖则弃之，使人有弃逐，不相与处，而来害相报者，岂非世之立教首也哉!”孟尝君曰：“善!”乃弗逐。"],
}
ZhanGuoBookPageModule[143] = {
    "index": "战国策",
    "name": "齐三·孟尝君出行国至楚",
    "content": [
        "　　孟尝君出行国，至楚，献象床。郢之登徒，直使送之，不欲行。见孟尝君门人公孙戍曰：“臣，郢之登徒也，直送象床。象床之直千金，伤此若发漂，卖妻子不足偿之。足下能使仆无行，先人有宝剑，愿得献之。”公孙曰：“诺。”",
        "　　入见孟尝君曰：“君岂受楚象床哉?”孟尝君曰：“然。”公孙戍曰：“臣愿君勿受。”孟尝君曰：“何哉?”公孙戍曰：“小国所以皆致相印于君者，闻君于齐能振达贫穷，有存亡继绝之义。小国英桀之士，皆以国事累君，诚说君之义，慕君之廉也。今君到楚而受象床，所未至之国，将何以待君?臣戍愿君勿受。”孟尝君曰：“诺。”",
        "　　公孙戍趋而去。未出，至中闺，君召而返之，曰：“子教文无受象床，甚善。今何举足之高，志之扬也?”公孙戍曰：“臣有大喜三，重之宝剑一。”孟尝君曰：“何谓也?”公孙戍曰：“门下百数，莫敢入谏，臣独入谏，臣一喜；谏而得听，臣二喜；谏而止君之过，臣三喜。输象床，郢之登徒不欲行，许戍以先人之宝剑。”孟尝君：“善，受之乎?”公孙戍曰：“未敢。”",
        "　　曰：“急受之。”因书门版曰：“有能扬文之名，止文之过，私得宝于外者，疾入谏！”",
    ],
}
ZhanGuoBookPageModule[144] = {
    "index": "战国策",
    "name": "齐三·淳于髡一日而见七人于宣王",
    "content": ["　　淳于髡一日而见七人于宣王。王曰：“子来，寡人闻之，千里而一士，是比肩而立；百世而一圣，若随踵而至也。今子一朝而见七士，则士不亦众乎?”淳于髡曰：“不然。夫鸟同翼者而聚居，兽同足者而俱行。今求柴胡、桔梗于沮泽，则累世不得—焉。及之皋黍、梁父之阴，则郄车而载耳。夫物各有畴，今髡贤者之畴也。王求士于髡，譬若挹水于河，而取火于燧也。髡将复见之，岂特七士也?”"],
}
ZhanGuoBookPageModule[145] = {
    "index": "战国策",
    "name": "齐三·齐欲伐魏",
    "content": ["　　齐欲伐魏。淳于髡谓齐王曰：“韩子卢者，天下之疾犬也。东郭逡者，海内之狡兔也。韩子卢逐东郭逡，环山者三，腾山者五，兔极于前，犬废于后，犬兔俱罢，各死其处。田父见之，无劳倦之苦，而擅其功。今齐、魏久相持，以顿其兵，弊其众，臣恐强秦大楚承其后，有田父之功。”齐王惧，谢将休士也。"],
}
ZhanGuoBookPageModule[146] = {
    "index": "战国策",
    "name": "齐三·国子曰秦破马服君之师",
    "content": [
        "　　国子曰：“秦破马服君之师，围邯郸。齐、魏亦佐秦伐邯郸，齐取淄鼠，魏取伊是。公子无忌为天下循便计，杀晋鄙，率魏兵以救邯郸之围，使秦弗有而失天下。是齐入于魏而救邯郸之功也。安邑者，魏之柱国也；晋阳者，赵之柱国也；鄢郢者，楚之柱国也。故三国欲与秦壤界，秦伐魏取安邑，伐赵取晋阳，伐楚取鄢郢矣。福三国之君，兼二周之地，举韩氏取其地，且天下之半。今又劫赵、魏，疏中国，封卫之东野，兼魏之河南，绝赵之东阳，则赵、魏亦危矣。赵、魏危，则非齐之利也。韩、魏、赵、楚之志，恐秦兼天下而臣其君，故专兵一志以逆秦。三国之于秦壤界而患急，齐不与秦壤界而患缓。是以天下之势，不得不事齐也。故秦得齐，则权重于中国；赵、魏、楚得齐，则足以敌秦。故秦、赵、魏得齐者重，失齐者轻。齐有此势，不能以重于天下者何也?其用者过也。”",
    ],
}
ZhanGuoBookPageModule[147] = {
    "index": "战国策",
    "name": "齐四·齐人有冯谖者",
    "content": [
        "　　齐人有冯谖者，贫乏不能自存，使人属孟尝君，愿寄食门下。孟尝君曰：“客何好？”曰：“客无好也。”曰：“客何能？”曰：“客无能也。”孟尝君笑而受之曰：“诺。”左右以君贱之也，食以草具。",
        "　　居有顷，倚柱弹其剑，歌曰：“长铗归来乎!食无鱼。”左右以告。孟尝君曰：“食之，比门下之客。”居有顷，复弹其铗，歌曰：“长铗归来乎!出无车。”左右皆笑之，以告。孟尝君曰：“为之驾，比门下之车客。”于是乘其车，揭其剑，过其友曰：“孟尝君客我。”后有顷，复弹其剑铗，歌曰：“长铗归来乎!无以为家。”左右皆恶之，以为贪而不知足。孟尝君问：“冯公有亲乎？”对曰：“有老母。”孟尝君使人给其食用，无使乏。于是冯谖不复歌。",
        "　　后孟尝君出记，问门下诸客：“谁习计会，能为文收责于薛者乎？”冯谖署曰：“能。”孟尝君怪之，曰：“此谁也？”左右曰：“乃歌夫长铗归来者也。”孟尝笑曰：“客果有能也，吾负之，未尝见也。”请而见之，谢曰：“文倦于事，愦于忧，而性懦愚，沉于国家之事，开罪于先生。先生不羞，乃有意欲为收责于薛乎？”冯谖曰：“愿之。”于是约车治装，载券契而行，辞曰：“责毕收，以何市而反？”孟尝君曰：“视吾家所寡有者。”",
        "　　驱而之薛，使吏召诸民当偿者，悉来合券。券遍合，起矫命以责赐诸民，因烧其券，民称万岁。",
        "　　长驱到齐，晨而求见。孟尝君怪其疾也，衣冠而见之，曰：“责毕收乎？来何疾也!”曰：“收毕矣。”“以何市而反？”冯谖曰：“君云‘视吾家所寡有者’。臣窃计，君宫中积珍宝，狗马实外厩，美人充下陈。君家所寡有者以义耳!窃以为君市义。”孟尝君曰：“市义奈何？”曰：“今君有区区之薛，不拊爱子其民，因而贾利之。臣窃矫君命，以责赐诸民，因烧其券，民称万岁。乃臣所以为君市义也。”孟尝君不说，曰：“诺，先生休矣!”",
        "　　后期年，齐王谓孟尝君曰：“寡人不敢以先王之臣为臣。”孟尝君就国于薛，未至百里，民扶老携幼，迎君道中。孟尝君顾谓冯谖：“先生所为文市义者，乃今日见之。”冯谖曰：“狡兔有三窟，仅得免其死耳。今君有一窟，未得高枕而卧也。请为君复凿二窟。”孟尝君予车五十乘，金五百斤，西游于梁，谓惠王曰：“齐放其大臣孟尝君于诸侯，诸侯先迎之者，富而兵强。”于是梁王虚上位，以故相为上将军，遣使者，黄金千斤，车百乘，往聘孟尝君。冯谖先驱诫孟尝君曰：“千金，重币也；百乘，显使也。齐其闻之矣。”梁使三反，孟尝君固辞不往也。齐王闻之，君臣恐惧，遣太傅赍黄金千斤，文车二驷，服剑一，封书谢孟尝君曰：“寡人不祥，被于宗庙之祟，沉于谄谀之臣，开罪于君，寡人不足为也。愿君顾先王之宗庙，姑反国统万人乎？”冯谖诫孟尝君曰：“愿请先王之祭器，立宗庙于薛。”庙成，还报",
        "　　孟尝君曰：“三窟已就，君始高枕为乐矣。”",
        "　　孟尝君为相数十年，无纤介之祸者，冯谖之计也。",
    ],
}
ZhanGuoBookPageModule[148] = {
    "index": "战国策",
    "name": "齐四·孟尝君为从",
    "content": [
        "　　孟尝君为从。公孙弘谓孟尝君曰：“君不以使人先观秦王?意者秦王帝王之主也，君恐不得为臣，奚暇从以难之?意者秦王不肖之主也，君从以难之，未晚。”孟尝君曰：“善，愿因请公往矣。”",
        "　　公孙弘敬诺，以车十乘之秦。昭王闻之，而欲醜之以辞。公孙弘见，昭王曰：“薛公之地，大小几何?”公孙弘对曰：“百里。”昭王笑而曰：“寡人地数千里，犹未敢以有难也。今孟尝君之地方百里，而因欲难寡人，犹可乎?”公孙弘对曰：“孟尝君好人，大王不好人。”昭王曰：“孟尝之好人也，奚如?”公孙弘曰：“义不臣乎天子，不友乎诸侯，得志不惭为人主，不得志不肯为人臣，如此者三人；而治可为管、商之师，说义听行，能致其如此者五人；万乘之严主也，辱其使者，退而自刎，必以其血洿其衣，如臣者十人。”昭王笑而谢之，曰：“客胡为若此，寡人直与客论耳!寡人善孟尝君，欲客之必谕寡人之志也!”公孙弘曰：“敬诺。”",
        "　　公孙弘可谓不侵矣。昭王，大国也。孟尝，千乘也。立千乘之义而不可陵，可谓足使矣。",
    ],
}

ZhanGuoBookPageModule[149] = {
    "index": "战国策",
    "name": "齐四·鲁仲连谓孟尝",
    "content": ["　　鲁仲连谓孟尝：“君好士也，雍门养椒亦，阳得子养，饮食、衣裘与之同之，皆得其死。今君之家富于二公，而士未有为君尽游者也。”君曰：“文不得是二人故也。使文得二人者，岂独不得尽?”对曰：“君之厩马百乘，无不被绣衣而食菽粟者，岂有骐麟騄耳哉?后宫十妃，皆衣缟紵，食梁肉，岂有毛嫱、西施哉?色与马取于今之世，士何必待古哉?故曰君之好士未也。”"],
}
ZhanGuoBookPageModule[150] = {
    "index": "战国策",
    "name": "齐四·孟尝君逐于齐而复反",
    "content": [
        "　　孟尝君逐于齐而复反。谭拾子迎之于境，谓孟尝君曰：“君得无有所怨齐士大夫?”孟尝君曰：“有。”“君满意杀之乎?”孟尝君曰：“然。”谭拾子曰：“事有必至，理有固然，君知之乎?”孟尝君曰：“不知。”谭拾子曰：“事之必至者，死也；理之固然者，富贵则就之，贫贱则去之。此事之必至，理之固然者。请以市谕。市，朝则满，夕则虚，非朝爱市而夕憎之也，求存故往，亡故去。愿君勿怨！”孟尝君乃取所怨五百牒削去之，不敢以为言。",
    ],
}
ZhanGuoBookPageModule[151] = {
    "index": "战国策",
    "name": "齐四·齐宣王见颜斶",
    "content": [
        "　　齐宣王见颜斶，曰：“斶前！”斶亦曰：“王前!”宣王不悦。左右曰：“王，人君也。斶，人臣也。王曰‘斶前’，亦曰‘王前’，可乎?”斶对曰：“夫斶前为慕势，王前为趋士。与使斶为趋势，不如使王为趋士。”王忿然作色曰：“王者贵乎?士贵乎?”对曰：“士贵耳，王者不贵。”王曰：“有说乎?”斶曰：“有。昔者秦攻齐，令曰：‘有敢去柳下季垄五十步而樵采者，死不赦。’令曰：‘有能得齐王头者，封万户侯，赐金千镒。’由是观之，生王之头，曾不若死士之垄也。”宣王默默不悦。",
        "　　左右皆曰：“斶来，斶来！大王据千乘之地，而建千石钟，万石（竹虚）。天下之士，仁义皆来役处；辩知并进，莫不来语；东西南北，莫敢不服。求万物无不备具，而百姓无不亲附。今夫士之高者，乃称匹夫，徒步而处农亩，下则鄙野、监门、闾里，士之贱也，亦甚矣!”",
        "　　斶对曰：“不然。斶闻古大禹之时，诸侯万国。何则?德厚之道，得贵士之力也。故舜起农亩，出于野鄙，而为天子。及汤之时，诸侯三千。当今之世，南面称寡者，乃二十四。由此观之，非得失之策与?稍稍诛灭，灭亡无族之时，欲为监门、闾里，安可得而有乎哉?是故《易传》不云乎：‘居上位，未得其实，以喜其为名者，必以骄奢为行。据慢骄奢，则凶从之。是故无其实而喜其名者削，无德而望其福者约，无功而受其禄者辱，祸必握。’故曰：‘矜功不立，虚愿不至。’此皆幸乐其名，华而无其实德者也。是以尧有九佐，舜有七友，禹有五丞，汤有三辅，自古及今而能虚成名于天下者，无有。是以君王无羞亟问，不市下学；是故成其道德而扬功名于后世者，尧、舜、禹、汤、周文王是也。故曰：‘无形者，形之君也。无端者，事之本也。’夫上见其原，下通其流，至圣人明学，何不吉之有哉!老子曰：‘虽贵，必以贱为本；虽高，必以下为基。’是以侯王称孤寡不谷。是其贱之本与!非夫孤寡者，人之困贱下位也，而侯王以自谓，岂非下人而尊贵士与?夫尧传舜，舜传禹，周成王任周公旦，而世世称曰明主，是以明乎士之贵也。”",
        "　　宣王曰：“磋乎!君子焉可侮哉，寡人自取病耳!及今闻君子之言，乃今闻细人之行，愿请受为弟子。且颜先生与寡人游，食必太牢，出必乘车，妻子衣服丽都。”",
        "　　颜斶辞去曰：“夫玉生于山，制则破焉，非弗宝贵矣，然夫璞不完。士生乎鄙野，推选则禄焉，非不得尊遂也，然而形神不全。斶愿得归，晚食以当肉，安步以当车，无罪以当贵，清静贞正以自虞。制言者王也，尽忠直言者斶也。言要道已备矣，愿得赐归，安行而反臣之邑屋。”则再拜而辞去也。",
        "　　斶知足矣，归反扑，则终身不辱也。",
    ],
}
ZhanGuoBookPageModule[152] = {
    "index": "战国策",
    "name": "齐四·先生王斗造门而欲见齐宣王",
    "content": [
        "　　先生王斗造门而欲见齐宣主，宣王使谒者延入。王斗曰：“斗趋见王为好势，王趋见斗为好士，于王何如?”使者复还报。王曰：“先生徐之，寡人请从。”宣王因趋而迎之于门，与入，曰：“寡人奉先君之宗庙，守社稷，闻先生直言正谏不讳。”王斗对曰：“王闻之过。斗生于乱世，事乱君，焉敢直言正谏。”宣王忿然作色，不说。",
        "　　有间，王斗曰：“昔先君桓公所好者，九合诸侯，一匡天下，天子受籍，立为大伯。今王有四焉。”宣王说，曰：“寡人愚陋，守齐国，唯恐失抎之，焉能有四焉?”王斗曰：“否。先君好马，王亦好马。先君好狗，王亦好狗。先君好酒，王亦好酒。先君好色，王亦好色。先君好士，是王不好士。”宣王曰：“当今之世无士，寡人何好?”王斗曰：“世无骐驎騄耳，王驷已备矣。世无东郭俊、卢氏之狗，王之走狗已具矣。世无毛嫱、西施，王宫已充矣。王亦不好士也，何患无士?”王曰：“寡人忧国爱民，固愿得士以治之。”王斗曰：“王之忧国爱民，不若王爱尺縠也。”王曰：“何谓也?”王斗曰：“王使人为冠，不使左右便辟而使工者何也?为能之也。今王治齐，非左右便辟无使也，臣故曰不如爱尺縠也。”",
        "　　宣王谢曰：“寡人有罪国家。”于是举士五人任官，齐国大治。",],
}
ZhanGuoBookPageModule[153] = {
    "index": "战国策",
    "name": "齐四·齐王使使者问赵威后",
    "content": ["　　齐王使使者问赵威后。书未发，威后问使者曰：“岁亦无恙耶?民亦无恙耶?王亦无恙耶?”使者不说，曰：“臣奉使使威后，今不问王，而先问岁与民，岂先贱而后尊贵者乎?”威后曰：“不然。苟无岁，何以有民?苟无民，何以有君?故有问舍本而问末者耶?”乃进而问之曰：“齐有处士曰钟离子，无恙耶?是其为人也，有粮者亦食，无粮者亦食；有衣者亦衣，无衣者亦衣。是助王养其民也，何以至今不业也?叶阳子无恙乎?是其为人，哀鳏寡，恤孤独，振困穷，补不足。是助王息其民者也，何以至今不业也?北宫之女婴儿子无恙耶?撤其环殽，至老不嫁，以养父母。是皆率民而出于孝情者也，胡为至今不朝也?此二士弗业，一女不朝，何以王齐国，子万民乎?於陵子仲尚存乎?是其为人也，上不臣于王，下不治其家，中不索交诸侯。此率民而出于无用者，何为至今不杀乎?”"],
}
ZhanGuoBookPageModule[154] = {
    "index": "战国策",
    "name": "齐四·齐人见田骈",
    "content": ["　　齐人见田骈，曰：“闻先生高议，设为不宦，而愿为役。”田骈曰：“子何闻之?”对曰：“臣闻之邻人之女。”田骈曰：“何谓也?”对曰：“臣邻人之女，设为不嫁，行年三十而有七子，不嫁则不嫁，然嫁过毕矣。今先生设为不宦，訾养千钟，徒百人，不宦则然矣，而富过毕也。”田子辞。"],
}
ZhanGuoBookPageModule[155] = {
    "index": "战国策",
    "name": "齐四·管燕得罪齐王",
    "content": ["　　管燕得罪齐王，谓其左右曰：“子孰而与我赴诸侯乎?”左右嘿然莫对。管燕连然流涕曰：“悲夫！士何其易得而难用也!”田需对曰：“士三食不得餍，而君鹅鹜有余食；下宫糅罗纨，曳绮縠，而士不得以为缘。且财者君之所轻，死者士之所重，君不肯以所轻与士，而责士以所重事君，非士易得而难用也。”"],
}
ZhanGuoBookPageModule[156] = {
    "index": "战国策",
    "name": "齐四·苏秦自燕之齐",
    "content": ["　　苏秦自燕之齐，见于华章南门。齐王曰：“嘻!子之来也。秦使魏冉致帝，子以为何如?”对曰：“王之问臣也卒，而患之所从生者微。今不听，是恨秦也；听之，是恨天下也。不如听之以卒秦，勿庸称也以为天下。秦称之，天下听之，王亦称之，先后之事，帝名为无伤也。秦称之，而天下不听，王因勿称，其于以收天下，此大资也。”"],
}
ZhanGuoBookPageModule[157] = {
    "index": "战国策",
    "name": "齐四·苏秦谓齐王",
    "content": ["　　苏秦谓齐王曰：“齐、秦立为两帝，王以天下为尊秦乎?且尊齐乎?”王曰：“尊秦。”“释帝则天下爱齐乎?且爱秦乎?”王曰：“爱齐而憎秦。”“两帝立，约伐赵，孰与伐宋之利也?”对曰：“夫约然与秦为帝，而天下独尊秦而轻齐；齐释帝，则天下爱齐而憎秦；伐赵不如伐宋之利。故臣愿王明释帝，以就天下；倍约傧秦，勿使争重；而王以其间举宋。夫有宋则卫之阳城危；有淮北则楚之东国危；有济西则赵之河东危；有阴、平陆则梁门不启。故释帝而贰之以伐宋之事，则国重而名尊，燕、楚以形服，天下不敢不听，此汤、武之举也。敬秦以为名，而后使天下憎之，此所谓以卑易尊者也!愿王之熟虑之也!”"],
}
ZhanGuoBookPageModule[158] = {
    "index": "战国策",
    "name": "齐五·苏秦说齐闵王",
    "content": [
        "　　苏秦说齐闵王曰：“臣闻用兵而喜先天下者忧，约结而喜主怨者孤。夫后起者藉也，而远怨者时也。是以圣人从事，必藉于权而务兴于时。夫权藉者，万物之率也；而时势者，百事之长也。故无权藉，倍时势，而能事成者寡矣。",
        "　　“今虽干将、莫邪，非得人力，则不能割刿矣。坚箭利金，不得弦机之利，则不能远杀矣。矢非不銛，而剑非不利也，何则?权藉不在焉。何以知其然也?昔者赵氏袭卫，车舍人不休传，卫国城割平，卫八门土而二门堕矣，此亡国之形也。卫君跣行，告迎于魏。魏王身被甲底剑，挑赵索战。邯郸之中鹜，河、山之间乱。卫得是藉也，亦收余甲而北面，残刚平，堕中牟之郭。卫非强于赵也，譬之卫矢而魏弦机也，藉力魏而有河东之地。赵氏惧，楚人救赵而伐魏，战于州西，出梁门，军舍林中，马饮于大河。赵得是藉也，亦袭魏之河北，烧棘沟，坠黄城。故刚平之残也，中牟之堕也，黄城之坠也，棘沟之烧也，此皆非赵、魏之欲也。然二国劝行之者，何也?卫明于时权之藉也。今世之为国者不然矣。兵弱而好敌强，国罢而好众怨，事败而好鞠之，兵弱而憎下人也，地狭而好敌大，事败而好长诈。行此六者而求伯，则远矣。",
        "　　“臣闻善为国者，顺民之意，而料兵之能，然后从于天下。故约不为人主怨，伐不为人挫强。如此，则兵不费，权不轻，地可广，欲可成也。昔者，齐之与韩、魏伐秦、楚也，战非甚疾也，分地又非多韩、魏也，然而天下独归咎于齐者，何也?以其为韩、魏主怨也。且天下遍用兵矣，齐、燕战，而赵氏兼中山，秦、楚战韩、魏不休，而宋、越专用其兵。此十国者，皆以相敌为意，而独举心于齐者，何也?约而好主怨，伐而好挫强也。",
        "　　“且夫强大之祸，常以王人为意也；夫弱小之殃，常以谋人为利也。是以大国危，小国灭也。大国之计，莫若后起而重伐不义。夫后起之籍与多而兵劲，则事以众强适罢寡也，兵必立也。事不塞天下之心，则利必附矣。大国行此，则名号不攘而至，伯王不为而立矣。小国之情，莫如仅静而寡信诸侯。仅静，则四邻不反；寡信诸侯，则天下不卖，外不卖，内不反，则槟祸朽腐而不用，币帛矫蠹而不服矣。小国道此，则不祠而福矣，不贷而见足矣。故曰：祖仁者王，立义者伯，用兵穷者亡。何以知其然也?昔吴王夫差以强大为天下先，强袭郢而栖越，身从诸侯之君，而卒身死国亡，为天下戮者，何也?此夫差平居而谋王，强大而喜先天下之祸也。昔者莱、莒好谋，陈、蔡好诈，莒恃越而灭，蔡恃晋而亡，此皆内长诈，外信诸侯之殃也。由此观之，则强弱大小之祸，可见于前事矣。",
        "　　“语曰：‘麒骥之衰也，驽马先之；孟贲之倦也，女子胜之。’夫驽马、女子，筋骨力劲，非贤於麒骥、孟贲也。何则?后起之藉也。今天下之相与也不并灭，有而案兵而后起，寄怨而诛不直，微用兵而寄于义，则亡天下可跼足而须也。明于诸侯之故，察于地形之理者，不约亲，不相质而固，不趋而疾，众事而不反，交割而不相憎，惧强而加以亲。何则?形同忧而兵趋利也。何以知其然也?昔者齐、燕战于桓之曲，燕不胜，十万之众尽。胡人袭燕楼烦数县，取其牛马。夫胡之与齐非素亲也，而用兵又非约质而谋燕也，然而甚于相趋者，何也?何则形同忧而兵趋利也。由此观之，约于同形则利长，后起则诸侯可趋役也。",
        "　　“故明主察相，诚欲以伯王也为志，则战攻非所先。战者，国之残也，而都县之费也。残费已先，而能从诸侯者寡矣。彼战者之为残也，士闻战则输私财而富军市，输饮食而待死士，令折辕而炊之，杀牛而觞士，则是路君之道也。中人祷视，君翳酿，通都小县置社，有市之邑莫不止事而奉王，则此虚中之计也。夫战之明日，尸死扶伤，虽若有功也，军出费，中哭泣，则伤主心矣。死者破家而葬，夷伤者空财而共药，完者内酺而华乐，故其费与死伤者钧。故民之所费也，十年之田而不偿也。军之所出，矛戟折，鐶弦绝，伤弩，破车，罢马，亡矢之大半。甲兵之具，官之所私出也，士大夫之所匿，厮养士之所窃，十年之田而不偿也。天下有此再费者，而能从诸侯寡矣。攻城之费，百姓理襜蔽，举冲橹，家杂总，身窟穴，中罢于刀金。而士困于土功，将不释甲，期数而能拔城者为亟耳。上倦于教，士断于兵，故三下城而能胜敌者寡矣。故曰：彼战攻者，非所先也。何以知其然也?昔智伯瑶攻范、中行氏，杀其君，灭其国，又西围晋阳，吞兼二国，而忧一主，此用兵之盛也。然而智伯卒身死国亡，为天下笑者，何谓也?兵先战攻，而灭二子患也。日者，中山悉起而迎燕、赵，南战于长子，败赵氏；北战于中山，克燕军，杀其将。夫中山千乘之国也，而敌万乘之国二，再战北胜，此用兵之上节也。然而国遂亡，君臣于齐者，何也?不啬于战攻之患也。由此观之，战攻之败，可见于前事。",
        "　　“今世之所谓善用兵者，终战比胜，而守不可拔，天下称为善，一国得而保之，则非国之利也。臣闻战大胜者，其士多死而兵益弱；守而不可拔者，其百姓罢而城郭露。夫士死于外，民残于内，而城郭露于境，则非王之乐也。今夫鹄的非咎罪于人也，便弓引弩而射之，中者则善，不中则愧，少长贵贱，则同心于贯之者，何也?恶其示人以难也。今穷战比胜，而守必不拔，则是非徒示人以难也，又且害人者也，然则天下仇之必矣。夫罢士露国，而多与天",
        "　　下为仇，则明君不居也；素用强兵而弱之，则察相不事。彼明君察相者，则五兵不动而诸侯从，辞让而重赂至矣。故明君之攻战也，甲兵不出于军而敌国胜，冲橹不施而边城降，士民不知而王业至矣。彼明君之从事也，用财少，旷日远而为利长者。故曰：兵后起则诸侯可趋役也。",
        "　　“臣之所闻，攻战之道非师者，虽有百万之军，比之堂上；虽有阖闾、吴起之将，禽之户内；千丈之城，拔之尊俎之间；百尺之冲，折之衽席之上。故钟鼓竽瑟之音不绝，地可广而欲可成；和乐倡优侏儒之笑不之，诸侯可同日而致也。故名配天地不为尊，利制海内不为厚。故夫善为王业者，在劳天下而自佚，乱天下而自安，诸侯无成谋，则其国无宿忧也。何以知其然?佚治在我，劳乱在天下，则王之道也。锐兵来则拒之，患至则趋之，使诸侯无成谋，则其国无宿忧矣。何以知其然矣?昔者魏王拥士千里，带甲三十六万，其强而拔邯郸，西围定阳，又从十二诸侯朝天子，以西谋秦。秦王恐之，寝不安席，食不甘昧，令于境内，尽堞中为战具，竟为守备，为死士置将，以待魏氏。卫鞅谋于秦王曰：‘夫魏氏其功大，而令行于天下，有十二诸侯而朝天子，其与必众。故以一秦而敌大魏，恐不如。王何不使臣见魏王，则臣请必北魏矣。’秦王许诺。卫鞅见魏王曰：‘大王之功大矣，令行于天下矣。今大王之所从十二诸侯，非宋、卫也，则邹、鲁、陈、蔡，此固大王之所以鞭箠使也，不足以王天下。大王不若北取燕，东伐齐，则赵必从矣；西取秦，南伐楚，则韩必从矣。大王有伐齐、楚心，而从天下之志，则王业见矣。大王不如先行王服，然后图齐、楚。’魏王说于卫鞅之言也，故身广公宫，制丹衣柱，建九斿，从七星之旟。此天子之位也，而魏王处之。于是齐、楚怒，诸侯奔齐，齐人伐魏，杀其太子，覆其十万之军。魏王大恐，跣行按兵于国，而东次于齐，然后天下乃舍之。当是时，秦王垂拱受河西之外，而不以德魏王。故曰卫鞅之始与秦王计也，谋约不下席，言于尊俎之间，谋成于堂上，而魏将以禽于齐矣；冲橹未施，而西河之外入于秦矣。此臣之所谓比之堂上，禽将户内，拔城于尊俎之间，折冲席上者也。”",
    ],
}

ZhanGuoBookPageModule[159] = {
    "index": "战国策",
    "name": "齐六·齐负郭之民有孤狐咺者",
    "content": [
        "　　齐负郭之民有孤狐咺者，正议闵王，斮之檀街，百姓不附。齐孙室子陈举直言，杀之东闾，宗族离心。司马穰苴为政者也，杀之，大臣不亲。以故燕举兵，使昌国君将而击之。齐使向子将而应之。齐军破，向子以舆一乘亡。达子收余卒，复振，与燕战，求所以偿者，闵王不肯与，军破走。",
        "　　王奔莒，淖齿数之曰：“夫千剩、博昌之间，方数百里，雨血沾衣，王知之乎?”王曰：“不知。”“嬴、博之间，地坼至泉，王知之乎?”王曰：“不知。”“人有当阙而哭者，求之则不得，去之则闻其声，王知之乎?”王曰：“不知。”淖齿曰：“天雨血沾衣者，天以告也；地坼至泉者，地以告也；人有当阙而哭者，人以告也。天地人皆以告矣，而王不知戒焉，何得无诛乎?”于是杀闵王于鼓里。",
        "　　太子乃解衣免服，逃太史之家为溉园。君王后，太史氏女，知其贵人，善事之。田单以即墨之破亡余卒，破燕兵，绐骑劫，遂以复齐，遽迎太子于莒，立之以为王。襄王即位，君王后以为后，生齐王建。",
    ],
}
ZhanGuoBookPageModule[160] = {
    "index": "战国策",
    "name": "齐六·王孙贾年十五事闵王",
    "content": [
        "　　王孙贾年十五，事闵王。王出走，失王之处。其母曰：“女朝出而晚来，则吾倚门而望；女暮出而不还，则吾倚闾而望。女今事王，王出走，女不知其处，女尚何归?”",
        "　　王孙贾乃入市中，曰：“淖齿乱齐国，杀闵王，欲与我诛者，袒右！”市人从者四百人，与之诛淖齿，刺而杀之。",
    ],
}
ZhanGuoBookPageModule[161] = {
    "index": "战国策",
    "name": "齐六·燕攻齐取七十余城",
    "content": [
        "　　燕攻齐，取七十余城，唯莒、即墨不下。齐田单以即墨破燕，杀骑劫。初，燕将攻聊城，人或谗之。燕将惧诛，遂保守聊城，不敢归。田单攻之岁余，士卒多死，而聊城不下。",
        "　　鲁连乃书，约之矢以射城中，遣燕将曰：“吾闻之，智者不倍时而弃利，勇士不怯死而灭名，忠臣不先身而后君。今公行一朝之忿，不顾燕王之无臣，非忠也；杀身亡聊城，而威不信于齐，非勇也；功废名灭，后世无称，非知也。故知者不再计，勇士不怯死。今死生荣辱，尊卑贵贱，此其一时也。愿公之详计而无与俗同也。且楚攻南阳，魏攻平陆，齐无南面之心，以为亡南阳之害，不若得济北之利，故定计而坚守之。今秦人下兵，魏不敢东面，横秦之势合，则楚之形危。且弃南阳，断右壤，存济北，计必为之。今楚、魏交退，燕救不至，齐无天下之规，与聊城共据期年之弊，即臣见公之不能得也。齐必决之于聊城，公无再计。彼燕国大乱，君臣过计，上下迷感，栗腹以百万之众，五折于外，万乘之国，被围于赵，壤削主困，为天下戮，公闻之乎?今燕王方寒心独立，大臣不足恃，国弊祸多，民心无所归。今公又以弊聊之民，距全齐之兵，期年不解，是墨翟之守也；食人炊骨，士无反北之心，是孙膑、吴起之兵也。能以见于天下矣。",
        "　　“故为公计者，不如罢兵休士，全车甲，归报燕王，燕王必喜。士民见公，如见父母，交游攘臂而议于世，功业可明矣。上辅孤主，以制群臣；下养百姓，以资说士。矫国革俗於天下，功名可立也。意者亦捐燕弃世，东游与齐乎?请裂地定封，富比陶、卫，世世称孤寡，与齐久存，此亦一计也。二者显名厚实也，愿公熟计而审处一也。",
        "　　“且吾闻，效小节者不能行大威，恶小耻者不能立荣名。昔管仲射桓公中钩，篡也；遗公子纠而不能死，怯也；束缚桎桔，辱身也。此三行者，乡里不通也，世主不臣也。使管仲终穷抑，幽囚而不出，惭耻而不见，穷年没寿，不免为辱人贱行矣。然而管子并三行之过，据齐国之政，一匡天下，九合诸侯，为五伯首，名高天下，光照邻国。曹沫为鲁君将，三战三北，而丧地千里。使曹子之足不离陈，计不顾后，出必死而不生，则不免为败军禽将。曹子以败军禽将，非勇也；功废名灭，后世无称，非知也。故去三北之耻，退而与鲁君计也，曹子以为遭。齐桓公有天下，朝诸侯。曹子以一剑之任，劫桓公于坛位之上，颜色不变，而辞气不悖。三战之所丧，一朝而反之，天下震动惊骇，威信吴、楚，传名后世。若此二公者，非不能行小节，死小耻也，以为杀身绝世，功名不立，非知也。故去忿恚之心，而成终身之名；除感忿之耻，而立累世之功。故业与三王争流，名与天壤相敝也。公其图之!”",
        "　　燕将曰：“敬闻命矣。”因罢兵到读而去。故解齐国之围，救百姓之死，仲连之说也。",
    ],
}
ZhanGuoBookPageModule[162] = {
    "index": "战国策",
    "name": "齐六·燕攻齐齐破",
    "content": [
        "　　燕攻齐，齐破。闵王奔莒，淖齿杀闵王。田单守即墨之城，破燕兵，复齐墟。襄王为太子征。齐以破燕，田单之立疑，齐国之众，皆以田单为自立也。襄王立，田单相之。",
        "　　过菑水，有老人涉菑而寒，出不能行，坐于沙中。田单见其寒，欲使后车分衣，无可以分者，单解裘而衣之。襄王恶之，曰：“田单之施，将欲以取我国乎?不早图，恐后之。”左右顾无人，岩下有贯珠者，襄王呼而问之曰：“女闻吾言乎?”对曰：“闻之。”王曰：“女以为何若?”对曰：“王不如因以为己善。王嘉单之善，下令曰：‘寡人忧民之饥也，单收而食之；寡人忧民之寒也，单解裘而衣之；寡人忧劳百姓，而单亦忧之，称寡人之意。’单有是善而王嘉之，善单之善，亦王之善已。”王曰：“善。”乃赐单牛酒，嘉其行。",
        "　　后数日，贯珠者复见王曰：“王至朝日，宜召田单而揖之于庭，口劳之。乃布令求百姓之饥寒者，收谷之。”乃使人听于闾里，闻丈夫之相口与语，举口口口口曰：“田单之爱人!嗟，乃王之教泽也！”",
    ],
}
ZhanGuoBookPageModule[163] = {
    "index": "战国策",
    "name": "齐六·貂勃常恶田单",
    "content": [
        "　　貂勃常恶田单，曰：“安平君，小人也。”安平君闻之，故为酒而召貂勃，曰：“单何以得罪于先生，故常见誉于朝?”貂勃曰：“跖之狗吠尧，非贵跖而贱尧也，狗固吠非其主也。且今使公孙子贤，而徐子不肖。然而使公孙子与徐子斗，徐子之狗，犹时攫公孙子之腓而噬之也。若乃得去不肖者，而为贤者狗，岂特攫其腓而噬之耳哉?”安平君曰：“敬闻命!”明日，任之于王。",
        "　　王有所幸臣九人之属，欲伤安平君，相与语于王曰：“燕之伐齐之时，楚王使将军将万人而佐齐。今国已定，而社稷已安矣，何不使使者谢于楚王?”王曰：“左右孰可?”九人之属曰：“貂勃可。”貂勃使楚，楚王受而觞之，数日不反。九人之属相与语于王曰：“夫一人身，而牵留万乘者，岂不以据势也哉?且安平君之与王也，君臣无礼，而上下无别。且其志欲为不善。内牧百姓，循抚其心，振穷补不足，布德于民；外怀戎翟，天下之贤士，阴结诸侯之雄俊豪英。其志欲有为也。愿王之察之。”异日，而王曰：“召相单来。”田单免冠徒跣肉袒而进，退而请死罪。五日，而王曰：“子无罪于寡人，子为子之臣礼，吾为吾之王礼而已矣。”",
        "　　貂勃从楚来，王赐诸前，酒酣，王曰：“召相田单而来。”貂勃避席稽首曰：“王恶得此亡国之言乎?王上者孰与周文王?”王曰：“吾不若也。”貂勃曰：“然，臣固知王不若也。下者孰与齐桓公?”王曰：“吾不若也。”貂勃曰：“然，臣固知王不若也。然则周文王得吕尚以为太公，齐桓公得管夷吾以为仲父，今王得安平君而独曰‘单’。且自天地之辟，民人之治，为人臣之功者，谁有厚于安平君者哉?而王曰‘单，单’，恶得此亡国之言乎?且王不能守先王之社稷，燕人兴师而袭齐墟，王走而之城阳之山中。安平君以惴惴之即墨，三里之城，五里之郭，敝卒七千，禽其司马，而反千里之齐，安平君之功也。当是时也，阖城阳而王，城阳、天下莫之能止。然而计之于道，归之于义，以为不可，故为栈道木阁，而迎王与后于城阳山中，王乃得反，子临百姓。今国已定，民已安矣，王乃曰‘单’。且婴儿之计不为此。王不亟杀此九子者以谢安平君，不然，国危矣!”王乃杀九子而逐其家，益封安平君以夜邑万户。",
    ],
}
ZhanGuoBookPageModule[164] = {
    "index": "战国策",
    "name": "齐六·田单将攻狄",
    "content": [
        "　　田单将攻狄，往见鲁仲子。仲子曰：“将军攻狄，不能下也。”田单曰：“臣以五里之城，七里之郭，破亡余卒，破万乘之燕，复齐墟。攻狄而不下，何也?”上车弗谢而去。遂攻狄，三月而不克之也。",
        "　　齐婴儿谣曰：“大冠若箕，修剑拄颐，攻狄不能，下垒枯丘。”田单乃惧，问鲁仲子曰：“先生谓单不能下狄，请闻其说。”鲁仲子曰：“将军之在即墨，坐而织蒉，立则丈插，为士卒倡曰：‘可往矣!宗庙亡矣！云曰尚矣！归于何党矣!’当此之时，将军有死之心，而士卒无生之气，闻若言，莫不挥泣奋臂而欲战，此所以破燕也。当今将军东有夜邑之奉，西有菑上之虞，黄金横带，而驰乎淄、渑之间，有生之乐，无死之心，所以不胜者也。”田单曰：“单有心，先生志之矣。”明日，乃厉气循城，立于矢石之所，乃援枹鼓之，狄人乃下。",
    ],
}
ZhanGuoBookPageModule[165] = {
    "index": "战国策",
    "name": "齐六·濮上之事",
    "content": ["　　濮上之事，赘子死，章子走，盼子谓齐王曰：“不如易余粮于宋，宋王必说，梁氏不敢过宋伐齐。齐固弱，是以余粮收宋也。齐国复强，虽复责之宋，可；不偿，因以为辞而攻之，亦可。”"],
}
ZhanGuoBookPageModule[166] = {
    "index": "战国策",
    "name": "齐六·齐闵王之遇杀",
    "content": [
        "　　齐闵王之遇杀，其子法章变姓名。为莒太史家庸夫。太史敫女奇法章之状貌，以为非常人，怜而常窃衣食之，与私焉。莒中及齐亡臣相聚，求闵王子，欲立之。法章乃自言于莒。共立法章为襄王。襄王立，以太史氏女为王后，生子建。太史敫曰：“女无谋而嫁者，非吾种也，汙吾世矣。”终身不睹。君王后贤，不以不睹之故，失人子之礼也。",
        "　　襄王卒，子建立为齐王，君王后事秦谨，与诸侯信，以故建立四十—有余年不受兵。",
        "　　秦始皇尝使使者遗君王后玉连环，曰：“齐多知，而解此环不?”君王后以示群臣，群臣不知解。君王后引椎椎破之，谢秦使曰：“谨以解矣。”",
        "　　及君王后病且卒，诫建口：“群臣之可用者某。”建曰：“请书之。”君王后曰：“善。”取笔牍受言。君王后曰：“老妇已亡矣!”",
        "　　君王后死，后后胜相齐，多受秦间金玉，使宾客入秦，皆为变辞，劝王朝秦，不修攻战之备。",
    ],
}
ZhanGuoBookPageModule[167] = {
    "index": "战国策",
    "name": "齐六·齐王建入朝于奏",
    "content": [
        "　　齐王建入朝于秦，雍门司马前曰：“所为立王者，为社稷耶?为王立王耶?”王曰：“为社稷。”司马曰：“为社稷立王，王何以去社稷而入秦?”齐王还车而反。",
        "　　即墨大夫与雍门司马谏而听之，则以为可可为谋，即入见齐王曰：“齐地方数千里，带甲数百万。夫三晋大夫，皆不便秦，而在阿、鄄之间者百数，王收而与之百万之众，使收三晋之故地，即临晋之关可以入矣；鄢、郢大夫，不欲为秦，而在城南下者百数，王收而与之百万之师，使收楚故地，即武关可以入矣。如此，则齐威可立，秦国可亡。夫舍南面之称制，乃西面而事秦，为大王不取也。”齐王不听。",
        "　　秦使陈驰诱齐王内之，约与五百里之地。齐王不听即墨大夫而听陈驰，遂入秦。处之共松柏之间，饿而死。先是齐为之歌曰：“松邪!柏邪!住建共者，容耶!”",
    ],
}
ZhanGuoBookPageModule[168] = {
    "index": "战国策",
    "name": "齐六·齐以淖君之乱 ",
    "content": ["　　齐以淖君之乱秦。其后秦欲取齐，故使苏涓之楚，令任固之齐。齐明谓楚王曰：“秦王欲楚，不若其欲齐之甚也。其使涓来，以示齐之有楚，以资固于齐。齐见楚，必受固。是王之听涓也，适为固驱以合齐、秦也。齐、秦合，非楚之利也。且夫涓来之辞，必非固之所以之齐之辞也。王不如令人以涓来之辞谩固于齐，齐、秦必不合。齐、秦不和，则王重矣。王欲收齐以攻秦，汉中可得也。王即欲以秦攻齐，淮泗之间亦可得也。”"],
}

module.exports = { ZhanGuoBookPageModule: ZhanGuoBookPageModule }