
import React, {Component} from 'react';
import {AppRegistry,View,Text} from 'react-native';


var ZhanGuoBookPageModule = new Array()



ZhanGuoBookPageModule[0] = {"index":"战国策","name":"战国策",
"content":["《战国策》（Intrigues of the Warring States），是一部国别体史书。主要记述了战国时期的纵横家的政治主张和策略，展示了战国时代的历史特点和社会风貌，是研究战国历史的重要典籍。作者并非一人，成书并非一时，书中文章作者大多不知是谁。西汉末刘向编定为三十三篇，书名亦为刘向所拟定。宋时已有缺失，由曾巩作了订补。有东汉高诱注，今残缺。宋鲍彪改变原书次序，作新注。吴师道作《校注》，近代人金正炜有《补释》，今人缪文远有《战国策新注》。"
],
}

ZhanGuoBookPageModule[1]={
"index":"战国策",
"name":"东周·秦兴师临周而求九鼎",
"content":[
    "　　秦兴师临周而求九鼎，周君患之，以告颜率。颜率曰：“大王勿忧，臣请东借救于齐。”颜率至齐，谓齐王曰：“夫秦之为无道也，欲兴兵临周而求九鼎，周之君臣内自画计，与秦，不若归之大国。夫存危国，美名也；得九鼎，厚宝也。愿大王图之。”齐王大悦，发师五万人，使陈臣思将，以救周，而秦兵罢。",
"　　齐将求九鼎，周君又患之。颜率曰：“大王勿忧，臣请东解之。”颜率至齐，谓齐王曰：“周赖大国之义，得君臣父子相保也，愿献九鼎，不识大国何途之从而致之齐?”齐王曰：“寡人将寄径于梁。”颜率曰：“不可。夫梁之君臣欲得九鼎，谋之晖台之下，少海之上，其日久矣。鼎入梁，必不出。”齐王曰：“寡人将寄径于楚。”对曰：“不可。楚之君臣欲得九鼎，谋之于叶庭之中，其日久矣。若入楚，鼎必不出。”王曰：“寡人终何途之从而致之齐?”颜率曰：“弊邑固窃为大王患之。夫鼎者，非效醯壶酱甀耳，可怀挟提挈以至齐者；非效鸟集乌飞，兔兴马逝，漓然止于齐者。昔周之伐殷，得九鼎，凡一鼎而九万人輓之，九九八十一万人，士卒师徒，器械被具，所以备者称此。今大王纵有其人，何途之从而出?臣窃为大王私忧之。”齐王曰：“子之数来者，犹无与耳。”颜率曰：“不敢欺大国，疾定所从出，弊邑迁鼎以待命。”齐王乃止。",
],
}
ZhanGuoBookPageModule[2]={
"index":"战国策",
"name":"东周·秦攻宜阳",
"content":[
    "　　秦攻宜阳，周君谓赵累曰：“子以为何如?”对曰：“宜阳必拔也。”君曰：“宜阳城方八里，材士十万，粟支数年，公仲之军二十万，景翠以楚之众，临山而救之，秦必无功。”对曰：“甘茂，羁旅也，攻宜阳而有功，则周公旦也；无功，则削迹于秦。秦王不听群臣父兄之义而攻宜阳，宜阳不拔，秦王耻之。臣故曰拔。”君曰 :“子为寡人谋，且奈何?”对曰：“君谓景翠曰:‘公爵为执圭，官为柱国，战而胜，则无加焉矣；不胜，则死。不如背秦援宜阳。公进兵，秦恐公之乘其弊也，必以宝事公，公中慕公之为己乘秦也，亦必尽其宝。”秦拔宜阳，景翠果进兵。秦惧，遽效煮枣，韩氏果亦效重宝。景翠得城于秦，受宝于韩，而德东周。",
],
}
ZhanGuoBookPageModule[3]={
"index":"战国策",
"name":"东周·东周与西周战",
"content":[
    "　　东周与西周战，韩救西周。为东周谓韩王曰:“西周者，故天子之国也，多名器重宝，案兵而勿出，可以德东周，西周之宝可尽矣。”",
],
}
ZhanGuoBookPageModule[4]={
"index":"战国策",
"name":"东周·东周与西周争",
"content":[
    "　　东周与西周争，西周欲和于楚、韩。齐明谓东周君曰：“臣恐西周之与楚、韩宝，令之为己求地于东周也。不如谓楚、韩曰，西周之欲入宝，持二端。今东周之兵不急西周，西周之宝不入楚、韩。楚、韩欲得宝，即且趣我攻西周。西周宝出，是我为楚、韩取宝以德之也。西周弱矣。”",
],
}
ZhanGuoBookPageModule[5]={
"index":"战国策",
"name":"东周·东周欲为稻",
"content":[
    "　　东周欲为稻，西周不下水，东周患之。苏子谓东周君曰：“臣请使西周下水,可乎?”乃往见西周之君曰：“君之谋过矣!今不下水，所以富东周也。今其民皆种麦，无他种矣。君若欲害之，不若一为下水，以病其所种。下水，东周必复种稻；种稻而复夺之。若是，则东周之民可令一仰西周，而受命于君矣。”西周君曰：“善。”遂下水，苏子亦得两国之金也。",
],
}
ZhanGuoBookPageModule[6]={
"index":"战国策",
"name":"东周·昭献在阳翟",
"content":["昭献在阳翟，周君将令相国往，相国将不欲。苏厉为之谓周君曰：“楚王与魏王遇也，主君令陈封之楚，令向公之魏。楚、韩之遇也，主君令许公之楚，令向公之韩。今昭献非人主也，而主君令相国往；若其王在阳翟，主君将令谁往?”周君曰：“善。”乃止其行。"],
}
ZhanGuoBookPageModule[7]={
"index":"战国策",
"name":"东周·秦假道于周以伐韩",
"content":["　　秦假道于周以伐韩，周恐假之而恶于韩，不假而恶于秦。史黶谓周君曰：“君何不令人谓韩公叔曰：‘秦敢绝塞而伐韩者，信东周也。公何不与周地，发重使使之楚，秦必疑，不信周，是韩不伐也。’又谓秦王曰：‘韩强与周地，将以疑周于秦，寡人不敢弗受。’秦必无辞而令周弗受，是得地于韩而听于秦也。”"],
}
ZhanGuoBookPageModule[8]={
"index":"战国策",
"name":"东周·楚攻雍氏",
"content":["　　楚攻雍氏，周粻秦、韩，楚王怒周，周之君患之。为周谓楚王曰：“以王之强而怒周，周恐，必以国合于所与粟之国，则是劲王之敌也。故王不如速解周恐，彼前得罪而后得解，必厚事王矣。”"],
}
ZhanGuoBookPageModule[9]={
"index":"战国策",
"name":"东周·周最谓吕礼",
"content":["　　周最谓石礼曰：“子何不以秦攻齐？臣请令齐相子，子以齐事秦，必无处矣。子因令周最居魏以共之，是天下制于子也。子东重于齐，西贵于秦，秦、齐合，则子常重矣。”"],
}
ZhanGuoBookPageModule[10]={
"index":"战国策",
"name":"东周·周相吕仓见客于周君",
"content":["　　周相吕仓见客于周君。前相工师藉恐客之伤己也，因令人谓周君曰：“客者，辩士也，然而所以不可者，好毁人。”"],
}
ZhanGuoBookPageModule[11]={
"index":"战国策",
"name":"东周·周文君免士工师藉",
"content":[
    "　　周文君免士工师藉，相吕仓，国人不说也。君有闵闵之心。",
"　　谓周文君曰：“国必有诽誉，忠臣令诽在己，誉在上。宋君夺民时以为台，而民非之，无忠臣以掩盖之也。子罕释相为司空，民非子罕而善其君。齐桓公宫中七市，女闾七百，国人非之。管仲故为三归之家，以掩桓公，非自伤于民也?《春秋》记臣弑君者以百数，皆大臣见誉者也。故大臣得誉，非国家之美也。故众庶成疆，增积成山。”周君遂不免。",
],
}
ZhanGuoBookPageModule[12]={
"index":"战国策",
"name":"东周·温人之周",
"content":["　　温人之周，周不纳。客即对曰：“主人也。”问其巷而不知也，吏因囚之。君使人问之曰：“子非周人，而自谓非客，何也?”对曰：“臣少而诵诗，诗曰：‘普天之下，莫非王土；率土之滨，莫非王臣。’今周君天下，则我天子之臣，而又为客哉?故曰主人。”君乃使吏出之。"],
}
ZhanGuoBookPageModule[13]={
"index":"战国策",
"name":"东周·或为周最谓金投",
"content":["　　或为周最谓金投曰：“秦以周最之齐疑天下，而又知赵之难子齐人战，恐齐、韩之合，必先合于秦。秦、齐合，则公之国虚矣。公不如救齐，因佐秦而伐韩、魏，上党长子赵之有。公东收宝于秦，南取地于韩，魏因以困，徐为之东，则有合矣。”"],
}
ZhanGuoBookPageModule[14]={
"index":"战国策",
"name":"东周·周最谓金投",
"content":["　　周最谓金投曰：“公负令秦与强齐战。战胜，秦且收齐而封之，使无多割，而听天下之战；不胜，国大伤，不得不听秦。秦尽韩、魏之上党太原，西止秦之有已。秦地，天下之半也，制齐、楚、三晋之命，复国且身危，是何计之道也。”"],
}
ZhanGuoBookPageModule[15]={
"index":"战国策",
"name":"东周·石行秦谓大梁造",
"content":["　　石行秦谓大梁造曰：“欲决霸王之名，不如备两周辩知之士。”谓周君曰：“君不如令辩知之士，为君争于秦。”"],
}
ZhanGuoBookPageModule[16]={
"index":"战国策",
"name":"东周·谓薛公",
"content":["　　谓薛公曰：“周最于齐王也而逐之，听祝弗，相吕礼者，欲取秦。秦、齐合，弗与礼重矣。有周齐，秦必轻君。君弗如急北兵趋赵取秦、魏，收周最以为后行，且反齐王之信，又禁天下之率。齐无秦，天下果，弗必走，齐王谁与为其国？”"],
}

ZhanGuoBookPageModule[17]={
"index":"战国策",
"name":"东周·齐听祝弗",
"content":["　　齐听祝弗，外周最。谓齐王曰：“逐周最、听祝弗、相吕礼者，欲深取秦也。秦得天下，则伐齐深矣。夫齐合，则赵恐伐，故急兵以示秦。秦以赵攻，与之齐伐赵，其实同理，必不处矣。故用祝弗，即天下之理也。”"],
}
ZhanGuoBookPageModule[18]={
"index":"战国策",
"name":"东周·苏厉为周最谓苏秦",
"content":["　　苏厉为周最谓苏秦曰：“君不如令王听最，以地合於魏、赵，故必怒合於齐，是君以合齐与强楚吏产子。君若欲因最之事，则合齐者，君也；割地者，最也。”"],
}
ZhanGuoBookPageModule[19]={
"index":"战国策",
"name":"东周·谓周最曰仇赫之相宋",
"content":["　　谓周最曰：“仇赫之相宋，将以观秦之应赵、宋，败三国。三国不败，将兴赵、宋合于东方以孤秦。亦将观韩、魏之于齐也。不固，则将与宋败三国，则卖赵、宋于三国。公何不令人谓韩、魏之王曰：‘欲秦、赵之相卖乎?何不合周最兼相，视之不可离，则秦、赵必相卖以合于王也。”’"],
}
ZhanGuoBookPageModule[20]={
"index":"战国策",
"name":"东周·为周最谓魏王",
"content":["　　为周最谓魏王曰：“秦知赵之难与齐战也，将恐齐、赵之合也，必阴劲之。赵不敢战，恐秦不己收也，先合于齐。秦、赵争齐，而王无人焉，不可。王不去周最，合与收齐，而以兵之急则伐齐，无因事也。”"],
}
ZhanGuoBookPageModule[21]={
"index":"战国策",
"name":"东周·谓周最曰魏王以国与先生",
"content":["　　谓周最曰：“魏王以国与先生，贵合于秦以伐齐。薛公故主，轻忘其薛，不顾其先君之丘墓，而公独帽虚信为茂行，明群臣据故主，不与伐齐者，产以忿强秦，不可。公不如谓魏王、薛公曰：‘请为王入齐，天下不能伤齐。而有变，臣请为救之；无变，王遂伐之。且臣齐级也，如累王之交於天下，不可。王为臣赐厚矣，臣入齐，则王亦无齐之累也’。”"],
}
ZhanGuoBookPageModule[22]={
"index":"战国策",
"name":"东周·赵取周之祭地",
"content":["　　赵取周之祭地，周君患之，告于郑朝。郑朝曰：“君勿患也，臣请以三十金复取之。”周君予之。郑朝献之赵太卜，因告以祭地事。及王病，使卜之。太卜谴之曰：“周之祭地为祟。”赵乃还之。"],
}
ZhanGuoBookPageModule[23]={
"index":"战国策",
"name":"东周·杜赫欲重景翠于周",
"content":["　　杜赫欲重景翠于周，谓周君曰：“君之国小，尽君子重宝珠玉以事诸侯，不可不察也。譬之如张罗者，张于无鸟之所，则终日无所得矣；张于多鸟处，则又骇鸟矣；必张于有鸟无鸟之际，然后能多得鸟矣。今君将施于大人，大人轻君；施于小人，小人无可以求，又费财焉。君必施于今之穷士，不必且为大人者，故能得欲矣。”"],
}
ZhanGuoBookPageModule[24]={
"index":"战国策",
"name":"东周·周共太子死",
"content":["　　周共太子死，有五庶子，皆爱之，而无适立也。司马翥谓楚王曰：“何不封公子咎，而为之请太子?”左成谓司马翥曰：“周君不听，是公之知困而交绝于周也。不如谓周君曰：‘孰欲立也?微告翥，翥令楚王资之以地。’公若欲为太子，因令人谓相国御展子，廧夫空曰：‘王类欲令若为之，此健士也，居中不便于相国。’”相国令之为太子。"],
}
ZhanGuoBookPageModule[25]={
"index":"战国策",
"name":"东周·三国隘秦",
"content":["　　三国隘秦，周令其相之秦，以秦之轻也，留其行。有人谓相国曰：“秦之轻重，未可知也。秦欲知三国之情，公不如遂见秦王曰：‘请谓王听东方之处’。秦必重公。是公重周，重用以取秦也。齐重故有周，而已取齐，是周常不失重国之交也。”"],
}
ZhanGuoBookPageModule[26]={
"index":"战国策",
"name":"东周·昌他亡西周",
"content":["　　昌他亡西周，之东周，尽输西周之情于东周。东周大喜，西周大怒。冯且曰：“臣能杀之。”君予金三十斤。冯且使人操金与书，间遗昌他书曰：“告昌他，事可成，勉成之；不可成，亟亡来亡来。事久且泄，自令身死。”因使人告东周之候曰：“今夕有奸人当入者矣。”侯得而献东周，东周立杀昌他。"],
}
ZhanGuoBookPageModule[27]={
"index":"战国策",
"name":"东周·昭翥与东周恶",
"content":["　　昭翥与东周恶，或谓昭翥曰：“为公画阴计。”昭翥曰：“何也?”“西周甚憎东周，尝欲东周与楚恶，西周必令贼贼公，因宣言东周也，以西周之于王也。”照翥曰：“善。吾又恐东周之贼己，而以轻西周恶之于楚。”遽和东周。"],
}
ZhanGuoBookPageModule[28]={
"index":"战国策",
"name":"东周·严氏为贼",
"content":["　　严氏为贼，而阳竖与焉。道周，周君留之十四日，载以乘车驷马而遣之。韩使人让周，周君患之。客谓周君曰：“正语之曰：‘寡人知严氏之为贼，而阳竖与之，故留之十四日以待命也。小国不足亦以容贼，君之使又不至，是以遣之也。’”"],
}
ZhanGuoBookPageModule[29]={
"index":"战国策",
"name":"西周·薛公以齐为韩魏攻楚",
"content":["　　薛公以齐为韩魏攻楚。薛公以齐为韩、魏攻楚，又与韩、魏攻秦，而籍兵乞食于西周。韩庆为西周谓薛公曰：“君以齐为韩、魏攻楚，九年而取宛、叶以北以强韩、魏，今又攻秦以益之。韩、魏南无楚忧，西无秦患，则地广而益重，齐必轻矣。夫本末更盛，虚实有时，窃为君危之。君不如令弊邑阴合于秦而君无攻，又无籍兵乞食。君临函谷而无攻，令弊邑以君之情谓秦王曰：‘薛公必破秦以张韩、魏，所以进兵者，欲王令楚割东国以与齐也。’秦王出楚王以为和，君令弊邑以此忠秦，秦得无破，而以楚之东国自免也，必欲之。楚王出，必德齐，齐得东国而益强，而薛世世无患。秦不大弱，而处之三晋之西，三晋必重齐。”薛公曰：“善。”因令韩庆入秦，而使三国无攻秦，而使不籍兵乞食于西周。"],
}
ZhanGuoBookPageModule[30]={
    "index":"战国策",
    "name":"西周·秦攻魏将犀武军于伊阙",
    "content":["　　秦攻魏将犀武军于伊阙，进兵而攻周。为周最谓李兑曰：“君不如禁秦之攻周。赵之上计，莫如令秦、魏复战。今秦攻周而得之，则众必多伤矣。秦欲待周之得，必不攻魏；秦若攻周而不得，前有胜魏之劳，后有攻周之败，又必不攻魏。今君禁之，而秦未与魏讲也。而全赵令其止，必不敢不听，是君却秦而定周也。秦去周，必复攻魏，魏不能支，必因君而讲，则君重矣。若魏不讲，而疾支之，是君存周而战秦、魏也。重亦尽在赵。”"],
    }
ZhanGuoBookPageModule[31]={
"index":"战国策",
"name":"西周·秦令樗里疾以车百乘入周",
"content":["　　秦令樗里疾以车百乘入周，周君迎之以卒，甚敬。楚王怒，让周，以其重秦客。游腾谓楚王曰：“昔智伯欲伐厹由，遗之大钟，载以广车，因随以兵，杂由卒亡，无备故也。桓公伐蔡也，号言伐楚，其实袭蔡。今秦者，虎狼之国也，兼有吞周之意；使樗里疾以车百乘入周，周君惧焉，以蔡杂由戒之，故使长兵在前，强弩在后，名曰卫疾，而实囚之也。周君岂能无爱国哉?恐一日之亡国，而忧大王。”楚王乃悦。"],
}
ZhanGuoBookPageModule[32]={
"index":"战国策",
"name":"西周·雍氏之役",
"content":["　　雍氏之役，韩征甲与粟于周。周君患之，告苏代。苏代曰：“何患焉?代能为君令韩不征甲与粟于周，又能为君得高都。”周君大悦曰：“子苟能，寡人请以国听。”苏代遂往见韩相国公中曰：“公不闻楚计乎?昭应谓楚王曰：‘韩氏罢于兵，仓廪空，无以守城，吾收之以饥，不过一月必拔之。”今围雍氏五月不能拔，是楚病也。楚王始不信昭应之计矣，今公乃征甲及粟于周，此告楚病也。昭应闻此，必劝楚王益兵守雍氏，雍氏必拔。”公中曰：“善。然吾使者已行矣。”代曰：“公何不以高都与周。”公中怒曰：“吾无征甲与粟于周，亦已多矣。何为与高都?”代曰：“与之高都，则周必折而入于韩，秦闻之必大怒，而焚周之节，不通其使，是公以弊高都得完周也，何不与也?”公中曰：“善。”不征甲与粟于周而与高都，楚卒不拔雍氏而去。"],
}
/*
ZhanGuoBookPageModule[33]={
"index":"战国策",
"name":"第三十三章·自知者明",
"content":["知人者智，自知者明。胜人者有力，自胜者强。知足者富。强行者有志。不失其所者久，死而不亡者寿。"],
}
ZhanGuoBookPageModule[34]={
"index":"战国策",
"name":"第三十四章·不自为大",
"content":["大道泛兮，其可左右。万物恃之而生而不辞，功成不名有，衣养万物而不为主。常无欲，可名于小﹔万物归焉而不为主，可名为大。以其终不自为大，故能成其大。"],
}
ZhanGuoBookPageModule[35]={
"index":"战国策",
"name":"第三十五章·往而不害",
"content":["执大象天下往。往而不害，安平太。乐与饵，过客止。道之出口，淡乎其无味，视之不足见，听之不足闻，用之不足既。"],
}
ZhanGuoBookPageModule[36]={
"index":"战国策",
"name":"第三十六章·柔弱刚强",
"content":["将欲歙[xī]之，必固张之。将欲弱之，必固强之。将欲废之，必固兴之。将欲取之，必固与之。是谓微明。柔弱胜刚强。鱼不可脱于渊，国之利器不可以示人。"],
}
ZhanGuoBookPageModule[37]={
"index":"战国策",
"name":"第三十七章·道常无为",
"content":["道常无为而无不为，侯王若能守之，万物将自化。化而欲作，吾将镇之以无名之朴。无名之朴，夫亦将不欲。不欲以静，天下将自定。"],
}
ZhanGuoBookPageModule[38]={
"index":"战国策",
"name":"第三十八章·处实去华",
"content":["上德不德，是以有德，下德不失德，是以无德。上德无为而无以为，下德为之而有以为。上仁为之而无以为，上义为之而有以为。上礼为之而莫之应，则攘[rǎng]臂而扔之。故失道而后德，失德而后仁，失仁而后义，失义而后礼。夫礼者，忠信之薄，而乱之首。前识者，道之华，而愚之始。是以大丈夫处其厚，不居其薄，处其实，不居其华。故去彼取此。"],
}
ZhanGuoBookPageModule[39]={
"index":"战国策",
"name":"第三十九章·贱为贵本",
"content":["昔之得一者，天得一以清，地得一以宁，神得一以灵，谷得一以盈，万物得一以生，候王得一以为天下贞。其致之，天无以清将恐裂，地无以宁将恐发，神无以灵将恐歇，谷无以盈将恐竭[jié]，万物无以生将恐灭，候王无以贵高将恐蹶[jué]。故贵以贱为本，高以下为基。是以侯王自称孤、寡、不谷，此非以贱为本邪？非乎！故致数舆无舆。是不欲琭琭[lù]如玉，珞珞[luò]如石。"],
}
ZhanGuoBookPageModule[40]={
"index":"战国策",
"name":"第四十章·有生于无",
"content":["反者道之动，弱者道之用。天下万物生于有，有生于无。"],
}
ZhanGuoBookPageModule[41]={
"index":"战国策",
"name":"第四十一章·大器晚成",
"content":["上士闻道，勤而行之﹔中士闻道，若存若亡﹔下士闻道，大笑之。不笑不足以为道。故建言有之，明道若昧，进道若退﹔夷道若颣[lèi]。上德若谷，大白若辱，广德若不足，建德若偷，质真若渝。大方无隅，大器晚成，大音希声，大象无形。道隐无名，夫唯道，善贷且成。"],
}
ZhanGuoBookPageModule[42]={
"index":"战国策",
"name":"第四十二章·或损或益",
"content":["道生一，一生二，二生三，三生万物。万物负阴而抱阳，冲气以为和。人之所恶，唯孤寡不谷，而王公以为称。故物或损之而益，或益之而损。人之所教，我亦教之。强梁者不得其死，吾将以为教父。"],
}
ZhanGuoBookPageModule[43]={
"index":"战国策",
"name":"第四十三章·无为之益",
"content":["天下之至柔，驰骋天下之至坚。无有入无间，吾是以知无为之有益。不言之教，无为之益，天下希及之。"],
}
ZhanGuoBookPageModule[44]={
"index":"战国策",
"name":"第四十四章·知足不辱",
"content":["名与身孰亲。身与货孰多。得与亡孰病。甚爱必大费﹔多藏必厚亡。故知足不辱，知止不殆，可以长久。"],
}
ZhanGuoBookPageModule[45]={
"index":"战国策",
"name":"第四十五章·大成若缺",
"content":["大成若缺，其用不弊。大盈若冲，其用不穷。大直若屈，大巧若拙，大辩若讷。躁胜寒，静胜热，清静为天下正。"],
}
ZhanGuoBookPageModule[46]={
"index":"战国策",
"name":"第四十六章·知足常足",
"content":["天下有道，却走马以粪；天下无道，戎马生于郊。祸莫大于不知足，咎莫大于欲得。故知足之足，常足矣。"],
}
ZhanGuoBookPageModule[47]={
"index":"战国策",
"name":"第四十七章·不为而成",
"content":["不出户，知天下﹔不窥牖，见天道。其出弥远，其知弥少。是以圣人不行而知，不见而名，不为而成。"],
}
ZhanGuoBookPageModule[48]={
"index":"战国策",
"name":"第四十八章·为学日益",
"content":["为学日益，为道日损，损之又损，以至于无为，无为而无不为。取天下常以无事，及其有事，不足以取天下。"],
}
ZhanGuoBookPageModule[49]={
"index":"战国策",
"name":"第四十九章·圣无常心",
"content":["圣人无常心，以百姓心为心。善者吾善之，不善者吾亦善之，德善。信者吾信之，不信者亦信之，德信。圣人在天下歙歙，为天下浑其心，圣人皆孩之。"],
}
ZhanGuoBookPageModule[50]={
"index":"战国策",
"name":"第五十章·出生入死",
"content":["出生入死，生之徒十有三，死之徒十有三。人之生，动之于死地亦十有三。夫何故。以其生之厚。盖闻善摄生者，陆行不遇兕[sì]虎，入军不被甲兵。兕无所投其角，虎无所措其爪，兵无所容其刃。夫何故，以其无死地。"],
}
ZhanGuoBookPageModule[51]={
"index":"战国策",
"name":"第五十一章·尊道贵德",
"content":["道生之，德畜之，物形之，势成之，是以万物莫不尊道而贵德。道之尊，德之贵，夫莫之命而常自然。故道生之，德畜之，长之育之，亭之毒之，养之覆之。生而不有，为而不恃，长而不宰，是谓元德。"],
}
ZhanGuoBookPageModule[52]={
"index":"战国策",
"name":"第五十二章·天下有始",
"content":["天下有始，以为天下母。既得其母，以知其子；既知其子，复守其母，没身不殆。塞其兑，闭其门，终身不勤；开其兑，济其事，终身不救。见小曰明，守柔曰强。用其光，复归其明，无遗身殃﹔是谓习常。"],
}
ZhanGuoBookPageModule[53]={
"index":"战国策",
"name":"第五十三章·行于大道",
"content":["使我介然有知，行于大道，惟施是畏。大道甚夷，而民好径。朝甚除，田甚芜，仓甚虚。服文彩，带利剑，厌饮食，财货有余，是为盗夸，非道也哉。"],
}
ZhanGuoBookPageModule[54]={
"index":"战国策",
"name":"第五十四章·善抱大道",
"content":["善建者不拔，善抱者不脱，子孙以祭祀[sì]不辍[chuò]。修之于身，其德乃真﹔修之于家，其德乃余﹔修之于乡，其德乃长﹔修之于国，其德乃丰﹔修之于天下，其德乃普。故以身观身，以家观家，以乡观乡，以国观国，以天下观天下。吾何以知天下然哉？以此。"],
}
ZhanGuoBookPageModule[55]={
"index":"战国策",
"name":"第五十五章·物壮则老",
"content":["含德之厚，比于赤子。蜂虿[chài]虺[huǐ]蛇不螫[zhē]，猛兽不据，攫[jué]鸟不搏。骨弱筋柔而握固，未知牝[pìn]牡[mǔ]之合而全作，精之至也。终日号而不嗄[shà]，和之至也。知和曰常，知常曰明，益生曰祥。心使气曰强。物壮则老，谓之不道，不道早已。"],
}
ZhanGuoBookPageModule[56]={
"index":"战国策",
"name":"第五十六章·知者不言",
"content":["知者不言，言者不知。塞其兑，闭其门，挫其锐，解其纷，和其光，同其尘，是谓玄同。故不可得而亲，不可得而疏，不可得而利，不可得而害，不可得而贵，不可得而贱。故为天下贵。"],
}
ZhanGuoBookPageModule[57]={
"index":"战国策",
"name":"第五十七章·以正治国",
"content":["以正治国，以奇用兵，以无事取天下。吾何以知其然哉？以此。天下多忌讳，而民弥贫。民多利器，国家滋昏。人多伎[jì]巧，奇物滋起。法令滋彰，盗贼多有。故圣人云我无为而民自化，我好静而民自正，我无事而民自富，我无欲而民自朴。"],
}
ZhanGuoBookPageModule[58]={
"index":"战国策",
"name":"第五十八章·福祸相倚",
"content":["其政闷闷，其民淳淳﹔其政察察，其民缺缺。祸兮福之所倚，福兮祸之所伏。孰知其极，其无正。正复为奇，善复为妖，人之迷，其日固久。是以圣人方而不割，廉而不刿[guì]，直而不肆，光而不耀。"],
}
ZhanGuoBookPageModule[59]={
"index":"战国策",
"name":"第五十九章·长生久视",
"content":["治人事天，莫若啬。夫唯啬，是谓早服。早服谓之重积德，重积德，则无不克。无不克，则莫知其极。莫知其极，可以有国，有国之母，可以长久。是谓深根固柢[dǐ]，长生久视之道。"],
}
ZhanGuoBookPageModule[60]={
"index":"战国策",
"name":"第六十章·治国烹鲜",
"content":["治大国若烹小鲜，以道莅天下，其鬼不神﹔非其鬼不神，其神不伤人﹔非其神不伤人，圣人亦不伤人。夫两不相伤，故德交归焉。"],
}
ZhanGuoBookPageModule[61]={
"index":"战国策",
"name":"第六十一章·各得其所",
"content":["大国者下流，天下之交，天下之牝。牝常以静胜牡，以静为下。故大国以下小国，则取小国﹔小国以下大国，则取大国邦。故或下以取，或下而取。大国不过欲兼畜人，小国不过欲入事人。夫两者各得所欲，大者宜为下。"],
}
ZhanGuoBookPageModule[62]={
"index":"战国策",
"name":"第六十二章·万物之奥",
"content":["道者，万物之奥，善人之宝，不善人之所保。美言可以市，尊行可以加人。人之不善，何弃之有？故立天子，置三公，虽有拱璧以先驷马，不如坐进此道。古之所以贵此道者何，不曰以求得，有罪以免邪，故为天下贵。"],
}
ZhanGuoBookPageModule[63]={
"index":"战国策",
"name":"第六十三章·为大于细",
"content":["为无为，事无事，味无味。大小多少，报怨以德，图难于其易，为大于其细。天下难事，必作于易；天下大事，必作于细。是以圣人终不为大，故能成其大。夫轻诺必寡信，多易必多难。是以圣人犹难之，故终无难矣。"],
}
ZhanGuoBookPageModule[64]={
"index":"战国策",
"name":"第六十四章·慎终如始",
"content":["其安易持，其未兆易谋。其脆易泮[pàn]，其微易散。为之于未有，治之于未乱。合抱之木生于毫末，九层之台起于累土，千里之行始于足下。民之从事，长于几成而败之，慎终如始则无败事。是以圣人欲不欲，不贵难得之货；学不学，复众人之所过，以辅万物之自然，而不敢为。"],
}
ZhanGuoBookPageModule[65]={
"index":"战国策",
"name":"第六十五章·善为道者",
"content":["古之善为道者，非以明民，将以愚之。民之难治，以其智多。故以智治国国之贼，不以智治国国之福。知此两者亦楷式，常知楷式，是谓玄德。玄德深矣，远矣，与物反矣。然后乃至大顺。"],
}
ZhanGuoBookPageModule[66]={
"index":"战国策",
"name":"第六十六章·不争之争",
"content":["江海之所以能为百谷王者，以其善下之，故能为百谷王。是以欲上民，必以言下之﹔欲先民，必以身后之。是以圣人处上而民不重，处前而民不害，是以天下乐推而不厌。以其不争，故天下莫能与之争。"],
}
ZhanGuoBookPageModule[67]={
"index":"战国策",
"name":"第六十七章·持保三宝",
"content":["天下皆谓我道大，似不肖。夫唯大，故似不肖。若肖，久矣其细也夫。我有三宝，持而保之：一曰慈，二曰俭，三曰不敢为天下先。慈故能勇，俭故能广，不敢为天下先，故能成器长。今舍慈且勇，舍俭且广，舍后且先，死矣。夫慈，以战则胜，以守则固。天将救之，以慈卫之。"],
}
ZhanGuoBookPageModule[68]={
"index":"战国策",
"name":"第六十八章·不争之德",
"content":["善为士者不武，善战者不怒，善胜敌者不与，善用人者为之下。是谓不争之德，是谓用人之力，是谓配天，古之极。"],
}
ZhanGuoBookPageModule[69]={
"index":"战国策",
"name":"第六十九章·哀者胜矣",
"content":["用兵有言：吾不敢为主而为客，不敢进寸而退尺。是谓行无行，攘无臂，执无兵，扔无敌。祸莫大于轻敌，轻敌几丧吾宝。故抗兵相若，哀者胜矣。"],
}
ZhanGuoBookPageModule[70]={
"index":"战国策",
"name":"第七十章·被褐怀玉",
"content":["吾言甚易知，甚易行。天下莫能知，莫能行。言有宗，事有君。夫唯无知，是以不我知。知我者希，则我者贵。是以圣人被褐[hè]而怀玉。"],
}
ZhanGuoBookPageModule[71]={
"index":"战国策",
"name":"第七十一章·知不知矣",
"content":["知不知上，不知知病。夫唯病病，是以不病。圣人不病，以其病病，是以不病。"],
}
ZhanGuoBookPageModule[72]={
"index":"战国策",
"name":"第七十二章·自知自爱",
"content":["民不畏威，则大威至。无狎[xiá]其所居，无厌其所生。夫唯不厌，是以不厌。是以圣人自知不自见，自爱不自贵，故去彼取此。"],
}
ZhanGuoBookPageModule[73]={
"index":"战国策",
"name":"第七十三章·天网恢恢",
"content":["勇于敢则杀，勇于不敢则活。此两者或利或害。天之所恶，孰知其故，是以圣人犹难之。天之道，不争而善胜，不言而善应，不召而自来，繟[chǎn]然而善谋。天网恢恢，疏而不失。"],
}
ZhanGuoBookPageModule[74]={
"index":"战国策",
"name":"第七十四章·民不畏死",
"content":["民不畏死，奈何以死惧之。若使民常畏死，而为奇者，吾得执而杀之，孰敢。常有司杀者杀，夫代司杀者杀，是谓代大匠斲[zhuó]，夫代大匠斲者，希有不伤其手矣。"],
}
ZhanGuoBookPageModule[75]={
"index":"战国策",
"name":"第七十五章·民之轻死",
"content":["民之饥，以其上食税之多，是以饥。民之难治，以其上之有为，是以难治。民之轻死，以其上求生之厚，是以轻死。夫唯无以生为者，是贤于贵生。"],
}
ZhanGuoBookPageModule[76]={
"index":"战国策",
"name":"第七十六章·柔弱处上",
"content":["人之生也柔弱，其死也坚强。万物草木之生也柔脆，其死也枯槁。故坚强者死之徒，柔弱者生之徒。是以兵强则不胜，木强则兵。强大处下，柔弱处上。"],
}
ZhanGuoBookPageModule[77]={
"index":"战国策",
"name":"第七十七章·功成不处",
"content":["天之道，其犹张弓欤[yú]。高者抑之，下者举之﹔有余者损之，不足者补之。天之道，损有余而补不足；人之道则不然，损不足以奉有余。孰能有余以奉天下？唯有道者。是以圣人为而不恃，功成而不处，其不欲见贤。"],
}
ZhanGuoBookPageModule[78]={
"index":"战国策",
"name":"第七十八章·柔之胜刚",
"content":["天下莫柔弱于水，而攻坚强者莫之能胜，以其无以易之。弱之胜强，柔之胜刚，天下莫不知，莫能行。是以圣人云：受国之垢，是谓社稷主﹔受国不祥，是为天下王。正言若反。"],
}
ZhanGuoBookPageModule[79]={
"index":"战国策",
"name":"第七十九章·报怨以德",
"content":["和大怨，必有余怨，安可以为善。是以圣人执左契，而不责于人。有德司契，无德司彻。天道无亲，常与善人。"],
}
ZhanGuoBookPageModule[80]={
"index":"战国策",
"name":"第八十章·小国寡民",
"content":["小国寡民。使有什伯之器而不用﹔使民重死而不远徙。虽有舟舆[yú]，无所乘之；虽有甲兵，无所陈之；使民复结绳而用之。甘其食，美其服，安其居，乐其俗。邻国相望，鸡犬之声相闻，民至老死不相往来。"],
}
ZhanGuoBookPageModule[81]={
"index":"战国策",
"name":"第八十一章·为而不争",
"content":["信言不美，美言不信。善者不辩，辩者不善。知者不博，博者不知。圣人不积，既以为人己愈有，既以与人己愈多。天之道，利而不害﹔圣人之道，为而不争。"],
}
*/
module.exports={ZhanGuoBookPageModule:ZhanGuoBookPageModule}