
import React, {Component} from 'react';

var 	FontTypeModule =  {

"太阳":["a", '#F3502A', '#FCE9E4'],
"月亮":["b", '#F8B616', '#FEF8D3'],
"水星":["c", '#64B7F7', '#EAF6FF'],
"金星":["d", '#FFDE00', '#FFFCE7'],
"木星":["e", '#ED4D27', '#FFDBD1'],
"火星":["f", '#6EB020', '#F0FCEB'],
"土星":["g", '#795136', '#E7E0DB'],
"天王":["h", '#5A1C9F', '#E1D5FF'],
"海王":["i", '#66BDFA', '#E0EEF8'],
"冥王":["j", '#4E4E4E', '#E9E9E9'],
"北交":["t", '#4E4E4E', '#FBFBFB'],
"南交":["u", '#4E4E4E', '#FBFBFB'],


"白羊":["A",'#F3502A', '#FCE9E4'],
"金牛":["B",'#826852', '#E6DBD4'],
"双子":["C",'#09316D', '#EAF6FF'],
"巨蟹":["D",'#00C0FF', '#F0F9FF'],
"狮子":["E",'#F3502A', '#FCE9E4'],
"处女":["F",'#826852', '#E6DBD4'],
"天平":["G",'#456694', '#EAF6FF'],
"天蝎":["H",'#00C0FF', '#F0F9FF'],
"射手":["I",'#F3502A', '#FCE9E4'],
"摩羯":["J",'#826852', '#E6DBD4'],
"水瓶":["K",'#09316D', '#EAF6FF'],
"双鱼":["L",'#00C0FF', '#F0F9FF'],

"一宫":[1,'#3dd1e0','#e2f8fa'],
"二宫":[2,'#3dd1e0','#e2f8fa'],
"三宫":[3,'#3dd1e0','#e2f8fa'],
"四宫":[4,'#3dd1e0','#e2f8fa'],
"五宫":[5,'#3dd1e0','#e2f8fa'],
"六宫":[6,'#3dd1e0','#e2f8fa'],
"七宫":[7,'#3dd1e0','#e2f8fa'],
"八宫":[8,'#3dd1e0','#e2f8fa'],
"九宫":[9,'#3dd1e0','#e2f8fa'],
"十宫":[10,'#3dd1e0','#e2f8fa'],
"十一":[11,'#3dd1e0','#e2f8fa'],
"十二":[12,'#3dd1e0','#e2f8fa'],

}



module.exports=FontTypeModule;  