
import React, {Component} from 'react';

var six_random_NaJia 	= new Array();
/*
---
---
---
---
---
---
*/
six_random_NaJia["000000"] = {
"name":"乾为天",
"p":"乾宫",
"1":"父母壬戌土 世",
"2":"兄弟壬申金",
"3":"官鬼壬午火",
"4":"父母甲辰土 应",
"5":"妻财甲寅木",
"6":"子孙甲子水",
"extname":"《易经》第一卦 乾 乾为天 乾上乾下",
"extnameexp":"乾：元，亨，利，贞。",
"extexp":"",
"ext":"",
"exp1":"初九：潜龙，勿用。",
"exp2":"",
"exp3":"九二：见龙再田，利见大人。",
"exp4":"",
"exp5":"九三：君子终日乾乾，夕惕若，厉无咎。",
"exp6":"",
"exp7":"九四：或跃在渊，无咎。",
"exp8":"",
"exp9":"九五：飞龙在天，利见大人。",
"exp10":"",
"exp11":"上九：亢龙有悔。",
"exp12":"用九：见群龙无首，吉。"
}
/*
---
---
---
---
---
- -
*/
six_random_NaJia["000001"] = {
"name":"天风姤",
"p":"乾宫",
"1":"父母壬戌土",
"2":"兄弟壬申金",
"3":"官鬼壬午火 应",
"4":"兄弟辛酉金",
"5":"子孙辛亥水",
"6":"父母辛丑土 世",
"f5":"妻财寅木",
"extname":"《易经》第四十四卦 姤 天风姤 乾上巽下",
"extnameexp":"姤：女壮，勿用取女。",
"extexp":"彖曰：姤，遇也，柔遇刚也。勿用取女，不可与长也。 天地相遇，品物咸章也。 刚遇中正，天下大行也。 姤之时义大矣哉！",
"ext":"象曰：天下有风，姤；后以施命诰四方。",
"exp1":"初六：系于金柅，贞吉，有攸往，见凶，羸豕踟躅。",
"exp2":"象曰：系于金柅，柔道牵也。",
"exp3":"九二：包有鱼，无咎，不利宾。",
"exp4":"象曰：包有鱼，义不及宾也。",
"exp5":"九三：臀无肤，其行次且，厉，无大咎。",
"exp6":"象曰：其行次且，行未牵也。",
"exp7":"九四：包无鱼，起凶。",
"exp8":"象曰：无鱼之凶，远民也。",
"exp9":"九五：以杞包瓜，含章，有陨自天。",
"exp10":"象曰：九五含章，中正也。 有陨自天，志不舍命也。",
"exp11":"上九：姤其角，吝，无咎。",
"exp12":"象曰：姤其角，上穷吝也。" 
}
/*
---
---
---
---
- -
- -
*/
six_random_NaJia["000011"] = {
"name":"天山遁",
"p":"乾宫",
"1":"父母壬戌土",
"2":"兄弟壬申金 应",
"3":"官鬼壬午火",
"4":"兄弟丙申金",
"5":"官鬼丙午火 世",
"6":"父母丙辰土",
"f5":"妻财寅木",
"f6":"子孙子水",
"extname":"《易经》第三十三卦 遯 天山遁 乾上艮下 ",
"extnameexp":"遯：亨，小利贞。",
"extexp":"彖曰：遯亨，遯而亨也。 刚当位而应，与时行也。 小利贞，浸而长也。遯之时义大矣哉！",
"ext":"象曰：天下有山，遯；君子以远小人，不恶而严。",
"exp1":"初六：遯尾，厉，勿用有攸往。",
"exp2":"象曰：遯尾之厉，不往何灾也。",
"exp3":"六二：执之用黄牛之革，莫之胜说。",
"exp4":"象曰：执用黄牛，固志也。",
"exp5":"九三：系遯，有疾厉，畜臣妾吉。",
"exp6":"象曰：系遯之厉，有疾惫也。 畜臣妾吉，不可大事也。",
"exp7":"九四：好遯君子吉，小人否。",
"exp8":"象曰：君子好遯，小人否也。",
"exp9":"九五：嘉遯，贞吉。",
"exp10":"象曰：嘉遯贞吉，以正志也。",
"exp11":"上九：肥遯，无不利。",
"exp12":"象曰：肥遯，无不利；无所疑也。" 
}
/*
---
---
---
- -
- -
- -
*/
six_random_NaJia["000111"] = {
"name":"天地否",
"p":"乾宫",
"1":"父母壬戌土 应",
"2":"兄弟壬申金",
"3":"官鬼壬午火",
"4":"妻财乙卯木 世",
"5":"官鬼乙巳火",
"6":"父母乙未土",
"f6":"子孙子水",
"extname":"《易经》第十二卦 否 天地否 乾上坤下",
"extnameexp":"否：否之匪人，不利君子贞，大往小来。",
"extexp":"彖曰：否之匪人，不利君子贞。 大往小来， 则是天地不交，而万物不通也；上下不交，而天下无邦也。内阴而外阳，内柔而外刚，内小人而外君子。 小人道长，君子道消也。",
"ext":"象曰：天地不交，否；君子以俭德辟难，不可荣以禄。",
"exp1":"初六：拔茅茹，以其夤，贞吉亨。",
"exp2":"象曰：拔茅贞吉，志在君也。",
"exp3":"六二：包承。 小人吉，大人否亨。",
"exp4":"象曰：大人否亨，不乱群也。",
"exp5":"六三：包羞。",
"exp6":"象曰：包羞，位不当也。",
"exp7":"九四：有命无咎，畴离祉。",
"exp8":"象曰：有命无咎，志行也。",
"exp9":"九五：休否，大人吉。 其亡其亡，系于苞桑。",
"exp10":"象曰：大人之吉，位正当也。",
"exp11":"上九：倾否，先否后喜。",
"exp12":"象曰：否终则倾，何可长也。" 
}
/*
---
---
- -
- -
- -
- -
*/
six_random_NaJia["001111"] = {
"name":"风地观",
"p":"乾宫",
"1":"妻财辛卯木",
"2":"官鬼辛巳火",
"3":"父母辛未土 世",
"4":"妻财乙卯木",
"5":"官鬼乙巳火",
"6":"父母乙未土 应",
"f2":"兄弟申金",
"f6":"子孙子水",
"extname":"《易经》第二十卦 观 风地观 巽上坤下",
"extnameexp":"观：盥而不荐，有孚颙若。",
"extexp":"彖曰：大观在上，顺而巽，中正以观天下。观，盥而不荐，有孚颙若，下观而化也。 观天之神道，而四时不忒， 圣人以神道设教，而天下服矣。",
"ext":"象曰：风行地上，观；先王以省方，观民设教。",
"exp1":"初六：童观，小人无咎，君子吝。",
"exp2":"象曰：初六童观，小人道也。",
"exp3":"六二：窥观，利女贞。",
"exp4":"象曰：窥观女贞，亦可丑也。",
"exp5":"六三：观我生，进退。",
"exp6":"象曰：观我生，进退；未失道也。",
"exp7":"六四：观国之光，利用宾于王。",
"exp8":"象曰：观国之光，尚宾也。",
"exp9":"九五：观我生，君子无咎。",
"exp10":"象曰：观我生，观民也。",
"exp11":"上九：观其生，君子无咎。",
"exp12":"象曰：观其生，志未平也。" 
}
/*
---
- -
- -
- -
- -
- -
*/
six_random_NaJia["011111"] = {
"name":"山地剥",
"p":"乾宫",
"1":"妻财丙寅木",
"2":"子孙丙子水 世",
"3":"父母丙戌土",
"4":"妻财乙卯木",
"5":"官鬼乙巳火 应",
"6":"父母乙未土",
"f2":"兄弟申金",
"extname":"《易经》第二十三卦 剥 山地剥 艮上坤下",
"extnameexp":"剥：不利有攸往。",
"extexp":"彖曰：剥，剥也，柔变刚也。 不利有攸往，小人长也。 顺而止之，观象也。 君子尚消息盈虚，天行也。",
"ext":"象曰：山附地上，剥；上以厚下，安宅。",
"exp1":"初六：剥牀以足，蔑贞凶。",
"exp2":"象曰：剥牀以足，以灭下也。",
"exp3":"六二：剥牀以辨，蔑贞凶。",
"exp4":"象曰：剥牀以辨，未有与也。",
"exp5":"六三：剥之，无咎。",
"exp6":"象曰：剥之无咎，失上下也。",
"exp7":"六四：剥牀以肤，凶。",
"exp8":"象曰：剥牀以肤，切近灾也。",
"exp9":"六五：贯鱼，以宫人宠，无不利。",
"exp10":"象曰：以宫人宠，终无尤也。",
"exp11":"上九：硕果不食，君子得舆，小人剥庐。",
"exp12":"象曰：君子得舆，民所载也。 小人剥庐，终不可用也。" 
}
/*
---
- -
---
- -
- -
- -
*/
six_random_NaJia["010111"] = {
"name":"火地晋",
"p":"乾宫",
"1":"官鬼己巳火",
"2":"父母己未土",
"3":"兄弟己酉金 世",
"4":"妻财乙卯木",
"5":"官鬼乙巳火",
"6":"父母乙未土 应",
"f6":"子孙子水",
"extname":"《易经》第三十五卦 晋 火地晋 离上坤下 ",
"extnameexp":"晋：康侯用锡马蕃庶，昼日三接。",
"extexp":"彖曰：晋，进也。 明出地上，顺而丽乎大明，柔进而上行。 是以康侯用锡马蕃庶，昼日三接也。",
"ext":"象曰：明出地上，晋；君子以自昭明德。",
"exp1":"初六：晋如，摧如，贞吉。 罔孚，裕无咎。",
"exp2":"象曰：晋如，摧如；独行正也。 裕无咎；未受命也。",
"exp3":"六二：晋如，愁如，贞吉。 受兹介福，于其王母。",
"exp4":"象曰：受之介福，以中正也。",
"exp5":"六三：众允，悔亡。",
"exp6":"象曰：众允之，志上行也。",
"exp7":"九四：晋如硕鼠，贞厉。",
"exp8":"象曰：硕鼠贞厉，位不当也。",
"exp9":"六五：悔亡，失得勿恤，往吉无不利。",
"exp10":"象曰：失得勿恤，往有庆也。",
"exp11":"上九：晋其角，维用伐邑，厉吉无咎，贞吝。",
"exp12":"象曰：维用伐邑，道未光也。" 
}
/*
---
- -
---
---
---
---
*/
six_random_NaJia["010000"] = {
"name":"火天大有",
"p":"乾宫",
"1":"官鬼己巳火 应",
"2":"父母己未土",
"3":"兄弟己酉金",
"4":"父母甲辰土 世",
"5":"妻财甲寅木",
"6":"子孙甲子水",
"extname":"《易经》第十四卦 大有 火天大有 离上乾下 ",
"extnameexp":"大有：元亨。 ",
"extexp":"彖曰：大有，柔得尊位，大中而上下应之，曰大有。其德刚健而文明，应乎天而时行，是以元亨。",
"ext":"象曰：火在天上，大有；君子以竭恶扬善，顺天休命。",
"exp1":"初九：无交害，匪咎，艰则无咎。",
"exp2":"象曰：大有初九，无交害也。",
"exp3":"九二：大车以载，有攸往，无咎。",
"exp4":"象曰：大车以载，积中不败也。",
"exp5":"九三：公用亨于天子，小人弗克。",
"exp6":"象曰：公用亨于天子，小人害也。",
"exp7":"九四：匪其彭，无咎。",
"exp8":"象曰：匪其彭，无咎；明辨晰也。",
"exp9":"六五：厥孚交如，威如；吉。",
"exp10":"象曰：厥孚交如，信以发志也。 威如之吉，易而无备也。",
"exp11":"上九：自天佑之，吉无不利。",
"exp12":"象曰：大有上吉，自天佑也。" 
}
/*
- -
---
---
- -
---
---
*/
six_random_NaJia["100100"] = {
"name":"兑为泽",
"p":"兑宫",
"1":"父母丁未土 世",
"2":"兄弟丁酉金",
"3":"子孙丁亥水",
"4":"父母丁丑土 应",
"5":"妻财丁卯木",
"6":"官鬼丁巳火",
"extname":"《易经》第五十八卦 兑 兑为泽 兑上兑下",
"extnameexp":"兑：亨，利贞。",
"extexp":"彖曰：兑，说也。 刚中而柔外，说以利贞，是以顺乎天，而应乎人。 说以先民，民忘其劳；说以犯难，民忘其死；说之大，民劝矣哉！",
"ext":"象曰：丽泽，兑；君子以朋友讲习。",
"exp1":"初九：和兑，吉。",
"exp2":"象曰：和兑之吉，行未疑也。",
"exp3":"九二：孚兑，吉，悔亡。",
"exp4":"象曰：孚兑之吉，信志也。",
"exp5":"六三：来兑，凶。",
"exp6":"象曰：来兑之凶，位不当也。",
"exp7":"九四：商兑，未宁，介疾有喜。",
"exp8":"象曰：九四之喜，有庆也。",
"exp9":"九五：孚于剥，有厉。",
"exp10":"象曰：孚于剥，位正当也。",
"exp11":"上六：引兑。",
"exp12":"象曰：上六引兑，未光也。" 
}
/*
- -
---
---
- -
---
- -
*/
six_random_NaJia["100101"] = {
"name":"泽水困",
"p":"兑宫",
"1":"父母丁未土",
"2":"兄弟丁酉金",
"3":"子孙丁亥水 应",
"4":"官鬼戊午火",
"5":"父母戊辰土",
"6":"妻财戊寅木 世",
"extname":"《易经》第四十七卦 困 泽水困 兑上坎下",
"extnameexp":"困：亨，贞，大人吉，无咎，有言不信。",
"extexp":"彖曰：困，刚掩也。 险以说，困而不失其所，亨；其唯君子乎？ 贞大人吉，以刚中也。 有言不信，尚口乃穷也。",
"ext":"象曰：泽无水，困；君子以致命遂志。",
"exp1":"初六：臀困于株木，入于幽谷，三岁不见。",
"exp2":"象曰：入于幽谷，幽不明也。",
"exp3":"九二：困于酒食，朱绂方来，利用亨祀，征凶，无咎。",
"exp4":"象曰：困于酒食，中有庆也。",
"exp5":"六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。",
"exp6":"象曰：据于蒺藜，乘刚也。 入于其宫，不见其妻，不祥也。",
"exp7":"九四：来徐徐，困于金车，吝，有终。",
"exp8":"象曰：来徐徐，志在下也。 虽不当位，有与也。",
"exp9":"九五：劓刖，困于赤绂，乃徐有说，利用祭祀。",
"exp10":"象曰：劓刖，志未得也。乃徐有说，以中直也。利用祭祀，受福也。",
"exp11":"上六：困于葛藟，于臲靰，曰动悔。 有悔，征吉。",
"exp12":"象曰：困于葛藟，未当也。 动悔，有悔吉，行也。" 
}
/*
- -
---
---
- -
- -
- -
*/
six_random_NaJia["100111"] = {
"name":"泽地萃",
"p":"兑宫",
"1":"父母丁未土",
"2":"兄弟丁酉金 应",
"3":"子孙丁亥水",
"4":"妻财乙卯木",
"5":"官鬼乙巳火 世",
"6":"父母乙未土",
"extname":"《易经》第四十五卦 萃 泽地萃 兑上坤下",
"extnameexp":"萃：亨。 王假有庙，利见大人，亨，利贞。 用大牲吉，利有攸往。",
"extexp":"彖曰：萃，聚也；顺以说，刚中而应，故聚也。王假有庙，致孝享也。利见大人亨，聚以正也。 用大牲吉，利有攸往，顺天命也。 观其所聚，而天地万物之情可见矣。",
"ext":"象曰：泽上於地，萃；君子以除戎器，戒不虞。",
"exp1":"初六：有孚不终，乃乱乃萃，若号一握为笑，勿恤，往无咎。",
"exp2":"象曰：乃乱乃萃，其志乱也。",
"exp3":"六二：引吉，无咎，孚乃利用禴。",
"exp4":"象曰：引吉无咎，中未变也。",
"exp5":"六三：萃如，嗟如，无攸利，往无咎，小吝。",
"exp6":"象曰：往无咎，上巽也。",
"exp7":"九四：大吉，无咎。",
"exp8":"象曰：大吉无咎，位不当也。",
"exp9":"九五：萃有位，无咎。 匪孚，元永贞，悔亡。",
"exp10":"象曰：萃有位，志未光也。",
"exp11":"上六：齎咨涕洟，无咎。",
"exp12":"象曰：齎咨涕洟，未安上也。" 
}
/*
- -
---
---
---
- -
- -
*/
six_random_NaJia["100011"] = {
"name":"泽山咸",
"p":"兑宫",
"1":"父母丁未土 应",
"2":"兄弟丁酉金",
"3":"子孙丁亥水",
"4":"兄弟丙申金 世",
"5":"官鬼丙午火",
"6":"父母丙辰土",
"f5":"妻财寅木",
"extname":"《易经》第三十一卦 咸 泽山咸 兑上艮下",
"extnameexp":"咸：亨，利贞，取女吉。",
"extexp":"彖曰：咸，感也。柔上而刚下，二气感应以相与，止而说，男下女，是以亨利贞，取女吉也。天地感而万物化生，圣人感人心而天下和平；观其所感，而天地万物之情可见矣！",
"ext":"象曰：山上有泽，咸；君子以虚受人。",
"exp1":"初六：咸其拇。",
"exp2":"象曰：咸其拇，志在外也。",
"exp3":"六二：咸其腓，凶，居吉。",
"exp4":"象曰：虽凶，居吉，顺不害也。",
"exp5":"九三：咸其股，执其随，往吝。",
"exp6":"象曰：咸其股，亦不处也。 志在随人，所执下也。",
"exp7":"九四：贞吉悔亡，憧憧往来，朋从尔思。",
"exp8":"象曰：贞吉悔亡，未感害也。 憧憧往来，未光大也。",
"exp9":"九五：咸其脢，无悔。",
"exp10":"象曰：咸其脢，志末也。",
"exp11":"上六：咸其辅，颊，舌。",
"exp12":"象曰：咸其辅，颊，舌，滕口说也。" 
}
/*
- -
---
- -
---
- -
- -
*/
six_random_NaJia["101011"] = {
"name":"水山蹇",
"p":"兑宫",
"1":"子孙戊子水",
"2":"父母戊戌土",
"3":"兄弟戊申金 世",
"4":"兄弟丙申金",
"5":"官鬼丙午火",
"6":"父母丙辰土 应",
"f5":"妻财卯木",
"extname":"《易经》第三十九卦 蹇 水山蹇 坎上艮下 ",
"extnameexp":"蹇：利西南，不利东北；利见大人，贞吉。",
"extexp":"彖曰：蹇，难也，险在前也。 见险而能止，知矣哉！蹇利西南， 往得中也；不利东北，其道穷也。 利见大人，往有功也。 当位贞吉，以正邦也。 蹇之时用大矣哉！",
"ext":"象曰：山上有水，蹇；君子以反身修德。",
"exp1":"初六：往蹇，来誉。",
"exp2":"象曰：往蹇来誉，宜待也。",
"exp3":"六二：王臣蹇蹇，匪躬之故。",
"exp4":"象曰：王臣蹇蹇，终无尤也。",
"exp5":"九三：往蹇来反。",
"exp6":"象曰：往蹇来反，内喜之也。",
"exp7":"六四：往蹇来连。",
"exp8":"象曰：往蹇来连，当位实也。",
"exp9":"九五：大蹇朋来。",
"exp10":"象曰：大蹇朋来，以中节也。",
"exp11":"上六：往蹇来硕，吉；利见大人。",
"exp12":"象曰：往蹇来硕，志在内也。 利见大人，以从贵也。" 
}
/*
- -
- -
- -
---
- -
- -
*/
six_random_NaJia["111011"] = {
"name":"地山谦",
"p":"兑宫",
"1":"兄弟癸酉金",
"2":"子孙癸亥水 世",
"3":"父母癸丑土",
"4":"兄弟丙申金",
"5":"官鬼丙午火 应",
"6":"父母丙辰土",
"f5":"妻财卯木",
"extname":"《易经》第十五卦 谦 地山谦 坤上艮下",
"extnameexp":"谦：亨，君子有终。",
"extexp":"彖曰：谦，亨，天道下济而光明，地道卑而上行。天道亏盈而益谦，地道变盈而流谦，鬼神害盈而福谦，人道恶盈而好谦。谦尊而光，卑而不可踰，君子之终也。",
"ext":"象曰：地中有山，谦；君子以裒多益寡，称物平施。",
"exp1":"初六：谦谦君子，用涉大川，吉。",
"exp2":"象曰：谦谦君子，卑以自牧也。",
"exp3":"六二：鸣谦，贞吉。",
"exp4":"象曰：鸣谦贞吉，中心得也。",
"exp5":"九三：劳谦君子，有终吉。",
"exp6":"象曰：劳谦君子，万民服也。",
"exp7":"六四：无不利，撝谦。",
"exp8":"象曰：无不利，撝谦；不违则也。",
"exp9":"六五：不富，以其邻，利用侵伐，无不利。",
"exp10":"象曰：利用侵伐，征不服也。",
"exp11":"上六：鸣谦，利用行师，征邑国。",
"exp12":"象曰：鸣谦，志未得也。 可用行师，征邑国也。" 
}
/*
- -
- -
---
---
- -
- -
*/
six_random_NaJia["110011"] = {
"name":"雷山小过",
"p":"兑宫",
"1":"父母庚戌土",
"2":"兄弟庚申金",
"3":"官鬼庚午火 世",
"4":"兄弟丙申金",
"5":"官鬼丙午火",
"6":"父母丙辰土 应",
"f5":"妻财卯木",
"extname":"《易经》第六十二卦 小过 雷山小过 震上艮下",
"extnameexp":"小过：亨，利贞，可小事，不可大事。飞鸟遗之音，不宜上宜下，大吉。",
"extexp":"彖曰：小过，小者过而亨也。 过以利贞，与时行也。 柔得中，是以小事吉也。 刚失位而不中，是以不可大事也。 有飞鸟之象焉，有飞鸟遗之音，不宜上宜下，大吉；上逆而下顺也。",
"ext":"象曰：山上有雷，小过；君子以行过乎恭，丧过乎哀，用过乎俭。",
"exp1":"初六：飞鸟以凶。",
"exp2":"象曰：飞鸟以凶，不可如何也。",
"exp3":"六二：过其祖，遇其妣；不及其君，遇其臣；无咎。",
"exp4":"象曰：不及其君，臣不可过也。",
"exp5":"九三：弗过防之，从或戕之，凶。",
"exp6":"象曰：从或戕之，凶如何也。",
"exp7":"九四：无咎，弗过遇之。 往厉必戒，勿用永贞。",
"exp8":"象曰：弗过遇之，位不当也。 往厉必戒，终不可长也。",
"exp9":"六五：密云不雨，自我西郊，公弋取彼在穴。",
"exp10":"象曰：密云不雨，已上也。",
"exp11":"上六：弗遇过之，飞鸟离之，凶，是谓灾眚。",
"exp12":"象曰：弗遇过之，已亢也。" 
}
/*
- -
- -
---
- -
---
---
*/
six_random_NaJia["110100"] = {
"name":"雷泽归妹",
"p":"兑宫",
"1":"父母庚戌土 应",
"2":"兄弟庚申金",
"3":"官鬼庚午火",
"4":"父母丁丑土 世",
"5":"妻财丁卯木",
"6":"官鬼丁巳火",
"f3":"子孙亥水",
"extname":"《易经》第五十四卦 归妹 雷泽归妹 震上兑下",
"extnameexp":"归妹：征凶，无攸利。",
"extexp":"彖曰：归妹，天地之大义也。天地不交，而万物不兴，归妹人之终始也。说以动，所归妹也。 征凶，位不当也。 无攸利，柔乘刚也。",
"ext":"象曰：泽上有雷，归妹；君子以永终知敝。",
"exp1":"初九：归妹以娣，跛能履，征吉。",
"exp2":"象曰：归妹以娣，以恒也。 跛能履吉，相承也。",
"exp3":"九二：眇能视，利幽人之贞。",
"exp4":"象曰：利幽人之贞，未变常也。",
"exp5":"六三：归妹以须，反归以娣。",
"exp6":"象曰：归妹以须，未当也。",
"exp7":"九四：归妹愆期，迟归有时。",
"exp8":"象曰：愆期之志，有待而行也。",
"exp9":"六五：帝乙归妹，其君之袂，不如其娣之袂良，月几望，吉。",
"exp10":"象曰：帝乙归妹，不如其娣之袂良也。 其位在中，以贵行也。",
"exp11":"上六：女承筐无实，士刲羊无血，无攸利。",
"exp12":"象曰：上六无实，承虚筐也。" 
}
/*
---
- -
---
---
- -
---
*/
six_random_NaJia["010010"] = {
"name":"离为火",
"p":"离宫",
"1":"兄弟己巳火 世",
"2":"子孙己未土",
"3":"妻财己酉金",
"4":"官鬼己亥水 应",
"5":"子孙己丑土",
"6":"父母己卯木",
"extname":"《易经》第三十卦 离 离为火 离上离下",
"extnameexp":"离：利贞，亨。 畜牝牛，吉。",
"extexp":"彖曰：离，丽也；日月丽乎天，百谷草木丽乎土，重明以丽乎正，乃化成天下。 柔丽乎中正，故亨；是以畜牝牛吉也。",
"ext":"象曰：明两作离，大人以继明照于四方。",
"exp1":"初九：履错然，敬之无咎。",
"exp2":"象曰：履错之敬，以辟咎也。",
"exp3":"六二：黄离，元吉。",
"exp4":"象曰：黄离元吉，得中道也。",
"exp5":"九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。",
"exp6":"象曰：日昃之离，何可久也。",
"exp7":"九四：突如其来如，焚如，死如，弃如。",
"exp8":"象曰：突如其来如，无所容也。",
"exp9":"六五：出涕沱若，戚嗟若，吉。",
"exp10":"象曰：六五之吉，离王公也。",
"exp11":"上九：王用出征，有嘉折首，获其匪丑，无咎。",
"exp12":"象曰：王用出征，以正邦也。" 
}
/*
---
- -
---
---
- -
- -
*/
six_random_NaJia["010011"] = {
"name":"火山旅",
"p":"离宫",
"1":"兄弟己巳火",
"2":"子孙己未土",
"3":"妻财己酉金 应",
"4":"妻财丙申金",
"5":"兄弟丙午火",
"6":"子孙丙辰土 世",
"f5":"官鬼亥水",
"f6":"父母卯木",
"extname":"《易经》第五十六卦 旅 火山旅 离上艮下",
"extnameexp":"旅：小亨，旅贞吉。",
"extexp":"彖曰：旅，小亨，柔得中乎外，而顺乎刚，止而丽乎明，是以小亨，旅贞吉也。 旅之时义大矣哉！",
"ext":"象曰：山上有火，旅；君子以明慎用刑，而不留狱。",
"exp1":"初六：旅琐琐，斯其所取灾。",
"exp2":"象曰：旅琐琐，志穷灾也。",
"exp3":"六二：旅即次，怀其资，得童仆贞。",
"exp4":"象曰：得童仆贞，终无尤也。",
"exp5":"九三：旅焚其次，丧其童仆，贞厉。",
"exp6":"象曰：旅焚其次，亦以伤矣。 以旅与下，其义丧也。",
"exp7":"九四：旅于处，得其资斧，我心不快。",
"exp8":"象曰：旅于处，未得位也。 得其资斧，心未快也。",
"exp9":"六五：射雉一矢亡，终以誉命。",
"exp10":"象曰：终以誉命，上逮也。",
"exp11":"上九：鸟焚其巢，旅人先笑后号啕。 丧牛于易，凶。",
"exp12":"象曰：以旅在上，其义焚也。 丧牛于易，终莫之闻也。" 
}
/*
---
- -
---
---
---
- -
*/
six_random_NaJia["010001"] = {
"name":"火风鼎",
"p":"离宫",
"1":"兄弟己巳火",
"2":"子孙己未土 应",
"3":"妻财己酉金",
"4":"妻财辛酉金",
"5":"官鬼辛亥水 世",
"6":"子孙辛丑土",
"f6":"父母卯木",
"extname":"《易经》第五十卦 鼎 火风鼎 离上巽下",
"extnameexp":"鼎：元吉，亨。",
"extexp":"彖曰：鼎，象也。 以木巽火，亨饪也。 圣人亨以享上帝，而大亨以养圣贤。 巽而耳目聪明，柔进而上行，得中而应乎刚，是以元亨。",
"ext":"象曰：木上有火，鼎；君子以正位凝命。",
"exp1":"初六：鼎颠趾，利出否，得妾以其子，无咎。",
"exp2":"象曰：鼎颠趾，未悖也。 利出否，以从贵也。",
"exp3":"九二：鼎有实，我仇有疾，不我能即，吉。",
"exp4":"象曰：鼎有实，慎所之也。 我仇有疾，终无尤也。",
"exp5":"九三：鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。",
"exp6":"象曰：鼎耳革，失其义也。",
"exp7":"九四：鼎折足，覆公餗，其形渥，凶。",
"exp8":"象曰：覆公餗，信如何也。",
"exp9":"六五：鼎黄耳金铉，利贞。",
"exp10":"象曰：鼎黄耳，中以为实也。",
"exp11":"上九：鼎玉铉，大吉，无不利。",
"exp12":"象曰：玉铉在上，刚柔节也。" 
}
/*
---
- -
---
- -
---
- -
*/
six_random_NaJia["010101"] = {
"name":"火水未济",
"p":"离宫",
"1":"兄弟己巳火 应",
"2":"子孙己未土",
"3":"妻财己酉金",
"4":"兄弟戊午火 世",
"5":"子孙戊辰土",
"6":"父母戊寅木",
"f4":"官鬼亥水",
"extname":"《易经》第六十四卦 未济 火水未济 离上坎下",
"extnameexp":"未济：亨，小狐汔济，濡其尾，无攸利。",
"extexp":"彖曰：未济，亨；柔得中也。 小狐汔济，未出中也。 濡其尾，无攸利；不续终也。 虽不当位，刚柔应也。",
"ext":"象曰：火在水上，未济；君子以慎辨物居方。",
"exp1":"初六：濡其尾，吝。",
"exp2":"象曰：濡其尾，亦不知极也。",
"exp3":"九二：曳其轮，贞吉。",
"exp4":"象曰：九二贞吉，中以行正也。",
"exp5":"六三：未济，征凶，利涉大川。",
"exp6":"象曰：未济征凶，位不当也。",
"exp7":"九四：贞吉，悔亡，震用伐鬼方，三年有赏于大国。",
"exp8":"象曰：贞吉悔亡，志行也。",
"exp9":"六五：贞吉，无悔，君子之光，有孚，吉。",
"exp10":"象曰：君子之光，其晖吉也。",
"exp11":"上九：有孚于饮酒，无咎，濡其首，有孚失是。",
"exp12":"象曰：饮酒濡首，亦不知节也。" 
}
/*
---
- -
- -
- -
---
- -
*/
six_random_NaJia["011101"] = {
"name":"山水蒙",
"p":"离宫",
"1":"父母丙寅木",
"2":"官鬼丙子水",
"3":"子孙丙戌土 世",
"4":"兄弟戊午火",
"5":"子孙戊辰土",
"6":"父母戊寅木 应",
"f3":"妻财酉金",
"extname":"《易经》第四卦 蒙 山水蒙 艮上坎下",
"extnameexp":"蒙：亨。 匪我求童蒙，童蒙求我。 初噬告，再三渎，渎则不告。利贞。",
"extexp":"彖曰：蒙，山下有险，险而止，蒙。 蒙亨，以亨行时中也。匪我求童蒙，童蒙求我，志应也。 初噬告，以刚中也。再三渎， 渎则不告，渎蒙也。 蒙以养正，圣功也。",
"ext":"象曰：山下出泉，蒙；君子以果行育德。",
"exp1":"初六：发蒙，利用刑人，用说桎梏，以往吝。",
"exp2":"象曰：利用刑人，以正法也。",
"exp3":"九二：包蒙吉；纳妇吉；子克家。",
"exp4":"象曰：子克家，刚柔接也。",
"exp5":"六三：勿用娶女；见金夫，不有躬，无攸利。",
"exp6":"象曰：勿用娶女，行不顺也。",
"exp7":"六四：困蒙，吝。",
"exp8":"象曰：困蒙之吝，独远实也。",
"exp9":"六五：童蒙，吉。",
"exp10":"象曰：童蒙之吉，顺以巽也。",
"exp11":"上九：击蒙；不利为寇，利御寇。",
"exp12":"象曰：利用御寇，上下顺也。" 
}
/*
---
---
- -
- -
---
- -
*/
six_random_NaJia["001101"] = {
"name":"风水涣",
"p":"离宫",
"1":"父母辛卯木",
"2":"兄弟辛巳火 世",
"3":"子孙辛未土",
"4":"兄弟戊午火",
"5":"子孙戊辰土 应",
"6":"父母戊寅木",
"f3":"妻财酉金",
"f4":"官鬼亥水",
"extname":"《易经》第五十九卦 涣 风水涣 巽上坎下",
"extnameexp":"涣：亨。 王假有庙，利涉大川，利贞。",
"extexp":"彖曰：涣，亨。 刚来而不穷，柔得位乎外而上同。 王假有庙，王乃在中也。 利涉大川，乘木有功也。",
"ext":"象曰：风行水上，涣；先王以享于帝立庙。",
"exp1":"初六：用拯马壮，吉。",
"exp2":"象曰：初六之吉，顺也。",
"exp3":"九二：涣奔其机，悔亡。",
"exp4":"象曰：涣奔其机，得愿也。",
"exp5":"六三：涣其躬，无悔。",
"exp6":"象曰：涣其躬，志在外也。",
"exp7":"六四：涣其群，元吉。 涣有丘，匪夷所思。",
"exp8":"象曰：涣其群，元吉；光大也。",
"exp9":"九五：涣汗其大号，涣王居，无咎。",
"exp10":"象曰：王居无咎，正位也。",
"exp11":"上九：涣其血，去逖出，无咎。",
"exp12":"象曰：涣其血，远害也。" 
}
/*
---
---
---
- -
---
- -
*/
six_random_NaJia["000101"] = {
"name":"天水讼",
"p":"离宫",
"1":"子孙壬戌土",
"2":"妻财壬申金",
"3":"兄弟壬午火 世",
"4":"兄弟戊午火",
"5":"子孙戊辰土",
"6":"父母戊寅木 应",
"f4":"官鬼亥水",
"extname":"《易经》第六卦 讼 天水讼 乾上坎下",
"extnameexp":"讼：有孚，窒。 惕中吉。 终凶。 利见大人，不利涉大川。",
"extexp":"彖曰：讼，上刚下险，险而健讼。讼有孚窒，惕中吉，刚来而得中也。终凶；讼不可成也。 利见大人；尚中正也。不利涉大川；入于渊也。",
"ext":"象曰：天与水违行，讼；君子以作事谋始。",
"exp1":"初六：不永所事，小有言，终吉。",
"exp2":"象曰：不永所事，讼不可长也。 虽有小言，其辩明也。",
"exp3":"九二：不克讼，归而逋，其邑人三百户，无眚。",
"exp4":"象曰：不克讼，归而逋也。 自下讼上，患至掇也。",
"exp5":"六三：食旧德，贞厉，终吉，或从王事，无成。",
"exp6":"象曰：食旧德，从上吉也。",
"exp7":"九四：不克讼，复自命，渝安贞，吉。",
"exp8":"象曰：复即命，渝安贞；不失也。",
"exp9":"九五：讼元吉。",
"exp10":"象曰：讼元吉，以中正也。",
"exp11":"上九：或锡之鞶带，终朝三褫之。",
"exp12":"象曰：以讼受服，亦不足敬也。" 
}
/*
---
---
---
---
- -
---
*/
six_random_NaJia["000010"] = {
"name":"天火同人",
"p":"离宫",
"1":"子孙壬戌土 应",
"2":"妻财壬申金",
"3":"兄弟壬午火",
"4":"官鬼己亥水 世",
"5":"子孙己丑土",
"6":"父母己卯木",
"extname":"《易经》第十三卦 同人 天火同人 乾上离下 ",
"extnameexp":"同人：同人于野，亨。 利涉大川，利君子贞。",
"extexp":"彖曰：同人，柔得位得中，而应乎乾，曰同人。 同人曰，同人于野，亨。利涉大川，乾行也。 文明以健，中正而应，君子正也。 唯君子为能通天下之志。",
"ext":"象曰：天与火，同人；君子以类族辨物。",
"exp1":"初九：同人于门，无咎。",
"exp2":"象曰：出门同人，又谁咎也。",
"exp3":"六二：同人于宗，吝。",
"exp4":"象曰：同人于宗，吝道也。",
"exp5":"九三：伏戎于莽，升其高陵，三岁不兴。",
"exp6":"象曰：伏戎于莽，敌刚也。 三岁不兴，安行也。",
"exp7":"九四：乘其墉，弗克攻，吉。",
"exp8":"象曰：乘其墉，义弗克也，其吉，则困而反则也。",
"exp9":"九五：同人，先号啕而后笑。 大师克相遇。",
"exp10":"象曰：同人之先，以中直也。 大师相遇，言相克也。",
"exp11":"上九：同人于郊，无悔。",
"exp12":"象曰：同人于郊，志未得也。" 
}
/*
- -
- -
---
- -
- -
---
*/
six_random_NaJia["110110"] = {
"name":"震为雷",
"p":"震宫",
"1":"妻财庚戌土 世",
"2":"官鬼庚申金",
"3":"子孙庚午火",
"4":"妻财庚辰土 应",
"5":"兄弟庚寅木",
"6":"父母庚子水",
"extname":"《易经》第五十一卦 震 震为雷 震上震下",
"extnameexp":"震：亨。 震来虩虩，笑言哑哑。 震惊百里，不丧匕鬯。",
"extexp":"彖曰：震，亨。 震来虩虩，恐致福也。笑言哑哑，后有则也。 震惊百里，惊远而惧迩也。 出可以守宗庙社稷，以为祭主也。",
"ext":"象曰：洊雷，震；君子以恐惧修身。",
"exp1":"初九：震来虩虩，后笑言哑哑，吉。",
"exp2":"象曰：震来虩虩，恐致福也。 笑言哑哑，后有则也。",
"exp3":"六二：震来厉，亿丧贝，跻于九陵，勿逐，七日得。",
"exp4":"象曰：震来厉，乘刚也。",
"exp5":"六三：震苏苏，震行无眚。",
"exp6":"象曰：震苏苏，位不当也。",
"exp7":"九四：震遂泥。",
"exp8":"象曰：震遂泥，未光也。",
"exp9":"六五：震往来厉，亿无丧，有事。",
"exp10":"象曰：震往来厉，危行也。 其事在中，大无丧也。",
"exp11":"上六：震索索，视矍矍，征凶。 震不于其躬，于其邻，无咎。 婚媾有言。",
"exp12":"象曰：震索索，未得中也。 虽凶无咎，畏邻戒也。" 
}
/*
- -
- -
---
- -
- -
- -
*/
six_random_NaJia["110111"] = {
"name":"雷地豫",
"p":"震宫",
"1":"妻财庚戌土",
"2":"官鬼庚申金",
"3":"子孙庚午火 应",
"4":"兄弟乙卯木",
"5":"子孙乙巳火",
"6":"妻财乙未土 世",
"f6":"父母子水",
"extname":"《易经》第十六卦 豫 雷地豫 震上坤下 ",
"extnameexp":"豫：利建侯行师。",
"extexp":"彖曰：豫，刚应而志行，顺以动，豫。豫，顺以动，故天地如之，而况建侯行师乎？天地以顺动，故日月不过，而四时不忒；圣人以顺动，则刑罚清而民服。 豫之时义大矣哉！",
"ext":"象曰：雷出地奋，豫。 先王以作乐崇德，殷荐之上帝，以配祖考。",
"exp1":"初六：鸣豫，凶。",
"exp2":"象曰：初六鸣豫，志穷凶也。",
"exp3":"六二：介于石，不终日，贞吉。",
"exp4":"象曰：不终日，贞吉；以中正也。",
"exp5":"六三：盱豫，悔。 迟有悔。",
"exp6":"象曰：盱豫有悔，位不当也。",
"exp7":"九四：由豫，大有得。勿疑。 朋盍簪。",
"exp8":"象曰：由豫，大有得；志大行也。",
"exp9":"六五：贞疾，恒不死。",
"exp10":"象曰：六五贞疾，乘刚也。 恒不死，中未亡也。",
"exp11":"上六：冥豫，成有渝，无咎。",
"exp12":"象曰：冥豫在上，何可长也。"
}
/*
- -
- -
---
- -
---
- -
*/
six_random_NaJia["110101"] = {
"name":"雷水解",
"p":"震宫",
"1":"妻财庚戌土",
"2":"官鬼庚申金 应",
"3":"子孙庚午火",
"4":"子孙戊午火",
"5":"妻财戊辰土 世",
"6":"兄弟戊寅木",
"f6":"父母子水",
"extname":"《易经》第四十卦 解 雷水解 震上坎下",
"extnameexp":"解：利西南，无所往，其来复吉。 有攸往，夙吉。",
"extexp":"彖曰：解，险以动，动而免乎险，解。 解利西南，往得众也。其来复吉，乃得中也。有攸往夙吉，往有功也。 天地解，而雷雨作，雷雨作，而百果草木皆甲坼，解之时义大矣哉！",
"ext":"象曰：雷雨作，解；君子以赦过宥罪。",
"exp1":"初六：无咎。",
"exp2":"象曰：刚柔之际，义无咎也。",
"exp3":"九二：田获三狐，得黄矢，贞吉。",
"exp4":"象曰：九二贞吉，得中道也。",
"exp5":"六三：负且乘，致寇至，贞吝。",
"exp6":"象曰：负且乘，亦可丑也，自我致戎，又谁咎也。",
"exp7":"九四：解而拇，朋至斯孚。",
"exp8":"象曰：解而拇，未当位也。",
"exp9":"六五：君子维有解，吉；有孚于小人。",
"exp10":"象曰：君子有解，小人退也。",
"exp11":"上六：公用射隼，于高墉之上，获之，无不利。",
"exp12":"象曰：公用射隼，以解悖也。"
}
/*
- -
- -
---
---
---
- -
*/
six_random_NaJia["110001"] = {
"name":"雷风恒",
"p":"震宫",
"1":"妻财庚戌土 应",
"2":"官鬼庚申金",
"3":"子孙庚午火",
"4":"官鬼辛酉金 世",
"5":"父母辛亥水",
"6":"妻财辛丑土",
"f5":"兄弟寅木",
"extname":"《易经》第三十二卦 恒 雷风恒 震上巽下",
"extnameexp":"恒：亨，无咎，利贞，利有攸往。",
"extexp":"彖曰：恒，久也。 刚上而柔下，雷风相与，巽而动，刚柔皆应，恒。 恒，亨无咎，利贞； 久於其道也，天地之道，恒久而不已也。 利有攸往，终则有始也。日月得天，而能久照，四时变化，而能久成，圣人久於其道，而天下化成；观其所恒，而天地万物之情可见矣！！",
"ext":"象曰：雷风，恒；君子以立不易方。",
"exp1":"初六：浚恒，贞凶，无攸利。",
"exp2":"象曰：浚恒之凶，始求深也。",
"exp3":"九二：悔亡。",
"exp4":"象曰：九二悔亡，能久中也。",
"exp5":"九三：不恒其德，或承之羞，贞吝。",
"exp6":"象曰：不恒其德，无所容也。",
"exp7":"九四：田无禽。",
"exp8":"象曰：久非其位，安得禽也。",
"exp9":"六五：恒其德，贞，妇人吉，夫子凶。",
"exp10":"象曰：妇人贞吉，从一而终也。 夫子制义，从妇凶也。",
"exp11":"上六：振恒，凶。",
"exp12":"象曰：振恒在上，大无功也。"
}
/*
- -
- -
- -
---
---
- -
*/
six_random_NaJia["111001"] = {
"name":"地风升",
"p":"震宫",
"1":"官鬼癸酉金",
"2":"父母癸亥水",
"3":"妻财癸丑土 世",
"4":"官鬼辛酉金",
"5":"父母辛亥水",
"6":"妻财辛丑土 应",
"f3":"子孙午火",
"f5":"兄弟寅木",
"extname":"《易经》第四十六卦 升 地风升 坤上巽下",
"extnameexp":"升：元亨，用见大人，勿恤，南征吉。",
"extexp":"彖曰：柔以时升，巽而顺，刚中而应，是以大亨。用见大人，勿恤；有庆也。 南征吉，志行也。",
"ext":"象曰：地中生木，升；君子以顺德，积小以高大。",
"exp1":"初六：允升，大吉。",
"exp2":"象曰：允升大吉，上合志也。",
"exp3":"九二：孚乃利用禴，无咎。",
"exp4":"象曰：九二之孚，有喜也。",
"exp5":"九三：升虚邑。",
"exp6":"象曰：升虚邑，无所疑也。",
"exp7":"六四：王用亨于岐山，吉无咎。",
"exp8":"象曰：王用亨于岐山，顺事也。",
"exp9":"六五：贞吉，升阶。",
"exp10":"象曰：贞吉升阶，大得志也。",
"exp11":"上六：冥升，利于不息之贞。",
"exp12":"象曰：冥升在上，消不富也。"
}
/*
- -
---
- -
---
---
- -
*/
six_random_NaJia["101001"] = {
"name":"水风井",
"p":"震宫",
"1":"父母戊子水",
"2":"妻财戊戌土 世",
"3":"官鬼戊申金",
"4":"官鬼辛酉金",
"5":"父母辛亥水 应",
"6":"妻财辛丑土",
"f3":"子孙午火",
"f5":"兄弟寅木",
"extname":"《易经》第四十八卦 井 水风井 坎上巽下",
"extnameexp":"井：改邑不改井，无丧无得，往来井井。汔至，亦未繘井，羸其瓶，凶。",
"extexp":"彖曰：巽乎水而上水，井；井养而不穷也。改邑不改井，乃以刚中也。汔至亦未繘井，未有功也。 羸其瓶，是以凶也。",
"ext":"象曰：木上有水，井；君子以劳民劝相。",
"exp1":"初六：井泥不食，旧井无禽。",
"exp2":"象曰：井泥不食，下也。 旧井无禽，时舍也。",
"exp3":"九二：井谷射鲋，瓮敝漏。",
"exp4":"象曰：井谷射鲋，无与也。",
"exp5":"九三：井渫不食，为我民恻，可用汲，王明，并受其福。",
"exp6":"象曰：井渫不食，行恻也。 求王明，受福也。",
"exp7":"六四：井甃，无咎。",
"exp8":"象曰：井甃无咎，修井也。",
"exp9":"九五：井冽，寒泉食。",
"exp10":"象曰：寒泉之食，中正也。",
"exp11":"上六：井收勿幕，有孚无吉。",
"exp12":"象曰：元吉在上，大成也。"
}
/*
- -
---
---
---
---
- -
*/
six_random_NaJia["100001"] = {
"name":"泽风大过",
"p":"震宫",
"1":"妻财丁未土",
"2":"官鬼丁酉金",
"3":"父母丁亥水 世",
"4":"官鬼辛酉金",
"5":"父母辛亥水",
"6":"妻财辛丑土 应",
"f3":"子孙午火",
"f5":"兄弟寅木",
"extname":"《易经》第二十八卦 大过 泽风大过 兑上巽下 ",
"extnameexp":"大过：栋桡，利有攸往，亨。",
"extexp":"彖曰：大过，大者过也。 栋桡，本末弱也。 刚过而中，巽而说行，利有攸往，乃亨。 大过之时义大矣哉！",
"ext":"象曰：泽灭木，大过；君子以独立不惧，遯世无闷。",
"exp1":"初六：藉用白茅，无咎。",
"exp2":"象曰：藉用白茅，柔在下也。",
"exp3":"九二：枯杨生秭，老夫得其女妻，无不利。",
"exp4":"象曰：老夫女妻，过以相与也。",
"exp5":"九三：栋桡，凶。",
"exp6":"象曰：栋桡之凶，不可以有辅也。",
"exp7":"九四：栋隆，吉；有它吝。",
"exp8":"象曰：栋隆之吉，不桡乎下也。",
"exp9":"九五：枯杨生华，老妇得士夫，无咎无誉。",
"exp10":"象曰：枯杨生华，何可久也。 老妇士夫，亦可丑也。",
"exp11":"上六：过涉灭顶，凶，无咎。",
"exp12":"象曰：过涉之凶，不可咎也。"
}
/*
- -
---
---
- -
- -
---
*/
six_random_NaJia["100110"] = {
"name":"泽雷随",
"p":"震宫",
"1":"妻财丁未土 应",
"2":"官鬼丁酉金",
"3":"父母丁亥水",
"4":"妻财庚辰土 世",
"5":"兄弟庚寅木",
"6":"父母庚子水",
"f3":"子孙午火",
"extname":"《易经》第十七卦 随 泽雷随 兑上震下",
"extnameexp":"随：元亨利贞，无咎。",
"extexp":"彖曰：随，刚来而下柔，动而说，随。大亨贞，无咎，而天下随时，随之时义大矣哉！",
"ext":"象曰：泽中有雷，随；君子以晦入宴息。",
"exp1":"初九：官有渝，贞吉。 出门交有功。",
"exp2":"象曰：官有渝，从正吉也。 出门交有功，不失也。",
"exp3":"六二：系小子，失丈夫。",
"exp4":"象曰：系小子，弗兼与也。",
"exp5":"六三：系丈夫，失小子。 随有求得，利居贞。",
"exp6":"象曰：系丈夫，志舍下也。",
"exp7":"九四：随有获，贞凶。有孚在道，以明，何咎。 ",
"exp8":"象曰：随有获，其义凶也。 有孚在道，明功也。",
"exp9":"九五：孚于嘉，吉。",
"exp10":"象曰：孚于嘉，吉；位正中也。",
"exp11":"上六：拘系之，乃从维之。 王用亨于西山。",
"exp12":"象曰：拘系之，上穷也。"
}
/*
---
---
- -
---
---
- -
*/
six_random_NaJia["001001"] = {
"name":"巽为风",
"p":"巽宫",
"1":"兄弟辛卯木 世",
"2":"子孙辛巳火",
"3":"妻财辛未土",
"4":"官鬼辛酉金 应",
"5":"父母辛亥水",
"6":"妻财辛丑土",
"extname":"《易经》第五十七卦 巽 巽为风 巽上巽下",
"extnameexp":"巽：小亨，利攸往，利见大人。",
"extexp":"彖曰：重巽以申命，刚巽乎中正而志行。柔皆顺乎刚，是以小亨，利有攸往，利见大人。",
"ext":"象曰：随风，巽；君子以申命行事",
"exp1":"初六：进退，利武人之贞。",
"exp2":"象曰：进退，志疑也。 利武人之贞，志治也。",
"exp3":"九二：巽在□下，用史巫纷若，吉无咎。",
"exp4":"象曰：纷若之吉，得中也。",
"exp5":"九三：频巽，吝。",
"exp6":"象曰：频巽之吝，志穷也。",
"exp7":"六四：悔亡，田获三品。 ",
"exp8":"象曰：田获三品，有功也。",
"exp9":"九五：贞吉悔亡，无不利。 无初有终，先庚三日，后庚三日，吉。",
"exp10":"象曰：九五之吉，位正中也。",
"exp11":"上九：巽在牀下，丧其资斧，贞凶。",
"exp12":"象曰：巽在牀下，上穷也。 丧其资斧，正乎凶也。"
}
/*
---
---
- -
---
---
---
*/
six_random_NaJia["001000"] = {
"name":"风天小畜",
"p":"巽宫",
"1":"兄弟辛卯木",
"2":"子孙辛巳火",
"3":"妻财辛未土 应",
"4":"妻财甲辰土",
"5":"兄弟甲寅木",
"6":"父母甲子水 世",
"f4":"官鬼酉金",
"extname":"《易经》第九卦 小畜 风天小畜 巽上乾下",
"extnameexp":"小畜：亨。 密云不雨，自我西郊。",
"extexp":"彖曰：小畜； 柔得位，而上下应之，曰小畜。 健而巽，刚中而志行，乃亨。 密云不雨，尚往也。 自我西郊，施未行也。",
"ext":"象曰：风行天上，小畜；君子以懿文德。",
"exp1":"初九：复自道，何其咎，吉。",
"exp2":"象曰：复自道，其义吉也。",
"exp3":"九二：牵复，吉。",
"exp4":"象曰：牵复在中，亦不自失也。",
"exp5":"九三：舆说辐，夫妻反目。",
"exp6":"象曰：夫妻反目，不能正室也。",
"exp7":"六四：有孚，血去惕出，无咎。",
"exp8":"象曰：有孚惕出，上合志也。",
"exp9":"九五：有孚挛如，富以其邻。",
"exp10":"象曰：有孚挛如，不独富也。",
"exp11":"上九：既雨既处，尚德载，妇贞厉。 月几望，君子征凶。",
"exp12":"象曰：既雨既处，德积载也。 君子征凶，有所疑也。"
}
/*
---
---
- -
---
- -
---
*/
six_random_NaJia["001010"] = {
"name":"风火家人",
"p":"巽宫",
"1":"兄弟辛卯木",
"2":"子孙辛巳火 应",
"3":"妻财辛未土",
"4":"父母己亥水",
"5":"妻财己丑土 世",
"6":"兄弟己卯木",
"f4":"官鬼酉金",
"extname":"《易经》第三十七卦 家人 风火家人 巽上离下",
"extnameexp":"家人：利女贞。",
"extexp":"彖曰：家人，女正位乎内，男正位乎外，男女正，天地之大义也。家人有严君焉，父母之谓也。父父，子子，兄兄，弟弟，夫夫，妇妇，而家道正；正家而天下定矣。",
"ext":"象曰：风自火出，家人；君子以言有物，而行有恒。",
"exp1":"初九：闲有家，悔亡。",
"exp2":"象曰：闲有家，志未变也。",
"exp3":"六二：无攸遂，在中馈，贞吉。",
"exp4":"象曰：六二之吉，顺以巽也。",
"exp5":"九三：家人嗃嗃，悔厉吉；妇子嘻嘻，终吝。",
"exp6":"象曰：家人嗃嗃，未失也；妇子嘻嘻，失家节也。",
"exp7":"六四：富家，大吉。",
"exp8":"象曰：富家大吉，顺在位也。",
"exp9":"九五：王假有家，勿恤吉。",
"exp10":"象曰：王假有家，交相爱也。",
"exp11":"上九：有孚威如，终吉。",
"exp12":"象曰：威如之吉，反身之谓也。"
}
/*
---
---
- -
- -
- -
---
*/
six_random_NaJia["001110"] = {
"name":"风雷益",
"p":"巽宫",
"1":"兄弟辛卯木 应",
"2":"子孙辛巳火",
"3":"妻财辛未土",
"4":"妻财庚辰土 世",
"5":"兄弟庚寅木",
"6":"父母庚子水",
"f4":"官鬼酉金",
"extname":"《易经》第四十二卦 益 风雷益 巽上震下",
"extnameexp":"益：利有攸往，利涉大川。",
"extexp":"彖曰：益，损上益下，民说无疆，自上下下，其道大光。利有攸往，中正有庆。 利涉大川，木道乃行。 益动而巽，日进无疆。 天施地生，其益无方。 凡益之道，与时偕行。",
"ext":"象曰：风雷，益；君子以见善则迁，有过则改。",
"exp1":"初九：利用为大作，元吉，无咎。",
"exp2":"象曰：元吉无咎，下不厚事也。",
"exp3":"六二：或益之，十朋之龟弗克违，永贞吉。 王用享于帝，吉。",
"exp4":"象曰：或益之，自外来也。",
"exp5":"六三：益之用凶事，无咎。 有孚中行，告公用圭。",
"exp6":"象曰：益用凶事，固有之也。",
"exp7":"六四：中行，告公从。 利用为依迁国。",
"exp8":"象曰：告公从，以益志也。",
"exp9":"九五：有孚惠心，勿问元吉。 有孚惠我德。",
"exp10":"象曰：有孚惠心，勿问之矣。 惠我德，大得志也。",
"exp11":"上九：莫益之，或击之，立心勿恒，凶。",
"exp12":"象曰：莫益之，偏辞也。 或击之，自外来也。"
}
/*
---
---
---
- -
- -
---
*/
six_random_NaJia["000110"] = {
"name":"天雷无妄",
"p":"巽宫",
"1":"妻财壬戌土",
"2":"官鬼壬申金",
"3":"子孙壬午火 世",
"4":"妻财庚辰土",
"5":"兄弟庚寅木",
"6":"父母庚子水 应",
"extname":"《易经》第二十五卦 无妄 天雷无妄 乾上震下",
"extnameexp":"无妄：元，亨，利，贞。 其匪正有眚，不利有攸往。",
"extexp":"彖曰：无妄，刚自外来，而为主於内。动而健，刚中而应，大亨以正，天之命也。 其匪正有眚，不利有攸往。无妄之往，何之矣？ 天命不佑，行矣哉？ ",
"ext":"象曰：天下雷行，物与无妄；先王以茂对时，育万物。",
"exp1":"初九：无妄，往吉。",
"exp2":"象曰：无妄之往，得志也。",
"exp3":"六二：不耕获，不菑畲，则利有攸往。",
"exp4":"象曰：不耕获，未富也。",
"exp5":"六三：无妄之灾，或系之牛，行人之得，邑人之灾。",
"exp6":"象曰：行人得牛，邑人灾也。",
"exp7":"九四：可贞，无咎。",
"exp8":"象曰：可贞无咎，固有之也。",
"exp9":"九五：无妄之疾，勿药有喜。",
"exp10":"象曰：无妄之药，不可试也。",
"exp11":"上九：无妄，行有眚，无攸利。",
"exp12":"象曰：无妄之行，穷之灾也。"
}
/*
---
- -
---
- -
- -
---
*/
six_random_NaJia["010110"] = {
"name":"火雷噬嗑",
"p":"巽宫",
"1":"子孙己巳火",
"2":"妻财己未土 世",
"3":"官鬼己酉金",
"4":"妻财庚辰土",
"5":"兄弟庚寅木 应",
"6":"父母庚子水",
"extname":"《易经》第二十一卦 噬嗑 火雷噬嗑 离上震下",
"extnameexp":"噬嗑：亨。 利用狱。",
"extexp":"彖曰：颐中有物，曰噬嗑，噬嗑而亨。刚柔分，动而明，雷电合而章。柔得中而上行，虽不当位，利用狱也。",
"ext":"象曰：雷电噬嗑；先王以明罚敕法。",
"exp1":"初九：履校灭趾，无咎。",
"exp2":"象曰：履校灭趾，不行也。",
"exp3":"六二：噬肤灭鼻，无咎。",
"exp4":"象曰：噬肤灭鼻，乘刚也。",
"exp5":"六三：噬腊肉，遇毒；小吝，无咎。",
"exp6":"象曰：遇毒，位不当也。",
"exp7":"九四：噬乾胏，得金矢，利艰贞，吉。",
"exp8":"象曰：利艰贞吉，未光也。",
"exp9":"六五：噬乾肉，得黄金，贞厉，无咎。",
"exp10":"象曰：贞厉无咎，得当也。",
"exp11":"上九：何校灭耳，凶。",
"exp12":"象曰：何校灭耳，聪不明也。"
}
/*
---
- -
- -
- -
- -
---
*/
six_random_NaJia["011110"] = {
"name":"山雷颐",
"p":"巽宫",
"1":"兄弟丙寅木",
"2":"父母丙子水",
"3":"妻财丙戌土 世",
"4":"妻财庚辰土",
"5":"兄弟庚寅木",
"6":"父母庚子水 应",
"f2":"子孙巳火",
"f4":"官鬼酉金",
"extname":"《易经》第二十七卦 颐 山雷颐 艮上震下",
"extnameexp":"颐：贞吉。 观颐，自求口实。",
"extexp":"彖曰：颐贞吉，养正则吉也。 观颐，观其所养也； 自求口实，观其自养也。 天地养万物，圣人养贤，以及万民；颐之时义大矣哉！",
"ext":"象曰：山下有雷，颐；君子以慎言语，节饮食。",
"exp1":"初九：舍尔灵龟，观我朵颐，凶。",
"exp2":"象曰：观我朵颐，亦不足贵也。",
"exp3":"六二：颠颐，拂经，于丘颐，征凶。",
"exp4":"象曰：六二征凶，行失类也。",
"exp5":"六三：拂颐，贞凶，十年勿用，无攸利。",
"exp6":"象曰：十年勿用，道大悖也。",
"exp7":"六四：颠颐吉，虎视眈眈，其欲逐逐，无咎。",
"exp8":"象曰：颠颐之吉，上施光也。",
"exp9":"六五：拂经，居贞吉，不可涉大川。",
"exp10":"象曰：居贞之吉，顺以从上也。",
"exp11":"上九：由颐，厉吉，利涉大川。",
"exp12":"象曰：由颐厉吉，大有庆也。"
}
/*
---
- -
- -
---
---
- -
*/
six_random_NaJia["011001"] = {
"name":"山风蛊",
"p":"巽宫",
"1":"兄弟丙寅木 应",
"2":"父母丙子水",
"3":"妻财丙戌土",
"4":"官鬼辛酉金 世",
"5":"父母辛亥水",
"6":"妻财辛丑土",
"f2":"子孙巳火",
"extname":"《易经》第十八卦 蛊 山风蛊 艮上巽下",
"extnameexp":"蛊：元亨，利涉大川。 先甲三日，后甲三日。",
"extexp":"彖曰：蛊，刚上而柔下，巽而止，蛊。 蛊，元亨，而天下治也。 利涉大川，往有事也。 先甲三日，后甲三日，终则有始，天行也。",
"ext":"象曰：山下有风，蛊；君子以振民育德。",
"exp1":"初六：干父之蛊，有子，考无咎，厉终吉。",
"exp2":"象曰：干父之蛊，意承考也。",
"exp3":"九二：干母之蛊，不可贞。",
"exp4":"象曰：干母之蛊，得中道也。",
"exp5":"九三：干父小有晦，无大咎。",
"exp6":"象曰：干父之蛊，终无咎也。",
"exp7":"六四：裕父之蛊，往见吝。",
"exp8":"象曰：裕父之蛊，往未得也。",
"exp9":"六五：干父之蛊，用誉。",
"exp10":"象曰：干父之蛊；承以德也。",
"exp11":"上九：不事王侯，高尚其事。 ",
"exp12":"象曰：不事王侯，志可则也。"
}
/*
- -
---
- -
- -
---
- -
*/
six_random_NaJia["101101"] = {
"name":"坎为水",
"p":"坎宫",
"1":"兄弟戊子水 世",
"2":"官鬼戊戌土",
"3":"父母戊申金",
"4":"妻财戊午火 应",
"5":"官鬼戊辰土",
"6":"子孙戊寅木",
"extname":"《易经》第二十九卦 坎 坎为水 坎上坎下",
"extnameexp":"坎：习坎，有孚，维心亨，行有尚。",
"extexp":"彖曰：习坎，重险也。 水流而不盈，行险而不失其信。 维心亨，乃以刚中也。 行有尚，往有功也。 天险不可升也，地险山川丘陵也，王公设险以守其国，坎之时用大矣哉！",
"ext":"象曰：水洊至，习坎；君子以常德行，习教事。",
"exp1":"初六：习坎，入于坎窞，凶。",
"exp2":"象曰：习坎入坎，失道凶也。",
"exp3":"九二：坎有险，求小得。",
"exp4":"象曰：求小得，未出中也。",
"exp5":"六三：来之坎坎，险且枕，入于坎窞，勿用。",
"exp6":"象曰：来之坎坎，终无功也。",
"exp7":"六四：樽酒簋贰，用缶，纳约自牖，终无咎。",
"exp8":"象曰：樽酒簋贰，刚柔际也。",
"exp9":"九五：坎不盈，只既平，无咎。",
"exp10":"象曰：坎不盈，中未大也。",
"exp11":"上六：用徽纆，置于丛棘，三岁不得，凶。",
"exp12":"象曰：上六失道，凶三岁也。"
}
/*
- -
---
- -
- -
---
---
*/
six_random_NaJia["101100"] = {
"name":"水泽节",
"p":"坎宫",
"1":"兄弟戊子水",
"2":"官鬼戊戌土",
"3":"父母戊申金 应",
"4":"官鬼丁丑土",
"5":"子孙丁卯木",
"6":"妻财丁巳火 世",
"extname":"《易经》第六十卦 节 水泽节 坎上兑下",
"extnameexp":"节：亨。 苦节不可贞。",
"extexp":"彖曰：节，亨，刚柔分，而刚得中。苦节不可贞，其道穷也。说以行险，当位以节，中正以通。 天地节而四时成，节以制度，不伤财，不害民。",
"ext":"象曰：泽上有水，节；君子以制数度，议德行。",
"exp1":"初九：不出户庭，无咎。",
"exp2":"象曰：不出户庭，知通塞也。",
"exp3":"九二：不出门庭，凶。",
"exp4":"象曰：不出门庭，失时极也。",
"exp5":"六三：不节若，则嗟若，无咎。",
"exp6":"象曰：不节之嗟，又谁咎也。",
"exp7":"六四：安节，亨。",
"exp8":"象曰：安节之亨，承上道也。",
"exp9":"九五：甘节，吉；往有尚。",
"exp10":"象曰：甘节之吉，居位中也。",
"exp11":"上六：苦节，贞凶，悔亡。",
"exp12":"象曰：苦节贞凶，其道穷也。"
}
/*
- -
---
- -
- -
- -
---
*/
six_random_NaJia["101110"] = {
"name":"水雷屯",
"p":"坎宫",
"1":"兄弟戊子水",
"2":"官鬼戊戌土 应",
"3":"父母戊申金",
"4":"官鬼丁丑土",
"5":"子孙庚寅木 世",
"6":"兄弟庚子水",
"f4":"妻财午火",
"extname":"《易经》第三卦 屯 水雷屯 坎上震下",
"extnameexp":"屯：元，亨，利，贞，勿用，有攸往，利建侯。",
"extexp":"彖曰：屯，刚柔始交而难生，动乎险中，大亨贞。雷雨之动满盈，天造草昧，宜建侯而不宁。",
"ext":"象曰：云，雷，屯；君子以经纶。",
"exp1":"初九：磐桓；利居贞，利建侯。",
"exp2":"象曰：虽磐桓，志行正也。 以贵下贱，大得民也。",
"exp3":"六二：屯如邅如，乘马班如。 匪寇婚媾，女子贞不字，十年乃字。",
"exp4":"象曰：六二之难，乘刚也。 十年乃字，反常也。",
"exp5":"六三：既鹿无虞，惟入于林中，君子几不如舍，往吝。",
"exp6":"象曰：既鹿无虞，以纵禽也。 君子舍之，往吝穷也。",
"exp7":"六四：乘马班如，求婚媾，无不利。",
"exp8":"象曰：求而往，明也。",
"exp9":"九五：屯其膏，小贞吉，大贞凶。",
"exp10":"象曰：屯其膏，施未光也。",
"exp11":"上六：乘马班如，泣血涟如。",
"exp12":"象曰：泣血涟如，何可长也。"
}
/*
- -
---
- -
---
- -
---
*/
six_random_NaJia["101010"] = {
"name":"水火既济",
"p":"坎宫",
"1":"兄弟戊子水 应",
"2":"官鬼戊戌土",
"3":"父母戊申金",
"4":"兄弟己亥水 世",
"5":"官鬼己丑土",
"6":"子孙己卯木",
"f4":"妻财午火",
"extname":"《易经》第六十三卦 既济 水火既济 坎上离下",
"extnameexp":"既济：亨，小利贞，初吉终乱。",
"extexp":"彖曰：既济，亨，小者亨也。利贞，刚柔正而位当也。 初吉，柔得中也。终止则乱，其道穷也。",
"ext":"象曰：水在火上，既济；君子以思患而预防之。",
"exp1":"初九：曳其轮，濡其尾，无咎。",
"exp2":"象曰：曳其轮， 义无咎也。",
"exp3":"六二：妇丧其髴，勿逐，七日得。",
"exp4":"象曰：七日得，以中道也。",
"exp5":"九三：高宗伐鬼方，三年克之，小人勿用。",
"exp6":"象曰：三年克之，惫也。",
"exp7":"六四：繻有衣如，终日戒。",
"exp8":"象曰：终日戒，有所疑也。",
"exp9":"九五：东邻杀牛，不如西邻之禴祭，实受其福。",
"exp10":"象曰：东邻杀牛，不如西邻之时也；实受其福，吉大来也。",
"exp11":"上六：濡其首，厉。",
"exp12":"象曰：濡其首厉，何可久也。"
}
/*
- -
---
---
---
- -
---
*/
six_random_NaJia["100010"] = {
"name":"泽火革",
"p":"坎宫",
"1":"官鬼丁未土",
"2":"父母丁酉金",
"3":"兄弟丁亥水 世",
"4":"兄弟己亥水",
"5":"官鬼己丑土",
"6":"子孙己卯木 应",
"f4":"妻财午火",
"extname":"《易经》第四十九卦 革 泽火革 兑上离下",
"extnameexp":"革：己日乃孚，元亨利贞，悔亡。",
"extexp":"彖曰：革，水火相息，二女同居，其志不相得，曰革。己日乃孚；革而信也。 文明以说，大亨以正，革而当，其悔乃亡。天地革而四时成，汤武革命，顺乎天而应乎人，革之时义大矣哉！",
"ext":"象曰：泽中有火，革；君子以治历明时。",
"exp1":"初九：巩用黄牛之革。",
"exp2":"象曰：巩用黄牛，不可以有为也。",
"exp3":"六二：己日乃革之，征吉，无咎。",
"exp4":"象曰：己日革之，行有嘉也。",
"exp5":"九三：征凶，贞厉，革言三就，有孚。",
"exp6":"象曰：革言三就，又何之矣。",
"exp7":"九四：悔亡，有孚改命，吉。",
"exp8":"象曰：改命之吉，信志也。",
"exp9":"九五：大人虎变，未占有孚。",
"exp10":"象曰：大人虎变，其文炳也。",
"exp11":"上六：君子豹变，小人革面，征凶，居贞吉。",
"exp12":"象曰：君子豹变，其文蔚也。 小人革面，顺以从君也。"
}
/*
- -
- -
---
---
- -
---
*/
six_random_NaJia["110010"] = {
"name":"雷火丰",
"p":"坎宫",
"1":"官鬼庚戌土",
"2":"父母庚申金 世",
"3":"妻财庚午火",
"4":"兄弟己亥水",
"5":"官鬼己丑土 应",
"6":"子孙己卯木",
"extname":"《易经》第五十五卦 丰 雷火丰 震上离下",
"extnameexp":"丰：亨，王假之，勿忧，宜日中。",
"extexp":"彖曰：丰，大也。 明以动，故丰。王假之，尚大也。 勿忧宜日中，宜照天下也。日中则昃，月盈则食，天地盈虚，与时消息，而况人於人乎？况於鬼神乎？",
"ext":"象曰：雷电皆至，丰；君子以折狱致刑。",
"exp1":"初九：遇其配主，虽旬无咎，往有尚。",
"exp2":"象曰：虽旬无咎，过旬灾也。",
"exp3":"六二：丰其蔀，日中见斗，往得疑疾，有孚发若，吉。",
"exp4":"象曰：有孚发若，信以发志也。",
"exp5":"九三：丰其沛，日中见昧，折其右肱，无咎。",
"exp6":"象曰：丰其沛，不可大事也。 折其右肱，终不可用也。",
"exp7":"九四：丰其蔀，日中见斗，遇其夷主，吉。",
"exp8":"象曰：丰其蔀，位不当也。 日中见斗，幽不明也。 遇其夷主，吉；行也。",
"exp9":"六五：来章，有庆誉，吉。",
"exp10":"象曰：六五之吉，有庆也。",
"exp11":"上六：丰其屋，蔀其家，窥其户，闃其无人，三岁不见，凶。",
"exp12":"象曰：丰其屋，天际翔也。 窥其户，闃其无人，自藏也。"
}
/*
- -
- -
- -
---
- -
---
*/
six_random_NaJia["111010"] = {
"name":"地火明夷",
"p":"坎宫",
"1":"父母癸酉金",
"2":"兄弟癸亥水",
"3":"官鬼癸丑土 世",
"4":"兄弟己亥水",
"5":"官鬼己丑土",
"6":"子孙己卯木 应",
"f4":"妻财午火",
"extname":"《易经》第三十六卦 明夷 地火明夷 坤上离下",
"extnameexp":"明夷：利艰贞。",
"extexp":"彖曰：明入地中，明夷。 内文明而外柔顺，以蒙大难，文王以之。 利艰贞，晦其明也，内难而能正其志，箕子以之。",
"ext":"象曰：明入地中，明夷；君子以莅众，用晦而明。",
"exp1":"初九：明夷于飞，垂其翼。 君子于行，三日不食， 有攸往，主人有言。",
"exp2":"象曰：君子于行，义不食也。",
"exp3":"六二：明夷，夷于左股，用拯马壮，吉。",
"exp4":"象曰：六二之吉，顺以则也。",
"exp5":"九三：明夷于南狩，得其大首，不可疾贞。",
"exp6":"象曰：南狩之志，乃大得也。",
"exp7":"六四：入于左腹，获明夷之心，出于门庭。",
"exp8":"象曰：入于左腹，获心意也。",
"exp9":"六五：箕子之明夷，利贞。",
"exp10":"象曰：箕子之贞，明不可息也。",
"exp11":"上六：不明晦，初登于天，后入于地。",
"exp12":"象曰：初登于天，照四国也。 后入于地，失则也。"
}
/*
- -
- -
- -
- -
---
- -
*/
six_random_NaJia["111101"] = {
"name":"地水师",
"p":"坎宫",
"1":"父母癸酉金 应",
"2":"兄弟癸亥水",
"3":"官鬼癸丑土",
"4":"妻财戊午火 世",
"5":"官鬼戊辰土",
"6":"子孙戊寅木",
"extname":"《易经》第七卦 师 地水师 坤上坎下 ",
"extnameexp":"师：贞，丈人，吉无咎。",
"extexp":"彖曰：师，众也，贞正也，能以众正，可以王矣。 刚中而应，行险而顺，以此毒天下，而民从之，吉又何咎矣。",
"ext":"象曰：地中有水，师；君子以容民畜众。",
"exp1":"初六：师出以律，否臧凶。",
"exp2":"象曰：师出以律，失律凶也。",
"exp3":"九二：在师中，吉无咎，王三锡命。",
"exp4":"象曰：在师中吉，承天宠也。 王三锡命，怀万邦也。",
"exp5":"六三：师或舆尸，凶。",
"exp6":"象曰：师或舆尸，大无功也。",
"exp7":"六四：师左次，无咎。",
"exp8":"象曰：左次无咎，未失常也。",
"exp9":"六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",
"exp10":"象曰：长子帅师，以中行也。弟子舆师，使不当也。",
"exp11":"上六：大君有命，开国承家，小人勿用。",
"exp12":"象曰：大君有命，以正功也。 小人勿用，必乱邦也。"
}
/*
---
- -
- -
---
- -
- -
*/
six_random_NaJia["011011"] = {
"name":"艮为山",
"p":"艮宫",
"1":"官鬼丙寅木 世",
"2":"妻财丙子水",
"3":"兄弟丙戌土",
"4":"子孙丙申金 应",
"5":"父母丙午火",
"6":"兄弟丙辰土",
"extname":"《易经》第五十二卦 艮 艮为山 艮上艮下",
"extnameexp":"艮：艮其背，不获其身，行其庭，不见其人，无咎。",
"extexp":"彖曰：艮，止也。 时止则止，时行则行，动静不失其时，其道光明。 艮其止，止其所也。 上下敌应，不相与也。 是以不获其身，行其庭不见其人，无咎也。",
"ext":"象曰：兼山，艮；君子以思不出其位。",
"exp1":"初六：艮其趾，无咎，利永贞。",
"exp2":"象曰：艮其趾，未失正也。",
"exp3":"六二：艮其腓，不拯其随，其心不快。",
"exp4":"象曰：不拯其随，未退听也。",
"exp5":"九三：艮其限，列其夤，厉薰心。",
"exp6":"象曰：艮其限，危薰心也。",
"exp7":"六四：艮其身，无咎。",
"exp8":"象曰：艮其身，止诸躬也。",
"exp9":"六五：艮其辅，言有序，悔亡。",
"exp10":"象曰：艮其辅，以中正也。",
"exp11":"上九：敦艮，吉。",
"exp12":"象曰：敦艮之吉，以厚终也。"
}
/*
---
- -
- -
---
- -
---
*/
six_random_NaJia["011010"] = {
"name":"山火贲",
"p":"艮宫",
"1":"官鬼丙寅木",
"2":"妻财丙子水",
"3":"兄弟丙戌土 应",
"4":"妻财己亥水",
"5":"兄弟己丑土",
"6":"官鬼己卯木 世",
"extname":"《易经》第二十二卦 贲 山火贲 艮上离下",
"extnameexp":"贲：亨。 小利有所往。",
"extexp":"彖曰：贲，亨；柔来而文刚，故亨。分刚上而文柔，故小利有攸往。天文也；文明以止，人文也。观乎天文，以察时变；观乎人文，以化成天下。",
"ext":"象曰：山下有火，贲；君子以明庶政，无敢折狱。",
"exp1":"初九：贲其趾，舍车而徒。",
"exp2":"象曰：舍车而徒，义弗乘也。",
"exp3":"六二：贲其须。",
"exp4":"象曰：贲其须，与上兴也。",
"exp5":"九三：贲如濡如，永贞吉。",
"exp6":"象曰：永贞之吉，终莫之陵也。",
"exp7":"六四：贲如皤如，白马翰如，匪寇婚媾。",
"exp8":"象曰：六四，当位疑也。 匪寇婚媾，终无尤也。",
"exp9":"六五：贲于丘园，束帛戋戋，吝，终吉。",
"exp10":"象曰：六五之吉，有喜也。",
"exp11":"上九：白贲，无咎。",
"exp12":"象曰：白贲无咎，上得志也。"
}
/*
---
- -
- -
---
---
---
*/
six_random_NaJia["011000"] = {
"name":"山天大畜",
"p":"艮宫",
"1":"官鬼丙寅木",
"2":"妻财丙子水 应",
"3":"兄弟丙戌土",
"4":"兄弟甲辰土",
"5":"官鬼甲寅木 世",
"6":"妻财甲子水",
"f4":"子孙申金",
"f5":"父母午火",
"extname":"《易经》第二十六卦 大畜 山天大畜 艮上乾下 ",
"extnameexp":"大畜：利贞，不家食吉，利涉大川。",
"extexp":"彖曰：大畜，刚健笃实辉光，日新其德，刚上而尚贤。 能止健，大正也。不家食吉，养贤也。 利涉大川，应乎天也。",
"ext":"象曰：天在山中，大畜；君子以多识前言往行，以畜其德。",
"exp1":"初九：有厉利已。",
"exp2":"象曰：有厉利已，不犯灾也。",
"exp3":"九二：舆说辐。",
"exp4":"象曰：舆说辐，中无尤也。",
"exp5":"九三：良马逐，利艰贞。 曰闲舆卫，利有攸往。",
"exp6":"象曰：利有攸往，上合志也。",
"exp7":"六四：童豕之牿，元吉。",
"exp8":"象曰：六四元吉，有喜也。",
"exp9":"六五：豮豕之牙，吉。",
"exp10":"象曰：六五之吉，有庆也。",
"exp11":"上九：何天之衢，亨。",
"exp12":"象曰：何天之衢，道大行也。"
}
/*
---
- -
- -
- -
---
---
*/
six_random_NaJia["011100"] = {
"name":"山泽损",
"p":"艮宫",
"1":"官鬼丙寅木 应",
"2":"妻财丙子水",
"3":"兄弟丙戌土",
"4":"兄弟丁丑土 世",
"5":"官鬼丁卯木",
"6":"父母丁巳火",
"f4":"子孙申金",
"f5":"父母午火",
"extname":"《易经》第四十一卦 损 山泽损 艮上兑下 ",
"extnameexp":"损：有孚，元吉，无咎，可贞，利有攸往？ 曷之用，二簋可用享。",
"extexp":"彖曰：损，损下益上，其道上行。损而有孚，元吉，无咎，可贞，利有攸往。 曷之用？ 二簋可用享；二簋应有时。损刚益柔有时，损益盈虚，与时偕行。",
"ext":"象曰：山下有泽，损；君子以惩忿窒欲。",
"exp1":"初九：已事遄往，无咎，酌损之。",
"exp2":"象曰：已事遄往，尚合志也。",
"exp3":"九二：利贞，征凶，弗损益之。",
"exp4":"象曰：九二利贞，中以为志也。",
"exp5":"六三：三人行，则损一人；一人行，则得其友。",
"exp6":"象曰：一人行，三则疑也。",
"exp7":"六四：损其疾，使遄有喜，无咎。",
"exp8":"象曰：损其疾，亦可喜也。",
"exp9":"六五：或益之，十朋之龟弗克违，元吉。",
"exp10":"象曰：六五元吉，自上佑也。",
"exp11":"上九：弗损益之，无咎，贞吉，利有攸往，得臣无家。",
"exp12":"象曰：弗损益之，大得志也。"
}
/*
---
- -
---
- -
---
---
*/
six_random_NaJia["010100"] = {
"name":"火泽睽",
"p":"艮宫",
"1":"父母己巳火",
"2":"兄弟己未土",
"3":"子孙己酉金 世",
"4":"兄弟丁丑土",
"5":"官鬼丁卯木",
"6":"父母丁巳火 应",
"f4":"子孙申金",
"extname":"《易经》第三十八卦 睽 火泽睽 离上兑下 ",
"extnameexp":"睽：小事吉。",
"extexp":"彖曰：睽，火动而上，泽动而下； 二女同居，其志不同行；说而丽乎明，柔进而上行，得中而应乎刚；是以小事吉。 天地睽，而其事同也；男女睽，而其志通也；万物睽，而其事类也；睽之时用大矣哉！",
"ext":"象曰：上火下泽，睽；君子以同而异。",
"exp1":"初九：已事遄往，无咎，酌损之。",
"exp2":"象曰：见恶人，以辟咎也。",
"exp3":"九二：遇主于巷，无咎。",
"exp4":"象曰：遇主于巷，未失道也。",
"exp5":"六三：见舆曳，其牛掣，其人天且劓，无初有终。",
"exp6":"象曰：见舆曳，位不当也。 无初有终，遇刚也。",
"exp7":"九四：睽孤，遇元夫，交孚，厉无咎。",
"exp8":"象曰：交孚无咎，志行也。",
"exp9":"六五：悔亡，厥宗噬肤，往何咎。",
"exp10":"象曰：厥宗噬肤，往有庆也。",
"exp11":"上九：睽孤， 见豕负涂，载鬼一车， 先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。",
"exp12":"象曰：遇雨之吉，群疑亡也。"
}
/*
---
---
---
- -
---
---
*/
six_random_NaJia["000100"] = {
"name":"天泽履",
"p":"艮宫",
"1":"兄弟壬戌土",
"2":"子孙壬申金 世",
"3":"父母壬午火",
"4":"兄弟丁丑土",
"5":"官鬼丁卯木 应",
"6":"父母丁巳火",
"f2":"妻财子水",
"extname":"《易经》第十卦 履 天泽履 乾上兑下 ",
"extnameexp":"履：履虎尾，不咥人，亨。",
"extexp":"彖曰：履，柔履刚也。说而应乎乾，是以履虎尾，不咥人，亨。刚中正，履帝位而不疚，光明也。",
"ext":"象曰：上天下泽，履；君子以辨上下，安民志。",
"exp1":"初九：素履，往无咎。",
"exp2":"象曰：素履之往，独行愿也。",
"exp3":"九二：履道坦坦，幽人贞吉。",
"exp4":"象曰：幽人贞吉，中不自乱也。",
"exp5":"六三：眇能视，跛能履，履虎尾，咥人，凶。 武人为于大君。",
"exp6":"象曰：眇能视；不足以有明也。跛能履；不足以与行也。咥人之凶；位不当也。 武人为于大君；志刚也。",
"exp7":"九四：履虎尾，愬愬终吉。",
"exp8":"象曰：愬愬终吉，志行也。",
"exp9":"九五：夬履，贞厉。",
"exp10":"象曰：夬履贞厉，位正当也。",
"exp11":"上九：视履考祥，其旋元吉。",
"exp12":"象曰：元吉在上，大有庆也。"
}
/*
---
---
- -
- -
---
---
*/
six_random_NaJia["001100"] = {
"name":"风泽中孚",
"p":"艮宫",
"1":"官鬼辛卯木",
"2":"父母辛巳火",
"3":"兄弟辛未土 世",
"4":"兄弟丁丑土",
"5":"官鬼丁卯木",
"6":"父母丁巳火 应",
"f4":"子孙申金",
"f2":"妻财子水",
"extname":"《易经》第六十一卦 中孚 风泽中孚 巽上兑下 ",
"extnameexp":"中孚：豚鱼吉，利涉大川，利贞。",
"extexp":"彖曰：中孚，柔在内而刚得中。 说而巽，孚，乃化邦也。 豚鱼吉，信及豚鱼也。 利涉大川，乘木舟虚也。 中孚以利贞，乃应乎天也。",
"ext":"象曰：泽上有风，中孚；君子以议狱缓死。",
"exp1":"初九：虞吉，有他不燕。",
"exp2":"象曰：初九虞吉，志未变也。",
"exp3":"九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。",
"exp4":"象曰：其子和之，中心愿也。",
"exp5":"六三：得敌，或鼓或罢，或泣或歌。",
"exp6":"象曰：可鼓或罢，位不当也。",
"exp7":"六四：月几望，马匹亡，无咎。",
"exp8":"象曰：马匹亡，绝类上也。",
"exp9":"九五：有孚挛如，无咎。",
"exp10":"象曰：有孚挛如，位正当也。",
"exp11":"上九：翰音登于天，贞凶。",
"exp12":"象曰：翰音登于天，何可长也。"
}
/*
---
---
- -
---
- -
- -
*/
six_random_NaJia["001011"] = {
"name":"风山渐",
"p":"艮宫",
"1":"官鬼辛卯木 应",
"2":"父母辛巳火",
"3":"兄弟辛未土",
"4":"子孙丙申金 世",
"5":"父母丙午火",
"6":"兄弟丙辰土",
"f2":"妻财子水",
"extname":"《易经》第五十三卦 渐 风山渐 巽上艮下 ",
"extnameexp":"渐：女归吉，利贞。",
"extexp":"彖曰：渐之进也，女归吉也。 进得位，往有功也。进以正，可以正邦也。其位刚，得中也。 止而巽，动不穷也。",
"ext":"象曰：山上有木，渐；君子以居贤德，善俗。",
"exp1":"初六：鸿渐于干，小子厉，有言，无咎。",
"exp2":"象曰：小子之厉，义无咎也。",
"exp3":"六二：鸿渐于磐，饮食衎衎，吉。",
"exp4":"象曰：饮食衎衎，不素饱也。",
"exp5":"九三：鸿渐于陆，夫征不复，妇孕不育，凶；利御寇。",
"exp6":"象曰：夫征不复，离群丑也。 妇孕不育，失其道也。利用御寇，顺相保也。",
"exp7":"六四：鸿渐于木，或得其桷，无咎。",
"exp8":"象曰：或得其桷，顺以巽也。",
"exp9":"九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。",
"exp10":"象曰：终莫之胜，吉；得所愿也。",
"exp11":"上九：鸿渐于逵，其羽可用为仪，吉。",
"exp12":"象曰：其羽可用为仪，吉；不可乱也。"
}
/*
- -
- -
- -
- -
- -
- -
*/
six_random_NaJia["111111"] = {
"name":"坤为地",
"p":"坤宫",
"1":"子孙癸酉金 世",
"2":"妻财癸亥水",
"3":"兄弟癸丑土",
"4":"官鬼乙卯木 应",
"5":"父母乙巳火",
"6":"兄弟乙未土",
"extname":"《易经》第二卦 坤 坤为地 坤上坤下 ",
"extnameexp":"坤：元，亨，利牝马之贞。 君子有攸往，先迷后得主，利西南得朋，东北丧朋。 安贞，吉。",
"extexp":"彖曰：至哉坤元，万物资生，乃顺承天。 坤厚载物，德合无疆。 含弘光大，品物咸亨。 牝马地类，行地无疆，柔顺利贞。 君子攸行，先迷失道，后顺得常。 西南得朋，乃与类行；东北丧朋，乃终有庆。安贞之吉，应地无疆。",
"ext":"象曰：地势坤，君子以厚德载物。",
"exp1":"初六：履霜，坚冰至。",
"exp2":"象曰：履霜坚冰，阴始凝也。 驯致其道，至坚冰也。",
"exp3":"六二：直，方，大，不习无不利。",
"exp4":"象曰：六二之动，直以方也。 不习无不利，地道光也。",
"exp5":"六三：含章可贞。 或从王事，无成有终。",
"exp6":"象曰：含章可贞；以时发也。 或从王事，知光大也。",
"exp7":"六四：括囊；无咎，无誉。",
"exp8":"象曰：括囊无咎，慎不害也。",
"exp9":"六五：黄裳，元吉。",
"exp10":"象曰：黄裳元吉，文在中也。",
"exp11":"上六：战龙於野，其血玄黄。",
"exp12":"象曰：战龙於野，其道穷也。"
}
/*
- -
- -
- -
- -
- -
---
*/
six_random_NaJia["111110"] = {
"name":"地雷复",
"p":"坤宫",
"1":"子孙癸酉金",
"2":"妻财癸亥水",
"3":"兄弟癸丑土 应",
"4":"兄弟庚辰土",
"5":"官鬼庚寅木",
"6":"妻财庚子水 世",
"f5":"父母巳火",
"extname":"《易经》第二十四卦 复 地雷复 坤上震下",
"extnameexp":"复：亨。 出入无疾，朋来无咎。 反复其道，七日来复，利有攸往。",
"extexp":"彖曰：复亨；刚反，动而以顺行，是以出入无疾，朋来无咎。 反复其道，七日来复，天行也。 利有攸往，刚长也。 复其见天地之心乎？",
"ext":"象曰：雷在地中，复；先王以至日闭关，商旅不行，后不省方。",
"exp1":"初九：不复远，无只悔，元吉。",
"exp2":"象曰：不远之复，以修身也。",
"exp3":"六二：休复，吉。",
"exp4":"象曰：休复之吉，以下仁也。",
"exp5":"六三：频复，厉无咎。",
"exp6":"象曰：频复之厉，义无咎也。",
"exp7":"六四：中行独复。",
"exp8":"象曰：中行独复，以从道也。",
"exp9":"六五：敦复，无悔。",
"exp10":"象曰：敦复无悔，中以自考也。",
"exp11":"上六：迷复，凶，有灾眚。用行师，终有大败，以其国君，凶；至于十年，不克征。",
"exp12":"象曰：迷复之凶，反君道也。"
}
/*
- -
- -
- -
- -
---
---
*/
six_random_NaJia["111100"] = {
"name":"地泽临",
"p":"坤宫",
"1":"子孙癸酉金",
"2":"妻财癸亥水 应",
"3":"兄弟癸丑土",
"4":"兄弟丁丑土",
"5":"官鬼丁卯木 世",
"6":"父母丁巳火",
"extname":"《易经》第十九卦 临 地泽临 坤上兑下",
"extnameexp":"临：元，亨，利，贞。 至于八月有凶。",
"extexp":"彖曰：临，刚浸而长。 说而顺，刚中而应，大亨以正，天之道也。 至于八月有凶，消不久也。",
"ext":"象曰：泽上有地，临； 君子以教思无穷，容保民无疆。",
"exp1":"初九：咸临，贞吉。",
"exp2":"象曰：咸临贞吉，志行正也。",
"exp3":"九二：咸临，吉无不利。",
"exp4":"象曰：咸临，吉无不利；未顺命也。",
"exp5":"六三：甘临，无攸利。 既忧之，无咎。",
"exp6":"象曰：甘临，位不当也。 既忧之，咎不长也。",
"exp7":"六四：至临，无咎。",
"exp8":"象曰：至临无咎，位当也。",
"exp9":"六五：知临，大君之宜，吉。",
"exp10":"象曰：大君之宜，行中之谓也。",
"exp11":"上六：敦临，吉无咎。",
"exp12":"象曰：敦临之吉，志在内也。"
}
/*
- -
- -
- -
---
---
---
*/
six_random_NaJia["111000"] = {
"name":"地天泰",
"p":"坤宫",
"1":"子孙癸酉金 应",
"2":"妻财癸亥水",
"3":"兄弟癸丑土",
"4":"兄弟甲辰土 世",
"5":"官鬼甲寅木",
"6":"妻财甲子水",
"f5":"父母巳火",
"extname":"《易经》第十一卦 泰 地天泰 坤上乾下",
"extnameexp":"泰：小往大来，吉亨。",
"extexp":"彖曰：泰，小往大来，吉亨。则是天地交，而万物通也；上下交，而其志同也。内阳而外阴，内健而外顺，内君子而外小人，君子道长，小人道消也。",
"ext":"象曰：天地交泰，后以财（裁）成天地之道，辅相天地之宜，以左右民。",
"exp1":"初九：拔茅茹，以其夤，征吉。",
"exp2":"象曰：拔茅征吉，志在外也。",
"exp3":"九二：包荒，用冯河，不遐遗，朋亡，得尚于中行。",
"exp4":"象曰：包荒，得尚于中行，以光大也。",
"exp5":"九三：无平不陂，无往不复，艰贞无咎。 勿恤其孚，于食有福。",
"exp6":"象曰：无往不复，天地际也。",
"exp7":"六四：翩翩不富，以其邻，不戒以孚。",
"exp8":"象曰：翩翩不富，皆失实也。 不戒以孚，中心愿也。",
"exp9":"六五：帝乙归妹，以祉元吉。",
"exp10":"象曰：以祉元吉，中以行愿也。",
"exp11":"上六：城复于隍，勿用师。 自邑告命，贞吝。",
"exp12":"象曰：城复于隍，其命乱也。"
}
/*
- -
- -
---
---
---
---
*/
six_random_NaJia["110000"] = {
"name":"雷天大壮",
"p":"坤宫",
"1":"兄弟庚戌土",
"2":"子孙庚申金",
"3":"父母庚午火 世",
"4":"兄弟甲辰土",
"5":"官鬼甲寅木",
"6":"妻财甲子水 应",
"extname":"《易经》第三十四卦 大壮 雷天大壮 震上乾下 ",
"extnameexp":"大壮：利贞。",
"extexp":"彖曰：大壮，大者壮也。 刚以动，故壮。 大壮利贞；大者正也。正大而天地之情可见矣！",
"ext":"象曰：雷在天上，大壮；君子以非礼勿履。",
"exp1":"初九：壮于趾，征凶，有孚。",
"exp2":"象曰：壮于趾，其孚穷也。",
"exp3":"九二：贞吉。",
"exp4":"象曰：九二贞吉，以中也。",
"exp5":"九三：小人用壮，君子用罔，贞厉。 羝羊触藩，羸其角。",
"exp6":"象曰：小人用壮，君子罔也。",
"exp7":"九四：贞吉悔亡，藩决不羸，壮于大舆之輹",
"exp8":"象曰：藩决不羸，尚往也。",
"exp9":"六五：丧羊于易，无悔。",
"exp10":"象曰：丧羊于易，位不当也。",
"exp11":"上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。",
"exp12":"象曰：不能退，不能遂，不祥也。 艰则吉，咎不长也。"
}
/*
- -
---
---
---
---
---
*/
six_random_NaJia["100000"] = {
"name":"泽天夬",
"p":"坤宫",
"1":"兄弟丁未土",
"2":"子孙丁酉金 世",
"3":"妻财丁亥水",
"4":"兄弟甲辰土",
"5":"官鬼甲寅木 应",
"6":"妻财甲子水",
"f5":"父母巳火",
"extname":"《易经》第四十三卦 夬 泽天夬 兑上乾下 ",
"extnameexp":"夬：扬于王庭，孚号，有厉，告自邑，不利即戎，利有攸往。",
"extexp":"彖曰：夬，决也，刚决柔也。健而说，决而和，扬于王庭，柔乘五刚也。孚号有厉，其危乃光也。 告自邑，不利即戎，所尚乃穷也。 利有攸往，刚长乃终也。",
"ext":"象曰：泽上于天，夬；君子以施禄及下，居德则忌。",
"exp1":"初九：壮于前趾，往不胜为吝。",
"exp2":"象曰：不胜而往，咎也。",
"exp3":"九二：惕号，莫夜有戎，勿恤。",
"exp4":"象曰：莫夜有戎，得中道也。",
"exp5":"九三：壮于頄，有凶。 君子夬夬，独行遇雨，若濡有愠，无咎。",
"exp6":"象曰：君子夬夬，终无咎也。",
"exp7":"九四：臀无肤，其行次且。 牵羊悔亡，闻言不信。",
"exp8":"象曰：其行次且，位不当也。 闻言不信，聪不明也。",
"exp9":"九五：苋陆夬夬，中行无咎。",
"exp10":"象曰：中行无咎，中未光也。",
"exp11":"上六：无号，终有凶。",
"exp12":"象曰：无号之凶，终不可长也。"
}
/*
- -
---
- -
---
---
---
*/
six_random_NaJia["101000"] = {
"name":"水天需",
"p":"坤宫",
"1":"妻财戊子水",
"2":"兄弟戊戌土",
"3":"子孙戊申金 世",
"4":"兄弟甲辰土",
"5":"官鬼甲寅木",
"6":"妻财甲子水 应",
"f5":"父母巳火",
"extname":"《易经》第五卦 需 水天需 坎上乾下",
"extnameexp":"需：有孚，光亨，贞吉。 利涉大川。",
"extexp":"彖曰：需，须也；险在前也。 刚健而不陷，其义不困穷矣。 需有孚，光亨，贞吉。 位乎天位，以正中也。 利涉大川，往有功也。",
"ext":"象曰：云上於天，需；君子以饮食宴乐。",
"exp1":"初九：需于郊。 利用恒，无咎。",
"exp2":"象曰：需于郊，不犯难行也。 利用恒，无咎；未失常也。",
"exp3":"九二：需于沙。 小有言，终吉。",
"exp4":"象曰：需于沙，衍在中也。 虽小有言，以终吉也。",
"exp5":"九三：需于泥，致寇至。",
"exp6":"象曰：需于泥，灾在外也。 自我致寇，敬慎不败也。",
"exp7":"六四：需于血，出自穴。",
"exp8":"象曰：需于血，顺以听也。",
"exp9":"九五：需于酒食，贞吉。",
"exp10":"象曰：酒食贞吉，以中正也。",
"exp11":"上六：入于穴，有不速之客三人来，敬之终吉。",
"exp12":"象曰：不速之客来，敬之终吉。 虽不当位，未大失也。"
}
/*
- -
---
- -
- -
- -
- -
*/
six_random_NaJia["101111"] = {
"name":"水地比",
"p":"坤宫",
"1":"妻财戊子水 应",
"2":"兄弟戊戌土",
"3":"子孙戊申金",
"4":"官鬼乙卯木 世",
"5":"父母乙巳火",
"6":"兄弟乙未土",
"extname":"《易经》第八卦 比 水地比 坎上下坤 ",
"extnameexp":"比：吉。 原筮元永贞，无咎。 不宁方来，后夫凶。",
"extexp":"彖曰：比，吉也，比，辅也，下顺从也。 原筮元永贞，无咎，以刚中也。不宁方来，上下应也。 后夫凶，其道穷也。",
"ext":"象曰：地上有水，比；先王以建万国，亲诸侯。",
"exp1":"初六：有孚比之，无咎。 有孚盈缶，终来有他，吉。",
"exp2":"象曰：比之初六，有他吉也。",
"exp3":"六二：比之自内，贞吉。",
"exp4":"象曰：比之自内，不自失也。",
"exp5":"六三：比之匪人。",
"exp6":"象曰：比之匪人，不亦伤乎！",
"exp7":"六四：外比之，贞吉。",
"exp8":"象曰：外比於贤，以从上也。",
"exp9":"九五：显比，王用三驱，失前禽。 邑人不诫，吉。",
"exp10":"象曰：显比之吉，位正中也。舍逆取顺，失前禽也。 邑人不诫，上使中也。",
"exp11":"上六：比之无首，凶。",
"exp12":"象曰：比之无首，无所终也。"
}

var startinfo;
var where               = new Array();      //地区
var three_random        = new Array();      //硬币取爻
var six_random          = new Array();      //本爻
var six_change_random   = new Array();      //变爻
var six_random_empty	= new Array();
var six_random_myth		= new Array();
var six_random_help_myth = new Array();		
var six_random_date		= new Array();
var six_random_draw		= new Array();


var htmldraw			= new Array();
var htmlchangedraw		= new Array();
var htmlmythdraw		= new Array();
var htmlnajiadraw		= new Array();
var htmlnajiachangedraw	= new Array();
var htmlchangeinfodraw 	= new Array();


const sixtycycletable = ["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"];
const oldnegativevalue = 0;                 //老阴
const negativevalue = 1;                    //少阴
const positivevalue = 2;                    //少阳    
const oldpositivevalue = 3                  //老阳
const randomtime = 6 

const negativedraw = "--- ---";
const positivedraw = "-------";
const negativechangedraw = "X->";
const positivechangedraw = "O->";
const nonechangedraw = "      ";
const nonechangehtmldraw = "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;";
const negativehtmldraw = "▄▄&nbsp;&nbsp;&nbsp;▄▄";
const positivehtmldraw = "▄▄▄▄▄";
const nonajiahtmldraw = "&nbsp;&nbsp;&nbsp;&nbsp;";


var j = [43856, 19416, 19168, 42352, 21717, 53856, 55632, 25940, 22191, 39632, 21970, 19168, 42422, 42192, 53840, 53845, 46415, 54944, 44450, 38320, 18807, 18815, 42160, 46261, 27216, 27968, 43860, 11119, 38256, 21234, 18800, 25958, 54432, 59984, 27285, 23263, 11104, 34531, 37615, 51415, 51551, 54432, 55462, 46431, 22176, 42420, 9695, 37584, 53938, 43344, 46423, 27808, 46416, 21333, 19887, 42416, 17779, 21183, 43432, 59728, 27296, 44710, 43856, 19296, 43748, 42352, 21088, 62051, 55632, 23383, 22176, 38608, 19925, 19152, 42192, 54484, 53840, 54616, 46400, 46752, 38310, 38335, 18864, 43380, 42160, 45690, 27216, 27968, 44870, 43872, 38256, 19189, 18800, 25776, 29859, 59984, 27480, 23232, 43872, 38613, 37600, 51552, 55636, 54432, 55888, 30034, 22176, 43959, 9680, 37584, 51893, 43344, 46240, 47780, 44368, 21977, 19360, 42416, 20854, 21183, 43312, 31060, 27296, 44368, 23378, 19296, 42726, 42208, 53856, 60005, 54576, 23200, 30371, 38608, 19195, 19152, 42192, 53430, 53855, 54560, 56645, 46496, 22224, 21938, 18864, 42359, 42160, 43600, 45653, 27951, 44448, 19299, 37759, 18936, 18800, 25776, 26790, 59999, 27424, 42692, 43759, 37600, 53987, 51552, 54615, 54432, 55888, 23893, 22176, 42704, 21972, 21200, 43448, 43344, 46240, 46758, 44368, 21920, 43940, 42416, 21168, 45683, 26928, 29495, 27296, 44368, 19285, 19311, 42352, 21732, 53856, 59752, 54560, 55968, 27302, 22239, 19168, 43476, 42192, 53584, 62034, 54560];
var o = ["9778397bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf97c3598082c95f8c965cc920f", "97bd0b06bdb0722c965ce1cfcc920f", "b027097bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf97c359801ec95f8c965cc920f", "97bd0b06bdb0722c965ce1cfcc920f", "b027097bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf97c359801ec95f8c965cc920f", "97bd0b06bdb0722c965ce1cfcc920f", "b027097bd097c36b0b6fc9274c91aa", "9778397bd19801ec9210c965cc920e", "97b6b97bd19801ec95f8c965cc920f", "97bd09801d98082c95f8e1cfcc920f", "97bd097bd097c36b0b6fc9210c8dc2", "9778397bd197c36c9210c9274c91aa", "97b6b97bd19801ec95f8c965cc920e", "97bd09801d98082c95f8e1cfcc920f", "97bd097bd097c36b0b6fc9210c8dc2", "9778397bd097c36c9210c9274c91aa", "97b6b97bd19801ec95f8c965cc920e", "97bcf97c3598082c95f8e1cfcc920f", "97bd097bd097c36b0b6fc9210c8dc2", "9778397bd097c36c9210c9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf97c3598082c95f8c965cc920f", "97bd097bd097c35b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf97c3598082c95f8c965cc920f", "97bd097bd097c35b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf97c359801ec95f8c965cc920f", "97bd097bd097c35b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf97c359801ec95f8c965cc920f", "97bd097bd097c35b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf97c359801ec95f8c965cc920f", "97bd097bd07f595b0b6fc920fb0722", "9778397bd097c36b0b6fc9210c8dc2", "9778397bd19801ec9210c9274c920e", "97b6b97bd19801ec95f8c965cc920f", "97bd07f5307f595b0b0bc920fb0722", "7f0e397bd097c36b0b6fc9210c8dc2", "9778397bd097c36c9210c9274c920e", "97b6b97bd19801ec95f8c965cc920f", "97bd07f5307f595b0b0bc920fb0722", "7f0e397bd097c36b0b6fc9210c8dc2", "9778397bd097c36c9210c9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bd07f1487f595b0b0bc920fb0722", "7f0e397bd097c36b0b6fc9210c8dc2", "9778397bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf7f1487f595b0b0bb0b6fb0722", "7f0e397bd097c35b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf7f1487f595b0b0bb0b6fb0722", "7f0e397bd097c35b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf7f1487f531b0b0bb0b6fb0722", "7f0e397bd097c35b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c965cc920e", "97bcf7f1487f531b0b0bb0b6fb0722", "7f0e397bd07f595b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b97bd19801ec9210c9274c920e", "97bcf7f0e47f531b0b0bb0b6fb0722", "7f0e397bd07f595b0b0bc920fb0722", "9778397bd097c36b0b6fc9210c91aa", "97b6b97bd197c36c9210c9274c920e", "97bcf7f0e47f531b0b0bb0b6fb0722", "7f0e397bd07f595b0b0bc920fb0722", "9778397bd097c36b0b6fc9210c8dc2", "9778397bd097c36c9210c9274c920e", "97b6b7f0e47f531b0723b0b6fb0722", "7f0e37f5307f595b0b0bc920fb0722", "7f0e397bd097c36b0b6fc9210c8dc2", "9778397bd097c36b0b70c9274c91aa", "97b6b7f0e47f531b0723b0b6fb0721", "7f0e37f1487f595b0b0bb0b6fb0722", "7f0e397bd097c35b0b6fc9210c8dc2", "9778397bd097c36b0b6fc9274c91aa", "97b6b7f0e47f531b0723b0b6fb0721", "7f0e27f1487f595b0b0bb0b6fb0722", "7f0e397bd097c35b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b7f0e47f531b0723b0b6fb0721", "7f0e27f1487f531b0b0bb0b6fb0722", "7f0e397bd097c35b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b7f0e47f531b0723b0b6fb0721", "7f0e27f1487f531b0b0bb0b6fb0722", "7f0e397bd097c35b0b6fc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b7f0e47f531b0723b0b6fb0721", "7f0e27f1487f531b0b0bb0b6fb0722", "7f0e397bd07f595b0b0bc920fb0722", "9778397bd097c36b0b6fc9274c91aa", "97b6b7f0e47f531b0723b0787b0721", "7f0e27f0e47f531b0b0bb0b6fb0722", "7f0e397bd07f595b0b0bc920fb0722", "9778397bd097c36b0b6fc9210c91aa", "97b6b7f0e47f149b0723b0787b0721", "7f0e27f0e47f531b0723b0b6fb0722", "7f0e397bd07f595b0b0bc920fb0722", "9778397bd097c36b0b6fc9210c8dc2", "977837f0e37f149b0723b0787b0721", "7f07e7f0e47f531b0723b0b6fb0722", "7f0e37f5307f595b0b0bc920fb0722", "7f0e397bd097c35b0b6fc9210c8dc2", "977837f0e37f14998082b0787b0721", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e37f1487f595b0b0bb0b6fb0722", "7f0e397bd097c35b0b6fc9210c8dc2", "977837f0e37f14998082b0787b06bd", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e27f1487f531b0b0bb0b6fb0722", "7f0e397bd097c35b0b6fc920fb0722", "977837f0e37f14998082b0787b06bd", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e27f1487f531b0b0bb0b6fb0722", "7f0e397bd097c35b0b6fc920fb0722", "977837f0e37f14998082b0787b06bd", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e27f1487f531b0b0bb0b6fb0722", "7f0e397bd07f595b0b0bc920fb0722", "977837f0e37f14998082b0787b06bd", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e27f1487f531b0b0bb0b6fb0722", "7f0e397bd07f595b0b0bc920fb0722", "977837f0e37f14998082b0787b06bd", "7f07e7f0e47f149b0723b0787b0721", "7f0e27f0e47f531b0b0bb0b6fb0722", "7f0e397bd07f595b0b0bc920fb0722", "977837f0e37f14998082b0723b06bd", "7f07e7f0e37f149b0723b0787b0721", "7f0e27f0e47f531b0723b0b6fb0722", "7f0e397bd07f595b0b0bc920fb0722", "977837f0e37f14898082b0723b02d5", "7ec967f0e37f14998082b0787b0721", "7f07e7f0e47f531b0723b0b6fb0722", "7f0e37f1487f595b0b0bb0b6fb0722", "7f0e37f0e37f14898082b0723b02d5", "7ec967f0e37f14998082b0787b0721", "7f07e7f0e47f531b0723b0b6fb0722", "7f0e37f1487f531b0b0bb0b6fb0722", "7f0e37f0e37f14898082b0723b02d5", "7ec967f0e37f14998082b0787b06bd", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e37f1487f531b0b0bb0b6fb0722", "7f0e37f0e37f14898082b072297c35", "7ec967f0e37f14998082b0787b06bd", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e27f1487f531b0b0bb0b6fb0722", "7f0e37f0e37f14898082b072297c35", "7ec967f0e37f14998082b0787b06bd", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e27f1487f531b0b0bb0b6fb0722", "7f0e37f0e366aa89801eb072297c35", "7ec967f0e37f14998082b0787b06bd", "7f07e7f0e47f149b0723b0787b0721", "7f0e27f1487f531b0b0bb0b6fb0722", "7f0e37f0e366aa89801eb072297c35", "7ec967f0e37f14998082b0723b06bd", "7f07e7f0e47f149b0723b0787b0721", "7f0e27f0e47f531b0723b0b6fb0722", "7f0e37f0e366aa89801eb072297c35", "7ec967f0e37f14998082b0723b06bd", "7f07e7f0e37f14998083b0787b0721", "7f0e27f0e47f531b0723b0b6fb0722", "7f0e37f0e366aa89801eb072297c35", "7ec967f0e37f14898082b0723b02d5", "7f07e7f0e37f14998082b0787b0721", "7f07e7f0e47f531b0723b0b6fb0722", "7f0e36665b66aa89801e9808297c35", "665f67f0e37f14898082b0723b02d5", "7ec967f0e37f14998082b0787b0721", "7f07e7f0e47f531b0723b0b6fb0722", "7f0e36665b66a449801e9808297c35", "665f67f0e37f14898082b0723b02d5", "7ec967f0e37f14998082b0787b06bd", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e36665b66a449801e9808297c35", "665f67f0e37f14898082b072297c35", "7ec967f0e37f14998082b0787b06bd", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e26665b66a449801e9808297c35", "665f67f0e37f1489801eb072297c35", "7ec967f0e37f14998082b0787b06bd", "7f07e7f0e47f531b0723b0b6fb0721", "7f0e27f1487f531b0b0bb0b6fb0722"];
var l = ["小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑", "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪", "冬至"];
var h = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];
var d = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];
var p = ["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"];
var k = ["初", "十", "廿", "三十"];
var g = ["", "一", "二", "三", "四", "五", "六", "七", "八", "九"];
var n = ["正", "二", "三", "四", "五", "六", "七", "八", "九", "十", "十一", "腊"];

function comefrom(loca,locacity) { this.loca = loca; this.locacity = locacity; } 
where[0]    = new comefrom("选择省份","选择城市");
where[1]    = new comefrom("福建","|安溪|长乐|长泰|长汀|崇安|大田|德化|东山|福安|福鼎|福清|福州|光泽|华安|惠安|吉田|建宁|建瓯|将乐|金门|晋江|连城|连江|龙海|龙溪|龙岩|罗源|闽侯|闽清|明溪|南安|南靖|南平|宁德|宁化|平和|平潭|屏南|莆田|浦城|清流|泉州|三明|沙县|上杭|邵武|寿宁|顺昌|松溪|泰宁|同安|武平|霞浦|厦门|仙游|永安|永春|永定|永泰|云霄|漳平|漳浦|漳州|诏安|柘荣|政和|周宁"); 
where[2]    = new comefrom("广东","|宝安|博罗|潮安|潮阳|潮州|澄海|从化|大埔|德庆|电白|东莞|斗门|恩平|番禺|丰顺|封开|佛岗|佛山|高明|高要|高州|广宁|广州|海丰|海康|海口|和平|河源|鹤山|洪江|花县|化州|怀集|惠东|惠来|惠阳|惠州|江门|蕉岭|揭西|揭阳|开平|乐昌|连南|连平|连山|连县|廉江|龙川|龙门|陆丰|罗定|茂名|梅县|梅州|南澳|南海|南雄|平远|普宁|清远|曲江|饶平|仁化|乳源|三水|汕头|韶关|深圳|始兴|顺德|四会|遂溪|台山|翁源|吴川|五华|新会|新十|新兴|信宜|兴宁|徐闻|阳春|阳江|阳山|英德|郁南|云浮|增城|肇庆|中山|珠海|紫金"); 
where[3]    = new comefrom("北京","|北京|昌平|大兴|房山|怀柔|密云|平谷|顺义|通县|延庆"); 
where[4]    = new comefrom("上海","|宝山|崇明|川沙|奉贤|嘉定|金山|南汇|青浦|上海|松江"); 
where[5]    = new comefrom("天津","|宝坻|蓟县|静海|宁河|天津|武清"); 
where[6]    = new comefrom("重庆","|壁山|长寿|大足|合川|南桐|綦江|荣昌|铜梁|潼南|万盛|永川|重庆"); 
where[7]    = new comefrom("河北","|安次|安国|安平|安新|霸县|柏乡|保定|泊头|博野|沧州|昌黎|成安|承德|赤城|崇礼|磁县|大厂|大城|大名|定县|定兴|东光|肥乡|丰南|丰宁|丰润|抚宁|阜城|阜平|高阳|高邑|藁城|沽源|固安|故城|馆陶|广平|广宗|海兴|邯郸|河间|衡水|怀安|怀来|黄骅|获鹿|鸡泽|冀县|交河|晋县|井陉|景县|巨鹿|康保|宽城|涞水|涞源|廊坊|乐亭|蠡县|临城|临西|临漳|灵寿|隆化|隆尧|卢龙|栾城|滦南|滦平|滦县|满城|孟村|内丘|南官|南和|南皮|宁普|平泉|平山|平乡|迁安|迁西|秦皇岛|青龙|青县|清河|清苑|丘县|曲阳|曲周|饶阳|任丘|任县|容城|三河|沙河|尚义|涉县|深县|深泽|石家庄|束鹿|肃宁|唐海|唐山|唐县|完县|万全|望都|威县|围场|蔚县|魏县|文安|无极|吴桥|武安|武强|武邑|献县|香河|新城|新河|新乐|兴隆|行唐|邢台|雄县|徐水|宣化|盐山|阳原|易县|永年|永清|玉田|元氏|赞皇|枣强|张北|张家口|赵县|正定|涿鹿|涿县|遵化"); 
where[8]    = new comefrom("山西","|安泽|保德|长治|长子|大宁|大同|代县|定襄|繁峙|方由|汾西|汾阳|浮山|高平|古县|广灵|和顺|河津|河曲|洪洞|侯马|壶关|怀仁|浑源|霍县|吉县|稷山|绛县|交城|交口|介休|晋城|静乐|岢岚|岚县|离石|黎城|临汾|临县|临猗|灵丘|灵石|陵川|柳林|娄烦|潞城|孟县|宁武|偏关|平定|平鲁|平陆|平顺|平遥|蒲县|祁县|沁水|沁县|沁源|清徐|曲沃|芮城|山阴|神池|石楼|寿阳|朔县|太谷|太原|天镇|屯留|万荣|文水|闻喜|五台|五寨|武乡|昔阳|夏县|乡宁|襄汾|襄垣|孝义|忻县|新绛|兴县|阳城|阳高|阳曲|阳泉|翼城|应县|永和|永济|右玉|榆次|榆社|垣曲|原平|运城|中阳|左权|左云"); 
where[9]    = new comefrom("内蒙古","|阿巴嘎旗|阿巴哈纳尔旗|阿拉善右旗|阿拉善左旗|阿鲁科尔沁旗|阿荣旗|敖汉旗|巴林右旗|巴林左旗|包头|布特哈旗|察哈尔右翼后旗|察哈尔右翼前旗|察哈尔右翼中旗|陈巴尔虎旗|赤峰|达尔罕茂明安联合旗|达拉特旗|磴口|东胜县|东乌珠穆沁旗|多伦|额尔古纳右旗|额尔古纳左旗|额济纳旗|鄂伦春自治旗|鄂托克旗|鄂托克前旗|鄂温克族自治旗|二连浩特|丰镇|固阳|海拉尔|杭锦后旗|杭锦旗|和林格尔|呼和浩特|化德|集宁|喀喇沁旗|开鲁|科尔沁右翼前旗|科尔沁右翼中旗|科尔沁左翼后旗|科尔沁左翼中旗|克什克腾旗|库伦旗|凉城|林西|临河|满洲里|莫力达瓦达斡尔族自治旗|奈曼旗|宁城|清水河|商都|上默特右旗|上默特左旗|四子王旗|苏尼特右旗|苏尼特左旗|太仆寺旗|通辽|突泉|托克托|翁牛特旗|乌海|乌拉特后旗|乌拉特前旗|乌拉特中旗|乌兰浩特|乌审旗|五原|武川|西乌珠穆沁旗|喜桂图旗|镶黄旗|新巴尔虎右旗|新巴尔虎左旗|兴和|伊金霍洛旗|伊克昭盟|扎鲁特旗|正蓝旗|正镶白旗|准格尔旗|卓资"); 
where[10]   = new comefrom("辽宁","|鞍由|北票|北镇|本溪|昌图|长海|朝阳|大连|大洼|丹东|灯塔|东沟|法库|凤城|抚顺|阜新|复县|盖县|海城|黑山|建昌|建平|金县|锦西|锦县|锦州|开原|康平|宽甸|辽阳|辽中|凌源|盘山|清原|沈阳|绥中|台安|铁法|铁岭|西丰|新宾|新金|新民|兴城|岫岩|义县|营口|垣仁|彰武|庄河"); 
where[11]   = new comefrom("吉林","|安图|白城|长白|长春|长岭|大安|德惠|东丰|敦化|扶余|抚松|海龙|和龙|桦甸|怀德|珲春|辉南|浑江|吉林|集安|蛟河|靖宇|九台|梨树|辽源|柳河|农安|磐石|乾安|舒兰|双辽|双阳|四平|洮安|通化|通榆|图们|汪清|延吉|伊通|永吉|榆树"); 
where[12]   = new comefrom("黑龙江","|阿城|爱辉|安达|巴彦|拜泉|宝清|北安|宾县|勃利|大庆|德都|东宁|杜尔伯特|方正|抚远|富锦|富裕|甘南|哈尔滨|海林|海伦|鹤岗|黑河|呼兰|呼玛|虎林|桦川|桦南|鸡东|鸡四|集贤|加格达奇|佳木斯|嘉荫|克东|克山|兰西|林甸|林口|龙江|萝北|密山|明水|漠河|牡丹江|木兰|穆棱|讷河|嫩江|宁安|七台河|齐齐哈尔|青岗|庆安|饶河|尚志|双城|双鸭山|绥滨|绥芬河|绥化|绥棱|孙吴|塔河|泰来|汤源|铁力|通北|通河|同江|望奎|五常|逊克|延寿|伊春|依安|依兰|肇东|肇源|肇州"); 
where[13]   = new comefrom("安徽","|合肥|长丰|淮南|凤台|淮北|濉溪|芜湖|铜陵|蚌埠|马鞍山|安庆|宿州|宿县|砀山|萧县|吴壁|泗县|五河|固镇|怀远|滁州|嘉山|天长|来安|全椒|定远|凤阳|巢湖|巢县|肥东|含山|和县|无为|卢江|宣城|当涂|郎溪|广德|泾县|南陵|繁昌|宁国|青阳|屯溪|休宁|旌得|绩溪|歙县|祁门|黟县|太平|石台|桐城|纵阳|怀宁|望江|宿松|太湖|岳西|潜山|东至|贵池|六安|霍丘|寿县|肥西|舒城|霍山|金寨|阜阳|毫县|涡阳|蒙城|利辛|颖上|阜南|临泉|界首|太和"); 
where[14]   = new comefrom("江苏","|宝应|滨海|常熟|常州|大丰|丹徒|丹阳|东海|东台|丰县|阜宁|赣榆|高淳|高邮|灌南|灌云|海安|海门|邗江|洪泽|淮安|淮阴|建湖|江都|江宁|江浦|江阴|金湖|金坛|靖江|句容|昆山|溧水|溧阳|连云港|涟水|六合|南京|南通|沛县|邳县|启东|清江|如东|如皋|沙洲|射阳|沭阳|泗洪|泗阳|苏州|宿迁|睢宁|太仓|泰县|泰兴|泰州|铜山|无锡|吴江|吴县|武进|响水|新沂|兴化|盱眙|徐州|盐城|扬中|扬州|仪征|宜兴|镇江"); 
where[15]   = new comefrom("江西","|安福|安义|安远|波阳|崇仁|崇义|大余|德安|德兴|定南|东乡|都昌|分宜|丰城|奉新|抚州|赣县|赣州|高安|广昌|广丰|贵溪|横峰|湖口|会昌|吉安|吉水|金溪|进贤|井冈山|景德镇|靖安|九江|乐安|乐平|黎川|莲花|临川|龙南|南昌|南城|南丰|南康|宁都|宁冈|彭泽|萍乡|铅山|清江|全南|瑞昌|瑞金|上高|上饶|上犹|石城|遂川|泰和|铜鼓|万安|万年|万载|武宁|婺源|峡江|新干|新建|新余|信丰|兴国|星子|修永|寻乌|宜春|宜丰|宜黄|弋阳|鹰潭|永丰|永新|永修|于都|于干|余江|玉山|资溪"); 
where[16]   = new comefrom("山东","|安丘|滨县|滨州|博兴|仓山|曹县|昌乐|昌邑|长岛|长清|成武|茌平|单县|德州|定陶|东阿|东明|东平|东营|肥城|费县|福山|高都|高密|高青|高唐|冠县|广饶|海阳|荷泽|桓台|黄县|惠民|即墨|济南|济宁|济阳|嘉祥|胶南|胶县|金乡|莒南|巨野|鄄城|垦利|莱芜|莱西|莱阳|崂山|乐陵|历城|利津|梁山|聊城|临清|临朐|临沭|临沂|临邑|陵县|蒙阴|牟平|宁津|宁阳|蓬莱|平度|平邑|平阴|平原|栖霞|齐河|青岛|庆云|曲阜|日照|荣成|乳山|商河|寿光|泗水|泰安|郯城|滕县|威海|微山|潍坊|潍县|文登|汶上|无棣|五莲|武城|夏津|莘县|新泰|新汶|烟台|兖州|阳谷|阳信|掖县|沂南|沂水|沂源|营县|鱼台|禹城|郓城|枣庄|沾化|章丘|招远|诸城|淄博|邹平|邹县"); 
where[17]   = new comefrom("河南","|安阳|宝丰|博爱|长葛|长垣|郸城|登封|邓县|范县|方城|封丘|扶沟|巩县|固始|光山|鹤壁|滑县|淮滨|淮阳|潢川|辉县|获嘉|汲县|济源|郏县|焦作|浚县|开封|兰考|林县|临汝|临颖|灵宝|卢氏|鲁山|鹿邑|栾川|罗山|洛宁|洛阳|漯河|孟津|孟县|泌阳|密县|民权|内黄|内乡|南乐|南阳|南召|宁陵|平顶山|平舆|濮阳|淇县|杞县|沁阳|清丰|确山|汝南|汝阳|三门峡|陕县|商城|商丘|商水|上蔡|社旗|沈丘|渑池|嵩县|睢县|遂平|台前|太康|汤阴|唐河|通许|桐柏|尉氏|温贺|武陟|舞阳|西华|西平|西峡|息县|淅川|夏邑|襄城|项城|新安|新蔡|新县|新乡|新野|新郑|信阳|修武|许昌|鄢县|延津|偃师|郾城|叶县|伊川|宜阳|义马|荥阳|永城|虞城|禹县|原阳|柘城|镇平|正阳|郑州|中牟|周口|驻马店"); 
where[18]   = new comefrom("湖北","|安陆|崇阳|大悟|鄂城|广济|汉川|汉阳|红安|黄陂|黄冈|黄梅|黄石|嘉鱼|监利|江陵|京山|荆门|罗川|麻城|蒲圻|蕲春|沙市|十堰|石首|通城|通山|武昌|武汉|浠水|咸宁|襄樊|孝感|新洲|阳新|宜昌|应城|应山|英山|云梦|钟祥");
where[19]   = new comefrom("湖南","|安化|安仁|安乡|保靖|茶陵|长沙|常德|常宁|郴县|郴州|辰溪|城步|慈利|大庸|道县|东安|洞口|凤凰|古丈|桂东|桂阳|汉寿|衡东|衡南|衡山|衡阳|洪江|花垣|华容|怀化|会同|吉首|嘉禾|江华|江永|津市|靖县|来阳|蓝山|泪罗|冷水江|澧县|醴陵|涟源|临澧|临武|临湘|零陵|酃县|浏阳|龙山|隆回|娄底|泸溪|麻阳|南县|宁乡|宁远|平江|祁东|祁阳|黔阳|汝城|桑植|邵东|邵阳|石门|双峰|双牌|绥宁|桃江|桃源|通道|望城|武冈|湘潭|湘乡|湘阴|新化|新晃|新宁|新邵|新田|溆浦|宜章|益阳|永顺|永兴|永州|攸县|沅江|沅陵|岳阳|芷江|株洲|资兴"); 
where[20]   = new comefrom("浙江","|安吉|苍南|长兴|常山|淳安|慈溪|岱山|德清|定海|东阳|洞头|奉化|富阳|海宁|海盐|杭州|湖州|黄岩|嘉善|嘉兴|建德|江山|椒江|金华|缙云|开化|兰溪|乐清|丽水|临安|临海|龙泉|宁波|宁海|瓯海|平湖|平阳|浦江|普陀|青田|庆无|衢州|瑞安|三门|上虞|绍兴|嵊四|嵊县|松阳|遂昌|泰顺|天台|桐庐|桐乡|温岭|温州|文成|武义|仙居|象山|萧山|新昌|义乌|鄞县|永康|永喜|余杭|余姚|玉环|云和|镇海|诸暨"); 
where[21]   = new comefrom("广西","|巴马|百色|北海|北流|宾阳|博白|苍悟|岑溪|崇左|大新|德保|东兰|都安|防城|凤山|扶绥|富川|恭城|灌阳|贵县|桂林|桂平|合浦|合山|河池|贺县|横县|环江|金秀|靖西|来宾|乐业|荔浦|临桂|灵川|灵山|凌云|柳城|柳江|柳州|龙胜|龙州|隆安|隆林|陆川|鹿寨|罗城|马山|蒙山|那坡|南丹|南宁|宁明|平果|平乐|平南|凭祥|浦北|钦州|全州|容县|融安|融水|三江|上林|上思|藤县|天等|天峨|田东|田林|田阳|梧州|武鸣|武宜|西林|象州|忻城|兴安|宜山|邕宁|永福|玉林|昭平|钟山|资源"); 
where[22]   = new comefrom("海南","|白沙|保亭|昌江|澄迈|儋县|定安|东方|海口|乐东|临高|陵水|琼海|琼山|琼中|屯昌|万宁|文昌|崖县"); 
where[23]   = new comefrom("四川","|阿坝|安县|安岳|巴塘|巴中|白玉|百沙|宝兴|北川|布拖|苍溪|长宁|成都|城口|崇庆|达县|大邑|大竹|丹巴|丹棱|道孚|稻城|得荣|德昌|德格|德阳|垫江|娥眉|峨边|丰都|奉节|涪陵|富顺|甘洛|甘孜|高县|古蔺|灌县|光元|广安|广汉|汉源|合江|黑水|红原|洪雅|华云|会东|会理|夹江|犍为|简阳|剑阁|江安|江油|金川|金口|金堂|金阳|井研|九龙|筠连|开江|开县|康定|来易|阆中|乐由|乐至|雷波|理塘|理县|梁平|邻水|隆昌|芦山|泸定|泸县|泸州|炉霍|马边|马尔康|茂汶|眉由|美姑|绵阳|绵竹|冕宁|名山|木里|沐川|内江|纳溪|南部|南川|南江|南坪|南溪|南允|宁南|彭水|彭县|彭由|蓬安|蓬溪|郫县|平昌|平武|屏由|蒲江|普格|琪县|黔江|青川|青神|邛崃|渠县|壤塘|仁寿|荣经|若尔盖|三台|色达|射洪|什邡|石棉|石渠|石柱|双流|松潘|遂宁|天全|通江|万县|万源|旺苍|威远|温江|汶川|巫山|巫溪|武隆|武胜|西昌|西阳|西允|喜德|乡城|小金|新都|新津|新龙|兴文|秀山|叙水|雅安|雅江|盐边|盐亭|盐源|仪陇|宜宾|宜汉|营山|岳池|越西|云阳|昭觉|中江|忠县|资阳|资中|梓潼"); 
where[24]   = new comefrom("贵州","|安龙|安顺|毕节|册亭|岑巩|长顺|赤水|从江|大方|丹寨|道真|德江|都匀|独山|凤冈|福泉|关岭|贵定|贵阳|赫章|黄平|惠水|剑河|江口|金沙|锦屏|开阳|凯里|雷山|黎平|荔波|六盘水|六枝|龙里|罗甸|麻江|湄潭|钠雍|盘县|平坝|平塘|普安|普定|黔西|清镇|晴龙|仁怀|榕江|三都|三穗|师阡|施秉|水城|思南|松桃|绥阳|台江|天柱|桐梓|铜仁|万山|望谟|威宁|瓮安|务川|息烽|习水|兴仁|兴义|修文|沿河|印江|余庆|玉屏|贞丰|镇宁|镇远|正安|织金|紫云|遵义"); 
where[25]   = new comefrom("云南","|安宁|保由|碧江|宾川|沧源|昌宁|呈贡|澄江|楚雄|大关|大理|大姚|德钦|峨山|洱源|凤庆|福贡|富民|富宁|富源|个旧|耿马|贡山|沽益|广南|河口|鹤庆|黑江|红河|华宁|华坪|会泽|建水|剑川|江城|江川|金平|晋宁|景东|景谷|景淇|开远|昆明|兰坪|澜沦|丽江|梁河|临沦|龙陵|陇川|泸水|泸西|鲁甸|陆良|禄丰|禄劝|路南|潞西|绿春|罗平|麻栗坡|马关|马龙|勐海|勐腊|蒙自|孟连|弥渡|弥勒|牟定|南华|南涧|宁蒗|屏边|普洱|巧家|丘北|曲靖|瑞丽|师宗|施甸|石屏|双柏|双江|思茅|嵩明|绥江|腾冲|通海|畹町|威信|巍山|维西|文山|武定|西畴|西盟|下关|祥云|新平|宣威|寻甸|盐津|砚山|漾濞|姚安|宜良|彝良|易门|盈江|永德|永富|永平|永仁|永善|永胜|玉溪|元江|元谋|元阳|云龙|云县|昭通|镇康|镇雄|镇沅|中甸");
where[26]   = new comefrom("西藏","|安多|昂仁|八宿|巴青|白朗|班戈|比如|边坝|波密|察雅|察隅|措美|措勤|错那|达孜|当雄|丁青|定结|定日|堆龙德庆|噶尔|改则|岗巴|革吉|工布江达|贡嘎|贡觉|吉隆|加查|嘉黎|江达|江孜|康马|拉萨|拉孜|朗县|浪卡子|类乌齐|林芝|林周|隆子|吕都|洛隆|洛扎|芒康|米林|墨脱|墨竹工卡|那曲|乃东|南木林|尼木|聂拉木|聂荣|普兰|穷结|曲水|曲松|仁布|日喀则|日上|萨嘎|萨迦|桑日|申扎|索县|谢通门|亚东|扎达|扎囊|仲巴|左贡"); 
where[27]   = new comefrom("陕西","|安康|安寨|白河|白水|宝鸡|彬县|长安|长武|成城|城固|淳化|丹凤|定边|凤县|凤翔|佛坪|浮风|府谷|富平|富县|甘泉|高陵|韩城|汉阴|汉中|合阳|横山|户县|华县|华阴|黄陵|黄龙|佳县|泾阳|靖边|岚皋|蓝田|礼泉|临潼|麟游|留坝|陇县|略阳|洛川|洛南|眉县|米脂|勉县|南郑|宁强|宁陕|平利|蒲城|岐山|千阳|乾县|清涧|人荔|三原|山阳|商南|商县|神木|石泉|绥德|太白|铜川|潼关|渭南|吴堡|吴旗|武功|西安|西乡|咸阳|兴平|旬阳|旬邑|延安|延长|延川|洋县|耀县|宜川|宜君|永寿|榆林|镇安|镇巴|镇坪|志丹|周至|子长|子洲|紫阳|柞水"); 
where[28]   = new comefrom("甘肃","|阿克塞|安西|成县|崇信|宕昌|迭部|定西|东乡|敦煌|甘谷|皋兰|高台|古浪|广河|合水|和政|华池|华亭|环县|徽县|会宁|积石山|金塔|泾川|景泰|靖远|静宁|酒泉|康乐|康县|兰州|礼县|两当|临潭|临洮|临夏|临泽|灵台|陇西|碌曲|玛曲|民乐|民勤|岷县|宁县|平凉|秦安|清水|庆阳|山丹|肃北|肃南|天水|天祝|通渭|渭源|文县|武都|武山|武威|西和|下河|永昌|永登|永靖|榆中|玉门|张家川|张掖|漳县|镇源|舟曲|庄浪|庄宁|卓尼"); 
where[29]   = new comefrom("宁夏","|固原|海原|贺兰|泾源|灵武|隆德|平罗|青铜峡|石嘴山|陶乐|同心|吴忠|西吉|盐池|银川|永宁|中宁|中卫"); 
where[30]   = new comefrom("青海","|班玛|称多|达日|大通|都兰|甘德|刚察|格尔木|共和|贵德|贵南|海晏|河南|互助|化隆|湟源|湟中|尖扎|久治|乐都|玛多|玛沁|门源|民和|囊谦|平安|祁连|曲麻菜|天峻|同德|同仁|乌兰|西宁|兴海|循化|玉树|杂多|泽库|治多"); 
where[31]   = new comefrom("新疆","|阿合奇|阿克苏|阿克陶|阿勒泰|阿图什|阿瓦提|巴楚|巴里坤|拜城|博湖|博乐|布尔津|策勒|察布察尔|昌吉|额敏|福海|阜康|富蕴|巩留|哈巴河|哈密|和布克赛尔|和静|和硕|和田|呼图壁|霍城|吉木乃|吉木萨尔|枷师|精河|柯平|克拉玛依|库车|库尔勒|奎屯|乐普湖|咯什|轮台|洛浦|玛纳斯|麦盖提|米泉|民丰|墨玉|木垒|尼勒克|皮山|奇台|青河|沙湾|沙雅|莎车|鄯善|石河子|疏附|疏勒|塔城|塔什库尔干|特克斯|吐鲁番|托克逊|托里|尉梨|温泉|温宿|乌鲁木齐|乌恰|乌什|乌苏|新和|新源|焉耆|叶城|伊宁|伊吾|英吉沙|于田|裕民|泽普|昭苏"); 
where[32]   = new comefrom("香港","香港"); 
where[33]   = new comefrom("澳门","澳门"); 
where[34]   = new comefrom("台湾","|台北市|桃园县市|台南县|东引岛|高雄市|新竹县|高雄县|马 祖|基隆市|苗栗县市|屏东县市|金 门|新竹市|台中县|花莲县市|台中市|彰化县市|台东县市|台南市|南投县市|绿 岛|台北县|云林县|兰 屿|宜兰县市|嘉义县市|澎湖县"); 
where[35]   = new comefrom("自填经度","自填经度"); 

var lunarInfo=new Array( 
0x04bd8,0x04ae0,0x0a570,0x054d5,0x0d260,0x0d950,0x16554,0x056a0,0x09ad0,0x055d2, 
0x04ae0,0x0a5b6,0x0a4d0,0x0d250,0x1d255,0x0b540,0x0d6a0,0x0ada2,0x095b0,0x14977, 
0x04970,0x0a4b0,0x0b4b5,0x06a50,0x06d40,0x1ab54,0x02b60,0x09570,0x052f2,0x04970, 
0x06566,0x0d4a0,0x0ea50,0x06e95,0x05ad0,0x02b60,0x186e3,0x092e0,0x1c8d7,0x0c950, 
0x0d4a0,0x1d8a6,0x0b550,0x056a0,0x1a5b4,0x025d0,0x092d0,0x0d2b2,0x0a950,0x0b557, 
0x06ca0,0x0b550,0x15355,0x04da0,0x0a5d0,0x14573,0x052b0,0x0a9a8,0x0e950,0x06aa0, 
0x0aea6,0x0ab50,0x04b60,0x0aae4,0x0a570,0x05260,0x0f263,0x0d950,0x05b57,0x056a0, 
0x096d0,0x04dd5,0x04ad0,0x0a4d0,0x0d4d4,0x0d250,0x0d558,0x0b540,0x0b5a0,0x195a6, 
0x095b0,0x049b0,0x0a974,0x0a4b0,0x0b27a,0x06a50,0x06d40,0x0af46,0x0ab60,0x09570, 
0x04af5,0x04970,0x064b0,0x074a3,0x0ea50,0x06b58,0x055c0,0x0ab60,0x096d5,0x092e0, 
0x0c960,0x0d954,0x0d4a0,0x0da50,0x07552,0x056a0,0x0abb7,0x025d0,0x092d0,0x0cab5, 
0x0a950,0x0b4a0,0x0baa4,0x0ad50,0x055d9,0x04ba0,0x0a5b0,0x15176,0x052b0,0x0a930, 
0x07954,0x06aa0,0x0ad50,0x05b52,0x04b60,0x0a6e6,0x0a4e0,0x0d260,0x0ea65,0x0d530, 
0x05aa0,0x076a3,0x096d0,0x04bd7,0x04ad0,0x0a4d0,0x1d0b6,0x0d250,0x0d520,0x0dd45, 
0x0b5a0,0x056d0,0x055b2,0x049b0,0x0a577,0x0a4b0,0x0aa50,0x1b255,0x06d20,0x0ada0, 
0x14b63); 


var m = {
	yearDataCache: {},
	getDate: function(u) {
		var x = Math.ceil((u - new Date(1899, 1, 10)) / 86400000);
		var w = 1899;
		var s;
		var r;
		var q;
		var t;
		var v;
		for(; w < 2100 && x > 0; w++) {
			s = this.getYearDays(w);
			x -= s
		}
		x < 0 && (x += s, w--);
		q = w;
		r = this.getLeapMonth(q) || false;
		for(w = 1; w <= 12; w++) {
			s = this.getMonthDays(q, w);
			if(r === true) {
				r = false;
				w--;
				s = this.getLeapDays(q);
				if(x < s) {
					t = true
				}
			}
			if(r === w) {
				r = true
			}
			if(x < s) {
				v = s === 30;
				break
			}
			x -= s
		}
		return {
			lunarYear: q,
			lunarMonth: w,
			lunarDay: x + 1,
			isLeap: t,
			isBigMonth: v
		}
	},
	getYearDays: function(q) {
		var r;
		var t = this.yearDataCache;
		if(t[q]) {
			return t[q]
		}
		var s = 348;
		var u = j[q - 1899];
		for(r = 32768; r > 8; r >>= 1) {
			s += r & u ? 1 : 0
		}
		s += this.getLeapDays(q);
		t[q] = s;
		return s
	},
	getLeapDays: function(q) {
		return this.getLeapMonth(q) ? (j[q - 1899 + 1] & 15 === 15 ? 30 : 29) : 0
	},
	getLeapMonth: function(r) {
		var q = j[r - 1899] & 15;
		return q == 15 ? 0 : q
	},
	getMonthDays: function(r, q) {
		return(j[r - 1899] & (65536 >> q)) ? 30 : 29
	}
};
var b = function(u, r) {
	var v = o[u - 1900];
	var t = [];
	var s = 0;
	var q;
	for(; s < 30; s += 5) {
		q = (+("0x" + v.substr(s, 5))).toString();
		t.push(q.substr(0, 1));
		t.push(q.substr(1, 2));
		t.push(q.substr(3, 1));
		t.push(q.substr(4, 2))
	}
	return new Date(u, parseInt(r / 2, 10), t[r])
};

/*
从已知日期计算干支纪日的公式为：

G = 4C + [C / 4] + 5y + [y / 4] + [3 * (M + 1) / 5] + d - 3

Z = 8C + [C / 4] + 5y + [y / 4] + [3 * (M + 1) / 5] + d + 7 + i

其中 C 是世纪数减一，y 是年份后两位，M 是月份，d 是日数。1月和2月按上一年的13月和14月来算。奇数月i=0，偶数月i=6。G 除以10的余数是天干，Z 除以12的余数是地支。

计算时带[ ]的数表示取整。

例如：查2006年4月1日的干支日。将数值代入计算公式。

G =4*20 + [20 / 4] + 5*06 + [06 / 4] + [3 * (4 + 1) / 5] + 1 - 3 =197

除以10 余数为 7 ，天干的第7位是‘庚’。

Z =8*20 + [20 / 4] + 5*06 + [06 / 4] + [3 * (4 + 1) / 5] + 1 + 7 + 6 =213

除以12 余数为 9 ，地支的第9位是‘申’。

答案是：2006年4月1日的干支日是庚申日。
*/
var c = {
	calculate: function(q) {
		return h[q % 10] + d[q % 12]
	},
	getGzYear: function(r, s, q) {
		return this.calculate(s - 1900 + 36 - (q === s ? 0 : 1))
	},
	getGzMonth: function(q, r, s) {
		var t = b(r, q.getMonth() * 2);
		return this.calculate((r - 1900) * 12 + s + 12 - (q < t ? 1 : 0))
	},
	getGzDay: function(q) {
		var t = new Date('Thu Jan 01 1970 00:00:00 GMT+0800 (CST)')
		var debug_t = (q - t) / 86400000
		return this.calculate(Math.floor((q - t) / 86400000 )+ 25567 + 10)
	},
	/*

     北京时间  			甲己 乙庚 丙辛 丁壬 戊癸  
	 子【水】 23----1 	甲子 丙子 戊子 庚子 壬子  
	 丑【土】 1----3 	乙丑 丁丑 己丑 辛丑 癸丑  
	 寅【木】 3----5 	丙寅 戊寅 庚寅 壬寅 甲寅  
	 卯【木】 5----7 	丁卯 己卯 辛卯 癸卯 乙卯  
	 辰【土】 7----9 	戊辰 庚辰 壬辰 甲辰 丙辰  
	 巳【火】 9----11 	己巳 辛巳 癸巳 乙巳 丁巳  
	 午【火】 11----13 	庚午 壬午 甲午 丙午 戊午  
	 未【土】 13----15 	辛未 癸未 乙未 丁未 己未  
	 申【金】 15----17 	壬申 甲申 丙申 戊申 庚申  
	 酉【金】 17----19 	癸酉 乙酉 丁酉 己酉 辛酉  
	 戌【土】 19----21 	甲戌 丙戌 戊戌 庚戌 壬戌  
	 亥【水】 21----23 	乙亥 丁亥 己亥 辛亥 癸亥
	*/
	getGzTime: function(q) {
		var t = new Date('Thu Jan 01 1970 00:00:00 GMT+0800 (CST)')
		var debug_t = (q - t) / 86400000
		var dateh = Math.floor((q - t) / 86400000 + 25567 + 10)
		var v = dateh % 5;
		var hour = q.getHours();
		hour = Math.floor(hour/2 + 0.5) % 12
		return h[ (v*2+hour+1) % 10] + d[hour % 12]
	}
};
/***************************************************************************** 
                                      日期计算 
*****************************************************************************/ 

class SixrandomModule extends React.Component {
/***************************************************************************** 
                                      日期爻动 
*****************************************************************************/ 

get_six_random_help_myth()
/*
神煞
寅午戌马在申，桃花在卯；
亥卯未马在巳，桃花在子；
申子辰马在寅，桃花在酉；
巳酉丑马在亥，桃花在午。

甲禄在寅，乙禄在卯，丙戊禄在巳，丁己禄在午，庚禄在申，辛禄在酉，壬禄在亥，癸禄在子。
 
贵人
甲戊兼牛羊，乙己 鼠猴乡，丙丁猪鸡位，壬癸兔蛇藏，庚辛逢虎马
*/
{
	var m = startinfo.gzDate.slice(1)
	var n = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];
	var x = ["寅", "亥", "申", "巳", "寅", "亥", "申", "巳", "寅", "亥", "申", "巳"];
	var th = ["申","巳", "寅", "亥"]
	var tt = ["卯","子", "酉", "午"]
	var q = n.indexOf(m);
	var p = x[q]
	six_random_help_myth[0] = p
	six_random_help_myth[1] = tt[th.indexOf(p)]

	var l = ["寅", "卯", "巳", "午", "巳", "午", "申", "酉", "亥", "子"];
	var ll = startinfo.gzDate.slice(0,1);
	var o = h.indexOf(ll);
	six_random_help_myth[2] = l[o];

	var g = ["丑,未", "子,申", "酉,亥", "酉,亥", "丑,未", "子,申", "寅,午", "寅,午", "卯,巳", "卯,巳"];
	var k = h.indexOf(ll)
	six_random_help_myth[3] = g[k];
}
get_six_random_myth()
/*
六神
甲乙起青龙.丙丁起朱雀.戊己起勾陈,庚辛起白虎.壬癸起玄武
*/
{
	var a = ["青龙","朱雀","勾陈","縢蛇","白虎","玄武"];
	var n = ["青龙","青龙","朱雀","朱雀","勾陈","縢蛇","白虎","白虎","玄武","玄武"];
	var m = startinfo.gzDate.slice(0,1)
	var b = h.indexOf(m);
	var c = a.indexOf(n[b])

	for(index = 0;index<randomtime;index++)
    {
        six_random_myth[randomtime - index] = a[(c+index)%6];
    }
}

get_one_random()
/*
六爻的启动测试，取三次正反，0表示反面，1表示证明
000表示全阴X
111表示全阳O
010表示少阴
100表示少阴
001表示少阴
101表示少阳
011表示少阳
110表示少阳
将结果加合就得到了4种结果，0 1 2 3 
0 老阴 1 少阴 2 少阳 3 全阳
*/
{

    three_random[0]=Math.random(1)>=0.5?1:0;
    three_random[1]=Math.random(1)>=0.5?1:0;
    three_random[2]=Math.random(1)>=0.5?1:0;
    return  three_random[0] + three_random[1] + three_random[2];
    
}

get_six_original_random()
/*
获取本卦六爻
*/
{

    for(index = 0;index<randomtime;index++)
    {
        six_random[randomtime - index] = get_one_random();
    }
}
 recover_six_original_random(lunardate)
/*
获取本卦六爻
*/
{
    for(index = 0;index<randomtime;index++)
    {
        six_random[randomtime - index] = lunardate[randomtime-index-1];
	}
	//alert(six_random)
}
 get_six_change_random()
/*
获得变卦六爻
老阴变少阳
老阳变少阴
*/
{
    for(index = 0;index<randomtime;index++)
    {
        if(oldnegativevalue == six_random[randomtime-index])
        {
            six_change_random[randomtime-index] = positivevalue
        }
        else if(oldpositivevalue == six_random[randomtime-index])
        {
            six_change_random[randomtime-index] = negativevalue
        }
        else
        {
            six_change_random[randomtime-index] = six_random[randomtime-index]
        }
        
    }
}

 get_empty_sixty_cycle(date)
/*
天干地支虚空表
输入："戊子"
得到："午""未"（array）
*/
{
	
    var skydate = date.slice(0,1);
    var earthdate = date.slice(1);
    var i = h.indexOf(skydate);
    var j = d.indexOf(earthdate);
    return sixtycycletable[(10-i+j)%12]+sixtycycletable[(10-i+j+1)%12];
}

 get_empty_date()
{
	six_random_empty[0] = this.get_empty_sixty_cycle(startinfo.gzYear);
	six_random_empty[1] = this.get_empty_sixty_cycle(startinfo.gzMonth);
	six_random_empty[2] = this.get_empty_sixty_cycle(startinfo.gzDate);
	six_random_empty[3] = this.get_empty_sixty_cycle(startinfo.gzTime);
}


 lunar_f(cur) 
/*
获得当前农历信息
*/
{
    var r = undefined==cur?new Date():new Date(cur);
	var w = r.getFullYear();
	var u = r.getMonth() + 1;
	var y = r.getDate();
	var v = (u - 1) * 2;
	var s = b(w, v);
	var q;
	var t = "";
	if(y != s.getDate()) {
		q = b(w, v + 1);
		if(y == q.getDate()) {
			t = l[v + 1]
		}
	} else {
		t = l[v]
	}
	var x = m.getDate(r);
	return {
		Hours:r.getHours(),
		Time:r.getHours(),
		Date:r.getDate(),
		Month:r.getMonth()+1,
		Year:r.getFullYear(),
		animal: p[(x.lunarYear - 4) % 12],
		gzTime: c.getGzTime(r),
		gzDate: c.getGzDay(r),
		gzMonth: c.getGzMonth(r, w, u),
		gzYear: c.getGzYear(r, w, x.lunarYear),
		lunarYear: x.lunarYear,
		lunarMonth: x.lunarMonth,
		lunarDate: x.lunarDay,
		lMonth: (x.isLeap ? "闰" : "") + n[x.lunarMonth - 1],
		lDate: x.lunarDay % 10 == 0 ? ["初十", "二十", "三十"][x.lunarDay / 10 - 1] : k[parseInt(x.lunarDay / 10, 10)] + g[parseInt(x.lunarDay % 10, 10)],
		term: t,
		isBigMonth: x.isBigMonth,
		oDate: r,
		cnDay: "日一二三四五六七".charAt(r.getDay())
	}
};

 get_six_random_date()
{
	six_random_date[0] = "公历：" + startinfo.Year + " " + startinfo.Month + " " + startinfo.Date + " " + startinfo.Hours + ":" + startinfo.oDate.getMinutes() 
	six_random_date[1] = "农历：" + startinfo.lunarYear + " " + startinfo.lunarMonth + " " + startinfo.lunarDate
	six_random_date[2] = "四柱：" + startinfo.gzYear + " " + startinfo.gzMonth + " " + startinfo.gzDate + " " + startinfo.gzTime 
}

 get_random_name()
{
	six_random_date[3] = "旬空：" + six_random_empty[0] + " " + six_random_empty[1] + " " + six_random_empty[2] + " " + six_random_empty[3] 
	six_random_date[4] = "神煞：" + "驿马-" + six_random_help_myth[0] + " 桃花-" + six_random_help_myth[1] + " 日禄-" + six_random_help_myth[2] + " 贵人-" + six_random_help_myth[3] 
	var ooup=oodown=ocup=ocdown="";
	for(index = 0;index<randomtime;index++)
    {
		if(oldnegativevalue==six_random[index+1])
		{
			if(index<randomtime/2)
			{
				ooup=ooup+"0"
				ocup=ocup+"1"
			}
			else{
				oodown=oodown+"0"
				ocdown=ocdown+"1"
			}
			
		}
		else if(oldpositivevalue==six_random[index+1])
		{
			if(index<randomtime/2)
			{
				ooup=ooup+"1"
				ocup=ocup+"0"
			}
			else{
				oodown=oodown+"1"
				ocdown=ocdown+"0"
			}
		}
		else if(positivevalue==six_random[index+1])
		{
			if(index<randomtime/2)
			{
				ooup=ooup+"1"
				ocup=ocup+"1"
			}
			else{
				oodown=oodown+"1"
				ocdown=ocdown+"1"
			}
		}
		else if(negativevalue==six_random[index+1])
		{
			if(index<randomtime/2)
			{
				ooup=ooup+"0"
				ocup=ocup+"0"
			}
			else{
				oodown=oodown+"0"
				ocdown=ocdown+"0"
			}
		}
	}
	six_random_date[5] = ooup+oodown
	six_random_date[6] = ocup+ocdown
	six_random_date[7] = six_random_NaJia[six_random_date[5]]
	six_random_date[8] = six_random_NaJia[six_random_date[6]];
}
get_simple_random_draw()
{
	var _build = new Array();

	_build.push("")
	_build.push("")
	_build.push(six_random_date[0]);
	_build.push(six_random_date[1]);
	_build.push("")
	_build.push(six_random_date[7].name)


	for(index = 0;index<randomtime;index++)
    {
		if(oldnegativevalue==six_random[randomtime-index])
		{
			six_random_draw[randomtime-index] =  negativedraw 
		}
		else if(oldpositivevalue==six_random[randomtime-index])
		{
			six_random_draw[randomtime-index] =  positivedraw 
		}
		else if(positivevalue==six_random[randomtime-index])
		{
			six_random_draw[randomtime-index] =  positivedraw 
		}
		else if(negativevalue==six_random[randomtime-index])
		{
			six_random_draw[randomtime-index] =  negativedraw 
		}
	}

	for(index = 0;index<randomtime;index++)
    {
		_build.push(six_random_draw[index+1]);
	}

	return _build
}

 get_random_draw()
{
	
	var _build = new Array();
	_build.push(six_random_date[0]);
	_build.push(six_random_date[1]);
	_build.push(six_random_date[2]);
	_build.push(six_random_date[3]);
	_build.push(six_random_date[4]);
	//console.log(six_random_date[5]);
	//console.log(six_random_date[6]);
	_build.push("")
	_build.push(("      本卦：        "+six_random_date[7].name+"     变卦："+six_random_date[8].name))
	
	//console.log();
	var o = ["","上爻","五爻","四爻","三爻","二爻","初爻"]

	for(index = 0;index<randomtime;index++)
    {
		six_random_draw[randomtime-index] = six_random_myth[randomtime-index]+":"+o[randomtime-index]+"          ";
		if(oldnegativevalue==six_random[randomtime-index])
		{
			six_random_draw[randomtime-index] = six_random_draw[randomtime-index] + negativedraw +" "+ negativechangedraw +" "
		}
		else if(oldpositivevalue==six_random[randomtime-index])
		{
			six_random_draw[randomtime-index] = six_random_draw[randomtime-index] + positivedraw +" "+ positivechangedraw +" "
		}
		else if(positivevalue==six_random[randomtime-index])
		{
			six_random_draw[randomtime-index] = six_random_draw[randomtime-index] + positivedraw +" "+ nonechangedraw +" "
		}
		else if(negativevalue==six_random[randomtime-index])
		{
			six_random_draw[randomtime-index] = six_random_draw[randomtime-index] + negativedraw +" "+ nonechangedraw +" "
		}
	}

	for(index = 0;index<randomtime;index++)
    {
		if(oldnegativevalue==six_change_random[randomtime-index])
		{
			six_random_draw[randomtime-index] = six_random_draw[randomtime-index] + negativedraw
		}
		else if(oldpositivevalue==six_change_random[randomtime-index])
		{
			six_random_draw[randomtime-index] = six_random_draw[randomtime-index] + positivedraw
		}
		else if(positivevalue==six_change_random[randomtime-index])
		{
			six_random_draw[randomtime-index] = six_random_draw[randomtime-index] + positivedraw
		}
		else if(negativevalue==six_change_random[randomtime-index])
		{
			six_random_draw[randomtime-index] = six_random_draw[randomtime-index] + negativedraw
		}
	}

	for(index = 0;index<randomtime;index++)
    {
		_build.push(six_random_draw[index+1]);
	}

	_build.push("")
	for(index = 0;index<randomtime;index++)
    {
		var t = index+1
		var n = six_random_date[7][t]
		var change = 5==n.length?true:false;
		var fs = "f"+t
		if(undefined === six_random_date[7][fs])
		{
			n = "                " + n
		}
		else
		{
			n =  six_random_date[7][fs]+ " " + n
		}
		var c = six_random[t]
		var cc = ""
		if(3==c)
		{

					cc= positivechangedraw + " "

			
		}
		else if(0==c)
		{

					cc=negativechangedraw + " "

			
		}
		else
		{

					cc= "        "

			
		}

		if(true==change)
		{
			n = six_random_myth[t] +" "+ n + " "

			_build.push(n+"     "+cc+six_random_date[8][t]);

		}
		else
		{
			n = six_random_myth[t] +" "+ n + " "

			_build.push(n+cc+six_random_date[8][t]);
			
		}
		
	}

	_build.push(six_random_date[7].extname)
	_build.push(six_random_date[7].extnameexp)
	_build.push(six_random_date[7].extexp)
	_build.push(six_random_date[7].ext)
	for(index =1 ;index < 13 ;index++)
	{
		var x = "exp"+index
		_build.push(six_random_date[7][x])
	}
	return _build
}

 get_six_random()
/*
获取本卦，变卦，时间，天干，地支，用神，旬空，六亲
*/
{
	
	this.get_six_random_date();
   
    //变卦
    this.get_six_change_random();
    //伏神纳甲世应
    //旬空
    this.get_empty_date();
    //神煞
	this.get_six_random_help_myth()
    //六神
	this.get_six_random_myth()
	//装卦
	this.get_random_name()
	//调试画卦
	//this.get_random_draw();
	return {
		info:startinfo,
		six_random_date:six_random_date,
		six_random:six_random,
		six_change_random:six_change_random,
		six_random_empty:six_random_empty,
		six_random_myth:six_random_myth,
		six_random_help_myth:six_random_help_myth,
		//htmldraw:htmldraw,
		//htmlchangedraw:htmlchangedraw,
		//htmlmythdraw:htmlmythdraw,
		//htmlnajiadraw:htmlnajiadraw,
		//htmlnajiachangedraw:htmlnajiachangedraw,
		//htmlchangeinfodraw:htmlchangeinfodraw,
	}
	
}

 lunarsix()
/*
六爻发动
*/
{
	//取爻
	startinfo = lunar_f();
	get_six_original_random();
    //本卦爻变
	return get_six_random();
	//存盘序列化
}

 getArgs()
{
        var args = {};
        var match = null;
        var search = decodeURIComponent(location.search.substring(1));
        var reg = /(?:([^&]+)=([^&]+))/g;
        while((match = reg.exec(search))!==null){
            args[match[1]] = match[2];
        }
        return args;
}

 recoverlunarsix(ret_info=null)
{
	//Mon Jul 10 2017 23:43:54 GMT+0800 (CST)
	var info = ret_info
	startinfo = this.lunar_f(info.date);
	//alert(startinfo)
	this.recover_six_original_random(info.lunar)
    //本卦爻变
	return this.get_six_random();
	//return null
	//存盘序列化
}

	 build(msg)
	{
		var info = null;
		
		var ret;
		var args = {};
        var match = null;
        var search = decodeURIComponent(msg.substring(1));
        var reg = /(?:([^&]+)=([^&]+))/g;
        while((match = reg.exec(search))!==null){
            args[match[1]] = match[2];
        }
		info = args
		//alert(info)
		
		ret = this.recoverlunarsix(info)
		return ret
	}
}

var sixrandommodule = new SixrandomModule()
module.exports=sixrandommodule;  