
import React, {Component} from 'react';
import {AppRegistry,View,Text} from 'react-native';
import {six_random_NaJia} from '../../kit/UniversechangesLib/SixrandomLib/SixrandomModule'

var UniversBookPageModule = new Array()
var UniversBookPageModule = new Array()
UniversBookPageModule[0] = {"icon":"☯️","key":"0","name": "六十四卦序","p":"总序","content":[
    "乾、坤、震、艮、离、坎、兑、巽",
    "☰、☷、☳、☶、☲、☵、☱、☴",
    "乾三连，坤六断；震仰盂，艮覆碗。",
    "离中虚，坎中满；兑上缺，巽下断。",

]}
var randomindex = 0
for(var key in six_random_NaJia){
  randomindex = six_random_NaJia[key].key
  UniversBookPageModule[randomindex]=six_random_NaJia[key]
  UniversBookPageModule[randomindex].content = [
    six_random_NaJia[key].name,
    six_random_NaJia[key].icon,
    
    undefined!=six_random_NaJia[key].extname?six_random_NaJia[key].extname:"",
    undefined!=six_random_NaJia[key].extnameexp?six_random_NaJia[key].extnameexp:"",
    undefined!=six_random_NaJia[key].base?six_random_NaJia[key].base:"",
    undefined!=six_random_NaJia[key].def?six_random_NaJia[key].def:"",
    undefined!=six_random_NaJia[key].story?six_random_NaJia[key].story:"",
    undefined!=six_random_NaJia[key].extexp?six_random_NaJia[key].extexp:"",
    undefined!=six_random_NaJia[key].extexp1?six_random_NaJia[key].extexp1:"",
    undefined!=six_random_NaJia[key].ext?six_random_NaJia[key].ext:"",
    undefined!=six_random_NaJia[key].exp1?six_random_NaJia[key].exp1:"",
    undefined!=six_random_NaJia[key].exp2?six_random_NaJia[key].exp2:"",
    undefined!=six_random_NaJia[key].exp3?six_random_NaJia[key].exp3:"",
    undefined!=six_random_NaJia[key].exp4?six_random_NaJia[key].exp4:"",
    undefined!=six_random_NaJia[key].exp5?six_random_NaJia[key].exp5:"",
    undefined!=six_random_NaJia[key].exp6?six_random_NaJia[key].exp6:"",
    undefined!=six_random_NaJia[key].exp7?six_random_NaJia[key].exp7:"",
    undefined!=six_random_NaJia[key].exp8?six_random_NaJia[key].exp8:"",
    undefined!=six_random_NaJia[key].exp9?six_random_NaJia[key].exp9:"",
    undefined!=six_random_NaJia[key].exp10?six_random_NaJia[key].exp10:"",
    undefined!=six_random_NaJia[key].exp11?six_random_NaJia[key].exp11:"",
    undefined!=six_random_NaJia[key].exp12?six_random_NaJia[key].exp12:"",
    undefined!=six_random_NaJia[key].exp13?six_random_NaJia[key].exp13:"",
    undefined!=six_random_NaJia[key].exp14?six_random_NaJia[key].exp14:"",
  ]
  UniversBookPageModule[randomindex].index = "易经"
}
UniversBookPageModule[65]={"icon":"☯️","key":"65","name": "系辞上传","p":"十翼","index":"易经","content":[
    "系辞传上·第一章 \n\n\t天尊地卑，乾坤定矣。卑高以陈，贵贱位矣。动静有常，刚柔断矣。方以类聚，物以群分，吉凶生矣。　在天成象，在地成形，变化见矣。\n\t是故刚柔相摩，八卦相荡，鼓之以雷霆，润之以风雨；日月运行，一寒一暑。\n\t乾道成男，坤道成女。乾知大始，坤作成物。\n\t乾以易知，坤以简能；易则易知，简则易从；易知则有亲，易从则有功；有亲则可久，有功则可大；可久则贤人之德，可大则贤人之业。易简而天下之理得矣。天下之理得，而成位乎其中矣。",
    "系辞传上·第二章  \n\n\t圣人设卦观象，系辞焉！而明吉凶，刚柔相推而生变化。是故吉凶者，失得之象也；悔吝者，忧虞之象也；变化者，进退之象也；刚柔者，昼夜之象也。六爻之动，三极之道也。\n\t是故君子所居而安者，《易》之序也；所乐而玩者，爻之辞也。是故君子居则观其象而玩其辞，动则观其变而玩其占，是以自天佑之，吉无不利。",
    "系辞传上·第三章\n\n\t彖者，言乎象者也；爻者，言乎变者也。吉凶者，言乎其失得也；悔吝者，言乎其小疵也。无咎者，善补过者也。\n\t是故列贵贱者存乎位，齐小大者存乎卦，辩吉凶者存乎辞，忧悔吝者存乎介，震无咎者存乎悔。\n\t是故卦有小大，辞有险易；辞也者，各指其所之。",
    "系辞传上·第四章\n\n\t《易》与天地准，故能弥纶天地之道。\n\t仰以观于天文，俯以察于地理，是故知幽明之故；\n\t原始反终，故知死生之说；精气为物，游魂为变，是故知鬼神之情状。\n\t与天地相似，故不违；知周乎万物，而道济天下，故不过；旁行而不流，乐天知命，故不忧；安土敦乎仁，故能爱。范围天地之化而不过，曲成万物而不遗，通乎昼夜之道而知，故神无方而《易》无体。",
    "系辞传上·第五章\n\n\t一阴一阳之谓道。\n\t继之者善也，成之者性也。仁者见之谓之仁，知者见之谓之知，百姓日用而不知，故君子之道鲜矣。\n\t显诸仁，藏诸用，鼓万物而不与圣人同忧，盛德大业至矣哉！\n\t富有之谓大业，日新之谓盛德。生生之谓易，成象之谓乾，效法之谓坤，极数知来之谓占，通变之谓事，阴阳不测之谓神。",
    "系辞传上·第六章\n\n\t夫《易》广矣大矣，以言乎远则不御，以言乎迩则静而正，以言乎天地之间则备矣。\n\t夫乾，其静也专，其动也直，是以大生焉。\n\t夫坤，其静也翕，其动也辟，是以广生焉。\n\t广大配天地，变通配四时，阴阳之义配日月，易简之善配至德。",
    "系辞传上·第七章\n\n\t子曰：《易》，其至矣乎！ \n\t夫《易》，圣人所以崇德而广业也。知崇礼卑，崇效天，卑法地。天地设位，而《易》行乎其中矣。成性存存，道义之门。",
    "系辞传上·第八章\n\n\t圣人有以见天下之赜，而拟诸其形容，像其物宜，是故谓之象。\n\t圣人有以见天下之动，而观其会通，以行其典礼，系辞焉以断其吉凶，是故谓之爻。\n\t言天下之至赜而不可恶也。言天下之至动而不可乱也。拟之而后言，议之而后动，拟议以成其变化。\n\t「鸣鹤在阴，其子和之。我有好爵，吾与尔靡之。」子曰：「君子居其室，出其言善，则千里之外应之，况其迩者乎？居其室，出其言不善，则千里之外违之，况其迩者乎？言出乎身，加乎民；行发乎迩，见乎远。言行，君子之枢机。枢机之发，荣辱之主也。言行，君子之所以动天地也，可不慎乎！」\n\t《同人》：先号啕而后笑。子曰：「君子之道，或出或处，或默或语。二人同心，其利断金。同心之言，其臭如兰。」\n\t初六，藉用白茅，无咎。子曰：「苟错诸地而可矣，藉之用茅，何咎之有？慎之至也。夫茅之为物薄，而用可重也。慎斯术也以往，其无所失矣。」\n\t劳谦，君子有终，吉。子曰：「劳而不伐，有功而不德，厚之至也。语以其功下人者也。德言盛，礼言恭；谦也者，致恭以存其位者也。」\n\t亢龙有悔。子曰：「贵而无位，高而无民，贤人在下位而无辅，是以动而有悔也。」\n\t不出户庭，无咎。子曰：「乱之所生也，则言语以为阶。君不密则失臣，臣不密则失身，几事不密则害成。是以君子慎密而不出也。」\n\t子曰：「作《易》者，其知盗乎？《易》曰『负且乘，致寇至。』负也者，小人之事也。乘也者，君子之器也。小人而乘君子之器，盗思夺之矣。上慢下暴，盗思伐之矣。慢藏诲盗，冶容诲淫。《易》曰：『负且乘，致寇至。』盗之招也。」",
    "系辞传上·第九章\n\n\t天一，地二；天三，地四；天五，地六；天七，地八；天九，地十。天数五，地数五，五位相得而各有合；天数二十有五，地数三十，凡天地之数五十有五，此所以成变化而行鬼神也。\n\t大衍之数五十，其用四十有九。分而为二以像两，挂一以像三，揲之以四以象四时，归奇于扐以象闰；五岁再闰，故再扐而后挂。\n\t《乾》之策二百一十有六，《坤》之策百四十有四，凡三百六十，当期之日。二篇之策，万有一千五百二十，当万物之数也。是故四营而成《易》，十有八变而成卦，八卦而小成。引而伸之，触类而长之，天下之能事毕矣。\n\t显道神德行，是故可与酬酢，可与佑神矣。子曰：「知变化之道者，其知神之所为乎。」",
    "系辞传上·第十章\n\n\t《易》有圣人之道四焉：以言者尚其辞，以动者尚其变，以制器者尚其象，以卜筮者尚其占。\n\t是以君子将有为也，将有行也，问焉而以言，其受命也如响。无有远近幽深，遂知来物。非天下之至精，其孰能与于此。参伍以变，错综其数。通其变，遂成天下之文；极其数，遂定天下之象。非天下之至变，其孰能与于此。《易》无思也，无为也，寂然不动，感而遂通天下之故。非天下之至神，其孰能与于此。\n\t夫《易》，圣人之所以极深而研几也。唯深也，故能通天下之志；唯几也，故能成天下之务；唯神也，故不疾而速，不行而至。子曰：「《易》有圣人之道四焉」者，此之谓也。",
    "系辞传上·第十一章\n\n\t子曰：「夫《易》何为者也？夫《易》开物成务，冒天下之道，如斯而已者也。」\n\t是故圣人以通天下之志，以定天下之业，以断天下之疑。\n\t是故蓍之德圆而神，卦之德方以知，六爻之义易以贡。圣人以此洗心，退藏于密，吉凶与民同患。神以知来，知以藏往，其孰能与于此哉！古之聪明睿知，神武而不杀者夫。\n\t是以明于天之道，而察于民之故，是兴神物以前民用。圣人以此斋戒，以神明其德夫。\n\t是故阖户谓之坤，辟户谓之乾，一阖一辟谓之变，往来不穷谓之通，见乃谓之象，形乃谓之器，制而用之谓之法，利用出入，民咸用之谓之神。\n\t是故《易》有太极，是生两仪。两仪生四象。四象生八卦。八卦定吉凶，吉凶生大业。\n\t是故法象莫大乎天地；变通莫大乎四时；县象着明莫大乎日月；崇高莫大乎富贵；备物致用，立成器以为天下利，莫大乎圣人探赜索隐，钩深致远，以定天下之吉凶，成天下之亹亹者，莫大乎蓍龟。\n\t是故天生神物，圣人则之；天地变化，圣人效之；天垂象，见吉凶，圣人像之；河出图，洛出书，圣人则之。\n\t《易》有四象，所以示也。系辞焉，所以告也；定之以吉凶，所以断也。",
    "系辞传上·第十二章\n\n\t《易》曰：「自天佑之，吉无不利。」子曰：「佑者，助也。天之所助者，顺也；人之所助者，信也。履信思乎顺，又以尚贤也。是以『自天佑之，吉无不利』也。」\n\t子曰：「书不尽言，言不尽意。」然则圣人之意，其不可见乎？子曰：「圣人立象以尽意，设卦以尽情伪，系辞焉以尽其言。变而通之以尽利，鼓之舞之以尽神。」\n\t乾坤，其《易》之蕴邪？乾坤成列，而《易》立乎其中矣。乾坤毁，则无以见《易》。《易》不可见，则乾坤或几乎息矣。\n\t是故形而上者谓之道，形而下者谓之器。化而裁之谓之变，推而行之谓之通，举而错之天下之民谓之事业。\n\t是故夫象，圣人有以见天下之赜，而拟诸其形容，像其物宜，是故谓之象。圣人有以见天下之动，而观其会通，以行其典礼，系辞焉以断其吉凶，是故谓之爻。\n\t极天下之赜者存乎卦，鼓天下之动者存乎辞；化而裁之存乎变；推而行之存乎通；神而明之存乎其人；默而成之，不言而信，存乎德行。",
    "","","","",

]
}
UniversBookPageModule[66]={"icon":"☯️","key":"66","name": "系辞下传","p":"十翼","index":"易经","content":[
    "系辞传下·第一章\n\n\t八卦成列，像在其中矣；因而重之，爻在其中矣；刚柔相推，变在其中焉；系辞焉而命之，动在其中矣。吉凶悔吝者，生乎动者也；刚柔者，立本者也；变通者，趋时者也。吉凶者，贞胜者也；天地之道，贞观者也；日月之道，贞明者也；天下之动，贞夫一者也。\n\t夫乾，确然示人易矣；夫坤，隤然示人简矣。\n\t爻也者，效此者也。象也者，像此者也；爻象动乎内，吉凶见乎外，功业见乎变，圣人之情见乎辞。\n\t天地之大德曰生，圣人之大宝曰位。何以守位？曰仁。何以聚人？曰财。理财正辞、禁民为非曰义。",
    "系辞传下·第二章\n\n\t　　古者包牺氏之王天下也，仰则观象于天，俯则观法于地，观鸟兽之文与地之宜，近取诸身，远取诸物，于是始作八卦，以通神明之德，以类万物之情。\n\t作结绳而为网罟，以佃以渔，盖取诸离。\n\t包牺氏没，神农氏作，斫木为耜，揉木为耒，耒耨之利，以教天下，盖取诸《益》。日中为市，致天下之民，聚天下之货，交易而退，各得其所，盖取诸《噬嗑》。神农氏没，黄帝、尧、舜氏作，通其变，使民不倦，神而化之，使民宜之。《易》穷则变，变则通，通则久。是以「自天佑之，吉无不利」。黄帝、尧、舜垂衣裳而天下治，盖取诸乾、坤。\n\tt刳木为舟，剡木为楫，舟楫之利，以济不通，致远以利天下，盖取诸涣。\n\tt服牛乘马，引重致远，以利天下，盖取诸随。\n\t重门击柝，以待暴客，盖取诸豫。断木为杵，掘地为臼，杵臼之利，万民以济，盖取诸小过。\n\t弦木为弧，剡木为矢，弧矢之利，以威天下，盖取诸睽。\n\t上古穴居而野处，后世圣人易之以宫室，上栋下宇，以待风雨，盖取诸大壮。\n\t古之葬者，厚衣之以薪，葬之中野，不封不树，丧期无数。后世圣人易之以棺椁，盖取诸大过。\n\t上古结绳而治，后世圣人易之以书契，百官以治，万民以察，盖取诸夬。",
    "系辞传下·第三章\n\n\t是故《易》者，象也；象也者，象也。\n\t彖者，材也；爻也者，效天下之动者也。\n\t是故吉凶生而悔吝著也。",
    "系辞传下·第四章\n\n\t　　阳卦多阴，阴卦多阳，其故何也？阳卦奇，阴卦偶。\n\t其德行何也？阳一君而二民，君子之道也。阴二君而一民，小人之道也。",
    "系辞传下·第五章\n\n\t　　《易》曰「憧憧往来，朋从尔思。」子曰：「天下何思何虑？天下同归而殊途，一致而百虑。天下何思何虑？日往则月来，月往则日来，日月相推而明生焉。寒往则暑来，暑往则寒来，寒暑相推而岁成焉。往者屈也，来者信也，屈信相感而利生焉。尺蠖之屈，以求信也；龙蛇之蛰，以存身也。精义入神，以致用也；利用安身，以崇德也。过此以往，未之或知也；穷神知化，德之盛也。」\n\t《易》曰：「困于石，据于蒺藜，入于其宫，不见其妻，凶。」子曰：「非所困而困焉，名必辱。非所据而据焉，身必危。既辱且危，死期将至，妻其可得见耶！」\n\t《易》曰：「公用射隼于高墉之上，获之，无不利。」子曰：「隼者，禽也；弓矢者，器也；射之者，人也。君子藏器于身，待时而动，何不利之有？动而不括，是以出而有获，语成器而动者也。」\n\t子曰：「小人不耻不仁，不畏不义，不见利不劝，不威不惩。小惩而不诫，此小人之福也。《易》曰：『履校灭趾，无咎。』此之谓也。」\n\t「善不积不足以成名，恶不积不足以灭身。小人以小善为无益而弗为也，以小恶为无伤而弗去也，故恶积而不可掩，罪大而不可解。《易》曰：『何校灭耳，凶。』」\n\t子曰：「危者，安其位者也；亡者，保其存者也；乱者，有其治者也。是故君子安而不忘危，存而不忘亡，治而不忘乱，是以身安而国家可保也。《易》曰：『其亡其亡，系于苞桑。』」\n\t子曰：「德薄而位尊，知小而谋大，力少而任重，鲜不及矣。《易》曰：『鼎折足，覆公餗，其形渥，凶。』言不胜其任也。」\n\t子曰：「知几其神乎！君子上交不谄，下交不渎，其知几乎？几者，动之微，吉之先见者也。君子见几而作，不俟终日。\n\t《易》曰：『介于石，不终日，贞吉。』介如石焉，宁用终日？断可识矣。君子知微知彰，知柔知刚，万夫之望。」 子曰：「颜氏之子，其殆庶几乎？有不善未尝不知，知之未尝复行也。《易》曰：『不远复，无祗悔，元吉。』」\n\t天地氤氲，万物化醇。男女构精，万物化生。《易》曰：『三人行则损一人，一人行则得其友。』言致一也。\n\t子曰：「君子安其身而后动，易其心而后语，定其交而后求。君子修此三者，故全也。危以动，则民不与也；惧以语，则民不应也；无交而求，则民不与也；莫之与，则伤之者至矣。《易》曰：『莫益之，或击之，立心勿恒，凶。』」",
    "系辞传下·第六章\n\n\t子曰：「乾坤，其《易》之门耶？」\n\t乾，阳物也；坤，阴物也。阴阳合德，而刚柔有体。以体天地之撰，以通神明之德。其称名也，杂而不越。于稽其类，其衰世之意邪？\n\t夫《易》，彰往而察来，而微显阐幽，开而当名，辨物正言断辞，则备矣。\n\t其称名也小，其取类也大。其旨远，其辞文，其言曲而中，其事肆而隐。因贰以济民行，以明失得之报。",
    "系辞传下·第七章\n\n\t　　《易》之兴也，其于中古乎？作《易》者，其有忧患乎？\n\t是故履，德之基也；谦，德之柄也；复，德之本也；恒，德之固也；损，德之修也；益，德之裕也；困，德之辨也；井，德之地也；巽，德之制也。\n\t履，和而至。谦，尊而光；复，小而辨于物；恒，杂而不厌；损，先难而后易；益，长裕而不设；困，穷而通；井，居其所而迁；巽，称而隐。\n\t履以和行，谦以制礼，复以自知，恒以一德，损以远害，益以兴利，困以寡怨，井以辨义，巽以行权。",
    "系辞传下·第八章\n\n\t　　《易》之为书也！不可远，为道也屡迁，变动不居，周流六虚，上下无常，刚柔相易，不可为典要，唯变所适。\n\t　其出入以度外内，使知惧。又明于忧患与故。无有师保，如临父母。初率其辞而揆其方，既有典常。苟非其人，道不虚行。",
    "系辞传下·第九章\n\n\t《易》之为书也，原始要终，以为质也。六爻相杂，唯其时物也。其初难知，其上易知，本末也。初辞拟之，卒成之终。\n\t若夫杂物撰德，辩是与非，则非其中爻不备。噫！亦要存亡吉凶，则居可知矣。知者观其彖辞，则思过半矣。\n\t二与四同功而异位，其善不同；二多誉，四多惧，近也。\n\t柔之为道，不利远者；其要无咎。其用柔中也。\n\t三与五同功而异位，三多凶，五多功，贵贱之等也。其柔危，其刚胜耶？",
    "系辞传下·第十章\n\n\t　　《易》之为书也，广大悉备。有天道焉，有人道焉，有地道焉。兼三才而两之，故六。六者非它也，三材之道也。\n\t道有变动，故曰爻；爻有等，故曰物；物相杂，故曰文；文不当，故吉凶生焉。",
    "系辞传下·第十一章\n\n\t《易》之兴也，其当殷之末世，周之盛德耶？当文王与纣之事耶？\n\t是故其辞危。危者使平，易者使倾。其道甚大，百物不废。惧以终始，其要无咎，此之谓《易》之道也。",
    "系辞传下·第十二章\n\n\t　　夫乾，天下之至健也，德行恒易以知险。夫坤，天下之至顺也，德行恒简以知阻。能说诸心，能研诸侯之虑，定天下之吉凶，成天下之亹亹者。\n\t是故变化云为，吉事有祥。象事知器，占事知来。天地设位，圣人成能。人谋鬼谋，百姓与能。\n\t八卦以象告，爻彖以情言，刚柔杂居，而吉凶可见矣。\n\t变动以利言，吉凶以情迁。是故爱恶相攻而吉凶生，远近相取而悔吝生，情伪相感而利害生。\n\t凡《易》之情，近而不相得则凶，或害之，悔且吝。\n\t将叛者其辞惭，中心疑者其辞枝，吉人之辞寡，躁人之辞多，诬善之人其辞游，失其守者其辞屈。",
]}
UniversBookPageModule[67]={"icon":"☯️","key":"67","name": "说卦传","p":"十翼","index":"易经","content":[
    "说卦传",
    "说卦传·第一章\n\t昔者，圣人之作易也，幽赞于神明而生蓍。参(sān)天两地而倚数；观变于阴阳，而立卦；发挥于刚柔，而生爻；和顺于道德，而理于义；穷理尽性，以至于命。",
    "说卦传·第二章\n\t昔者圣人之作易也，将以顺性命之理。是以立天之道，曰阴与阳；立地之道，曰柔与刚；立人之道，曰仁与义。兼三才而两之，故易六画而成卦。 分阴分阳，迭用柔刚，故易六位而成章。",
    "说卦传·第三章\n\t天地定位，山泽通气，雷风相薄，水火不相射，八卦相错，数往者顺，知来者逆；是故，易逆数也。",
    "说卦传·第四章\n\t雷以动之，风以散之，雨以润之， 日以烜之，艮以止之，兑以说之，乾以君之，坤以藏之。",
    "说卦传·第五章\n\t帝出乎震，齐乎巽，相见乎离，致役乎坤，说言乎兑，战乎乾，劳乎坎，成言乎艮。万物出乎震，震东方也。齐乎巽，巽东南也，齐也者，言万物之洁齐也。离也者，明也，万物皆相见，南方之卦也，圣人南面而听天下，向明而治，盖取诸此也。坤也者地也，万物皆致养焉，故曰致役乎坤。兑正秋也，万物之所说也，故曰说；言乎兑。战乎乾，乾西北之卦也，言阴阳相薄也。坎者水也，正北方之卦也，劳卦也，万物之所归也，故曰劳乎坎。艮东北之卦也，万物之所终而所成始也，故曰成言乎艮。",
    "说卦传·第六章\n\t神也者，妙万物而为言者也。动万物者，莫疾乎雷；桡万物者，莫疾乎风；燥万物者，莫熯乎火；说万物者，莫说乎泽；润万物者，莫润乎水；终万物始万物者，莫盛乎艮。故水火相逮，雷风不相悖，山泽通气，然后能变化，既成万物也。",
    "说卦传·第七章\n\t乾，健也；坤，顺也； 震，动也； 巽，入也；坎，陷也；离，丽也；艮，止也；兑，说也。",
    "说卦传·第八章\n\t乾为马，坤为牛，震为龙，巽为鸡，坎为豕，离为雉，艮为狗，兑为羊。",
    "说卦传·第九章\n\t乾为首，坤为腹，震为足，巽为股，坎为耳，离为目，艮为手，兑为口。",
    "说卦传·第十章\n\t乾天也，故称乎父，坤地也，故称乎母；震一索而得男，故谓之长男；巽一索而得女，故谓之长女；坎再索而得男，故谓之中男；离再索而得女，故谓之中女；艮三索而得男，故谓之少男；兑三索而得女，故谓之少女。",
    "说卦传·第十一章\n\t乾为天、为圜(yuán,圆环)、为君、为父、为玉、为金、为寒、为冰、为大赤、为良马、为瘠马、为驳马、为木果。",
    "\n\t坤为地、为母、为布、为釜、为吝啬、为均、为子母牛、为大舆、为文、为众、为柄、其于地也为黑。",
    "\n\t震为雷、为龙、为玄黄、为敷、为大涂、为长子、为决躁、为苍筤(láng)竹、为萑(huán,芦)苇。其于马也，为善鸣、为馵(zhù,左足白)足，为的颡(sǎng,额头)。其于稼也，为反生。其究为健，为蕃鲜。",
    "\n\t巽为木、为风、为长女、为绳直、为工、为白、为长、为高、为进退、为不果、为臭。其于人也，为寡发、为广颡、为多白眼、为近利市三倍。 其究为躁卦。",
    "\n\t坎为水、为沟渎、为隐伏、为矫輮(róu,使弯曲)、为弓轮。其于人也，为加忧、为心病、为耳痛、为血卦、为赤。其于马也，为美脊、为亟心、为下首、为薄蹄、为曳。其于舆也，为多眚(shěng,“过失”之意)。 为通、为月、为盗。其于木也，为坚多心。",
    "\n\t离为火、为日、为电、为中女、为甲胄、为戈兵。其于人也，为大腹，为乾卦。为鳖、为蟹、为蠃(luó,螺)、为蚌、为龟。其于木也，为科上槁。",
    "\n\t艮为山、为径路、为小石、为门阙、为果苽、为阍寺、为指、为狗、为鼠、为黔喙之属。其于木也，为坚多节。",
    "\n\t兑为泽、为少女、为巫、为口舌、为毁折、为附决。其于地也，刚卤。 为妾、为羊。",
    "","","","",
]}
UniversBookPageModule[68]={"icon":"☯️","key":"68","name": "序卦传","p":"十翼","index":"易经","content":[
"序卦传",
"有天地，然后万物生焉。 \n盈天地之间者，唯万物，故受之以屯；\n屯者 盈也，屯者物之始生也。 \n物生必蒙，故受之以蒙；\n蒙者蒙也，物之稚也。 物稚不可不养也，故受之以需；需者饮食之道也。饮食必有讼，故受之以 讼。讼必有众起，故受之以师；师者众也。 众必有所比，故受之以比；比 者比也。 比必有所畜也，故受之以小畜。物畜然后有礼，故受之以履。履 而泰，然后安，故受之以泰；泰者通也。 物不可以终通，故受之以否。物 不可以终否，故受之以同人。 与人同者，物必归焉，故受之以大有。有大 者不可以盈，故受之以谦。 有大而能谦，必豫，故受之以豫。 豫必有随， 故受之以随。 以喜随人者，必有事，故受之以蛊；蛊者事也。有事而后可 大，故受之以临；临者大也。 物大然后可观，故受之以观。可观而后有所 合，故受之以噬嗑；嗑者合也。 物不可以苟合而已，故受之以贲；贲者饰 也。 致饰然后亨，则尽矣，故受之以剥；剥者剥也。物不可以终尽，剥穷 上反下，故受之以复。 复则不妄矣，故受之以无妄。有无妄然后可畜，故 受之以大畜。 物畜然后可养，故受之以颐；颐者养也。不养则不可动，故 受之以大过。物不可以终过，故受之以坎；坎者陷也。 陷必有所丽，故受 之以离；离者丽也。",
"有天地，然后有万物； \n有万物，然后有男女； 有男女，然后有夫妇； 有夫妇，然后有父子；有父子然后有君臣；有君臣，然后有上下；有上下， 然后礼仪有所错。 夫妇之道，不可以不久也，故受之以恒；恒者久也。物 不可以久居其所，故受之以遁； 遁者退也。 物不可终遁，故受之以大壮。 物不可以终壮，故受之以晋；晋者进也。进必有所伤，故受之以明夷； 夷者伤也。 伤于外者，必反其家，故受之以家人。家道穷必乖，故受之以 睽；睽者乖也。 乖必有难，故受之以蹇；蹇者难也。物不可终难，故受之 以解；解者缓也。 缓必有所失，故受之以损；损而不已，必益，故受之以 益。益而不已，必决，故受之以夬； 夬者决也。决必有所遇，故受之以 姤；姤者遇也。物相遇而后聚，故受之以萃；萃者聚也。 聚而上者，谓 之升，故受之以升。升而不已，必困，故受之以困。 困乎上者，必反下， 故受之以井。 井道不可不革，故受之以革。 革物者莫若鼎，故受之以鼎。 主器者莫若长子，故受之以震；震者动也。 物不可以终动，止之，故受之 以艮；艮者止也。 物不可以终止，故受之以渐；渐者进也。 进必有所归， 故受之以归妹。 得其所归者必大，故受之以丰；丰者大也。穷大者必失其 居，故受之以旅。 旅而无所容，故受之以巽；巽者入也。入而后说之，故 受之以兑；兑者说也。 说而后散之，故受之以涣；涣者离也。物不可以终 离，故受之以节。节而信之，故受之以中孚。 有其信者，必行之，故受之 以小过。有过物者，必济，故受之既济。物不可穷也，故受之以未济终焉。",
"","","","",
]}
UniversBookPageModule[69]={"icon":"☯️","key":"68","name": "杂卦传","p":"十翼","index":"易经","content":[
    "杂卦传",
"乾刚，坤柔，比乐，师忧。",
"临、观之义，或与或求。",
"屯见而不失其居。蒙杂而著。",
"震起也，艮止也；损益盛衰之始也。",
"大畜时也。无妄灾也。",
"萃聚，而升不来也。",
"谦轻，而豫怠也。",
"噬嗑食也，贲无色也。",
"兑见，而巽伏也。",
"随无故也，蛊则饬也。",
"剥烂也，复反也。",
"晋昼也，明夷诛也。",
"井通，而困相遇也。",
"咸速也，恒久也。",
"涣离也，节止也；",
"解缓也，蹇难也；",
"睽外也，家人内也；",
"否泰反其类也。",
"大壮则止，遁则退也。",
"大有众也，同人亲也；革去故也，鼎取新也；小过过也，中孚信也；丰多故也，亲寡旅也。",
"离上，而坎下也。",
"小畜寡也，履不处也。",
"需不进也，讼不亲也。",
"大过颠也。姤遇也，柔遇刚也。",
"渐女归，待男行也。颐养正也，既济定也。",
"归妹女之终也。未济男之穷也。",
"夬决也，刚决柔也，君子道长，小人道忧也。",
"","","","",
]}
UniversBookPageModule[70]={"icon":"☯️","key":"68","name": "文言传","p":"十翼","index":"易经","content":[
    "乾文言",
"“元”者，善之长也；“亨”者，嘉之会也；“利”者，义之和也；“贞”者，事之干也。君子体仁足以长人，嘉会足以合礼，利物足以和义，贞固足以干事。君子行此四德者，故曰：“乾、元、亨、利、贞。”初九曰：“潜龙勿用。”何谓也？子曰：“龙德而隐者也，不易乎世，不成乎名，遯世无闷，不见是而无闷，乐则行之，忧则违之，确乎其不可拔，潜龙也。”九二曰：“见龙在田，利见大人。”何谓也？子曰：“龙德而正中者也。庸言之信，庸行之谨，闲邪存其诚，善世而不伐，德博而化。",
"《易》曰‘见龙在田，利见大人’。君德也。”九三曰：“君子终日乾乾，夕惕若厉，无咎。”何谓也？子曰：“君子进德修业。忠信所以进德也。修辞立其诚，所以居业也。知至至之，可与几也。知终终之，可与存义也。是故居上位而不骄，在下位而不忧，故乾乾因其时而惕，虽危无咎矣。”九四曰：“或跃在渊，无咎。”何谓也？子曰：“上下无常，非为邪也。进退无恒，非离群也。君子进德修业，欲及时也，故无咎。”九五曰：“飞龙在天，利见大人。”何谓也？子曰：“同声相应，同气相求。水流湿，火就燥。云从龙，风从虎。圣人作而万物覩。本乎天者亲上，本乎地者亲下。则各从其类也。”上九曰：“亢龙有悔。”何谓也？子曰：“贵而无位，高而无民，贤人在下位而无辅，是以动而有悔也。”",
"“潜龙勿用”，下也；“见龙在田”，时舍也；“终日乾乾”，行事也；“或跃在渊”，自试也；“飞龙在天”，上治也；“亢龙有悔”，穷之灾也；乾元“用九”，天下治也。“潜龙勿用”，阳气潜藏；“见龙在田”，天下文明；“终日乾乾”，与时偕行；“或跃在渊”，乾道乃革；“飞龙在天”，乃位乎天德；“亢龙有悔”，与时偕极；乾元“用九”，乃见天则。乾“元”者，始而亨者也；“利贞”者，性情也。乾始能以美利利天下，不言所利，大矣哉，大哉乾乎，刚健中正，纯粹精也。六爻发挥，旁通情也，时乘六龙，以御天也。云行雨施，天下平也。",
"君子以成德为行，日可见之行也。“潜”之为言也，隐而未见，行而未成，是以君子弗用也。君子学以聚之，问以辩之，宽以居之，仁以行之。《易》曰：“见龙在田，利见大人。”君德也。九三重刚而不中，上不在天，下不在田，故乾乾因其时而惕，虽危“无咎”矣。九四重刚而不中，上不在天，下不在田，中不在人，故“或”之，或之者，疑之也。故“无咎”。夫“大人”者，与天地合其德，与日月合其明，与四时合其序，与鬼神合其吉凶。先天而天弗违，后天而奉天时，天且弗违，而况于人乎！况于鬼神乎！“亢”之为言也，知进而不知退，知存而不知亡，知得而不知丧，其唯圣人乎！知进退存亡而不失其正者，其唯圣人乎！",
"",
"",
"坤文言",
"坤至柔而动也刚，至静而德方，后得主而有常，含万物而化光。坤道其顺乎，承天而时行。积善之家必有余庆，积不善之家必有余殃。臣弑其君，子弑其父，非一朝一夕之故，其所由来者渐矣。由辩之不早辩也。",
"《易》曰：“履霜，坚冰至。”盖言顺也。“直”其正也，“方”其义也。君子敬以直内，义以方外，敬义立而德不孤。“直方大，不习无不利。”则不疑其所行也。阴虽有美，“含”之以从王事，弗敢成也。地道也，妻道也，臣道也。地道“无成”而代“有终”也。天地变化，草木蕃，天地闭，贤人隐。",
"《易》曰：“括囊，无咎无誉。”盖言谨也。君子“黄”中通理，正位居体，美在其中，而畅于四支，发于事业，美之至也！阴疑于阳必战，为其嫌于无阳也。故称“龙”焉犹未离其类也，故称“血”焉。夫“玄黄”者，天地之杂也，天玄而地黄。",
"","","","",
]}

module.exports={UniversBookPageModule:UniversBookPageModule};  