
import React, { Component } from 'react';
import ValueTypeModule from '../../../config/ValueTypeModule'
import chineseLunar from '../solar2lunar/chinese-lunar'
import LunarCalendar from '../solar2lunar/LunarCalendar'

var six_random_NaJia = new Array();
/*
---
---
---
---
---
---
*/
six_random_NaJia["111111"] = {
	"icon":"䷀",
	"key":"1",
	"name": "乾为天",
	"p": "乾宫",
	"1": "父母壬戌土 世",
	"2": "兄弟壬申金",
	"3": "官鬼壬午火",
	"4": "父母甲辰土 应",
	"5": "妻财甲寅木",
	"6": "子孙甲子水",
	"extname": "《易经》第一卦 乾 乾为天 乾上乾下",
	"extnameexp": "乾：元，亨，利，贞。",
	"extexp": "彖曰：大哉乾元、万物资始，乃统天。云行雨施，品物流形。大明终始，六位时成，时乘六龙以御天。乾道变化，各正性命，保合太和，乃利贞。首出庶物，万国咸宁。",
	"extexp1": "象曰：潜龙勿用，阳在下也。见龙在田，德施普也。终日乾乾，反复道也。或跃在渊，进无咎也。飞龙在天，大人造也。亢龙有悔，盈不可久也。用九，天德不可为首也。",
	"ext": "《乾》卦：大通顺，占问有利。",
	"exp1": "初九：潜龙，勿用。",
	"exp2": "倒数第一阳爻：象龙潜伏著，不可有所作为。",
	"exp3": "九二：见龙再田，利见大人。",
	"exp4": "倒数第二阳爻：龙出现在田野里，见贵人有利。",
	"exp5": "九三：君子终日乾乾，夕惕若，厉无咎。",
	"exp6": "倒数第三阳爻：贵人整天自强不息，晚上警惕著。(情况)严重，没有害。",
	"exp7": "九四：或跃在渊，无咎。",
	"exp8": "倒数第四阳爻：龙或者帮进深渊，没有害。",
	"exp9": "九五：飞龙在天，利见大人。",
	"exp10": "倒数第五阳爻：龙飞在天上，见贵人有利。",
	"exp11": "上九：亢龙有悔。",
	"exp12": "最上阳爻：处在极高处的龙，有悔恨。",
	"exp13": "用九：见群龙无首，吉。",
	"exp14": "用阳爻：看见许多龙，没有龙王，是吉利的。",

	"base": "天行健，君子以自强不息。凛凛皇者之象 自强不息之意 刚健中正",
	"general": "大象：天行刚健，自强不息",
	"lucky": "运势：飞龙在天，名利双收之象，宜把握机会，争取成果。 ",
	"emotion": "爱情：双方逞强，宜多加沟通迁就。",
	"health": "疾病：病情恶化，宜细心调养，注意头、脑、骨髓等病变。",
	"find": "失物：可望寻回。",
	"sued": "诉讼：宜据理力争。",
	"bussiness": "",
	"finance": "",
	"def":"乾刚，坤柔，比乐，师忧",
	"story":"有天地，然后万物生焉",
	"poem":"困龙得水",
	"kind": "金"
}
/*
---
---
---
---
---
- -
*/
six_random_NaJia["111110"] = {"icon":"䷫","key":"44",
	"name": "天风姤",
	"p": "乾宫",
	"1": "父母壬戌土",
	"2": "兄弟壬申金",
	"3": "官鬼壬午火 应",
	"4": "兄弟辛酉金",
	"5": "子孙辛亥水",
	"6": "父母辛丑土 世",
	"f5": "妻财寅木",
	"extname": "《易经》第四十四卦 姤 天风姤 乾上巽下",
	"extnameexp": "姤：女壮，勿用取女。",
	"extexp": "彖曰：姤，遇也，柔遇刚也。勿用取女，不可与长也。 天地相遇，品物咸章也。 刚遇中正，天下大行也。 姤之时义大矣哉！",
	"extexp1": "象曰：系于金柅，柔道牵也。包有鱼，义不及宾也。其行次且，行未牵也。无鱼之凶，远民也。九五含章，中正也。有陨自天，志不舍命也。姤其角，上穷吝也。",
	"ext": "《姤》卦：女子伤残，不要娶这个女子",
	"exp1": "初六：系于金柅，贞吉，有攸往，见凶，羸豕踟躅。",
	"exp2": "倒数第一阴爻：系在纺车转轮的铜把手上，占问吉。有所往，看到凶。母猪躁动徘徊。",
	"exp3": "九二：包有鱼，无咎，不利宾。",
	"exp4": "倒数第二阳爻：厨房里有鱼，无害。不利于待客。",
	"exp5": "九三：臀无肤，其行次且，厉，无大咎。",
	"exp6": "倒数第三阳爻：臀部皮开肉绽，他的走路困难，危险，没有大害。",
	"exp7": "九四：包无鱼，起凶。",
	"exp8": "倒数第四阳爻：厨房里没有鱼，引起争执，有凶。",
	"exp9": "九五：以杞包瓜，含章，有陨自天。",
	"exp10": "倒数第五阳爻：用柳条来包瓜，有文彩。（包不住）自然掉落。",
	"exp11": "上九：姤其角，吝，无咎。",
	"exp12": "最上阳爻：碰上兽的角，不幸，无害。",
	"exp13": "",
	"exp14": "",

	"base": "天下有风，姤。后以施命诰四方。刚柔相遇之象 聚散随缘之意 制恶除奸 慎交",
	"general": "大象：风无孔不入，所吹到之处，暴露其间之物体，无一不与之相遇，为邂逅之意。",
	"lucky": "运势：阴长阳消，注意桃色纠纷，诸事阻滞，宜慎重行事。",
	"emotion": "爱情：双方互不满意，感情复杂，用情不专之象。",
	"health": "疾病：病情重，有恶化青况，注意泌尿生殖系统、胸肺科病。 ",
	"find": "失物：尽快寻找，可失而 得。失物似被重重物件压在最底部。 ",
	"sued": "诉讼：提防桃色纠纷，是非谣言播弄。",
	"bussiness": "",
	"finance": "",
	"def":"决必有所遇，故受之以姤；姤者遇也",
	"story":"大过颠也。姤遇也，柔遇刚也",
	"poem":"他乡遇友",
	"kind": "金"
}
/*
---
---
---
---
- -
- -
*/
six_random_NaJia["111100"] = {"icon":"䷠","key":"33",
	"name": "天山遁",
	"p": "乾宫",
	"1": "父母壬戌土",
	"2": "兄弟壬申金 应",
	"3": "官鬼壬午火",
	"4": "兄弟丙申金",
	"5": "官鬼丙午火 世",
	"6": "父母丙辰土",
	"f5": "妻财寅木",
	"f6": "子孙子水",
	"extname": "《易经》第三十三卦 遯 天山遁 乾上艮下 ",
	"extnameexp": "遯：亨，小利贞。",
	"extexp": "彖曰：遯亨，遯而亨也。 刚当位而应，与时行也。 小利贞，浸而长也。遯之时义大矣哉！",
	"extexp1": "象曰：遯尾之厉，不往何灾也？执用黄牛，固志也。系遯之厉，有疾惫也。畜臣妾吉，不可大事也。君子好遯，小人否也。嘉遯贞吉，以正志也。肥遯无不利，无所疑也。",
	"ext": "《遁》卦：通顺。占问有小利。",
	"exp1": "初六：遯尾，厉，勿用有攸往。",
	"exp2": "倒数第一阴爻：做隐遁的尾巴，危险。不用有所往。",
	"exp3": "六二：执之用黄牛之革，莫之胜说。",
	"exp4": "倒数第二阴爻：捉住他，用黄牛皮绳来捆绑，没有能胜过黄牛皮而逃脱。",
	"exp5": "九三：系遯，有疾厉，畜臣妾吉。",
	"exp6": "倒数第三阳爻：羁留隐遁者，像人有病危险。畜养男女奴隶，吉。",
	"exp7": "九四：好遯君子吉，小人否。",
	"exp8": "倒数第四阳爻：爱好退隐，君子吉，小人坏。",
	"exp9": "九五：嘉遯，贞吉。",
	"exp10": "倒数第五阳艾：赞美隐遁，占问吉。",
	"exp11": "上九：肥遯，无不利。",
	"exp12": "最上阳爻：远走高飞那样隐遁，没有不利。",
	"exp13": "",
	"exp14": "",

	"base": "天下有山，遯。君子以远小人，不恶而严。掘井无泉之象 韬光养晦之意 以退为进 大智",
	"general": "大象： 者遁也。山在天之下，阴渐长，而阳渐消，宜退避三舍。",
	"lucky": "运势：小人道长，君子道消，凡事宜退不宜进，穷则独善其身，养诲修身。",
	"emotion": "爱情：落花虽有意，流水却无情。",
	"health": "疾病：病重，注意血气不调、头、背、筋骨不良之疾。",
	"find": "失物：失落远处，不能寻回。",
	"sued": "诉讼：强行争取亦不利，宜罢手逃避反吉。",
	"bussiness": "",
	"finance": "",
	"def":"大壮则止，遁则退也",
	"story":"物不可以久居其所，故受之以遁；遁者退也",
	"poem":"浓云蔽日",
	"kind": "金"
}
/*
---
---
---
- -
- -
- -
*/
six_random_NaJia["111000"] = {"icon":"䷋","key":"12",
	"name": "天地否",
	"p": "乾宫",
	"1": "父母壬戌土 应",
	"2": "兄弟壬申金",
	"3": "官鬼壬午火",
	"4": "妻财乙卯木 世",
	"5": "官鬼乙巳火",
	"6": "父母乙未土",
	"f6": "子孙子水",
	"extname": "《易经》第十二卦 否 天地否 乾上坤下",
	"extnameexp": "否：否之匪人，不利君子贞，大往小来。",
	"extexp": "彖曰：否之匪人，不利君子贞。 大往小来， 则是天地不交，而万物不通也；上下不交，而天下无邦也。内阴而外阳，内柔而外刚，内小人而外君子。 小人道长，君子道消也。",
	"extexp1": "象曰：拔茅贞吉，志在君也。大人否亨，不乱群也。包羞，位不当也。有命无咎，志行也。大人之吉，位正当也。否终则倾，何可长也。",
	"ext": "《否》 卦：干坏事的是坏人。贵族占问不利。大的去了小的来。",
	"exp1": "初六：拔茅茹，以其夤，贞吉亨。",
	"exp2": "倒数第一阴爻：拔茜草要按它的类来拔。占问是吉，是通顺。",
	"exp3": "六二：包承。 小人吉，大人否亨。",
	"exp4": "倒数第二阴爻：包裹蒸肉，小民吉，贵族坏。（贵族和小民分开），是通顺。",
	"exp5": "六三：包羞。",
	"exp6": "倒数第三阴爻：包裹熟肉，（小人吉，大人坏，亨）。",
	"exp7": "九四：有命无咎，畴离祉。",
	"exp8": "倒数第四阳爻：有天命，无害。谁受到福？（受到的是泰，受不到的是否）。",
	"exp9": "九五：休否，大人吉。 其亡其亡，系于苞桑。",
	"exp10": "倒数第五阳爻：停止干坏事，大人是吉的。衰亡啊衰亡啊，只寄托在脆弱的苞草桑条上，（这样担心，故能转危为安，成为通顺）。",
	"exp11": "上九：倾否，先否后喜。",
	"exp12": "最上阳爻：干坏事的跌倒，先坏后喜。",
	"exp13": "",
	"exp14": "",

	"base": "天地不交，否。君子以俭德辟难，不可荣以禄。闭塞不通之象 阴阳不交之意 不交不汇 乱世",
	"general": "大象：天气上升，地气下降，天地之气不交，主闭塞不通。 ",
	"lucky": "大象：天气上升，地气下降，天地之气不交，主闭塞不通。  ",
	"emotion": "爱情：阴阳相背，拒人于千里之外，有不和及离别之象。 ",
	"health": "疾病：占病为凶兆，病在脑、肺及肠胃等，慎防癌症。 ",
	"find": "失物：寻不回",
	"sued": "诉讼：各走极端，有口难言，宜及时求和。",
	"bussiness": "",
	"finance": "",
	"def":"否泰反其类也",
	"story":"物不可以终通，故受之以否",
	"poem":"虎落陷坑",
	"kind": "金"
}
/*
---
---
- -
- -
- -
- -
*/
six_random_NaJia["110000"] = {"icon":"䷓","key":"20",
	"name": "风地观",
	"p": "乾宫",
	"1": "妻财辛卯木",
	"2": "官鬼辛巳火",
	"3": "父母辛未土 世",
	"4": "妻财乙卯木",
	"5": "官鬼乙巳火",
	"6": "父母乙未土 应",
	"f2": "兄弟申金",
	"f6": "子孙子水",
	"extname": "《易经》第二十卦 观 风地观 巽上坤下",
	"extnameexp": "观：盥而不荐，有孚颙若。",
	"extexp": "彖曰：大观在上，顺而巽，中正以观天下。观，盥而不荐，有孚颙若，下观而化也。 观天之神道，而四时不忒， 圣人以神道设教，而天下服矣。",
	"extexp1": "象曰：初六童观，小人道也。窥观女贞，亦可丑也。观我生进退，未失道也。观国之光，尚宾也。观我生，观民也。观其生，志未平也。",
	"ext": "《观》：用酒灌地迎神，不献牲，有俘虏长得高大，要用作人牲。",
	"exp1": "初六：童观，小人无咎，君子吝。",
	"exp2": "倒数第一阴爻：幼稚的观察，在小民无害，在贵族就艰难。",
	"exp3": "六二：窥观，利女贞。",
	"exp4": "倒数第二阴爻：一孔之见，女子占问有利，（在贵族就艰难）。",
	"exp5": "六三：观我生，进退。",
	"exp6": "倒数第三阴爻：观察我的亲族的进用或退斥。",
	"exp7": "六四：观国之光，利用宾于王。",
	"exp8": "倒数第四阴爻：观察王国的光辉，作为周王的的宾客有利。",
	"exp9": "九五：观我生，君子无咎。",
	"exp10": "倒数第五阳爻：观察我的亲族，（加以团结），贵族无害。",
	"exp11": "上九：观其生，君子无咎。",
	"exp12": "最上阳爻：观察其他的部族，（加以处理），贵族无害。",
	"exp13": "",
	"exp14": "",

	"base": "风行地上，观。先王以省方，观民设教。风云莫测之象 观察入微之意 省察观摩 设教",
	"general": "大象：风运行于坤地之上，喻有周游观览之意。阴长阳消，正道衰微，万物难行。",
	"lucky": "运势：处身于变化之中，宜多观察入微，心身苦恼，并防外来诱惑。",
	"emotion": "爱情：飘动不定，外表看好，但内里虚浮，宜得长辈扶助。",
	"health": "疾病：有渐恶化之象，病情变化多，为腹、神经系统病症。 ",
	"find": "失物：若能细心四察，可以找回来。 ",
	"sued": "诉讼：小人当道，愈争论惹起纷争愈多，但终会和解。",
	"bussiness": "",
	"finance": "",
	"def":"临、观之义，或与或求",
	"story":"物大然后可观，故受之以观",
	"poem":"旱莲逢河",
	"kind": "金"
}
/*
---
- -
- -
- -
- -
- -
*/
six_random_NaJia["100000"] = {"icon":"䷖","key":"23",
	"name": "山地剥",
	"p": "乾宫",
	"1": "妻财丙寅木",
	"2": "子孙丙子水 世",
	"3": "父母丙戌土",
	"4": "妻财乙卯木",
	"5": "官鬼乙巳火 应",
	"6": "父母乙未土",
	"f2": "兄弟申金",
	"extname": "《易经》第二十三卦 剥 山地剥 艮上坤下",
	"extnameexp": "剥：不利有攸往。",
	"extexp": "彖曰：剥，剥也，柔变刚也。 不利有攸往，小人长也。 顺而止之，观象也。 君子尚消息盈虚，天行也。",
	"extexp1": "象曰：剥床以足，以灭下也。剥床以辨，未有与也。剥之无咎，失上下也。剥床以肤，切近灾也。以宫人宠，终无尤也。君子得舆，民所载也。小人剥庐，终不可用也。",
	"ext": "《剥》卦：对有所往不利。",
	"exp1": "初六：剥牀以足，蔑贞凶。",
	"exp2": "倒数第一阴爻：去掉床的脚，占梦是凶的。",
	"exp3": "六二：剥牀以辨，蔑贞凶。",
	"exp4": "倒数第二阴爻：去掉床板，占梦是凶的。",
	"exp5": "六三：剥之，无咎。",
	"exp6": "倒数第三阴爻：去掉它没有害，（床已无脚无板，成为废物，故可弃去)。",
	"exp7": "六四：剥牀以肤，凶。",
	"exp8": "倒数第四阴爻：去掉床上的席子，凶。",
	"exp9": "六五：贯鱼，以宫人宠，无不利。",
	"exp10": "倒数第五阴爻：射中了鱼，宫人因而得宠。占问没有不利。",
	"exp11": "上九：硕果不食，君子得舆，小人剥庐。",
	"exp12": "最上阳爻：大果实不吃，贵族不吃（得到小人的拥戴），多得到车子坐。小民不吃，剥取荠菜来充饥。",
	"exp13": "",
	"exp14": "",

	"base": "山附于地，剥。上以厚下安宅。生机剥落之象 去旧生新之意 应付衰败 成仁",
	"general": "大象：山附于地喻山石崩而落于地面上，五阴迫一阳，正义被损。",
	"lucky": "运势：恶运缠身，宜重新部署，不宜自作聪明，防被女子及小人连累。 ",
	"emotion": "爱情：阴盛而阳衰，男追女则利，反之不利，是非小人多。 ",
	"health": "疾病：病情恶化之象，防头痛、肠胃、性病等疾。",
	"find": "失物：目前还隐藏在家中地上，可惜无法发现，不久会被扫走。 ",
	"sued": "诉讼：因财而起纷争，小人当道，宜避之则吉。",
	"bussiness": "",
	"finance": "",
	"def":"剥烂也，复反也",
	"story":"致饰然后亨，则尽矣，故受之以剥；剥者剥也",
	"poem":"鹰鹊同林",
	"kind": "金"
}
/*
---
- -
---
- -
- -
- -
*/
six_random_NaJia["101000"] = {"icon":"䷢","key":"35",
	"name": "火地晋",
	"p": "乾宫",
	"1": "官鬼己巳火",
	"2": "父母己未土",
	"3": "兄弟己酉金 世",
	"4": "妻财乙卯木",
	"5": "官鬼乙巳火",
	"6": "父母乙未土 应",
	"f6": "子孙子水",
	"extname": "《易经》第三十五卦 晋 火地晋 离上坤下 ",
	"extnameexp": "晋：康侯用锡马蕃庶，昼日三接。",
	"extexp": "彖曰：晋，进也。明出地上，顺而丽乎大明，柔进而上行。 是以康侯用锡马蕃庶，昼日三接也。",
	"extexp1": "象曰：晋如摧如，独行正也。裕无咎，未受命也。受兹介福，以中正也。众允之志，上行也。鼫鼠贞厉，位不当也。失得勿恤，往有庆也。维用伐邑，道未光也。",
	"ext": "《晋》卦：康侯用〈周成王〉赐给他的良马来繁殖，一天三次交配。",
	"exp1": "初六：晋如，摧如，贞吉。 罔孚，裕无咎。",
	"exp2": "倒数第一阴爻：进攻它，摧毁它，占问吉。没有俘获财物，无害。",
	"exp3": "六二：晋如，愁如，贞吉。 受兹介福，于其王母。",
	"exp4": "倒数第二阴爻：进攻它，围困它，占问是吉。在他的王母那里受此大福。",
	"exp5": "六三：众允，悔亡。",
	"exp6": "倒数第三阴爻：众人信从他，没有悔恨。",
	"exp7": "九四：晋如硕鼠，贞厉。",
	"exp8": "倒数第四阳爻：进攻象田鼠（的偷吃禾苗），占问危险。",
	"exp9": "六五：悔亡，失得勿恤，往吉无不利。",
	"exp10": "倒数第五阴爻：悔恨消失，失物可得，勿 。前去吉，没有不利。",
	"exp11": "上九：晋其角，维用伐邑，厉吉无咎，贞吝。",
	"exp12": "最上的阳爻：进攻就较量，考虑用兵攻邑。是危是吉，是无害，占问困难。",
	"exp13": "",
	"exp14": "",

	"base": "明出地上，晋。君子以自昭明德。明出地上之象 良臣遇君之意 积极进取 上达",
	"general": "大象：日出地面，普照大地，有光明上进之象。",
	"lucky": "运势：事业、名望、财运皆吉，所谓有加官晋爵之兆。",
	"emotion": "爱情：以柔顺态度追求，定可成功。 ",
	"health": "疾病：病情严重，为腹、肠胃、肌肉等慢性病。 ",
	"find": "失物：动作快，可以寻回来。似是在地上的箱子之类藏著。",
	"sued": "诉讼：最终能圆满解决。",
	"bussiness": "",
	"finance": "",
	"def":"晋昼也，明夷诛也",
	"story":"物不可以终壮，故受之以晋；晋者进也",
	"poem":"锄地得金",
	"kind": "金"
}
/*
---
- -
---
---
---
---
*/
six_random_NaJia["101111"] = {"icon":"䷍","key":"14",
	"name": "火天大有",
	"p": "乾宫",
	"1": "官鬼己巳火 应",
	"2": "父母己未土",
	"3": "兄弟己酉金",
	"4": "父母甲辰土 世",
	"5": "妻财甲寅木",
	"6": "子孙甲子水",
	"extname": "《易经》第十四卦 大有 火天大有 离上乾下 ",
	"extnameexp": "大有：元亨。 ",
	"extexp": "彖曰：大有，柔得尊位，大中而上下应之，曰大有。其德刚健而文明，应乎天而时行，是以元亨。",
	"extexp1": "象曰：大有初九，无交害也。大车以载，积中不败也。公用亨于天子，小人害也。匪其彭无咎，明辨皙也。厥孚交如，信以发志也。威如之吉，易而无备也。大有上吉，自天祐也。",
	"ext": "《大有》卦：大通顺。",
	"exp1": "初九：无交害，匪咎，艰则无咎。",
	"exp2": "倒数第一阳爻：没有互相损害，就不是害。处在艰难时，就无害。",
	"exp3": "九二：大车以载，有攸往，无咎。",
	"exp4": "倒数第二阳爻：用大车来运载，有所往，无害。",
	"exp5": "九三：公用亨于天子，小人弗克。",
	"exp6": "倒数第三阳爻：公在天子那里享受宴席，小民不能（享受）。",
	"exp7": "九四：匪其彭，无咎。",
	"exp8": "倒数第四阳爻：不是他的骨骼弯曲，没有害。",
	"exp9": "六五：厥孚交如，威如；吉。",
	"exp10": "倒数第五阴爻：他的诚信，上下互信，有威严。吉。",
	"exp11": "上九：自天佑之，吉无不利。",
	"exp12": "最上阳爻：从天来保佑(音)他，吉，没有不利。",
	"exp13": "",
	"exp14": "",

	"base": "火在天上，大有。君子以遏恶扬善，顺天休命。日丽中天之象 辛勤丰收之意 文明光大 多福",
	"general": "大象：太阳在天，遍照大地万物，但五阳争一阴，须知有盈即缺。",
	"lucky": "运势：得时得运，昌荣大吉，但防物极必反，盛极而衰。",
	"emotion": "爱情：有情人终成眷属。  ",
	"health": "疾病：治疗可愈，防高血压、心脏、头肺病患。 ",
	"find": "失物：找寻费时，惟可失而 得。",
	"sued": "诉讼：可圆满解决。",
	"bussiness": "",
	"finance": "",
	"def":"大有众也，同人亲也；革去故也，鼎取新也；小过过也，中孚信也；丰多故也，亲寡旅也",
	"story":"与人同者，物必归焉，故受之以大有",
	"poem":"砍树摸雀",
	"kind": "金"
}
/*
- -
---
---
- -
---
---
*/
six_random_NaJia["011011"] = {"icon":"䷹","key":"58",
	"name": "兑为泽",
	"p": "兑宫",
	"1": "父母丁未土 世",
	"2": "兄弟丁酉金",
	"3": "子孙丁亥水",
	"4": "父母丁丑土 应",
	"5": "妻财丁卯木",
	"6": "官鬼丁巳火",
	"extname": "《易经》第五十八卦 兑 兑为泽 兑上兑下",
	"extnameexp": "兑：亨，利贞。",
	"extexp": "彖曰：兑，说也。 刚中而柔外，说以利贞，是以顺乎天，而应乎人。 说以先民，民忘其劳；说以犯难，民忘其死；说之大，民劝矣哉！",
	"extexp1": "象曰：和兑之吉，行未疑也。孚兑之吉，信志也。来兑之凶，位不当也。九四之喜，有庆也。孚于剥，位正当也。上六引兑，未光也。",
	"ext": "《兑》卦：通顺，利于占问。",
	"exp1": "初九：和兑，吉。",
	"exp2": "倒数第一阳爻：和悦，吉。",
	"exp3": "九二：孚兑，吉，悔亡。",
	"exp4": "倒数第二阳爻：以诚信使人喜悦，吉，悔恨消失。",
	"exp5": "六三：来兑，凶。",
	"exp6": "倒数第三阴爻：来讨好，凶。",
	"exp7": "九四：商兑，未宁，介疾有喜。",
	"exp8": "倒数第四阳爻：喜悦的商谈虽末定，疥疮的病有去掉的可喜",
	"exp9": "九五：孚于剥，有厉。",
	"exp10": "倒数第五阳爻：相信剥落的说法，有危险。",
	"exp11": "上六：引兑。",
	"exp12": "最上阴爻：引我喜悦。",
	"exp13": "",
	"exp14": "",

	"base": "丽泽，兑。君子以朋友讲习。与众同乐之象 有誉有讥之意 悦以和情",
	"general": "大象：两泽相依，更得泽中映月，美景良辰，令人怡悦。 ",
	"lucky": "运势：悲喜交集，有誉有讥，守正道，诸事尚可称意。 ",
	"emotion": "爱情：可能因金钱而致口舌之争，又或者因两个女性而烦恼。",
	"health": "疾病：六冲卦久病则凶，注意生活检点，戒酒色。 ",
	"find": "失物：遣失物似为金属或金钱，有望失而 得，但是迟一点。且多数已损毁或损失。",
	"sued": "诉讼：似为两个女性及金钱之事惹起，宜有和事老出面调解。",
	"bussiness": "",
	"finance": "",
	"def":"兑见，而巽伏也",
	"story":"入而后说之，故受之以兑；兑者说也",
	"poem":"趁水和泥",
	"kind": "金"
}
/*
- -
---
---
- -
---
- -
*/
six_random_NaJia["011010"] = {"icon":"䷮","key":"47",
	"name": "泽水困",
	"p": "兑宫",
	"1": "父母丁未土",
	"2": "兄弟丁酉金",
	"3": "子孙丁亥水 应",
	"4": "官鬼戊午火",
	"5": "父母戊辰土",
	"6": "妻财戊寅木 世",
	"extname": "《易经》第四十七卦 困 泽水困 兑上坎下",
	"extnameexp": "困：亨，贞，大人吉，无咎，有言不信。",
	"extexp": "彖曰：困，刚揜也。 险以说，困而不失其所，亨；其唯君子乎？ 贞大人吉，以刚中也。 有言不信，尚口乃穷也。",
	"extexp1": "象曰：入于幽谷，幽不明也。困于酒食，中有庆也。据于蒺藜，乘刚也。入于其宫不见其妻，不祥也。来徐徐，志在下也。虽不当位，有与也。劓刖，志未得也。乃徐有说，以中直也。利用祭祀，受福也。困于葛藟，未当也。动悔有悔，吉行也。",
	"ext": "《困》：顺利。占问重要人物的事吉利，没有困苦。你所说的话别人不信。",
	"exp1": "初六：臀困于株木，入于幽谷，三岁不见。",
	"exp2": "倒数第一阴爻：臀部受刑杖的困苦，关入幽暗的牢狱，三年不见天日。",
	"exp3": "九二：困于酒食，朱绂方来，利用亨祀，征凶，无咎。",
	"exp4": "倒数第二阳爻：为酒醉饱食所困，穿朱红色服装的贵族刚来。有利于用祭祀。出征凶，无害。",
	"exp5": "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。",
	"exp6": "倒数第三阴爻：在乱石里受困，手抓在蒺藜上，进到家里，不看见他的妻，凶。",
	"exp7": "九四：来徐徐，困于金车，吝，有终。",
	"exp8": "倒数第四阳爻：来得慢慢的，受到贵人的困阻，困难，有结果。",
	"exp9": "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。",
	"exp10": "倒数第五阳爻：危而不安，受到贵人的困苦，是慢慢得脱，用祭祀谢神有利。",
	"exp11": "上六：困于葛藟，于臲靰，曰动悔。 有悔，征吉。",
	"exp12": "最上阴爻：在有刺的蔓藤上受困，在不安中，说一动悔而又悔，出行吉。",
	"exp13": "",
	"exp14": "",

	"base": "泽无水，困。君子以致命遂志。龙游浅水之象 守正待机之意 因境求通 守义",
	"general": "大象：水在泽下，万物不生，喻君子困穷，小人滥盈之象。 ",
	"lucky": "运势：诸事不如意，所谓龙游浅水遭虾戏。 ",
	"emotion": "爱情：多失败收场，难成气候。 ",
	"health": "疾病：危重之象，注意口腔咽喉，泌尿系统，甚至性病。 ",
	"find": "失物：不能寻回。  ",
	"sued": "诉讼：凡事不宜过于执著，虽防牢狱之灾。",
	"bussiness": "",
	"finance": "",
	"def":"井通，而困相遇也",
	"story":"升而不已，必困，故受之以困",
	"poem":"撮楼抽梯",
	"kind": "金"
}
/*
- -
---
---
- -
- -
- -
*/
six_random_NaJia["011000"] = {"icon":"䷬","key":"45",
	"name": "泽地萃",
	"p": "兑宫",
	"1": "父母丁未土",
	"2": "兄弟丁酉金 应",
	"3": "子孙丁亥水",
	"4": "妻财乙卯木",
	"5": "官鬼乙巳火 世",
	"6": "父母乙未土",
	"extname": "《易经》第四十五卦 萃 泽地萃 兑上坤下",
	"extnameexp": "萃：亨。 王假有庙，利见大人，亨，利贞。 用大牲吉，利有攸往。",
	"extexp": "彖曰：萃，聚也；顺以说，刚中而应，故聚也。王假有庙，致孝享也。利见大人亨，聚以正也。 用大牲吉，利有攸往，顺天命也。 观其所聚，而天地万物之情可见矣。",
	"extexp1": "象曰：乃乱乃萃，其志乱也。引吉无咎，中未变也。往无咎，上巽也。大吉无咎，位不当也。萃有位，志未光也。赍咨涕洟，未安上也。",
	"ext": "《萃》卦：祭祀，王到了宗庙。见大人有利，通顺，占问有利。用牛祭吉。有所往有利。",
	"exp1": "初六：有孚不终，乃乱乃萃，若号一握为笑，勿恤，往无咎。",
	"exp2": "倒数第一阴爻：有俘虏，没有结果，（跑了）。是乱是聚，而呼号。（捉到了），一屋子人都笑，不用 。出去，无害。",
	"exp3": "六二：引吉，无咎，孚乃利用禴。",
	"exp4": "倒数第二阴爻：长期吉，无害。诚信是有利于春祭。",
	"exp5": "六三：萃如，嗟如，无攸利，往无咎，小吝。",
	"exp6": "倒数第三阴爻：聚会者，叹息著，无所利。出去无害，有小的艰难。",
	"exp7": "九四：大吉，无咎。",
	"exp8": "倒数第四阳爻：大吉无害。",
	"exp9": "九五：萃有位，无咎。 匪孚，元永贞，悔亡。",
	"exp10": "倒数第五阳爻：聚集有地位的人，无害。（志趣没有光明），不够诚信。（但刚而正位），占问大事而长期无悔。",
	"exp11": "上六：齎咨涕洟，无咎。",
	"exp12": "最上阴爻：叹气流泪，无害。",
	"exp13": "",
	"exp14": "",

	"base": "泽上于地，萃。君子以除戎器，戒不虞。鲤跃龙门之象 精英荟萃之意 团结力量 保国",
	"general": "大象：泽在地上，水聚于泥土中，滋养草木，生长茂盛。",
	"lucky": "运势：吉运昌盛，又得长辈提携，事业大利，但须防财务纠纷。  ",
	"emotion": "爱情：可喜可贺之吉象。",
	"health": "疾病：凶象，宜速诊治，防胸腹及咽喉之病变。  ",
	"find": "失物：多半能失而得。 ",
	"sued": "诉讼：宜解不宜结。",
	"bussiness": "",
	"finance": "",
	"def":"萃聚，而升不来也",
	"story":"物相遇而后聚，故受之以萃；萃者聚也",
	"poem":"鲤鱼化龙",
	"kind": "金"
}
/*
- -
---
---
---
- -
- -
*/
six_random_NaJia["011100"] = {"icon":"䷞","key":"31",
	"name": "泽山咸",
	"p": "兑宫",
	"1": "父母丁未土 应",
	"2": "兄弟丁酉金",
	"3": "子孙丁亥水",
	"4": "兄弟丙申金 世",
	"5": "官鬼丙午火",
	"6": "父母丙辰土",
	"f5": "妻财寅木",
	"extname": "《易经》第三十一卦 咸 泽山咸 兑上艮下",
	"extnameexp": "咸：亨，利贞，取女吉。",
	"extexp": "彖曰：咸，感也。柔上而刚下，二气感应以相与，止而说，男下女，是以亨利贞，取女吉也。天地感而万物化生，圣人感人心而天下和平；观其所感，而天地万物之情可见矣！",
	"extexp1": "象曰：咸其拇，志在外也。虽凶居吉，顺不害也。咸其股，亦不处也。志在随人，所执下也。贞吉悔亡，未感害也。憧憧往来，未光大也。咸其脢，志末也。咸其辅颊舌，滕口说也。",
	"ext": "《咸》卦：通顺。占问有利。娶新妇吉。",
	"exp1": "初六：咸其拇。",
	"exp2": "倒数第一阴爻：伤他的足大趾。",
	"exp3": "六二：咸其腓，凶，居吉。",
	"exp4": "倒数第二阴爻：伤他的腿肚子，凶。居家不出，吉。",
	"exp5": "九三：咸其股，执其随，往吝。",
	"exp6": "倒数第三阳爻：伤他的大腿，握住他的裂开的肉，出外难",
	"exp7": "九四：贞吉悔亡，憧憧往来，朋从尔思。",
	"exp8": "倒数第四阳爻：占问吉，悔没有了。人们往来不断，钱财跟者你来。",
	"exp9": "九五：咸其脢，无悔。",
	"exp10": "倒数第五阴爻：伤他的背肉，没有害。",
	"exp11": "上六：咸其辅，颊，舌。",
	"exp12": "最上阴爻：伤他的面颊和舌。",
	"exp13": "",
	"exp14": "",

	"base": "山上有泽，咸。君子以虚受人。两性交感之象 往来无阻之意 感应相通 有情",
	"general": "大象：少男在少女之下，彼此感应，象徵新婚，两性交感。",
	"lucky": "运势：如意吉祥，但勿为不正当感情而意乱情迷。",
	"emotion": "爱情：正常恋情，则发展顺利，但名不顺者，当悬崖勒马。 ",
	"health": "疾病：防泌尿系统病，肠胃病及性病等，须疗养得法，否则不利。",
	"find": "失物：尽速找寻，可以取回，延误时机，则找不回来。",
	"sued": "诉讼：提防桃色纠纷，诸事宜和解，有贵人相助。",
	"bussiness": "事业：和为贵，和则万事兴，务以诚感人，以诚待人。广泛交往朋友，谦虚礼让。树立大志向，坚持主见，不可盲目随大流。不利时应安居待机，不可妄动强求",
	"finance": "经商：有利可图。但应以纯正之心，以诚待人，加强合作。市场若不景气，决不可妄动，不可强求，而应静待发展。虚心听取不同意见",
	"def":"咸速也，恒久也",
	"story":"",
	"poem":"棒槌发芽",
	"kind": "金"
}
/*
- -
---
- -
---
- -
- -
*/
six_random_NaJia["010100"] = {"icon":"䷦","key":"39",
	"name": "水山蹇",
	"p": "兑宫",
	"1": "子孙戊子水",
	"2": "父母戊戌土",
	"3": "兄弟戊申金 世",
	"4": "兄弟丙申金",
	"5": "官鬼丙午火",
	"6": "父母丙辰土 应",
	"f5": "妻财卯木",
	"extname": "《易经》第三十九卦 蹇 水山蹇 坎上艮下 ",
	"extnameexp": "蹇：利西南，不利东北；利见大人，贞吉。",
	"extexp": "彖曰：蹇，难也，险在前也。 见险而能止，知矣哉！蹇利西南， 往得中也；不利东北，其道穷也。 利见大人，往有功也。 当位贞吉，以正邦也。 蹇之时用大矣哉！",
	"extexp1": "象曰：往蹇来誉，宜待也。王臣蹇蹇，终无尤也。往蹇来反，内喜之也。往蹇来连，当位实也。大蹇朋来，以中节也。往蹇来硕，志在内也。利见大人，以从贵也。",
	"ext": "《蹇》卦：到西南去有利，到东北不利。见大人有利。占问吉。",
	"exp1": "初六：往蹇，来誉。",
	"exp2": "倒数第一阴爻：去时难走，回来走得安舒。",
	"exp3": "六二：王臣蹇蹇，匪躬之故。",
	"exp4": "倒数第二阴爻：王臣难上加难，不是自身的缘故，（是环境所逼）。",
	"exp5": "九三：往蹇来反。",
	"exp6": "倒数第三阴爻：去时难走，回来时美好。",
	"exp7": "六四：往蹇来连。",
	"exp8": "倒数第四阴爻：去时难走，回来时坐车。",
	"exp9": "九五：大蹇朋来。",
	"exp10": "倒数第五阳爻：经过大困难，钱财来了。",
	"exp11": "上六：往蹇来硕，吉；利见大人。",
	"exp12": "最上阳爻：去时难行，回来大得利，吉，见大人有利。",
	"exp13": "",
	"exp14": "",

	"base": "山上有水，蹇。君子以反身修德。举步维艰之象 前路难行之意 险阻在前 反省",
	"general": "大象：前路险陷，后有高山，进退维谷，如跛者举步为艰。 ",
	"lucky": "运势：多灾多难，进退两难，此时宜守正道，不可轻举妄动，动反招祸。  ",
	"emotion": "爱情：困难重重，破象已现。 ",
	"health": "疾病：病重，不可疏忽医治，注意肾、胃、手部四肢损伤。 ",
	"find": "失物：搜索有困难阻滞而停止，不能寻回。",
	"sued": "诉讼：终必有险，更防血光。不宜起讼，动则招咎。",
	"bussiness": "",
	"finance": "",
	"def":"解缓也，蹇难也",
	"story":"乖必有难，故受之以蹇；蹇者难也",
	"poem":"雨雪载途",
	"kind": "金"
}
/*
- -
- -
- -
---
- -
- -
*/
six_random_NaJia["000100"] = {"icon":"䷎","key":"15",
	"name": "地山谦",
	"p": "兑宫",
	"1": "兄弟癸酉金",
	"2": "子孙癸亥水 世",
	"3": "父母癸丑土",
	"4": "兄弟丙申金",
	"5": "官鬼丙午火 应",
	"6": "父母丙辰土",
	"f5": "妻财卯木",
	"extname": "《易经》第十五卦 谦 地山谦 坤上艮下",
	"extnameexp": "谦：亨，君子有终。",
	"extexp": "彖曰：谦亨，天道下济而光明，地道卑而上行。天道亏盈而益谦，地道变盈而流谦，鬼神害盈而福谦，人道恶盈而好谦。谦尊而光，卑而不可踰，君子之终也。",
	"extexp1": "象曰：谦谦君子，卑以自牧也。鸣谦贞吉，中心得也。劳谦君子，万民服也。无不利撝谦，不违则也。利用侵伐，征不服也。鸣谦，志未得也。可用行师，征邑国也。",
	"ext": "《谦》卦：通顺。贵族(谦让)有好结果。",
	"exp1": "初六：谦谦君子，用涉大川，吉。",
	"exp2": "倒数第一阴爻：谦而又谦的贵族，用（这种念度）来渡过大河，是吉的。",
	"exp3": "六二：鸣谦，贞吉。",
	"exp4": "倒数第二阴爻：有声望而谦虚，占问是吉。",
	"exp5": "九三：劳谦君子，有终吉。",
	"exp6": "倒数第三阳爻：勤劳而谦让的贵族，有好结果，是吉的。",
	"exp7": "六四：无不利，撝谦。",
	"exp8": "倒数第四阴爻：没有不利，奋勇向前而谦虚。",
	"exp9": "六五：不富，以其邻，利用侵伐，无不利。",
	"exp10": "倒数第五阴爻：不富，因为邻国来侵犯掠夺。利用邻国的侵伐来防御，没有不利。",
	"exp11": "上六：鸣谦，利用行师，征邑国。",
	"exp12": "最上阴爻：有声望而廉虚，有利地用出兵来征讨大夫的邑、诸侯的国。",
	"exp13": "",
	"exp14": "",

	"base": "地中有山，谦。君子以裒多益寡，称物平施。空谷藏玉之象 虚怀处世之意 虚而有容 戒惰",
	"general": "大象：山应在地面上，而今在地下，代表谦逊之德。",
	"lucky": "运势：吉利平安。前途无限，但必须去除骄横之气。",
	"emotion": "爱情：以谦诚之态度追求有成，可获良缘。",
	"health": "疾病：防旧病 发，腹部或背部之疾，但仍属吉象。",
	"find": "失物：难以发现，有失窃的可能。 ",
	"sued": "诉讼：宜速和解，拖延不利。",
	"bussiness": "",
	"finance": "",
	"def":"谦轻，而豫怠也",
	"story":"有大者不可以盈，故受之以谦",
	"poem":"二人分金",
	"kind": "金"
}
/*
- -
- -
---
---
- -
- -
*/
six_random_NaJia["001100"] = {"icon":"䷽","key":"62",
	"name": "雷山小过",
	"p": "兑宫",
	"1": "父母庚戌土",
	"2": "兄弟庚申金",
	"3": "官鬼庚午火 世",
	"4": "兄弟丙申金",
	"5": "官鬼丙午火",
	"6": "父母丙辰土 应",
	"f5": "妻财卯木",
	"extname": "《易经》第六十二卦 小过 雷山小过 震上艮下",
	"extnameexp": "小过：亨，利贞，可小事，不可大事。飞鸟遗之音，不宜上宜下，大吉。",
	"extexp": "彖曰：小过，小者过而亨也。 过以利贞，与时行也。 柔得中，是以小事吉也。 刚失位而不中，是以不可大事也。 有飞鸟之象焉，有飞鸟遗之音，不宜上宜下，大吉；上逆而下顺也。",
	"extexp1": "象曰：飞鸟以凶，不可如何也。不及其君，臣不可过也。从或戕之，凶如何也？弗过遇之，位不当也。往厉必戒，终不可长也。密云不雨，已上也。弗遇过之，已亢也",
	"ext": "《小过》卦：通顺，有利占问，可以做碎琐事，不可以做重大的事，雀鸟飞过只留下叫声回旋，不宜向上飞，宜下飞，大吉。",
	"exp1": "初六：飞鸟以凶。",
	"exp2": "倒数第一阴爻：飞鸟硷来凶兆。",
	"exp3": "六二：过其祖，遇其妣；不及其君，遇其臣；无咎。",
	"exp4": "倒数第二阴爻：批评他的祖父，赞扬他的祖母。指出他的君王的不足，赞扬他的臣子。",
	"exp5": "九三：弗过防之，从或戕之，凶。",
	"exp6": "倒数第三阳爻：没有错误，要防备他犯错误，放纵他，或许害了他。凶。",
	"exp7": "九四：无咎，弗过遇之。 往厉必戒，勿用永贞。",
	"exp8": "倒数第四阳爻：无害。没有错误，表扬他；日后有犯错误的危险，一定要告诫。占问不是永远好的。",
	"exp9": "六五：密云不雨，自我西郊，公弋取彼在穴。",
	"exp10": "倒数第五阴爻：自从我到了西郊，乌云密布，没有下雨。公射箭，在山洞里得到野兽",
	"exp11": "上六：弗遇过之，飞鸟离之，凶，是谓灾眚。",
	"exp12": "最上阴爻：（没有过错），不表扬，反批评他，多用网来捕飞鸟，凶，是叫灾害。",
	"exp13": "",
	"exp14": "",

	"base": "山上有雷，小过。君子以行过乎恭，丧过乎哀，用过乎俭。贪多务失之象 阳奉阴违之意 慎防逾越 没世",
	"general": "大象：山上有雷，雷声虽大但被山阻隔，雷声减弱，即为「小过」。",
	"lucky": "运势：诸事不利，宜行小事，不宜做大事，更防因小过失做成惊动，惹来是非争讼。",
	"emotion": "爱情：相处有障碍，虽可成功但最终又不和。",
	"health": "疾病：病情有恶化之象，但及时诊治则吉，防手足，肠胃之疾。 ",
	"find": "失物：不能寻回。",
	"sued": "诉讼：不宜各走极端，宜多沟通和解。",
	"bussiness": "",
	"finance": "",
	"def":"大有众也，同人亲也；革去故也，鼎取新也；小过过也，中孚信也；丰多故也，亲寡旅也",
	"story":"有其信者，必行之，故受之 以小过",
	"poem":"急过独桥",
	"kind": "金"
}
/*
- -
- -
---
- -
---
---
*/
six_random_NaJia["001011"] = {"icon":"䷵","key":"54",
	"name": "雷泽归妹",
	"p": "兑宫",
	"1": "父母庚戌土 应",
	"2": "兄弟庚申金",
	"3": "官鬼庚午火",
	"4": "父母丁丑土 世",
	"5": "妻财丁卯木",
	"6": "官鬼丁巳火",
	"f3": "子孙亥水",
	"extname": "《易经》第五十四卦 归妹 雷泽归妹 震上兑下",
	"extnameexp": "归妹：征凶，无攸利。",
	"extexp": "彖曰：归妹，天地之大义也。天地不交，而万物不兴，归妹人之终始也。说以动，所归妹也。 征凶，位不当也。 无攸利，柔乘刚也。",
	"extexp1": "象曰：归妹以娣，以恒也。跛能履吉，相承也。利幽人之贞，未变常也。归妹以须，未当也。愆期之志，有待而行也。帝乙归妹，不如其娣之袂良也。其位在中，以贵行也。上六无实，承虚筐也。",
	"ext": "《归妹》卦：出外作战不吉利，没有利益收获。",
	"exp1": "初九：归妹以娣，跛能履，征吉。",
	"exp2": "倒数第一阳爻：嫁少女及女妹，跛子能够走路，出行吉。",
	"exp3": "九二：眇能视，利幽人之贞。",
	"exp4": "倒数第二阳爻：眼睛不好能视，占问被幽禁的人有利。",
	"exp5": "六三：归妹以须，反归以娣。",
	"exp6": "倒数第三阴爻：嫁少女及女姊，夫家把妹逐归父母家。",
	"exp7": "九四：归妹愆期，迟归有时。",
	"exp8": "倒数第四阳爻：嫁少女误了婚期，迟嫁是有所等待。",
	"exp9": "六五：帝乙归妹，其君之袂，不如其娣之袂良，月几望，吉。",
	"exp10": "倒数第五阴爻：帝乙嫁少女为王后，王后的衣袖不及她妹的衣袖美丽。结婚在月半后，吉。",
	"exp11": "上六：女承筐无实，士刲羊无血，无攸利。",
	"exp12": "最上阴爻：女捧筐，筐中无物；男刺羊不出血，（是空刺），无所利。",
	"exp13": "",
	"exp14": "",

	"base": "泽上有雷，归妹。君子以永终知敝。少女追男之象 错失端正之意 始乱终悔 妄动",
	"general": "大象：震长男在上，兑少女在下，女必归从，归即是出嫁，但少女配长男，非正常组合。",
	"lucky": "运势：处事有违常理正道，先得其益，但随后祸事百端。 ",
	"emotion": "爱情：有女追男之象，但多为悲剧收场，宜三思而行。",
	"health": "疾病：病危重，极易恶化，为中风、肝病、气管及性病等。",
	"find": "失物：失物虽有被归还的可能，但自身仍有损失。 ",
	"sued": "诉讼：事牵连于女性，宜力求和解，但我方必有损失。",
	"bussiness": "",
	"finance": "",
	"def":"归妹女之终也。未济男之穷也",
	"story":"进必有所归， 故受之以归妹",
	"poem":"缘木求鱼",
	"kind": "金"
}
/*
---
- -
---
---
- -
---
*/
six_random_NaJia["101101"] = {"icon":"䷝","key":"30",
	"name": "离为火",
	"p": "离宫",
	"1": "兄弟己巳火 世",
	"2": "子孙己未土",
	"3": "妻财己酉金",
	"4": "官鬼己亥水 应",
	"5": "子孙己丑土",
	"6": "父母己卯木",
	"extname": "《易经》第三十卦 离 离为火 离上离下",
	"extnameexp": "离：利贞，亨。 畜牝牛，吉。",
	"extexp": "彖曰：离，丽也；日月丽乎天，百谷草木丽乎土，重明以丽乎正，乃化成天下。 柔丽乎中正，故亨；是以畜牝牛吉也。",
	"extexp1": "象曰：履错之敬，以辟咎也。黄离元吉，得中道也。日昃之离，何可久也？突如其来如，无所容也。六五之吉，离王公也。王用出征，以正邦也。",
	"ext": "《离》卦：占问有利。通顺。养母牛吉。",
	"exp1": "初九：履错然，敬之无咎。",
	"exp2": "倒数第一阳爻：步子错乱，恭敬地对待他无害。",
	"exp3": "六二：黄离，元吉。",
	"exp4": "倒数第二阴爻：黄色附在物上，大吉。",
	"exp5": "九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。",
	"exp6": "倒数第三阳爻：太阳偏西附著（在天上)，不敲瓦器唱歌，就到老了叹气，凶。",
	"exp7": "九四：突如其来如，焚如，死如，弃如。",
	"exp8": "倒数第四阳爻：（敌人）突如其来，焚烧著，杀死著，抛弃著。",
	"exp9": "六五：出涕沱若，戚嗟若，吉。",
	"exp10": "倒数第五阴爻：泪流滂沱，悲伤叹息，吉。",
	"exp11": "上九：王用出征，有嘉折首，获其匪丑，无咎。",
	"exp12": "最上阳爻：王因出击，有喜事斩了敌首，捉住他们的敌众，无害。",
	"exp13": "",
	"exp14": "",

	"base": "明两作，离。大人以继明照于四方。丽日中天之象 光明远大之意 附和柔中",
	"general": "大象：两离火相重，上下通明之象，火有气，但无形，主不实不定之意。",
	"lucky": "运势：外观极盛，烈日当空之象，凡事不宜急进及意气用事。 ",
	"emotion": "爱情：不宜性急，会弄巧反拙，静而诚者必有所成。",
	"health": "疾病：急病可解，久病则凶，宜耐心调养、为心脏眼科血疾。",
	"find": "失物：动作快，可寻回。",
	"sued": "诉讼：只宜人侵己，不宜己侵人，主动者不利。",
	"bussiness": "",
	"finance": "",
	"def":"离上，而坎下也",
	"story":"陷必有所丽，故受之以离；离者丽也",
	"poem":"天官赐福",
	"kind": "火"
}
/*
---
- -
---
---
- -
- -
*/
six_random_NaJia["101100"] = {"icon":"䷷","key":"56",
	"name": "火山旅",
	"p": "离宫",
	"1": "兄弟己巳火",
	"2": "子孙己未土",
	"3": "妻财己酉金 应",
	"4": "妻财丙申金",
	"5": "兄弟丙午火",
	"6": "子孙丙辰土 世",
	"f5": "官鬼亥水",
	"f6": "父母卯木",
	"extname": "《易经》第五十六卦 旅 火山旅 离上艮下",
	"extnameexp": "旅：小亨，旅贞吉。",
	"extexp": "彖曰：旅，小亨，柔得中乎外，而顺乎刚，止而丽乎明，是以小亨，旅贞吉也。 旅之时义大矣哉！",
	"extexp1": "象曰：旅琐琐，志穷灾也。得童仆贞，终无尤也。旅焚其次，亦以伤矣。以旅与下，其义丧也。旅于处，未得位也。得其资斧，心未快也。终以誉命，上逮也。以旅在上，其义焚也。丧牛于易，终莫之闻也。",
	"ext": "《旅》：小通顺，占问旅程是吉利的。",
	"exp1": "初六：旅琐琐，斯其所取灾。",
	"exp2": "倒数第一阴爻：旅客三心两意，离开他的寓所，因而得祸。",
	"exp3": "六二：旅即次，怀其资，得童仆贞。",
	"exp4": "倒数第二阴爻：旅客到了住处，携带钱币，买得一男奴隶，占问吉。",
	"exp5": "九三：旅焚其次，丧其童仆，贞厉。",
	"exp6": "倒数第三阳爻：旅客住的住处被火烧了，失掉了他的男奴隶。占问有危险。",
	"exp7": "九四：旅于处，得其资斧，我心不快。",
	"exp8": "倒数第四阳爻：旅客在住处，找到了他的钱币，心里不快活。",
	"exp9": "六五：射雉一矢亡，终以誉命。",
	"exp10": "倒数第五阴爻：旅客射野鸡，一箭射中，野鸡带箭飞走，终究得到善射的美名。",
	"exp11": "上九：鸟焚其巢，旅人先笑后号啕。 丧牛于易，凶。",
	"exp12": "最上阳爻：（旅客住处被烧，象）鸟被烧了它的巢，旅客先笑后嚎哭。在敌人那里失去了牛，凶。",
	"exp13": "",
	"exp14": "",

	"base": "山上有火，旅。君子以明慎用刑，而不留狱。居无定所之象 漂泊寻安之意 拨乱反正 失所",
	"general": "大象：火烧山野，火头遍布，所到之处，无一幸免，火头尤如行旅之人，无所定处。",
	"lucky": "运势：诸事变动不定，此时只好坚守信心，多参考他人意见，否则必有凶。 ",
	"emotion": "爱情：呈现不稳定现象，有孤身上路之叹，宜检讨原因。 ",
	"health": "疾病：病情变化不定，宜速就医。 ",
	"find": "失物：尽快去找，应可寻回，失物似在屋舍之外，留意镜子之类物体，可提供线索。  ",
	"sued": "诉讼：宜速战速决，时间一拖则不利。",
	"bussiness": "",
	"finance": "",
	"def":"大有众也，同人亲也；革去故也，鼎取新也；小过过也，中孚信也；丰多故也，亲寡旅也",
	"story":"穷大者必失其居，故受之以旅",
	"poem":"宿鸟焚巢",
	"kind": "火"
}
/*
---
- -
---
---
---
- -
*/
six_random_NaJia["101110"] = {"icon":"䷱","key":"50",
	"name": "火风鼎",
	"p": "离宫",
	"1": "兄弟己巳火",
	"2": "子孙己未土 应",
	"3": "妻财己酉金",
	"4": "妻财辛酉金",
	"5": "官鬼辛亥水 世",
	"6": "子孙辛丑土",
	"f6": "父母卯木",
	"extname": "《易经》第五十卦 鼎 火风鼎 离上巽下",
	"extnameexp": "鼎：元吉，亨。",
	"extexp": "彖曰：鼎，象也。 以木巽火，亨饪也。 圣人亨以享上帝，而大亨以养圣贤。 巽而耳目聪明，柔进而上行，得中而应乎刚，是以元亨。",
	"extexp1": "象曰：鼎颠趾，未悖也。利出否，以从贵也。鼎有实，慎所之也。我仇有疾，终无尤也。鼎耳革，失其义也。覆公饣束，信如何也。鼎黄耳，中以为实也。玉铉在上，刚柔节也。",
	"ext": "《鼎》卦：大吉利，通顺。",
	"exp1": "初六：鼎颠趾，利出否，得妾以其子，无咎。",
	"exp2": "倒数第一阴爻：鼎的脚颠倒在上，利于倒出鼎中坏物。得到妾（用作正妻），因她的儿子，无害。",
	"exp3": "九二：鼎有实，我仇有疾，不我能即，吉。",
	"exp4": "倒数第二阳爻：鼎里有食物，我的配偶有病，不能就我同吃。（但病会痊愈），吉。",
	"exp5": "九三：鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。",
	"exp6": "倒数第三阳爻：鼎耳坏了，它搬动不了，鼎壁的野鸡肉没有吃，天正下雨，（落入鼎里），美味亏损，可悔恨，（可以改煮），终于吉。",
	"exp7": "九四：鼎折足，覆公餗，其形渥，凶。",
	"exp8": "倒数第四阳爻：鼎的脚折断了，翻倒了公的美味，他在屋内受刑，凶。",
	"exp9": "六五：鼎黄耳金铉，利贞。",
	"exp10": "倒数第五阴爻：鼎铜耳、铜的横杠。占问有利。",
	"exp11": "上九：鼎玉铉，大吉，无不利。",
	"exp12": "最上的阳爻：鼎用镶玉的杠，大吉，没有不利。",
	"exp13": "",
	"exp14": "",

	"base": "木上有火，鼎。君子以正位凝命。鼎盛兴隆之象 去故取新之意 严整创新 任重",
	"general": "大象：木之上有离火，为燃炊烹饪之象，鼎有去旧立新，改过迁善之意。",
	"lucky": "运势：时运仍佳，事业可成，但诸事不宜迟滞，及防有诉讼之累。",
	"emotion": "爱情：未婚者则顺利，已婚女性占得防婚外情影响家庭。",
	"health": "疾病：病情有变，但无大碍，为胆石，心脏，消化系统病。 ",
	"find": "失物：过一段时间后可寻回，惟已变形。 ",
	"sued": "诉讼：由小事引起，宜和解了事。",
	"bussiness": "",
	"finance": "",
	"def":"大有众也，同人亲也；革去故也，鼎取新也；小过过也，中孚信也；丰多故也，亲寡旅也",
	"story":"革物者莫若鼎，故受之以鼎",
	"poem":"渔人得利",
	"kind": "火"
}
/*
---
- -
---
- -
---
- -
*/
six_random_NaJia["101010"] = {"icon":"䷿","key":"64",
	"name": "火水未济",
	"p": "离宫",
	"1": "兄弟己巳火 应",
	"2": "子孙己未土",
	"3": "妻财己酉金",
	"4": "兄弟戊午火 世",
	"5": "子孙戊辰土",
	"6": "父母戊寅木",
	"f4": "官鬼亥水",
	"extname": "《易经》第六十四卦 未济 火水未济 离上坎下",
	"extnameexp": "未济：亨，小狐汔济，濡其尾，无攸利。",
	"extexp": "彖曰：未济，亨；柔得中也。 小狐汔济，未出中也。 濡其尾，无攸利；不续终也。 虽不当位，刚柔应也。",
	"extexp1": "彖曰：濡其尾，亦不知极也。九二贞吉，中以行正也。未济征凶，位不当也。贞吉悔亡，志行也。君子之光，其晖吉也。饮酒濡首，亦不知节也。",
	"ext": "《未济》卦：通顺，小狐快将渡过对岸，但它的尾巴给弄湿了，没有利益。",
	"exp1": "初六：濡其尾，吝。",
	"exp2": "倒数第一阴爻：弄湿了小狐的尾巴，有困难。",
	"exp3": "九二：曳其轮，贞吉。",
	"exp4": "倒数第二阳爻：拉车子的轮子（过河），占问吉。",
	"exp5": "六三：未济，征凶，利涉大川。",
	"exp6": "倒数第三阴爻：没有渡过河，出外凶。渡大河有利。",
	"exp7": "九四：贞吉，悔亡，震用伐鬼方，三年有赏于大国。",
	"exp8": "倒数第四阳爻：占问吉，悔恨消失。（周人）出动去讨伐鬼方，三年，从大国（殷商）受到贤赐。",
	"exp9": "六五：贞吉，无悔，君子之光，有孚，吉。",
	"exp10": "倒数第五阴爻：占问吉，无悔。有诚信是君子的光荣。吉。",
	"exp11": "上九：有孚于饮酒，无咎，濡其首，有孚失是。",
	"exp12": "最上阳爻：有诚信而饮酒，无害。酗酒连头都浇湿了，虽有诚信，不对了。",
	"exp13": "",
	"exp14": "",

	"base": "火在水上，未济。 阴阳失调之象 上下不通之意 乾坤再造 卜终",
	"general": "大象：水性下注，火势向上，水火不交，阴阳不得正位，未能完成和未能成功之意。",
	"lucky": "运势：运气欠佳，但必须耐心突破难关，终可成功，有初凶后吉之象。 ",
	"emotion": "爱情：发展初期难以沟通，格格不入，但必须耐心，慢慢会得到对方接受。 ",
	"health": "疾病：病情不稳定，注意心肾不交、失眠、血液等病。  ",
	"find": "失物：不能寻回。 ",
	"sued": "诉讼：宜拖延时间，日久可得贵人之助，和解了事。",
	"bussiness": "",
	"finance": "",
	"def":"物不可穷也，故受之以未济终焉",
	"story":"归妹女之终也。未济男之穷也",
	"poem":"太岁月建",
	"kind": "火"
}
/*
---
- -
- -
- -
---
- -
*/
six_random_NaJia["100010"] = {"icon":"䷃","key":"4",
	"name": "山水蒙",
	"p": "离宫",
	"1": "父母丙寅木",
	"2": "官鬼丙子水",
	"3": "子孙丙戌土 世",
	"4": "兄弟戊午火",
	"5": "子孙戊辰土",
	"6": "父母戊寅木 应",
	"f3": "妻财酉金",
	"extname": "《易经》第四卦 蒙 山水蒙 艮上坎下",
	"extnameexp": "蒙：亨。 匪我求童蒙，童蒙求我。 初噬告，再三渎，渎则不告。利贞。",
	"extexp": "彖曰：蒙，山下有险，险而止，蒙。 蒙亨，以亨行时中也。匪我求童蒙，童蒙求我，志应也。 初噬告，以刚中也。再三渎， 渎则不告，渎蒙也。 蒙以养正，圣功也。",
	"extexp1": "象曰：利用刑人，以正法也。子克家，刚柔接也。勿用取女，行不顺也。困蒙之吝，独远实也。童蒙之吉，顺以巽也。利用御寇，上下顺也。",
	"ext": "《蒙》卦：通顺。不是我求蒙昧的童子，蒙昧的童子求我。利于占问。",
	"exp1": "初六：发蒙，利用刑人，用说桎梏，以往吝。",
	"exp2": "倒数第一阴爻：启发蒙昧，利用受刑的人，脱掉他们的枷锁，用在出外，不利。",
	"exp3": "九二：包蒙吉；纳妇吉；子克家。",
	"exp4": "倒数第二阳爻：包容蒙昧，吉。娶妇，吉。子能够成家。",
	"exp5": "六三：勿用娶女；见金夫，不有躬，无攸利。",
	"exp6": "倒数第三阴爻：不用去抢女，看见武夫，要丧命，无所利。",
	"exp7": "六四：困蒙，吝。",
	"exp8": "倒数第四阴爻：困于蒙昧，不利。",
	"exp9": "六五：童蒙，吉。",
	"exp10": "倒数第五阴爻：蒙昧的童子（处于好的地位可教导），吉利。",
	"exp11": "上九：击蒙；不利为寇，利御寇。",
	"exp12": "最上阳爻：攻击蒙昧，作为侵略是不利的，作为抵抗侵略是有利的。",
	"exp13": "",
	"exp14": "",

	"base": "山下出泉，蒙。君子以果行育德。童蒙启智之象　迷糊摸索之意 启蒙奋发 正始",
	"general": "大象：蒙者，昏而无所见也，故宜「启蒙」。",
	"lucky": "运势：初时迷惑不知方向，须忍耐待机而动，凡事多听取别人意见，则运可通。",
	"emotion": "爱情：落花有意流水无情，主缺乏勇气与决心。",
	"health": "疾病：病情不明，反覆难治。为肠胃、腹水之疾及传染病。",
	"find": "失物：遍寻不获。似乎在大门下陷之处遗失，忘记带走，可试问人。 ",
	"sued": "诉讼：因外人引起事端，目下未明，有理讲不清。",
	"bussiness": "",
	"finance": "",
	"def":"屯见而不失其居。蒙杂而著",
	"story":"物生必蒙，故受之以蒙；蒙者蒙也，物之稚也",
	"poem":"小鬼偷钱",
	"kind": "火"
}
/*
---
---
- -
- -
---
- -
*/
six_random_NaJia["110010"] = {"icon":"䷺","key":"59",
	"name": "风水涣",
	"p": "离宫",
	"1": "父母辛卯木",
	"2": "兄弟辛巳火 世",
	"3": "子孙辛未土",
	"4": "兄弟戊午火",
	"5": "子孙戊辰土 应",
	"6": "父母戊寅木",
	"f3": "妻财酉金",
	"f4": "官鬼亥水",
	"extname": "《易经》第五十九卦 涣 风水涣 巽上坎下",
	"extnameexp": "涣：亨。 王假有庙，利涉大川，利贞。",
	"extexp": "彖曰：涣亨。刚来而不穷，柔得位乎外而上同。 王假有庙，王乃在中也。 利涉大川，乘木有功也。",
	"extexp1": "象曰：初六之吉，顺也。涣奔其机，得愿也。涣其躬，志在外也。涣其群元吉，光大也。王居无咎，正位也。涣其血，远害也。",
	"ext": "《涣》卦：通顺。国王来到宗庙，有利于渡大河，利于占问。",
	"exp1": "初六：用拯马壮，吉。",
	"exp2": "倒数第一阴爻：用阉割的马强壮，吉。",
	"exp3": "九二：涣奔其机，悔亡。",
	"exp4": "倒数第二阳爻：散流的水奔冲他的台阶，（冲洗院内藏秽），悔恨消失。",
	"exp5": "六三：涣其躬，无悔。",
	"exp6": "倒数第三阴爻：散流的水冲洗他的身子，没有悔恨。",
	"exp7": "六四：涣其群，元吉。 涣有丘，匪夷所思。",
	"exp8": "倒数第四阴爻：散流冲洗群众，大吉。散流到丘陵，不是平常所能想的。",
	"exp9": "九五：涣汗其大号，涣王居，无咎。",
	"exp10": "倒数第五阳爻：散流他的汗，像发出大的号令。散流的水冲洗王宫，无害。",
	"exp11": "上九：涣其血，去逖出，无咎。",
	"exp12": "最上阳爻：涣散他的患，患去警惕出来，无害",
	"exp13": "",
	"exp14": "",

	"base": "风行水上，涣。先王以享于帝立庙。风吹水荡之象 随波涣散之意 彼离散漫 追远",
	"general": "大象：风吹在水面上，流动四散，又有春风吹散严寒，令冰雪消解。",
	"lucky": "运势：虽有忧患，但终可解困，百事亨通，忌任性散慢。 ",
	"emotion": "爱情：现时有障碍，但最终能圆满。 ",
	"health": "疾病：幼年多体弱多病，及年逐长大而渐康 ，注意血液、内分泌。 ",
	"find": "失物：不能寻回。  ",
	"sued": "诉讼：凡事宜大事化小，小事化无，诉讼可解。",
	"bussiness": "",
	"finance": "",
	"def":"涣离也，节止也",
	"story":"说而后散之，故受之以涣；涣者离也",
	"poem":"隔河望金",
	"kind": "火"
}
/*
---
---
---
- -
---
- -
*/
six_random_NaJia["111010"] = {"icon":"䷅","key":"6",
	"name": "天水讼",
	"p": "离宫",
	"1": "子孙壬戌土",
	"2": "妻财壬申金",
	"3": "兄弟壬午火 世",
	"4": "兄弟戊午火",
	"5": "子孙戊辰土",
	"6": "父母戊寅木 应",
	"f4": "官鬼亥水",
	"extname": "《易经》第六卦 讼 天水讼 乾上坎下",
	"extnameexp": "讼：有孚，窒。 惕中吉。 终凶。 利见大人，不利涉大川。",
	"extexp": "彖曰：讼，上刚下险，险而健讼。讼有孚窒，惕中吉，刚来而得中也。终凶；讼不可成也。 利见大人；尚中正也。不利涉大川；入于渊也。",
	"extexp1": "象曰：不永所事，讼不可长也。虽小有言，其辩明也。不克讼，归逋窜也。自下讼上，患至掇也。食旧德，从上吉也。复即命渝，安贞不失也。讼元吉，以中正也。以讼受服，亦不足敬也。",
	"ext": "《讼》卦：有俘虏，（加以）闭塞，警惕，中途是吉的，终于凶，（被逃跑了）。看到大人有利。渡过大河不利。",
	"exp1": "初六：不永所事，小有言，终吉。",
	"exp2": "倒数第一阴爻：不做完所做的事，受到小的谴责，但结果是吉的。",
	"exp3": "九二：不克讼，归而逋，其邑人三百户，无眚。",
	"exp4": "倒数第二阳爻：（贵族）没有胜讼，归来时，他的采邑内奴隶三百户逃跑了，无灾祸",
	"exp5": "六三：食旧德，贞厉，终吉，或从王事，无成。",
	"exp6": "倒数第三阴爻：靠祖业过活，占问危险，结果是吉的。有人从事战争，没有成功。",
	"exp7": "九四：不克讼，复自命，渝安贞，吉。",
	"exp8": "倒数第四阳爻：（贵族）没有胜诉，回来就命令改变（争讼）。安于占问，是吉。",
	"exp9": "九五：讼元吉。",
	"exp10": "倒数第五阳爻：争讼大吉。",
	"exp11": "上九：或锡之鞶带，终朝三褫之。",
	"exp12": "最上阳爻：有人赐给他大带，一天里赐予却又被三次夺回。",
	"exp13": "",
	"exp14": "",

	"base": "天与水违行，讼；君子以作事谋始。背道而驰之象　无端起讼之意 慎争戒讼 谋始",
	"general": "大象：乾天升于上，坎水降于下，相背而行而起讼。 ",
	"lucky": "运势：诸事不宜急进，以静制动为宜。 ",
	"emotion": "爱情：急进有失，缓进反成，欲速不达。 ",
	"health": "疾病：病情严重，为腹、肠胃、肌肉等慢性病。 ",
	"find": "失物：难以寻回，大部份均不知下落。 ",
	"sued": "诉讼：防房地产之争，宜和解，有始无终之兆。",
	"bussiness": "",
	"finance": "",
	"def":"需不进也，讼不亲也",
	"story":"饮食必有讼，故受之以讼",
	"poem":"二人争路",
	"kind": "火"
}
/*
---
---
---
---
- -
---
*/
six_random_NaJia["111101"] = {"icon":"䷌","key":"13",
	"name": "天火同人",
	"p": "离宫",
	"1": "子孙壬戌土 应",
	"2": "妻财壬申金",
	"3": "兄弟壬午火",
	"4": "官鬼己亥水 世",
	"5": "子孙己丑土",
	"6": "父母己卯木",
	"extname": "《易经》第十三卦 同人 天火同人 乾上离下 ",
	"extnameexp": "同人：同人于野，亨。 利涉大川，利君子贞。",
	"extexp": "彖曰：同人，柔得位得中，而应乎乾，曰同人。 同人曰，同人于野，亨。利涉大川，乾行也。 文明以健，中正而应，君子正也。 唯君子为能通天下之志。",
	"extexp1": "出门同人，又谁咎也。同人于宗，吝道也。伏戎于莽，敌刚也。三岁不兴，安行也。乘其墉，义弗克也。其吉，则困而反则也。同人之先，以中直也。大师相遇，言相克也。同人于郊，志未得也。",
	"ext": "《同人》卦：聚众在野外，通顺，利于渡大河，利于正直的人占问。",
	"exp1": "初九：同人于门，无咎。",
	"exp2": "倒数第一阴爻：聚众在王门，无害。",
	"exp3": "六二：同人于宗，吝。",
	"exp4": "倒数第二阴爻：在宗族聚众，有困难。",
	"exp5": "九三：伏戎于莽，升其高陵，三岁不兴。",
	"exp6": "倒数第三阳爻：埋伏军队在密林里，登上高地，三年不能取胜。",
	"exp7": "九四：乘其墉，弗克攻，吉。",
	"exp8": "倒数第四阳爻：登土城墙，不能攻进去，吉。",
	"exp9": "九五：同人，先号啕而后笑。 大师克相遇。",
	"exp10": "倒数第五阳爻：聚众先嚎哭而后笑，大军战胜，互相碰头。",
	"exp11": "上九：同人于郊，无悔。",
	"exp12": "最上阳爻：聚众在郊野，没有悔恨。",
	"exp13": "",
	"exp14": "",

	"base": "天与火，同人。君子以类族辨物。二人同心之象　合作共事之意 亲切求同 多助",
	"general": "大象：二人同心，其利断金，君子正心诚意，与人和同之象。 ",
	"lucky": "运势：如意吉祥，与人共事，上下皆和，又得长辈提拔。",
	"emotion": "爱情：如鱼得水，彼此互敬互谅，定成美眷。 ",
	"health": "疾病：病轻，不久可愈，注意心脏，头肺等疾。  ",
	"find": "失物：遗失似文件眼镜等物，可能被压在底层，尽快找寻，则可取回。 ",
	"sued": "诉讼：凡事以和为贵。",
	"bussiness": "",
	"finance": "",
	"def":"大有众也，同人亲也；革去故也，鼎取新也；小过过也，中孚信也；丰多故也，亲寡旅也",
	"story":"物不可以终否，故受之以同人",
	"poem":"仙人指路",
	"kind": "火"
}
/*
- -
- -
---
- -
- -
---
*/
six_random_NaJia["001001"] = {"icon":"䷲","key":"51",
	"name": "震为雷",
	"p": "震宫",
	"1": "妻财庚戌土 世",
	"2": "官鬼庚申金",
	"3": "子孙庚午火",
	"4": "妻财庚辰土 应",
	"5": "兄弟庚寅木",
	"6": "父母庚子水",
	"extname": "《易经》第五十一卦 震 震为雷 震上震下",
	"extnameexp": "震：亨。 震来虩虩，笑言哑哑。 震惊百里，不丧匕鬯。",
	"extexp": "彖曰：震亨。震来虩虩，恐致福也。笑言哑哑，后有则也。 震惊百里，惊远而惧迩也。 出可以守宗庙社稷，以为祭主也。",
	"extexp1": "象曰：震来虩虩，恐致福也。笑言哑哑，后有则也。震来厉，乘刚也。震苏苏，位不当也。震遂泥，未光也。震往来厉，危行也。其事在中，大无丧也。震索索，中未得也。虽凶无咎，畏邻戒也。",
	"ext": "《震》卦：通顺。霹雳使人恐惧，后来若无其事地谈笑。雷声使百里内的人都吓惊，这个人却镇定得连手持酒杯中的酒都没有一滴洒出来。",
	"exp1": "初九：震来虩虩，后笑言哑哑，吉。",
	"exp2": "倒数第一阳爻：霹雳初使人恐惧，后来变得若无其事地谈笑，吉。",
	"exp3": "六二：震来厉，亿丧贝，跻于九陵，勿逐，七日得。",
	"exp4": "倒数第二阴爻：霹雳打下来有危险，丢了钱币，正登上九重山。（占问说），不用追寻，到第七天可以得到。",
	"exp5": "六三：震苏苏，震行无眚。",
	"exp6": "倒数第三阴爻：霹雳打下来，吓得苏软，霹雳打下来没有害。",
	"exp7": "九四：震遂泥。",
	"exp8": "倒数第四阳爻：霹雳掉在泥里。",
	"exp9": "六五：震往来厉，亿无丧，有事。",
	"exp10": "倒数第五阴爻：霹雳一去一来，危险。只是对人事没有伤害。",
	"exp11": "上六：震索索，视矍矍，征凶。 震不于其躬，于其邻，无咎。 婚媾有言。",
	"exp12": "最上阴爻：霹雳下来脚发抖，目光不定。出外凶。霹雳不打在他的身上，打在邻家。无害。亲戚有谴责。",
	"exp13": "",
	"exp14": "",

	"base": "洊雷，震。君子以恐惧修省。雷惊百里之象 惊惧自持之意 临危不乱",
	"general": "大象：重雷发向，千里传声，有惊无险之象，亦有变动之意。 ",
	"lucky": "运势：表面昌盛风光，内里正处多事之秋，动荡不安之境。 ",
	"emotion": "爱情：是非，纷乱，虚而无实之象。 ",
	"health": "疾病：注意肝、神经系统、足疾，病情反覆。",
	"find": "失物：可能是受某些事惊吓而遣失，令你惊惶失措，尝试于会发声的东西或电器处寻找。",
	"sued": "诉讼：反覆难平，宜收敛脾气，心平气和。",
	"bussiness": "",
	"finance": "",
	"def":"震起也，艮止也；损益盛衰之始也",
	"story":"主器者莫若长子，故受之以震；震者动也",
	"poem":"金钟夜撞",
	"kind": "木"
}
/*
- -
- -
---
- -
- -
- -
*/
six_random_NaJia["001000"] = {"icon":"䷏","key":"16",
	"name": "雷地豫",
	"p": "震宫",
	"1": "妻财庚戌土",
	"2": "官鬼庚申金",
	"3": "子孙庚午火 应",
	"4": "兄弟乙卯木",
	"5": "子孙乙巳火",
	"6": "妻财乙未土 世",
	"f6": "父母子水",
	"extname": "《易经》第十六卦 豫 雷地豫 震上坤下 ",
	"extnameexp": "豫：利建侯行师。",
	"extexp": "彖曰：豫，刚应而志行，顺以动，豫。豫，顺以动，故天地如之，而况建侯行师乎？天地以顺动，故日月不过，而四时不忒；圣人以顺动，则刑罚清而民服。 豫之时义大矣哉！",
	"extexp1": "象曰：初六鸣豫，志穷凶也。不终日贞吉，以中正也。盱豫有悔，位不当也。由豫大有得，志大行也。六五贞疾，乘刚也。恒不死，中未亡也。冥豫在上，何可长也？",
	"ext": "《豫》卦：有利于分封诸侯和行军。",
	"exp1": "初六：鸣豫，凶。",
	"exp2": "倒数第一阴爻：有名于享乐，是凶。",
	"exp3": "六二：介于石，不终日，贞吉。",
	"exp4": "倒数第二阴爻：坚如石，不过一整天。占问吉。",
	"exp5": "六三：盱豫，悔。 迟有悔。",
	"exp6": "倒数第三阴爻：媚上享乐，有悔。迟疑不决又悔。",
	"exp7": "九四：由豫，大有得。勿疑。 朋盍簪。",
	"exp8": "倒数第四阳爻：由于豫悦，大有所得，勿疑。用朋贝组合成簪。",
	"exp9": "六五：贞疾，恒不死。",
	"exp10": "倒数第五阴爻：贞问疾病，虽久不死。",
	"exp11": "上六：冥豫，成有渝，无咎。",
	"exp12": "最上阴爻：在昏暗中还享乐，成事又变动，（变好），是无害。",
	"exp13": "",
	"exp14": "",

	"base": "雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。雷奋大地之象　事见生机之意 乐而奋发 戒佚",
	"general": "大象：雷出于地上，阳气奋发，万物欣欣向荣。",
	"lucky": "运势：如意安泰，可得长辈扶助，但须防色难，凡事应有备而战。",
	"emotion": "爱情：一帆风顺，天赐良缘，但女方年龄比男方大。",
	"health": "疾病：凶险之卦，注意腹腔、肝胆之疾。 ",
	"find": "失物：难以寻回。",
	"sued": "诉讼：有始而无终，易被多人连累，破财、受惊。",
	"bussiness": "",
	"finance": "",
	"def":"谦轻，而豫怠也",
	"story":"有大而能谦，必豫，故受之以豫",
	"poem":"青龙得位",
	"kind": "木"
}
/*
- -
- -
---
- -
---
- -
*/
six_random_NaJia["001010"] = {"icon":"䷧","key":"40",
	"name": "雷水解",
	"p": "震宫",
	"1": "妻财庚戌土",
	"2": "官鬼庚申金 应",
	"3": "子孙庚午火",
	"4": "子孙戊午火",
	"5": "妻财戊辰土 世",
	"6": "兄弟戊寅木",
	"f6": "父母子水",
	"extname": "《易经》第四十卦 解 雷水解 震上坎下",
	"extnameexp": "解：利西南，无所往，其来复吉。 有攸往，夙吉。",
	"extexp": "彖曰：解，险以动，动而免乎险，解。 解利西南，往得众也。其来复吉，乃得中也。有攸往夙吉，往有功也。 天地解，而雷雨作，雷雨作，而百果草木皆甲坼，解之时义大矣哉！",
	"extexp1": "象曰：刚柔之际，义无咎也。九二贞吉，得中道也。负且乘，亦可丑也。自我致戎，又谁咎也？解而拇，未当位也。君子有解，小人退也。公用射隼，以解悖也。",
	"ext": "《解》卦：去西南有利。无所为而去，(没好处)，他的回来，吉。有所为而去，早去吉。",
	"exp1": "初六：无咎。",
	"exp2": "倒数第一阴爻：（占问）无害。",
	"exp3": "九二：田获三狐，得黄矢，贞吉。",
	"exp4": "倒数第二阳爻：打猎得到三只狐，（从它们身上）得到铜箭头，占问吉。",
	"exp5": "六三：负且乘，致寇至，贞吝。",
	"exp6": "倒数第三阴爻：背著东西而乘车，招致寇盗来抢，占问有艰难。",
	"exp7": "九四：解而拇，朋至斯孚。",
	"exp8": "倒数第四阳爻：放开你的脚，（让它走去），钱来了就有收获。",
	"exp9": "六五：君子维有解，吉；有孚于小人。",
	"exp10": "倒数第五阴爻：贵族把他捆绑了又解开，吉。俘虏成为奴隶。",
	"exp11": "上六：公用射隼，于高墉之上，获之，无不利。",
	"exp12": "最上阴爻：公在成高的城墙上，把一只鹰射中了，抓到它，没有不利。",
	"exp13": "",
	"exp14": "",

	"base": "雷雨作，解。君子以赦过宥罪。雷雨大作之象 遇困可解之意 疏解条贯 排难",
	"general": "大象：春雷大作，大地解冻，喻冬去春来生机再现。",
	"lucky": "运势：宜把握良机，快速处理，身边困境，更宜出外求谋，因贵人在远方，以西南为吉方。 ",
	"emotion": "爱情：无须犹疑，把握良机，可成功。",
	"health": "疾病：久病可治愈，注意肝、肾、足疾。",
	"find": "失物：遗失之物似有被支解破坏的可能，故寻回的机会不大。",
	"sued": "诉讼：一般纠纷皆可解决，宜当机立断，不可拖延。",
	"bussiness": "",
	"finance": "",
	"def":"解缓也，蹇难也",
	"story":"物不可终难，故受之以解；解者缓也",
	"poem":"五关脱难",
	"kind": "木"
}
/*
- -
- -
---
---
---
- -
*/
six_random_NaJia["001110"] = {"icon":"䷟","key":"32",
	"name": "雷风恒",
	"p": "震宫",
	"1": "妻财庚戌土 应",
	"2": "官鬼庚申金",
	"3": "子孙庚午火",
	"4": "官鬼辛酉金 世",
	"5": "父母辛亥水",
	"6": "妻财辛丑土",
	"f5": "兄弟寅木",
	"extname": "《易经》第三十二卦 恒 雷风恒 震上巽下",
	"extnameexp": "恒：亨，无咎，利贞，利有攸往。",
	"extexp": "彖曰：恒，久也。 刚上而柔下，雷风相与，巽而动，刚柔皆应，恒。 恒，亨无咎，利贞； 久於其道也，天地之道，恒久而不已也。 利有攸往，终则有始也。日月得天，而能久照，四时变化，而能久成，圣人久於其道，而天下化成；观其所恒，而天地万物之情可见矣！！",
	"extexp1": "象曰：浚恒之凶，始求深也。九二悔亡，能久中也。不恒其德，无所容也。久非其位，安得禽也。妇人贞吉，从一而终也。夫子制义，从妇凶也。振恒在上，大无功也。",
	"ext": "《恒》卦：通顺，无害。占问有利。有所往有利。",
	"exp1": "初六：浚恒，贞凶，无攸利。",
	"exp2": "倒数第一阴爻：掘深掘得久，占问是凶，没有什么好处。",
	"exp3": "九二：悔亡。",
	"exp4": "倒数第二阳爻：悔恨消失。",
	"exp5": "九三：不恒其德，或承之羞，贞吝。",
	"exp6": "倒数第三阳爻：不是经久地（保持）他的德行，或者要受人耻辱，占问有困难。",
	"exp7": "九四：田无禽。",
	"exp8": "倒数第四阳爻：打猎没有得到鸟兽。",
	"exp9": "六五：恒其德，贞，妇人吉，夫子凶。",
	"exp10": "倒数第五阴爻：经久地保持德行，占问，妇人吉，男人凶。",
	"exp11": "上六：振恒，凶。",
	"exp12": "最上阴爻：经久地雷雨，凶。",
	"exp13": "",
	"exp14": "",

	"base": "雷风，恒。君子以立不易方。夫妇恒常之象 努力不懈之意 恒以而成 有常",
	"general": "大象：震者为动，宜向外发展，巽为入为内向，一内一外，各居本位，故能永恒不变，喻夫妇之道。",
	"lucky": "运势：万事亨通，能恒久努力，安守本份则吉，妄动则招灾。",
	"emotion": "爱情：万事亨通，恒久如意，终成美眷。",
	"health": "疾病：为慢性及须长期治疗之疾。注意肝之疾。",
	"find": "失物：不能寻回。 ",
	"sued": "诉讼：小人招祸，但宜速战速决，不利拖延，宜和解。",
	"bussiness": "",
	"finance": "",
	"def":"咸速也，恒久也",
	"story":"夫妇之道，不可以不久也，故受之以恒；恒者久也",
	"poem":"鱼来撞网",
	"kind": "木"
}
/*
- -
- -
- -
---
---
- -
*/
six_random_NaJia["000110"] = {"icon":"䷭","key":"46",
	"name": "地风升",
	"p": "震宫",
	"1": "官鬼癸酉金",
	"2": "父母癸亥水",
	"3": "妻财癸丑土 世",
	"4": "官鬼辛酉金",
	"5": "父母辛亥水",
	"6": "妻财辛丑土 应",
	"f3": "子孙午火",
	"f5": "兄弟寅木",
	"extname": "《易经》第四十六卦 升 地风升 坤上巽下",
	"extnameexp": "升：元亨，用见大人，勿恤，南征吉。",
	"extexp": "彖曰：柔以时升，巽而顺，刚中而应，是以大亨。用见大人，勿恤；有庆也。 南征吉，志行也。",
	"extexp1": "象曰：允升大吉，上合志也。九二之孚，有喜也。升虚邑，无所疑也。王用亨于岐山，顺事也。贞吉升阶，大得志也。冥升在上，消不富也。",
	"ext": "《升》卦：大通顺。见大人有利。不要犹疑。往南方会吉利。",
	"exp1": "初六：允升，大吉。",
	"exp2": "倒数第一阴爻：进升，大吉。",
	"exp3": "九二：孚乃利用禴，无咎。",
	"exp4": "倒数第二阳爻：诚信是利于作祭，无害。",
	"exp5": "九三：升虚邑。",
	"exp6": "倒数第三阳爻：登上在高丘上的城邑。",
	"exp7": "六四：王用亨于岐山，吉无咎。",
	"exp8": "倒数第四阴爻：王祭祀岐山，吉，无害。",
	"exp9": "六五：贞吉，升阶。",
	"exp10": "倒数第五阴爻：占问吉，升上台阶。",
	"exp11": "上六：冥升，利于不息之贞。",
	"exp12": "最上阴爻：夜里上升，占问不停地努力有利。",
	"exp13": "",
	"exp14": "",

	"base": "地中生木，升。君子以顺德，积小以高大。风从地起之象 力图升华之意 柔顺升进 拓疆",
	"general": "大象：树木从地上不断向上，有进升之势。",
	"lucky": "运势：名利双收，发展开运之象，宜向南方发展。 ",
	"emotion": "爱情：可望成功，但不宜急进。",
	"health": "疾病：病情重，注意腹部，胆管之疾。 ",
	"find": "失物：不易寻回，失物有被束之高阁的可能。 ",
	"sued": "诉讼：宜持平和态度处理，可争取主动，胜算在握。",
	"bussiness": "",
	"finance": "",
	"def":"萃聚，而升不来也",
	"story":"聚而上者，谓之升，故受之以升",
	"poem":"指日高升",
	"kind": "木"
}
/*
- -
---
- -
---
---
- -
*/
six_random_NaJia["010110"] = {"icon":"䷯","key":"48",
	"name": "水风井",
	"p": "震宫",
	"1": "父母戊子水",
	"2": "妻财戊戌土 世",
	"3": "官鬼戊申金",
	"4": "官鬼辛酉金",
	"5": "父母辛亥水 应",
	"6": "妻财辛丑土",
	"f3": "子孙午火",
	"f5": "兄弟寅木",
	"extname": "《易经》第四十八卦 井 水风井 坎上巽下",
	"extnameexp": "井：改邑不改井，无丧无得，往来井井。汔至，亦未繘井，羸其瓶，凶。",
	"extexp": "彖曰：巽乎水而上水，井；井养而不穷也。改邑不改井，乃以刚中也。汔至亦未繘井，未有功也。 羸其瓶，是以凶也。",
	"extexp1": "彖曰：井泥不食，下也。旧井无禽，时舍也。井谷射鲋，无与也。井渫不食，行恻也。求王明，受福也。井甃无咎，修井也。寒泉之食，中正也。元吉在上，大成也。",
	"ext": "《井》：住户可以搬迁，但泉井不能移动，纵使人来人往取水，井既无损失亦无得益。如果你有机会，却不用绳绑吊桶来取水，吊水桶就会腐坏，凶。",
	"exp1": "初六：井泥不食，旧井无禽。",
	"exp2": "倒数第一阴爻：水井有泥，水不能喝。旧的陷阱（坏了），没有兽(掉下去）。",
	"exp3": "九二：井谷射鲋，瓮敝漏。",
	"exp4": "倒数第二阳爻：在塌井的积水里射小鱼，（难射中）。水瓮漏了，（不能储水）。",
	"exp5": "九三：井渫不食，为我民恻，可用汲，王明，并受其福。",
	"exp6": "倒数第三阳爻：井水清了却不喝，为此我心悲痛。可以汲水，国王明察，臣民都得到他的福。",
	"exp7": "六四：井甃，无咎。",
	"exp8": "倒数第四阴爻：井壁砌好了，无害。",
	"exp9": "九五：井冽，寒泉食。",
	"exp10": "倒数第五阳爻：井水清泉水凉，可喝。",
	"exp11": "上六：井收勿幕，有孚无吉。",
	"exp12": "最上阴爻：阱口收小，不要盖上，有收获大吉。",
	"exp13": "",
	"exp14": "",

	"base": "木上有水，井。君子以劳民劝相。汲水育民之象 井井有条之意 济人利物 养性",
	"general": "大象：水被植物吸收，滋养树身又象徵汲器入井取水，有节约重覆之意。",
	"lucky": "运势：井为静物，不能移动，故凡事不能进取主动，又缺乏冲劲，不如处之泰然更有利。 ",
	"emotion": "爱情：形势不大理想，有分开再合之象，故往后可成。",
	"health": "疾病：病情较重且拖延，可能是发。",
	"find": "失物：不能寻回。",
	"sued": "诉讼：有刑罚之象，且受人牵连，及防房地产之诉讼。",
	"bussiness": "",
	"finance": "",
	"def":"井通，而困相遇也",
	"story":"困乎上者，必反下，故受之以井",
	"poem":"枯井生泉",
	"kind": "木"
}
/*
- -
---
---
---
---
- -
*/
six_random_NaJia["011110"] = {"icon":"䷛","key":"28",
	"name": "泽风大过",
	"p": "震宫",
	"1": "妻财丁未土",
	"2": "官鬼丁酉金",
	"3": "父母丁亥水 世",
	"4": "官鬼辛酉金",
	"5": "父母辛亥水",
	"6": "妻财辛丑土 应",
	"f3": "子孙午火",
	"f5": "兄弟寅木",
	"extname": "《易经》第二十八卦 大过 泽风大过 兑上巽下 ",
	"extnameexp": "大过：栋桡，利有攸往，亨。",
	"extexp": "彖曰：大过，大者过也。 栋桡，本末弱也。 刚过而中，巽而说行，利有攸往，乃亨。 大过之时义大矣哉！",
	"extexp1": "象曰：藉用白茅，柔在下也。老夫女妻，过以相与也。栋桡之凶，不可以有辅也。栋隆之吉，不桡乎下也。枯杨生华，何可久也。无妇士夫，亦可丑也。过涉之凶，不可咎也。",
	"ext": "《大过》卦：正梁弯曲，利于出外有所往，通顺。",
	"exp1": "初六：藉用白茅，无咎。",
	"exp2": "倒数第一阴爻：（祭祀时）用白茅衬垫（祭品），无害。",
	"exp3": "九二：枯杨生秭，老夫得其女妻，无不利。",
	"exp4": "倒数第二阳爻：枯杨树抽新茅，老男娶得年轻的妻子，没有不利。",
	"exp5": "九三：栋桡，凶。",
	"exp6": "倒数第三阳爻：正梁弯曲了，凶。",
	"exp7": "九四：栋隆，吉；有它吝。",
	"exp8": "倒数第四阳爻：正梁高起，吉。有别的变故，危险。",
	"exp9": "九五：枯杨生华，老妇得士夫，无咎无誉。",
	"exp10": "倒数第五阳爻：枯杨树开花，老妇人嫁给没有结过婚的男子，无害也无称誉。",
	"exp11": "上六：过涉灭顶，凶，无咎。",
	"exp12": "最上阴爻：错误地渡河没顶，凶。（有救应），无害。",
	"exp13": "",
	"exp14": "",

	"base": "泽灭木，大过。君子以独立不惧，遯世无闷。不胜负荷之象 发展失衡之意 反省过失 补偏",
	"general": "大象：中间四阳爻，为结实之梁，但初末为阴爻，力弱不支，则势将摧折。 ",
	"lucky": "运势：有力不从心，负担过重之象，多烦恼，防官非及水险。 ",
	"emotion": "爱情：双方之眼光均太高或各已有心上人，凶象。  ",
	"health": "疾病：严重，须耐心治疗，为肺、神经系统，女占得妇科经带之疾。 ",
	"find": "失物：无法发现，不能物归原主。 ",
	"sued": "诉讼：有文书之烦，即使求和也未能如愿。",
	"bussiness": "",
	"finance": "",
	"def":"大过颠也。姤遇也，柔遇刚也",
	"story":"不养则不可动，故受之以大过",
	"poem":"夜梦金银",
	"kind": "木"
}
/*
- -
---
---
- -
- -
---
*/
six_random_NaJia["011001"] = {"icon":"䷐","key":"17",
	"name": "泽雷随",
	"p": "震宫",
	"1": "妻财丁未土 应",
	"2": "官鬼丁酉金",
	"3": "父母丁亥水",
	"4": "妻财庚辰土 世",
	"5": "兄弟庚寅木",
	"6": "父母庚子水",
	"f3": "子孙午火",
	"extname": "《易经》第十七卦 随 泽雷随 兑上震下",
	"extnameexp": "随：元亨利贞，无咎。",
	"extexp": "彖曰：随，刚来而下柔，动而说，随。大亨贞，无咎，而天下随时，随之时义大矣哉！",
	"extexp1": "象曰：官有渝，从正吉也。出门交有功，不失也。系小子，弗兼与也。系丈夫，志舍下也。随有获，其义凶也。有孚在道，明功也。孚于嘉吉，位正中也。拘系之，上穷也。",
	"ext": "《随》卦：大通顺，占问有利，无害。",
	"exp1": "初九：官有渝，贞吉。 出门交有功。",
	"exp2": "倒数第一阳爻：旅馆里有事故，占问是吉，因出门人互相帮助有好处。",
	"exp3": "六二：系小子，失丈夫。",
	"exp4": "倒数第二阴爻：拴住小奴隶，跑掉大奴隶。",
	"exp5": "六三：系丈夫，失小子。 随有求得，利居贞。",
	"exp6": "倒数第三阴爻：拴住大奴隶，跑掉小奴隶，跟踪去找，得到。占问居处有利。",
	"exp7": "九四：随有获，贞凶。有孚在道，以明，何咎。 ",
	"exp8": "倒数第四阳爻：相随出外有收获，（但不免相争），占问是凶。在路上有了俘虏，用盟约定了，有什甚害处？",
	"exp9": "九五：孚于嘉，吉。",
	"exp10": "倒数第五阳爻：在美好处掠夺，吉。",
	"exp11": "上六：拘系之，乃从维之。 王用亨于西山。",
	"exp12": "最上阴爻：拘留拴住他，又从而说服他。周文王用他去祭岐山。",
	"exp13": "",
	"exp14": "",

	"base": "泽中有雷，随。君子以向晦入宴息。顺水行舟之象　随遇而安之意 择善而从 有守",
	"general": "大象：震木在兑泽之下，木必随水漂荡，随者，顺也。 ",
	"lucky": "运势：有去旧迎新之吉象，宜与人合作，可获厚利，忌三心两意，或独断独行。",
	"emotion": "爱情：防用情不专，沉迷情欲。  ",
	"health": "疾病：病重、须长期治疗，注意口腔、肝、足患等症。 ",
	"find": "失物：即将疏忽之时，会突然察觉。 ",
	"sued": "诉讼：宜决意和解，目前无忧，但不久须防有祸。",
	"bussiness": "",
	"finance": "",
	"def":"随无故也，蛊则饬也",
	"story":"豫必有随，故受之以随",
	"poem":"推车靠崖",
	"kind": "木"
}
/*
---
---
- -
---
---
- -
*/
six_random_NaJia["110110"] = {"icon":"䷸","key":"57",
	"name": "巽为风",
	"p": "巽宫",
	"1": "兄弟辛卯木 世",
	"2": "子孙辛巳火",
	"3": "妻财辛未土",
	"4": "官鬼辛酉金 应",
	"5": "父母辛亥水",
	"6": "妻财辛丑土",
	"extname": "《易经》第五十七卦 巽 巽为风 巽上巽下",
	"extnameexp": "巽：小亨，利攸往，利见大人。",
	"extexp": "彖曰：重巽以申命，刚巽乎中正而志行。柔皆顺乎刚，是以小亨，利有攸往，利见大人。",
	"extexp1": "象曰：进退，志疑也。利武人之贞，志治也。纷若之吉，得中也。频巽之吝，志穷也。田获三品，有功也。九五之吉，位正中也。巽在床下，上穷也。丧其资斧，正乎凶也。",
	"ext": "《巽》卦：小通顺，有利于前往，有利于谒见重要的人物。",
	"exp1": "初六：进退，利武人之贞。",
	"exp2": "倒数第一阴爻：占问武人指挥军队进退有利。",
	"exp3": "九二：巽在□下，用史巫纷若，吉无咎。",
	"exp4": "倒数第二阳爻：伏在床下，用史巫乱纷纷地祷告，吉，无害。",
	"exp5": "九三：频巽，吝。",
	"exp6": "倒数第三阳爻：皱眉头伏著，困难。",
	"exp7": "六四：悔亡，田获三品。 ",
	"exp8": "倒数第四阴爻：悔恨消失。打猎捉到三个品种的猎物。",
	"exp9": "九五：贞吉悔亡，无不利。 无初有终，先庚三日，后庚三日，吉。",
	"exp10": "倒数第五阳爻：占问吉，悔恨消失，没有不利，没有好开头，有效结果。在庚前三日到庚后三日，即从丁日到癸日，吉。",
	"exp11": "上九：巽在牀下，丧其资斧，贞凶。",
	"exp12": "最上阳爻：伏在床下，失掉钱币，占问凶。",
	"exp13": "",
	"exp14": "",

	"base": "随风，巽。君子以申命行事。随风漂荡之象 上行下效之意 谦柔顺应",
	"general": "大象：此卦为两重巽风重叠，巽为入，风之所到无孔不入，尤如政令颁布，深入民心。",
	"lucky": "运势：波折重重，运势起落浮沉不定，要随机应变，心平气和，择善固执。 ",
	"emotion": "爱情：有不稳定之象，宜作真诚沟通，不可一味奉承。 ",
	"health": "疾病：六冲卦者久病则凶，且病情变化多端。  ",
	"find": "失物：遣失在远处，不能寻回。",
	"sued": "诉讼：不易和解，但一方肯让步则易解决。",
	"bussiness": "",
	"finance": "",
	"def":"兑见，而巽伏也",
	"story":"旅而无所容，故受之以巽；巽者入也",
	"poem":"孤舟得水",
	"kind": "木"
}
/*
---
---
- -
---
---
---
*/
six_random_NaJia["110111"] = {"icon":"䷈","key":"9",
	"name": "风天小畜",
	"p": "巽宫",
	"1": "兄弟辛卯木",
	"2": "子孙辛巳火",
	"3": "妻财辛未土 应",
	"4": "妻财甲辰土",
	"5": "兄弟甲寅木",
	"6": "父母甲子水 世",
	"f4": "官鬼酉金",
	"extname": "《易经》第九卦 小畜 风天小畜 巽上乾下",
	"extnameexp": "小畜：亨。 密云不雨，自我西郊。",
	"extexp": "彖曰：小畜，柔得位而上下应之，曰小畜。 健而巽，刚中而志行，乃亨。 密云不雨，尚往也。自我西郊，施未行也。",
	"extexp1": "象曰：复自道，其义吉也。牵复在中，亦不自失也。夫妻反目，不能正室也。有孚惕出，上合志也。有孚挛如，不独富也。既雨既处，德积载也。君子征凶，有所疑也。",
	"ext": "《小畜》卦：通顺。云浓不下雨，从我的西郊来。",
	"exp1": "初九：复自道，何其咎，吉。",
	"exp2": "倒数第一阳爻：回到自己的道路，有什么害处？是吉的。",
	"exp3": "九二：牵复，吉。",
	"exp4": "倒数第二阳爻：与初九牵连回到自己的道路，是吉的。",
	"exp5": "九三：舆说辐，夫妻反目。",
	"exp6": "倒数第三阳爻：车轮中的直轴脱落了，（车子坏了）。夫妻失和。",
	"exp7": "六四：有孚，血去惕出，无咎。",
	"exp8": "倒数第四阴爻：得俘虏， 患消失，出以警惕，无害。",
	"exp9": "九五：有孚挛如，富以其邻。",
	"exp10": "倒数第五阳爻：得俘虏，捆绑，（出征有得），富连及到邻居。",
	"exp11": "上九：既雨既处，尚德载，妇贞厉。 月几望，君子征凶。",
	"exp12": "最上阳爻：既下雨既雨止，还得到车子来运载。妇人占问有危险。过了阴历月半，君子出外凶。",
	"exp13": "",
	"exp14": "",

	"base": " 风行天上，小畜。君子以懿文德。积小成多之象 蓄养实力之意 蓄养待进 积德",
	"general": "大象：蓄养之量有限，力不从心，故宜忍耐蓄养实力，静待时机。",
	"lucky": "运势：运势反覆，有口舌之争，但难于短期内解决，须忍耐，静待时机。 ",
	"emotion": "爱情：意见分歧，或遭受长辈反对。  ",
	"health": "疾病：危，重病，注意肝胆，头部病变。 ",
	"find": "失物：似乎遗失的是金器或现金支票等物，有被硬物夹住，或者第三格的地方。 ",
	"sued": "诉讼：会因证据不足而败诉。",
	"bussiness": "",
	"finance": "",
	"def":"小畜寡也，履不处也",
	"story":"比必有所畜也，故受之以小畜",
	"poem":"密云不雨",
	"kind": "木"
}
/*
---
---
- -
---
- -
---
*/
six_random_NaJia["110101"] = {"icon":"䷤","key":"37",
	"name": "风火家人",
	"p": "巽宫",
	"1": "兄弟辛卯木",
	"2": "子孙辛巳火 应",
	"3": "妻财辛未土",
	"4": "父母己亥水",
	"5": "妻财己丑土 世",
	"6": "兄弟己卯木",
	"f4": "官鬼酉金",
	"extname": "《易经》第三十七卦 家人 风火家人 巽上离下",
	"extnameexp": "家人：利女贞。",
	"extexp": "彖曰：家人，女正位乎内，男正位乎外，男女正，天地之大义也。家人有严君焉，父母之谓也。父父，子子，兄兄，弟弟，夫夫，妇妇，而家道正；正家而天下定矣。",
	"extexp1": "象曰：闲有家，志未变也。六二之吉，顺以巽也。家人嗃嗃，未失也。妇子嘻嘻，失家节也。富家大吉，顺在位也。王假有家，交相爱也。威如之吉，反身之谓也。",
	"ext": "《家人》卦，妇女占问有利",
	"exp1": "初九：闲有家，悔亡。",
	"exp2": "倒数第一阴爻：在家里注意防闲，悔恨没有。",
	"exp3": "六二：无攸遂，在中馈，贞吉。",
	"exp4": "倒数第二阴爻：没有什么错失，在家中主持家务，占问吉。",
	"exp5": "九三：家人嗃嗃，悔厉吉；妇子嘻嘻，终吝。",
	"exp6": "倒数第三阳爻：家人嗷嗷愁苦，悔恨，危险，转化为吉。家人戏突作乐，（趋向淫逸)，最终仍然艰难。",
	"exp7": "六四：富家，大吉。",
	"exp8": "倒数第四阳爻：幸福的家庭，大吉。",
	"exp9": "九五：王假有家，勿恤吉。",
	"exp10": "倒数第五阳爻：王扩大了有家（的意义），勿 ，吉。",
	"exp11": "上九：有孚威如，终吉。",
	"exp12": "最上的阴爻：有信用，有威严，终于吉。",
	"exp13": "",
	"exp14": "",

	"base": "风自火出，家人。君子以言有物，而行有恒。齐家治国之象 开花结果之意 诚威治家 安居",
	"general": "大象：风吹火之象，助火之威，喻家人同心协力，发展事业。",
	"lucky": "运势：平安大吉，与人合作则易成，更有喜庆之象，如添丁婚嫁等。 ",
	"emotion": "爱情：大吉之象，终成美眷。 ",
	"health": "疾病：注意心脏或胆病，必须小心调理。 ",
	"find": "失物：出现。隐藏在家中。可能是被家人收起来了。 ",
	"sued": "诉讼：虽产生大疑虑，若行事合理则无碍。",
	"bussiness": "",
	"finance": "",
	"def":"睽外也，家人内也",
	"story":"伤于外者，必反其家，故受之以家人",
	"poem":"镜里观花",
	"kind": "木"
}
/*
---
---
- -
- -
- -
---
*/
six_random_NaJia["110001"] = {"icon":"䷩","key":"42",
	"name": "风雷益",
	"p": "巽宫",
	"1": "兄弟辛卯木 应",
	"2": "子孙辛巳火",
	"3": "妻财辛未土",
	"4": "妻财庚辰土 世",
	"5": "兄弟庚寅木",
	"6": "父母庚子水",
	"f4": "官鬼酉金",
	"extname": "《易经》第四十二卦 益 风雷益 巽上震下",
	"extnameexp": "益：利有攸往，利涉大川。",
	"extexp": "彖曰：益，损上益下，民说无疆，自上下下，其道大光。利有攸往，中正有庆。 利涉大川，木道乃行。 益动而巽，日进无疆。 天施地生，其益无方。 凡益之道，与时偕行。",
	"extexp1": "象曰：元吉无咎，下不厚事也。或益之，自外来也。益用凶事，固有之也。告公从，以益志也。有孚惠心，勿问之矣。惠我德，大得志也。莫益之，偏辞也。或击之，自外来也。",
	"ext": "《益》卦：有所往有利。渡大河有利。",
	"exp1": "初九：利用为大作，元吉，无咎。",
	"exp2": "倒数第一阳爻：有利于兴建大建筑，大吉，无害。",
	"exp3": "六二：或益之，十朋之龟弗克违，永贞吉。 王用享于帝，吉。",
	"exp4": "倒数第二阴爻：有人赐给他价值一百贝的大宝龟，不能拒绝。占问长期的事吉。武王用祭祀来祭上帝，吉。",
	"exp5": "六三：益之用凶事，无咎。 有孚中行，告公用圭。",
	"exp6": "倒数第三阴爻：用在丧事上要增加礼数，无害。有俘虏。在半路报告周公用玉硅(音)来祭。",
	"exp7": "六四：中行，告公从。 利用为依迁国。",
	"exp8": "倒数第四阴爻：半路报告周公，公听从，有利用俘虏为殷民迁国。",
	"exp9": "九五：有孚惠心，勿问元吉。 有孚惠我德。",
	"exp10": "倒数第五阳爻：有俘虏顺从我的心，不用送东西，大吉。有俘俘，顺从我的恩德。",
	"exp11": "上九：莫益之，或击之，立心勿恒，凶。",
	"exp12": "最上阳爻：没人帮他，有人攻击他，用心不能持久不变，凶。",
	"exp13": "",
	"exp14": "",

	"base": "风雷，益。君子以见善则迁，有过则改。积德行善之象 固本培元之意 助人自助 生产",
	"general": "大象：强风配快雷，声威增长之象，长男配长女，夫妇合体，增益儿孙之象。",
	"lucky": "运势：现正当吉运，可得贵人之助而成功，宜施惠于人，施比受更有福。",
	"emotion": "爱情：相亲相爱，良缘天定。",
	"health": "疾病：可治愈，提防肝胆、肠胃之疾，或性病等。",
	"find": "失物：有望可寻回。",
	"sued": "诉讼：有牢狱之灾，或事因女人、房地产引起，宜和解。",
	"bussiness": "",
	"finance": "",
	"def":"震起也，艮止也；损益盛衰之始也",
	"story":"损而不已，必益，故受之以益",
	"poem":"枯木开花",
	"kind": "木"
}
/*
---
---
---
- -
- -
---
*/
six_random_NaJia["111001"] = {"icon":"䷘","key":"25",
	"name": "天雷无妄",
	"p": "巽宫",
	"1": "妻财壬戌土",
	"2": "官鬼壬申金",
	"3": "子孙壬午火 世",
	"4": "妻财庚辰土",
	"5": "兄弟庚寅木",
	"6": "父母庚子水 应",
	"extname": "《易经》第二十五卦 无妄 天雷无妄 乾上震下",
	"extnameexp": "无妄：元，亨，利，贞。 其匪正有眚，不利有攸往。",
	"extexp": "彖曰：无妄，刚自外来，而为主於内。动而健，刚中而应，大亨以正，天之命也。 其匪正有眚，不利有攸往。无妄之往，何之矣？ 天命不佑，行矣哉？ ",
	"extexp1": "象曰：无妄之往，得志也。不耕获，未富也。行人得牛，邑人灾也。可贞无咎，固有之也。无妄之药，不可试也。无妄之行，穷之灾也。",
	"ext": "《无妄》：大通顺，占问有利。倘他的行动不正确，有灾祸，有所往不利。",
	"exp1": "初九：无妄，往吉。",
	"exp2": "倒数第一阳爻：不妄行，吉。",
	"exp3": "六二：不耕获，不菑畲，则利有攸往。",
	"exp4": "倒数第二阴爻：不耕种而想得收获，不垦荒地，想种熟地，(是妄想)；那出外去(经商)有利。",
	"exp5": "六三：无妄之灾，或系之牛，行人之得，邑人之灾。",
	"exp6": "倒数第三阴爻：意外的灾难，有人(邑主)把牛拴在外面，过路人把牛牵走了，邑人却遭了灾，(邑主问他要牛)。",
	"exp7": "九四：可贞，无咎。",
	"exp8": "倒数第四阳爻：占问可行，无害",
	"exp9": "九五：无妄之疾，勿药有喜。",
	"exp10": "倒数第五阳爻：无原无故所得的病，不吃药也会好的。",
	"exp11": "上九：无妄，行有眚，无攸利。",
	"exp12": "最上阳爻：不要乱来，乱来有灾害，没有好处。",
	"exp13": "",
	"exp14": "",

	"base": "天下雷行，物与无妄。先王以茂对时，育万物。飞来橫祸之象 守正安常之意 自然而得 厚生",
	"general": "大象：雷动于天，阳气舒发，为真实无虚妄之意。",
	"lucky": "运势：凡事宜守正，若行为不检者，必招灾祸。 ",
	"emotion": "爱情：有不和，不顺遂或被伤害之凶象。 ",
	"health": "疾病：不宜意气用事，应尽力疗养为宜，属呼吸系统，头、足之疾病。",
	"find": "失物：找不到，似已遗失。 ",
	"sued": "诉讼：因女人或死亡之事起纷争，宜和解，否则招凶。",
	"bussiness": "",
	"finance": "",
	"def":"大畜时也。无妄灾也",
	"story":"复则不妄矣，故受之以无妄",
	"poem":"鸟被笼牢",
	"kind": "木"
}
/*
---
- -
---
- -
- -
---
*/
six_random_NaJia["101001"] = {"icon":"䷔","key":"21",
	"name": "火雷噬嗑",
	"p": "巽宫",
	"1": "子孙己巳火",
	"2": "妻财己未土 世",
	"3": "官鬼己酉金",
	"4": "妻财庚辰土",
	"5": "兄弟庚寅木 应",
	"6": "父母庚子水",
	"extname": "《易经》第二十一卦 噬嗑 火雷噬嗑 离上震下",
	"extnameexp": "噬嗑：亨。 利用狱。",
	"extexp": "彖曰：颐中有物，曰噬嗑，噬嗑而亨。刚柔分，动而明，雷电合而章。柔得中而上行，虽不当位，利用狱也。",
	"extexp1": "象曰：屦校灭趾，不行也。噬肤灭鼻，乘刚也。遇毒，位不当也。利艰贞吉，未光也。贞厉无咎，得当也。何校灭耳，聪不明也。",
	"ext": "《噬嗑》卦：通顺。有利于诉讼。",
	"exp1": "初九：履校灭趾，无咎。",
	"exp2": "倒数第一阳爻：拖著脚枷，遮住脚趾。无害。",
	"exp3": "六二：噬肤灭鼻，无咎。",
	"exp4": "倒数第二阴爻：咬肥肉连鼻子也遮住，无害。",
	"exp5": "六三：噬腊肉，遇毒；小吝，无咎。",
	"exp6": "倒数第三阴爻：咬腊肉，碰到毒，小的困难，无害。",
	"exp7": "九四：噬乾胏，得金矢，利艰贞，吉。",
	"exp8": "倒数第四阳爻：啃带骨的乾肉，得到铜箭头。占问艰难事有利，吉。",
	"exp9": "六五：噬乾肉，得黄金，贞厉，无咎。",
	"exp10": "倒数第五阴爻：咬乾肉，得到铜（箭头）。占问危险事，无害。",
	"exp11": "上九：何校灭耳，凶。",
	"exp12": "最上阳爻：担枷遮住耳朵，凶。",
	"exp13": "",
	"exp14": "",

	"base": "雷电噬嗑。先王以明罚勑法。化除梗阻之象 防患未然之意 济之以刑 除恶",
	"general": "大象：上唇与下唇间有物，必须咬断，方能合拢，乃诸事被阻，务必去除，方可成功。",
	"lucky": "运势：诸事阻隔，纷争难免，宜守常规，不为利诱，问题可解决。",
	"emotion": "爱情：有被人阻隔或横刀夺爱之象，宜勇往直前。",
	"health": "疾病：病情严重，为腹、肠胃、肌肉等慢性病。 ",
	"find": "失物：有被人捷足捡走的可能，寻回的机会不大。",
	"sued": "诉讼：宜采取主动，据理力争。",
	"bussiness": "",
	"finance": "",
	"def":"噬嗑食也，贲无色也",
	"story":"可观而后有所合，故受之以噬嗑",
	"poem":"饥人遇食",
	"kind": "木"
}
/*
---
- -
- -
- -
- -
---
*/
six_random_NaJia["100001"] = {"icon":"䷚","key":"27",
	"name": "山雷颐",
	"p": "巽宫",
	"1": "兄弟丙寅木",
	"2": "父母丙子水",
	"3": "妻财丙戌土 世",
	"4": "妻财庚辰土",
	"5": "兄弟庚寅木",
	"6": "父母庚子水 应",
	"f2": "子孙巳火",
	"f4": "官鬼酉金",
	"extname": "《易经》第二十七卦 颐 山雷颐 艮上震下",
	"extnameexp": "颐：贞吉。 观颐，自求口实。",
	"extexp": "彖曰：颐贞吉，养正则吉也。 观颐，观其所养也;自求口实，观其自养也。 天地养万物，圣人养贤，以及万民；颐之时义大矣哉！",
	"extexp1": "象曰：观我朵颐，亦不足贵也。六二征凶，行失类也。十年勿用，道大悖也。颠颐之吉，上施光也。居贞之吉，顺以从上也。由颐厉吉，大有庆也。",
	"ext": "《颐》卦：占问吉。观察面颊，(看人是否吃饱)，自己要求得口粮(来吃饱)",
	"exp1": "初九：舍尔灵龟，观我朵颐，凶。",
	"exp2": "倒数第一阳爻：放弃你灵验的龟，窥伺我鼓起面颊里的食物，凶。",
	"exp3": "六二：颠颐，拂经，于丘颐，征凶。",
	"exp4": "倒数第二阴爻：（六二求养于初九），是养生的颠倒，违反常理。（上九最高，有丘象）。六二求养于上，（非正应），往必凶。",
	"exp5": "六三：拂颐，贞凶，十年勿用，无攸利。",
	"exp6": "倒数第三阴爻：违反养生，占问凶。所以十年不用，用了无所利。",
	"exp7": "六四：颠颐吉，虎视眈眈，其欲逐逐，无咎。",
	"exp8": "倒数第四阴爻：（六四养初九，以阴养阳），是养生的颠倒。（但六四在初九之上，以上养下），是吉。（初九之刚），如虎视盯紧，它的欲望急迫，（六四不失以上养下之正），无害。",
	"exp9": "六五：拂经，居贞吉，不可涉大川。",
	"exp10": "倒数第五阴爻：（六五居尊位，赖上九以为养），是违反常理。（六五安静居于尊位），故占问居处吉。（既安静），故不可渡大河。",
	"exp11": "上九：由颐，厉吉，利涉大川。",
	"exp12": "最上的阳爻：（从上九来养人），是从养。（但上九位高），故心危才吉。（上九阳刚），故利于渡大河。",
	"exp13": "",
	"exp14": "",

	"base": "山下有雷，颐。君子以慎言语，节饮食。饮食养体之象 休养生息之意 颐养蓄力 止贪",
	"general": "大象：形如口腔之象，取其饮食之道，须慎言，注重日常生活。",
	"lucky": "运势：处事欠缺周详考虑，不宜心怀阴谋，要守正道而善方吉。 ",
	"emotion": "爱情：忌傲气凌人，宜重新估计对方之价值，切勿因情误了青春。",
	"health": "疾病：占病为凶，久病者险，为肠胃、咽喉、手足之疾。",
	"find": "失物：尽快去找，似被物件上下夹著。",
	"sued": "诉讼：我告他人终不能成，宜速和解。",
	"bussiness": "",
	"finance": "",
	"def":"渐女归，待男行也。颐养正也，既济定也",
	"story":"物畜然后可养，故受之以颐",
	"poem":"渭水访贤",
	"kind": "木"
}
/*
---
- -
- -
---
---
- -
*/
six_random_NaJia["100110"] = {"icon":"䷑","key":"18",
	"name": "山风蛊",
	"p": "巽宫",
	"1": "兄弟丙寅木 应",
	"2": "父母丙子水",
	"3": "妻财丙戌土",
	"4": "官鬼辛酉金 世",
	"5": "父母辛亥水",
	"6": "妻财辛丑土",
	"f2": "子孙巳火",
	"extname": "《易经》第十八卦 蛊 山风蛊 艮上巽下",
	"extnameexp": "蛊：元亨，利涉大川。 先甲三日，后甲三日。",
	"extexp": "彖曰：蛊，刚上而柔下，巽而止，蛊。 蛊，元亨，而天下治也。 利涉大川，往有事也。 先甲三日，后甲三日，终则有始，天行也。",
	"extexp1": "象曰：干父之蛊，意承考也。干母之蛊，得中道也。干父之蛊，终无咎也。裕父之蛊，往未得也。干父用誉，承以德也。不事王侯，志可则也。",
	"ext": "《蛊》卦：大通顺。渡大河有利，在辛日，在丁日。",
	"exp1": "初六：干父之蛊，有子，考无咎，厉终吉。",
	"exp2": "倒数第一阴爻：继承父亲的事业，有子孝，无害。即使有危险，终于是吉的。",
	"exp3": "九二：干母之蛊，不可贞。",
	"exp4": "倒数第二阳爻：继承母亲的事业，占问认为不行。（九二是阳刚，母是阴柔，以刚承柔，故不可）。",
	"exp5": "九三：干父小有晦，无大咎。",
	"exp6": "倒数第三阳爻：继承父亲的事业，虽有小的毛病，没有大害。",
	"exp7": "六四：裕父之蛊，往见吝。",
	"exp8": "倒数第四阴爻：扩大父亲的事业，前进将遇到困难。",
	"exp9": "六五：干父之蛊，用誉。",
	"exp10": "倒数第五阴爻：继承父亲的事业，因此有名誉。",
	"exp11": "上九：不事王侯，高尚其事。 ",
	"exp12": "最上的阳爻：不去事奉王侯，保持高尚的志向。",
	"exp13": "",
	"exp14": "",

	"base": "山下有风，蛊。君子以振民育德。郁结内腐之象 不进则退之意 振疲起衰 有为",
	"general": "大象：风入山下，闭而不出，即物腐生虫，意气不通，因循败事。",
	"lucky": "运势：诸事不如意，艰难迷惑，宜大胆革新，否则引来内忧外患。",
	"emotion": "爱情：苦恼多，受人诱惑，关系复杂，切忌到处留情，徒增烦恼。",
	"health": "疾病：宜把握治疗时机，冬季占得险象，为内脏恶性疾病。",
	"find": "失物：找不回来，遗失似是木制工艺品，在门口或旅馆遗失，或者是寄失了。",
	"sued": "诉讼：慎防桃色纠纷，会拖一段时间，不易解决。",
	"bussiness": "",
	"finance": "",
	"def":"随无故也，蛊则饬也",
	"story":"以喜随人者，必有事，故受之以蛊；蛊者事也",
	"poem":"推磨岔道",
	"kind": "木"
}
/*
- -
---
- -
- -
---
- -
*/
six_random_NaJia["010010"] = {"icon":"䷜","key":"29",
	"name": "坎为水",
	"p": "坎宫",
	"1": "兄弟戊子水 世",
	"2": "官鬼戊戌土",
	"3": "父母戊申金",
	"4": "妻财戊午火 应",
	"5": "官鬼戊辰土",
	"6": "子孙戊寅木",
	"extname": "《易经》第二十九卦 坎 坎为水 坎上坎下",
	"extnameexp": "坎：习坎，有孚，维心亨，行有尚。",
	"extexp": "彖曰：习坎，重险也。 水流而不盈，行险而不失其信。 维心亨，乃以刚中也。 行有尚，往有功也。 天险不可升也，地险山川丘陵也，王公设险以守其国，坎之时用大矣哉！",
	"extexp1": "象曰：习坎入坎，失道凶也。求小得，未出中也。来之坎坎，终无功也。樽酒簋贰，刚柔际也。坎不盈，中未大也。上六失道，凶三岁也。",
	"ext": "《坎》卦：重坑（坑中有坑），有俘虏，要维系他的心，通顺。出行有赏赐。",
	"exp1": "初六：习坎，入于坎窞，凶。",
	"exp2": "倒数第一阴爻：重坑，进到坑里，下面还有坑，凶。",
	"exp3": "九二：坎有险，求小得。",
	"exp4": "倒数第二阴爻：坑里有危险，（人进入坑内，为了）求小的好处。",
	"exp5": "六三：来之坎坎，险且枕，入于坎窞，勿用。",
	"exp6": "倒数第三阴爻：来到坑里，坑险又深。进入坑里，下面又有坑，不用（再进去）。",
	"exp7": "六四：樽酒簋贰，用缶，纳约自牖，终无咎。",
	"exp8": "倒数第四阴爻：一杯酒，两碗饭，用瓦器盛，从窗里送进取出，终于无害。",
	"exp9": "九五：坎不盈，只既平，无咎。",
	"exp10": "倒数第五阴爻：坑没有填满，小丘的土已经铲平，无害。",
	"exp11": "上六：用徽纆，置于丛棘，三岁不得，凶。",
	"exp12": "最上阴爻：用绳索捆绑俘虏，放在围¨成丛棘木的牢狱内，过了三年还不能使他服从当奴隶，凶。",
	"exp13": "",
	"exp14": "",

	"base": "水洊至，习坎。君子以常德行，习教事。重重险陷之象 向下内敛之意 突破艰难 行险",
	"general": "大象：两水重叠，坎水为险，进固险，退亦险，进退两难。 ",
	"lucky": "运势：危机重重，宜沉著应付，保持心境开朗，凡事莫与人争。 ",
	"emotion": "爱情：易沉溺于爱情中，但有险阻重重之象。 ",
	"health": "疾病：病重宜速治，否则难救，注意肾脏，膀胱生殖器病。 ",
	"find": "失物：找不回来。有失窃可能。或沉在水底。因坎水有困难之意。",
	"sued": "诉讼：有盗贼之讼，或田土之争，有理说不清，凶象。",
	"bussiness": "",
	"finance": "",
	"def":"离上，而坎下也",
	"story":"物不可以终过，故受之以坎；坎者陷也",
	"poem":"水底捞月",
	"kind": "水"
}
/*
- -
---
- -
- -
---
---
*/
six_random_NaJia["010011"] = {"icon":"䷻","key":"60",
	"name": "水泽节",
	"p": "坎宫",
	"1": "兄弟戊子水",
	"2": "官鬼戊戌土",
	"3": "父母戊申金 应",
	"4": "官鬼丁丑土",
	"5": "子孙丁卯木",
	"6": "妻财丁巳火 世",
	"extname": "《易经》第六十卦 节 水泽节 坎上兑下",
	"extnameexp": "节：亨。 苦节不可贞。",
	"extexp": "彖曰：节亨，刚柔分，而刚得中。苦节不可贞，其道穷也。说以行险，当位以节，中正以通。 天地节而四时成，节以制度，不伤财，不害民。",
	"extexp1": "象曰：不出户庭，知通塞也。不出门庭凶，失时极也。不节之嗟，又谁咎也？安节之亨，承上道也。甘节之吉，居位中也。苦节贞凶，其道穷也。",
	"ext": "《节》卦：通顺，将节检视为苦事是不可去占问的。",
	"exp1": "初九：不出户庭，无咎。",
	"exp2": "倒数第一阳爻：（以有节度为苦），不出家门，无害。",
	"exp3": "九二：不出门庭，凶。",
	"exp4": "倒数第二阳爻：不出 门，（会得罪 内邻居），凶。",
	"exp5": "六三：不节若，则嗟若，无咎。",
	"exp6": "倒数第三阴爻：不守节度，就嗟叹；守节度，无过错。",
	"exp7": "六四：安节，亨。",
	"exp8": "倒数第四阴爻：安心守节度，通顺。",
	"exp9": "九五：甘节，吉；往有尚。",
	"exp10": "倒数第五阳爻：甘心守节度，吉，做下去有赏。",
	"exp11": "上六：苦节，贞凶，悔亡。",
	"exp12": "最上阴爻：以守参度为芳，占问是凶，守节度，悔恨没有了。",
	"exp13": "",
	"exp14": "",

	"base": "泽上有水，节。君子以制数度、议德行。蓄水成塘之象 勤俭克已之意 控制严谨 禁非",
	"general": "大象：泽为池沼，坎水在上，喻蓄积及约束水份不使流失，但水位过高，则成泛滥。",
	"lucky": "运势：有志不能伸，诸事必须节制，不宜过份，更要戒酒色。 ",
	"emotion": "爱情：男女正常交往则吉利，相反则凶。 ",
	"health": "疾病：注意泌尿及消化系病变，宜速就医。 ",
	"find": "失物：不能寻回。 诉讼：局势僵持不下，宜让则讼可解。 ",
	"sued": "",
	"bussiness": "",
	"finance": "",
	"def":"涣离也，节止也",
	"story":"物不可以终离，故受之以节",
	"poem":"斩将封神",
	"kind": "水"
}
/*
- -
---
- -
- -
- -
---
*/
six_random_NaJia["010001"] = {"icon":"䷂","key":"3",
	"name": "水雷屯",
	"p": "坎宫",
	"1": "兄弟戊子水",
	"2": "官鬼戊戌土 应",
	"3": "父母戊申金",
	"4": "官鬼丁丑土",
	"5": "子孙庚寅木 世",
	"6": "兄弟庚子水",
	"f4": "妻财午火",
	"extname": "《易经》第三卦 屯 水雷屯 坎上震下",
	"extnameexp": "屯：元，亨，利，贞，勿用，有攸往，利建侯。",
	"extexp": "彖曰：屯，刚柔始交而难生，动乎险中，大亨贞。雷雨之动满盈，天造草昧，宜建侯而不宁。",
	"extexp1": "象曰：虽磐桓，志行正也。以贵下贱，大得民也。六二之难，乘刚也。十年乃字，反常也。即鹿无虞，以从禽也。君子舍之，往吝穷也。求而往，明也。屯其膏，施未光也。泣血涟如，何可长也。",
	"ext": "《屯》卦：一开始就顺利，利于占问，不要出外办事，但有利分封诸侯。",
	"exp1": "初九：磐桓；利居贞，利建侯。",
	"exp2": "倒数第一阳爻：徘徊（难进）。占问安居有利，建国封侯有利。",
	"exp3": "六二：屯如邅如，乘马班如。 匪寇婚媾，女子贞不字，十年乃字。",
	"exp4": "倒数第二阴爻：迟回地（难进），骑著马回旋。不是来抢劫，是来就婚，占问女子不孕，十年才孕。",
	"exp5": "六三：即鹿无虞，惟入于林中；君子几不如舍。往吝。",
	"exp6": "倒数第三阴爻：逐鹿没有虞人（帮著驱逐)，（鹿)只跑入林中，君子见机，不如放弃，去追捕不利。",
	"exp7": "六四：乘马班如，求婚媾，无不利。",
	"exp8": "倒数第四阴爻：乘马徘徊，求婚配；往前吉利，没有不利。",
	"exp9": "九五：屯其膏，小贞吉，大贞凶。",
	"exp10": "倒数第五阳爻：储存肥肉。向小事吉，问大事凶。",
	"exp11": "上六：乘马班如，泣血涟如。",
	"exp12": "最上阴爻：骑马回旋，(去抢亲。被抢的女子)哭得血泪交流。",
	"exp13": "",
	"exp14": "",

	"base": "云雷，屯。君子以经纶。春木更新之象　艰难险阻之意 起始艰难 创始",
	"general": "大象：屯者难也，万事欲进而不得进。",
	"lucky": "运势：身处困境，步步为营，有初难后解之意。",
	"emotion": "爱情：感情发展受阻，宜坚守信念，排除困难。 ",
	"health": "疾病：病在肠胃，足部或泌尿系统，不宜掉以轻心。",
	"find": "失物：难以寻回。",
	"sued": "诉讼：小事粘滞纠缠，大事反无大害，宜和解。",
	"bussiness": "",
	"finance": "",
	"def":"屯见而不失其居。蒙杂而著",
	"story":"盈天地之间者，唯万物，故受之以屯；屯者盈也",
	"poem":"乱丝无头",
	"kind": "水"
}
/*
- -
---
- -
---
- -
---
*/
six_random_NaJia["010101"] = {"icon":"䷾","key":"63",
	"name": "水火既济",
	"p": "坎宫",
	"1": "兄弟戊子水 应",
	"2": "官鬼戊戌土",
	"3": "父母戊申金",
	"4": "兄弟己亥水 世",
	"5": "官鬼己丑土",
	"6": "子孙己卯木",
	"f4": "妻财午火",
	"extname": "《易经》第六十三卦 既济 水火既济 坎上离下",
	"extnameexp": "既济：亨，小利贞，初吉终乱。",
	"extexp": "彖曰：既济，亨，小者亨也。利贞，刚柔正而位当也。 初吉，柔得中也。终止则乱，其道穷也。",
	"extexp1": "象曰：曳其轮，义无咎也。七日得，以中道也。三年克之，惫也。终日戒，有所疑也。东邻杀牛，不如西邻之时也。实受其福，吉大来也。濡其首厉，何可久也？",
	"ext": "《既济》卦：通顺，占问会有点吉利，开始时吉利，最后动荡不安。",
	"exp1": "初九：曳其轮，濡其尾，无咎。",
	"exp2": "倒数第一阳爻：（过河时），拉动车子的轮子，打湿了车子的后部，无害。",
	"exp3": "六二：妇丧其髴，勿逐，七日得。",
	"exp4": "倒数第二阴爻：妇人丢失她的头巾，不必找，七天就能得到。",
	"exp5": "九三：高宗伐鬼方，三年克之，小人勿用。",
	"exp6": "倒数第三阴爻：殷高宗讨伐鬼方，经过三年打败它。小民不利。",
	"exp7": "六四：繻有衣如，终日戒。",
	"exp8": "倒数第四阴爻：寒衣有败絮，（怕受寒），整天戒惕。",
	"exp9": "九五：东邻杀牛，不如西邻之禴祭，实受其福。",
	"exp10": "倒数第五阳爻：东方邻国殷商杀牛来祭神，不如西方邻国周王用旧饭菜的薄礼来祭神，实在得到神的赐福。",
	"exp11": "上六：濡其首，厉。",
	"exp12": "倒数最上阴爻：弄湿了他的头，有危险。",
	"exp13": "",
	"exp14": "",

	"base": " 水在火上，既济。君子以思患而豫防之。阴阳和谐之象 上下相通之意 功行圆满 虑终",
	"general": "大象：坎水在离火之上，水性下注，火势上炎，水火相济。完成之意。",
	"lucky": "运势：名利双收，成功之象，防物极必反，初吉后凶。 ",
	"emotion": "爱情：初则出双入对，形影不离，但日久反目离异。 ",
	"health": "疾病：短期虽有好转，但好景不常。 ",
	"find": "失物：应可寻回。",
	"sued": "诉讼：有理说不清，仍须把握最有利时机争取主动，迟则反见凶。",
	"bussiness": "",
	"finance": "",
	"def":"渐女归，待男行也。颐养正也，既济定也",
	"story":"有过物者，必济，故受之既济",
	"poem":"金榜题名",
	"kind": "水"
}
/*
- -
---
---
---
- -
---
*/
six_random_NaJia["011101"] = {"icon":"䷰","key":"49",
	"name": "泽火革",
	"p": "坎宫",
	"1": "官鬼丁未土",
	"2": "父母丁酉金",
	"3": "兄弟丁亥水 世",
	"4": "兄弟己亥水",
	"5": "官鬼己丑土",
	"6": "子孙己卯木 应",
	"f4": "妻财午火",
	"extname": "《易经》第四十九卦 革 泽火革 兑上离下",
	"extnameexp": "革：己日乃孚，元亨利贞，悔亡。",
	"extexp": "彖曰：革，水火相息，二女同居，其志不相得，曰革。己日乃孚；革而信也。 文明以说，大亨以正，革而当，其悔乃亡。天地革而四时成，汤武革命，顺乎天而应乎人，革之时义大矣哉！",
	"extexp1": "象曰：巩用黄牛，不可以有为也。巳日革之，行有嘉也。革言三就，又何之矣。改命之吉，信志也。大人虎变，其文炳也。君子豹变，其文蔚也。小人革面，顺以从君也。",
	"ext": "《革》：祭祀之日怀著诚信的态度，一开始就顺利，利于占问，悔恨消失。",
	"exp1": "初九：巩用黄牛之革。",
	"exp2": "倒数第一阳爻：用黄牛的皮革包裹它。",
	"exp3": "六二：己日乃革之，征吉，无咎。",
	"exp4": "倒数第二阴爻：祭祀之日用皮革包裹它，到出外作战时就会吉利，无过失。",
	"exp5": "九三：征凶，贞厉，革言三就，有孚。",
	"exp6": "倒数第三阳爻：征战结果不利，占问结果是危险，用皮革包裹来祭祀，这样说三次，要虔诚。",
	"exp7": "九四：悔亡，有孚改命，吉。",
	"exp8": "倒数第四阳爻：灾祸消失，也具有了诚信，改变一下命令，结果是吉利的。",
	"exp9": "九五：大人虎变，未占有孚。",
	"exp10": "倒数第五阴爻：重要的人物发怒就像一只老虎，不用占问，因你已有了诚信。",
	"exp11": "上六：君子豹变，小人革面，征凶，居贞吉。",
	"exp12": "最上的阴爻：正直的人改变心意如豹子的快，小人则用皮革掩饰过失，这时若自动出击是不吉利的，但占问居住的事是吉利的。",
	"exp13": "",
	"exp14": "",

	"base": "泽中有火，革。君子以治历明时。炼金成器之象 破旧立新之意 顺天而变 更新",
	"general": "大象：兑为金，被离火所烧，变革之象。",
	"lucky": "运势：凡事均在变动之中，宜去旧立新，以应革新之象。",
	"emotion": "爱情：代表往事如烟，重新再开始，或应改旧有态度。 ",
	"health": "疾病：病情多变，宜改换求医方法，注意心脏，眼目和咽喉之疾。  ",
	"find": "失物：因有弃旧迎新之意，故相信不能寻回。",
	"sued": "诉讼：要改变旧有对策，才可圆满解决。",
	"bussiness": "",
	"finance": "",
	"def":"大有众也，同人亲也；革去故也，鼎取新也；小过过也，中孚信也；丰多故也，亲寡旅也",
	"story":"井道不可不革，故受之以革",
	"poem":"旱苗得雨",
	"kind": "水"
}
/*
- -
- -
---
---
- -
---
*/
six_random_NaJia["001101"] = {"icon":"䷶","key":"55",
	"name": "雷火丰",
	"p": "坎宫",
	"1": "官鬼庚戌土",
	"2": "父母庚申金 世",
	"3": "妻财庚午火",
	"4": "兄弟己亥水",
	"5": "官鬼己丑土 应",
	"6": "子孙己卯木",
	"extname": "《易经》第五十五卦 丰 雷火丰 震上离下",
	"extnameexp": "丰：亨，王假之，勿忧，宜日中。",
	"extexp": "彖曰：丰，大也。 明以动，故丰。王假之，尚大也。 勿忧宜日中，宜照天下也。日中则昃，月盈则食，天地盈虚，与时消息，而况人於人乎？况於鬼神乎？",
	"extexp1": "象曰：虽旬无咎，过旬灾也。有孚发若，信以发志也。丰其沛，不可大事也。折其右肱，终不可用也。丰其蔀，位不当也。日中见斗，幽不明也。遇其夷主，吉行也。六五之吉，有庆也。丰其屋，天际翔也。窥其户阒其无人，自藏也。",
	"ext": "《丰》卦：通顺，国王来了，不用担忧，这种情况只适宜在中午。",
	"exp1": "初九：遇其配主，虽旬无咎，往有尚。",
	"exp2": "倒数第一阳爻：碰到女主人，只十天内无害，去有赏。",
	"exp3": "六二：丰其蔀，日中见斗，往得疑疾，有孚发若，吉。",
	"exp4": "倒数第二阴爻：扩大蔽日的黑云，一片黑暗，日正中时看见北斗星，前去得到多疑病，有诚信未启发，吉。",
	"exp5": "九三：丰其沛，日中见昧，折其右肱，无咎。",
	"exp6": "倒数第三阳爻：扩大遮阳的黑云，昏暗不明，日中看见小星。折断他的右臂，（可以洽愈），无害。",
	"exp7": "九四：丰其蔀，日中见斗，遇其夷主，吉。",
	"exp8": "倒数第四阳爻：扩大蔽日的黑云，日中看见北斗星。碰见平常去寄宿处的主人，吉。",
	"exp9": "六五：来章，有庆誉，吉。",
	"exp10": "倒数第五阴爻：取得文采，有庆贺赞誉，吉。",
	"exp11": "上六：丰其屋，蔀其家，窥其户，闃其无人，三岁不见，凶。",
	"exp12": "最上阴爻：扩大他的屋，遮蔽他的家，窥看他的门户，静寂地没有人，三年没有看见人，凶。",
	"exp13": "",
	"exp14": "",

	"base": "雷电皆至，丰。君子以折狱致刑。丰满盛大之象 居安思危之意 日中则斜 蔽明",
	"general": "大象：雷电交加，声势壮大，又离日动于天际，普照大地，皆为盛大之象。",
	"lucky": "运势：运势极强，为收获之时，但不宜贪得无厌，须知足常乐，要防是非，损财甚至火险。 ",
	"emotion": "爱情：吉利有成，但不可得意忘形。  ",
	"health": "疾病：病况重，注意肝足疾及血压，心脏等疾。 ",
	"find": "失物：尽快找寻，可失而 得。 ",
	"sued": "诉讼：自己虽势如破竹，胜券在握，但应留一线。",
	"bussiness": "",
	"finance": "",
	"def":"大有众也，同人亲也；革去故也，鼎取新也；小过过也，中孚信也；丰多故也，亲寡旅也",
	"story":"得其所归者必大，故受之以丰；丰者大也",
	"poem":"古镜重明",
	"kind": "水"
}
/*
- -
- -
- -
---
- -
---
*/
six_random_NaJia["000101"] = {"icon":"䷣","key":"36",
	"name": "地火明夷",
	"p": "坎宫",
	"1": "父母癸酉金",
	"2": "兄弟癸亥水",
	"3": "官鬼癸丑土 世",
	"4": "兄弟己亥水",
	"5": "官鬼己丑土",
	"6": "子孙己卯木 应",
	"f4": "妻财午火",
	"extname": "《易经》第三十六卦 明夷 地火明夷 坤上离下",
	"extnameexp": "明夷：利艰贞。",
	"extexp": "彖曰：明入地中，明夷。 内文明而外柔顺，以蒙大难，文王以之。 利艰贞，晦其明也，内难而能正其志，箕子以之。",
	"extexp1": "象曰：君子于行，义不食也。六二之吉，顺以则也。南狩之志，乃大得也。入于左腹，获心意也。箕子之贞，明不可息也。初登于天，照四国也。后入于地，失则也。",
	"ext": "《明夷》卦：占问艰难的事有利。",
	"exp1": "初九：明夷于飞，垂其翼。 君子于行，三日不食， 有攸往，主人有言。",
	"exp2": "倒数第一阳爻：鸣叫的鹈鹏在飞，塌下它的（左）翼。君子在出行，三天不吃饭，有所往，主人有谴责。",
	"exp3": "六二：明夷，夷于左股，用拯马壮，吉。",
	"exp4": "倒数第二阴爻：鸣叫的鹈鹕伤在左翼，（还能飞）。用骟马，还强壮，吉。",
	"exp5": "九三：明夷于南狩，得其大首，不可疾贞。",
	"exp6": "倒数第三阳爻：鸣叫的鹈鹕伤在君子南去扎猎时，（君子）找到了大路。占问疾病不利。",
	"exp7": "六四：入于左腹，获明夷之心，出于门庭。",
	"exp8": "倒数第四阴爻：（鸣叫的鹈鹕飞 )入左边山沿，君子要捉到鸣叫鹈鹕的心，在出门时（就有了）。",
	"exp9": "六五：箕子之明夷，利贞。",
	"exp10": "倒数第五阴爻：箕子的遭难退隐，占问有利。",
	"exp11": "上六：不明晦，初登于天，后入于地。",
	"exp12": "最上阴爻，（太阳下山），不亮，暗了。（太阳）开始升上天，后来落入地。",
	"exp13": "",
	"exp14": "",

	"base": "明入地中，明夷。君子以莅众，用晦而明。大地无光之象 弃明投暗之意 患难成长 内敛",
	"general": "大象：太阳掩没在坤地之下，大地黑暗，有失明之象。",
	"lucky": "运势：百事阻滞，小人加害，遇事多迷惑，宜守，静待时机而动。",
	"emotion": "爱情：对方不接受自己，难得成功。 ",
	"health": "疾病：凶象。为潜伏已久之疾，注意心脏、腹部之疾或神经病。  ",
	"find": "失物：不能立即寻回。正当要遗忘这件事时，会意外地有所发现。 ",
	"sued": "诉讼：败象，宜和解了事，愈争愈苦。",
	"bussiness": "",
	"finance": "",
	"def":"晋昼也，明夷诛也",
	"story":"进必有所伤，故受之以明夷； 夷者伤也",
	"poem":"过河拆桥",
	"kind": "水"
}
/*
- -
- -
- -
- -
---
- -
*/
six_random_NaJia["000010"] = {"icon":"䷆","key":"7",
	"name": "地水师",
	"p": "坎宫",
	"1": "父母癸酉金 应",
	"2": "兄弟癸亥水",
	"3": "官鬼癸丑土",
	"4": "妻财戊午火 世",
	"5": "官鬼戊辰土",
	"6": "子孙戊寅木",
	"extname": "《易经》第七卦 师 地水师 坤上坎下 ",
	"extnameexp": "师：贞，丈人，吉无咎。",
	"extexp": "彖曰：师，众也，贞正也，能以众正，可以王矣。 刚中而应，行险而顺，以此毒天下，而民从之，吉又何咎矣。",
	"extexp1": "象曰：师出以律，失律凶也。在师中吉，承天宠也。王三锡命，怀万邦也。师或舆尸，大无功也。左次无咎，未失常也。长子帅师，以中行也。弟子舆尸，使不当也。大君有命，以正功也。小人勿用，必乱邦也。",
	"ext": "《师》卦：占问（任命）总指挥是吉的，无害。",
	"exp1": "初六：师出以律，否臧凶。",
	"exp2": "倒数第一阴爻：行军靠纪律，纪律不好，凶。",
	"exp3": "九二：在师中，吉无咎，王三锡命。",
	"exp4": "倒数第二阳爻：身在军中吉，无害。王三次嘉奖。",
	"exp5": "六三：师或舆尸，凶。",
	"exp6": "倒数第三阴爻：军队有时载尸归，凶。",
	"exp7": "六四：师左次，无咎。",
	"exp8": "倒数第四阴爻：军队驻扎左方，无害。",
	"exp9": "六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",
	"exp10": "倒数第五阴爻：打猎得禽兽，执行（上级）的话有利，无害。长子统率军队出征，次子战死，载著尸体归来，占问是凶。",
	"exp11": "上六：大君有命，开国承家，小人勿用。",
	"exp12": "最上阴爻：天子有命令，封侯国，封大夫。小民不用封爵。",
	"exp13": "",
	"exp14": "",

	"base": "地中有水，师。君子以容民畜众。 地势临渊之象　以寡服众之意 行险而顺 有功",
	"general": "大象：养兵聚众，出师攻伐之象，彼此有伤，难得安宁。",
	"lucky": "运势：困难重重，凡事以正规行事，忌独断独行，投机取巧，提防潜在敌人。  ",
	"emotion": "爱情：阴盛阳衰，须提防色情之厄，似多角关系，求婚难成。 ",
	"health": "疾病：病况严重，提防心脏或腹腔肿瘤等。",
	"find": "失物：不会出现，即或寻回，也已损坏。 ",
	"sued": "诉讼：宜进不宜退，内心虽忧，但得贵人之助。",
	"bussiness": "",
	"finance": "",
	"def":"乾刚，坤柔，比乐，师忧",
	"story":"讼必有众起，故受之以师",
	"poem":"马到成功",
	"kind": "水"
}
/*
---
- -
- -
---
- -
- -
*/
six_random_NaJia["100100"] = {"icon":"䷳","key":"52",
	"name": "艮为山",
	"p": "艮宫",
	"1": "官鬼丙寅木 世",
	"2": "妻财丙子水",
	"3": "兄弟丙戌土",
	"4": "子孙丙申金 应",
	"5": "父母丙午火",
	"6": "兄弟丙辰土",
	"extname": "《易经》第五十二卦 艮 艮为山 艮上艮下",
	"extnameexp": "艮：艮其背，不获其身，行其庭，不见其人，无咎。",
	"extexp": "彖曰：艮，止也。 时止则止，时行则行，动静不失其时，其道光明。 艮其止，止其所也。 上下敌应，不相与也。 是以不获其身，行其庭不见其人，无咎也。",
	"extexp1": "象曰：艮其趾，未失正也。不拯其随，未退听也。艮其限，危熏心也。艮其身，止诸躬也。艮其辅，以中正也。敦艮之吉，以厚终也。",
	"ext": "《艮》卦：注意他的背部，却没有保护全身，走到家中的庭园发现没有人，没有害。。",
	"exp1": "初六：艮其趾，无咎，利永贞。",
	"exp2": "倒数第一阴爻：注意他的脚趾，无害。占问长期的事有利。",
	"exp3": "六二：艮其腓，不拯其随，其心不快。",
	"exp4": "倒数第二阴爻：注意他的褪肚子，不长肉，他的心里不舒服。",
	"exp5": "九三：艮其限，列其夤，厉薰心。",
	"exp6": "倒数第三阳爻：注意他的腰，对他的背分散注意，危险，焦心。",
	"exp7": "六四：艮其身，无咎。",
	"exp8": "倒数第四阴爻：注意他的身体，无害。",
	"exp9": "六五：艮其辅，言有序，悔亡。",
	"exp10": "倒数第五阴爻：注意他的面颊，说话有次序，悔恨可以消失。",
	"exp11": "上九：敦艮，吉。",
	"exp12": "最上阳爻：多方面注意，吉。",
	"exp13": "",
	"exp14": "",

	"base": "兼山，艮；君子以思不出其位。重山关锁之象 步步为营之意 安静自守",
	"general": "大象：两重高山并峙，故宜止不宜进，阻塞之象。",
	"lucky": "运势：凡事不宜妄动，前路受阻，只好待机而动。 ",
	"emotion": "爱情：有单恋不和之象，双方阻隔重重，关系停滞不前。 ",
	"health": "疾病：难治，注意肠胃血管硬化及结核病。 ",
	"find": "失物：可以寻回，但要等一段时间。藏在家中、旅馆、寺院、山中某处。 ",
	"sued": "诉讼：因小事而化大，宜速求和，忌土姓人。",
	"bussiness": "",
	"finance": "",
	"def":"震起也，艮止也；损益盛衰之始也",
	"story":"物不可以终动，止之，故受之 以艮；艮者止也",
	"poem":"矬巴勾枣",
	"kind": "土"
}
/*
---
- -
- -
---
- -
---
*/
six_random_NaJia["100101"] = {"icon":"䷕","key":"22",
	"name": "山火贲",
	"p": "艮宫",
	"1": "官鬼丙寅木",
	"2": "妻财丙子水",
	"3": "兄弟丙戌土 应",
	"4": "妻财己亥水",
	"5": "兄弟己丑土",
	"6": "官鬼己卯木 世",
	"extname": "《易经》第二十二卦 贲 山火贲 艮上离下",
	"extnameexp": "贲：亨。 小利有所往。",
	"extexp": "彖曰：贲，亨；柔来而文刚，故亨。分刚上而文柔，故小利有攸往。天文也；文明以止，人文也。观乎天文，以察时变；观乎人文，以化成天下。",
	"extexp1": "象曰：舍车而徒，义弗乘也。贲其须，与上兴也。永贞之吉，终莫之陵也。六四，当位疑也。匪寇婚媾，终无尤也。六五之吉，有喜也。白贲无咎，上得志也。",
	"ext": "《贲》卦：通顺。有所往得小利。",
	"exp1": "初九：贲其趾，舍车而徒。",
	"exp2": "倒数第一阳爻：文饰他的脚，放弃车子不坐却徒步走，（显示脚的美）。",
	"exp3": "六二：贲其须。",
	"exp4": "倒数第二阴爻：文饰他的须，（如老人染白须）。",
	"exp5": "九三：贲如濡如，永贞吉。",
	"exp6": "倒数第三阳爻：采色照耀地，态度柔和地，占问是长期吉的。",
	"exp7": "六四：贲如皤如，白马翰如，匪寇婚媾。",
	"exp8": "倒数第四阴爻：采色照耀地，毛色纯洁地，白马飞一般的来，不是盗寇，是来迎娶。",
	"exp9": "六五：贲于丘园，束帛戋戋，吝，终吉。",
	"exp10": "倒数第五阴爻：结彩来装饰丘园，送上一束微少的帛，有困难，终于吉。",
	"exp11": "上九：白贲，无咎。",
	"exp12": "最上阳爻：文饰纯白的，没有不利。",
	"exp13": "",
	"exp14": "",

	"base": "山下有火，贲。君子以明庶政，无敢折狱。争妍斗丽之象 粉饰妆扮之意 饰外实内 审美",
	"general": "大象：日落西山，照耀通明，华美灿烂，同时喻光明力量渐消，阴暗的力量扩大。",
	"lucky": "运势：表面风光内里空虚，必须充实自己，凡事踏实，按部就班。",
	"emotion": "爱情：不宜单注重外表而忽略内涵，不可自视太高。",
	"health": "疾病：病情危重，为心脏、胸腹等病。 ",
	"find": "失物：在家中遗失，将可寻回。不妨试试注意门脚的地方。 ",
	"sued": "诉讼：宜速求解决，不可拖延，可得贵人调解",
	"bussiness": "",
	"finance": "",
	"def":"噬嗑食也，贲无色也",
	"story":"物不可以苟合而已，故受之以贲；贲者饰也",
	"poem":"喜气盈门",
	"kind": "土"
}
/*
---
- -
- -
---
---
---
*/
six_random_NaJia["100111"] = {"icon":"䷙","key":"26",
	"name": "山天大畜",
	"p": "艮宫",
	"1": "官鬼丙寅木",
	"2": "妻财丙子水 应",
	"3": "兄弟丙戌土",
	"4": "兄弟甲辰土",
	"5": "官鬼甲寅木 世",
	"6": "妻财甲子水",
	"f4": "子孙申金",
	"f5": "父母午火",
	"extname": "《易经》第二十六卦 大畜 山天大畜 艮上乾下 ",
	"extnameexp": "大畜：利贞，不家食吉，利涉大川。",
	"extexp": "彖曰：大畜，刚健笃实辉光，日新其德，刚上而尚贤。 能止健，大正也。不家食吉，养贤也。 利涉大川，应乎天也。",
	"extexp1": "象曰：有厉利巳，不犯灾也。舆说輹，中无尤也。利有攸往，上合志也。六四元吉，有喜也。六五之吉，有庆也。何天之衢，道大行也。",
	"ext": "《大畜》卦：占问有利。不靠家里吃饭，吉。渡大河有利。",
	"exp1": "初九：有厉利已。",
	"exp2": "倒数第一阳爻：事情有危险，停止不做有利。",
	"exp3": "九二：舆说辐。",
	"exp4": "倒数第二阳爻：车轮中的直轴脱落，（车不能前进）。",
	"exp5": "九三：良马逐，利艰贞。 曰闲舆卫，利有攸往。",
	"exp6": "倒数第三阳爻：驾著良马驰逐，路虽艰险，占问有利。每天熟练驾驶保卫的事，有所往有利。",
	"exp7": "六四：童豕之牿，元吉。",
	"exp8": "倒数第四阴爻：小牛角上加上横木，大吉。",
	"exp9": "六五：豮豕之牙，吉。",
	"exp10": "倒数第五阴爻：阉割的猪的牙齿，（不会伤害），吉。",
	"exp11": "上九：何天之衢，亨。",
	"exp12": "最上阳爻：受天的庇护，通顺。",
	"exp13": "",
	"exp14": "",

	"base": "天在山中，大畜。君子以多识前言往行，以畜其德。浅水行舟之象 积小成大之意 畜德涵真 尊贤",
	"general": "大象：天之大而在山之中，以小阻大，以阴畜阳，为止为养。",
	"lucky": "运势：处事不可好高骛远，宜脚踏实地，可成大业，忌目空一切。 ",
	"emotion": "爱情：虽现时有小阻碍，但终可成功。  ",
	"health": "疾病：病虽重，但可治，防胸肺，腹或手部之病，易积劳成疾。",
	"find": "失物：有机会寻回。似是在圆形有盖盛存之物中。",
	"sued": "诉讼：因房地产引起，有破财之象，但纠纷可解。",
	"bussiness": "",
	"finance": "",
	"def":"大畜时也。无妄灾也",
	"story":"有无妄然后可畜，故受之以大畜",
	"poem":"阵势得开",
	"kind": "土"
}
/*
---
- -
- -
- -
---
---
*/
six_random_NaJia["100011"] = {"icon":"䷨","key":"41",
	"name": "山泽损",
	"p": "艮宫",
	"1": "官鬼丙寅木 应",
	"2": "妻财丙子水",
	"3": "兄弟丙戌土",
	"4": "兄弟丁丑土 世",
	"5": "官鬼丁卯木",
	"6": "父母丁巳火",
	"f4": "子孙申金",
	"f5": "父母午火",
	"extname": "《易经》第四十一卦 损 山泽损 艮上兑下 ",
	"extnameexp": "损：有孚，元吉，无咎，可贞，利有攸往？ 曷之用，二簋可用享。",
	"extexp": "彖曰：损，损下益上，其道上行。损而有孚，元吉，无咎，可贞，利有攸往。 曷之用？ 二簋可用享；二簋应有时。损刚益柔有时，损益盈虚，与时偕行。",
	"extexp1": "象曰：巳事遄往，尚合志也。九二利贞，中以为志也。一人行，三则疑也。损其疾，亦可喜也。六五元吉，自上祐也。弗损益之，大得志也。",
	"ext": "《损》卦：得俘虏，大吉，无害。占问可行。有所往，有利。",
	"exp1": "初九：已事遄往，无咎，酌损之。",
	"exp2": "倒数第一阳爻：祭祀的事要快去参加，无害。有时酌量减损它的祭品。",
	"exp3": "九二：利贞，征凶，弗损益之。",
	"exp4": "倒数第二阳爻：占问有利。出行，凶。不能减损，要增补他。",
	"exp5": "六三：三人行，则损一人；一人行，则得其友。",
	"exp6": "倒数第三阴爻：三人同行就损一人，一人独行就得到他的朋友。",
	"exp7": "六四：损其疾，使遄有喜，无咎。",
	"exp8": "倒数第四阴爻：减轻他的病，使他快好，可喜，无害。",
	"exp9": "六五：或益之，十朋之龟弗克违，元吉。",
	"exp10": "倒数第五阴爻：有人赐给他价值百贝的大龟，不能拒绝，大吉。",
	"exp11": "上九：弗损益之，无咎，贞吉，利有攸往，得臣无家。",
	"exp12": "最上阳爻：不能减损，要增益他，无害，占问吉。有所往有利，得到一个单身奴隶，没有家属。",
	"exp13": "",
	"exp14": "",

	"base": "山下有泽，损。君子以惩忿窒欲。塞翁失马之象 因损得益之意 损下益上 节用",
	"general": "大象：山高水深，各得其所，因损得益之象。",
	"lucky": "运势：现况诸事不顺，有破财之象，虽先损失，但后反而得益，因祸得福。",
	"emotion": "爱情：不利女性之卦。以诚信待人，可得成功，不宜斤斤计较。 ",
	"health": "疾病：现况病情虽重，积极治疗可愈。身体较衰弱，注意肠胃、咽喉、贫血等疾。 ",
	"find": "失物：不能寻回。",
	"sued": "诉讼：有斗争之象，损失破财，和解反而获益。",
	"bussiness": "",
	"finance": "",
	"def":"震起也，艮止也；损益盛衰之始也",
	"story":"缓必有所失，故受之以损",
	"poem":"推车掉耳",
	"kind": "土"
}
/*
---
- -
---
- -
---
---
*/
six_random_NaJia["101011"] = {"icon":"䷥","key":"38",
	"name": "火泽睽",
	"p": "艮宫",
	"1": "父母己巳火",
	"2": "兄弟己未土",
	"3": "子孙己酉金 世",
	"4": "兄弟丁丑土",
	"5": "官鬼丁卯木",
	"6": "父母丁巳火 应",
	"f2": "妻财子水",
	"extname": "《易经》第三十八卦 睽 火泽睽 离上兑下 ",
	"extnameexp": "睽：小事吉。",
	"extexp": "彖曰：睽，火动而上，泽动而下； 二女同居，其志不同行；说而丽乎明，柔进而上行，得中而应乎刚；是以小事吉。 天地睽，而其事同也；男女睽，而其志通也；万物睽，而其事类也；睽之时用大矣哉！",
	"extexp1": "象曰：见恶人，以辟咎也。遇主于巷，未失道也。见舆曳，位不当也。无初有终，遇刚也。交孚无咎，志行也。厥宗噬肤，往有庆也。遇雨之吉，群疑亡也。",
	"ext": "《睽》卦：做小事吉。",
	"exp1": "初九：悔亡，丧马勿逐，自见恶人无咎。",
	"exp2": "倒数第一阳爻：悔恨没有了。马跑掉了不用追寻，它自己会回来。遇见丑人，无害。",
	"exp3": "九二：遇主于巷，无咎。",
	"exp4": "倒数第二阳爻：在小巷里碰见接待客人的主人，无害。",
	"exp5": "六三：见舆曳，其牛掣，其人天且劓，无初有终。",
	"exp6": "倒数第三阳爻：看见大车在拉东西，驾车的牛角一高一低。（拉得很累）。驾车的人黯额割鼻，开始困难，结果顺利，（得到别人帮助）。",
	"exp7": "九四：睽孤，遇元夫，交孚，厉无咎。",
	"exp8": "倒数第四阳爻：旅人孤单，碰见一个跛子，都被俘虏，（因跛子是逃走的奴隶）。处境危险，（经过解释），无害。",
	"exp9": "六五：悔亡，厥宗噬肤，往何咎。",
	"exp10": "倒数第五阳爻：悔恨消除了。他的同宗族的人在吃肉，前去又何害？",
	"exp11": "上九：睽孤， 见豕负涂，载鬼一车， 先张之弧，后说之弧，匪寇婚媾，往遇雨则吉。",
	"exp12": "最上阳爻：旅人孤单地（走路），看见猪背上都是泥，一车上载著鬼，他先拉开弓，后放下弓，原来不是强盗，是来迎娶的。前去遇雨就吉。",
	"exp13": "",
	"exp14": "",

	"base": "上火下泽，睽。君子以同而异。两相乖违之象 乖离相悖之意 异中求同 离群",
	"general": "大象：离火向上，兑泽则向下，一上一下，两相乖违，又二女同居，不得正之象。",
	"lucky": "运势：气运欠佳，诸事难成，有水火不容之象，宜处变不惊。",
	"emotion": "爱情：互相皆无意，不宜寄望。",
	"health": "疾病：轻症宜速就医，重症则危，更防断症错误，注意心脏，寒热失调之症。",
	"find": "失物：不能找回。有失窃的可能。",
	"sued": "诉讼：宜速求和解，迟则理屈辞穷。",
	"bussiness": "",
	"finance": "",
	"def":"睽外也，家人内也",
	"story":"家道穷必乖，故受之以睽；睽者乖也",
	"poem":"贩卖猪羊",
	"kind": "土"
}
/*
---
---
---
- -
---
---
*/
six_random_NaJia["111011"] = {"icon":"䷉","key":"10",
	"name": "天泽履",
	"p": "艮宫",
	"1": "兄弟壬戌土",
	"2": "子孙壬申金 世",
	"3": "父母壬午火",
	"4": "兄弟丁丑土",
	"5": "官鬼丁卯木 应",
	"6": "父母丁巳火",
	"f2": "妻财子水",
	"extname": "《易经》第十卦 履 天泽履 乾上兑下 ",
	"extnameexp": "履：履虎尾，不咥人，亨。",
	"extexp": "彖曰：履，柔履刚也。说而应乎乾，是以履虎尾，不咥人，亨。刚中正，履帝位而不疚，光明也。",
	"extexp1": "象曰：素履之往，独行愿也。幽人贞吉，中不自乱也。眇能视，不足以有明也。跛能履，不足以与行也。咥人之凶，位不当也。武人为于大君，志刚也。愬愬终吉，志行也。夬履贞厉，位正当也。元吉在上，大有庆也。",
	"ext": "《履》卦：踩著老虎尾巴，老虎不咬人。通顺。",
	"exp1": "初九：素履，往无咎。",
	"exp2": "倒数第一阳爻：品行端正纯朴，前往那里都不会有过失。",
	"exp3": "九二：履道坦坦，幽人贞吉。",
	"exp4": "倒数第二阳爻：遵行正道，心胸坦荡，关在狱中的人若能做到，占问就吉利。",
	"exp5": "六三：眇能视，跛能履，履虎尾，咥人，凶。 武人为于大君。",
	"exp6": "倒数第三阴爻：瞎了一只眼，瘸了一条腿，踩在虎尾上，被虎咬，凶。武将成为一国之君。",
	"exp7": "九四：履虎尾，愬愬终吉。",
	"exp8": "倒数第四阳爻：踩著老虎尾巴，感到恐惧，最后都平安。",
	"exp9": "九五：夬履，贞厉。",
	"exp10": "倒数第五阳爻：鞋底要断裂，占问结果是将会有危险。",
	"exp11": "上九：视履考祥，其旋元吉。",
	"exp12": "最上阳爻：周全反覆的视察要办的事，那样从一开始就会吉利。",
	"exp13": "",
	"exp14": "",

	"base": "上天下泽，履。君子以辩上下、定民志。如履虎尾之象　险中求胜之意 脚踏实地 制礼",
	"general": "大象：柔弱遇刚强，欲行却难行之象，难且危也。",
	"lucky": "运势：先劳而后逸，始惊而后安，百事不宜急进，须以和待人，有惊无险。",
	"emotion": "爱情：两情相悦，但阻碍重重，精诚所至，金石为开。 ",
	"health": "疾病：病虽重，但注意调理亦可愈，防头、口、肺等疾。 ",
	"find": "失物：赶快去找有可能寻回，留意行过的路上，或者有鞋的地方。 ",
	"sued": "诉讼：敌强而我弱之象，宜步步为营。",
	"bussiness": "",
	"finance": "",
	"def":"小畜寡也，履不处也",
	"story":"物畜然后有礼，故受之以履",
	"poem":"凤鸣歧山",
	"kind": "土"
}
/*
---
---
- -
- -
---
---
*/
six_random_NaJia["110011"] = {"icon":"䷼","key":"61",
	"name": "风泽中孚",
	"p": "艮宫",
	"1": "官鬼辛卯木",
	"2": "父母辛巳火",
	"3": "兄弟辛未土 世",
	"4": "兄弟丁丑土",
	"5": "官鬼丁卯木",
	"6": "父母丁巳火 应",
	"f4": "子孙申金",
	"f2": "妻财子水",
	"extname": "《易经》第六十一卦 中孚 风泽中孚 巽上兑下 ",
	"extnameexp": "中孚：豚鱼吉，利涉大川，利贞。",
	"extexp": "彖曰：中孚，柔在内而刚得中。 说而巽，孚，乃化邦也。 豚鱼吉，信及豚鱼也。 利涉大川，乘木舟虚也。 中孚以利贞，乃应乎天也。",
	"extexp1": "象曰：初九虞吉，志未变也。其子和之，中心愿也。或鼓或罢，位不当也。马匹亡，绝类上也。有孚挛如，位正当也。翰音登于天，何可长也？",
	"ext": "《中孚》卦：猪和鱼，吉利，利于渡大河，有利占问。",
	"exp1": "初九：虞吉，有他不燕。",
	"exp2": "倒数第一阳爻：安居，吉。有意外，不安。",
	"exp3": "九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。",
	"exp4": "倒数第二阴爻：鸣叫的鹤在树荫里，它的小鹤也鸣叫来应和。找存好的杯酒，我跟你共饮它。",
	"exp5": "六三：得敌，或鼓或罢，或泣或歌。",
	"exp6": "倒数第三阴爻：得到敌人，有的击鼓，有的疲惫，有的哭泣，有的唱歌。",
	"exp7": "六四：月几望，马匹亡，无咎。",
	"exp8": "倒数第四阴爻：过了月半，马匹跑掉，无害。",
	"exp9": "九五：有孚挛如，无咎。",
	"exp10": "倒数第五阳爻：有诚信连贯著，无害。",
	"exp11": "上九：翰音登于天，贞凶。",
	"exp12": "最上阳爻：鸡飞升上天，（鸡不会高飞，高飞会跌死）。占问凶。",
	"exp13": "",
	"exp14": "",

	"base": "泽上有风，中孚。君子以议狱缓死。以诚待人之象 一诺千金之意 诚信立身 好生",
	"general": "大象：中孚为诚信意，风吹在泽水之上，泽水必相应而起波浪，为共鸣之象。",
	"lucky": "运势：凡事以「诚」待人，以「信」处事则诸事皆吉，心存邪念则凶。 ",
	"emotion": "爱情：双方能以诚相待，良缘可定。",
	"health": "疾病：金木交战之象，士妥井啁理，注意胸腹脾胃。",
	"find": "失物：可失而 得，但需要一段时间。 ",
	"sued": "诉讼：为突发事件，宜把握第一时间处理，迟则反凶。",
	"bussiness": "",
	"finance": "",
	"def":"大有众也，同人亲也；革去故也，鼎取新也；小过过也，中孚信也；丰多故也，亲寡旅也",
	"story":"节而信之，故受之以中孚",
	"poem":"行走薄冰",
	"kind": "土"
}
/*
---
---
- -
---
- -
- -
*/
six_random_NaJia["110100"] = {"icon":"䷴","key":"53",
	"name": "风山渐",
	"p": "艮宫",
	"1": "官鬼辛卯木 应",
	"2": "父母辛巳火",
	"3": "兄弟辛未土",
	"4": "子孙丙申金 世",
	"5": "父母丙午火",
	"6": "兄弟丙辰土",
	"f2": "妻财子水",
	"extname": "《易经》第五十三卦 渐 风山渐 巽上艮下 ",
	"extnameexp": "渐：女归吉，利贞。",
	"extexp": "彖曰：渐之进也，女归吉也。 进得位，往有功也。进以正，可以正邦也。其位刚，得中也。 止而巽，动不穷也。",
	"extexp1": "象曰：小子之厉，义无咎也。饮食衎衎，不素饱也。夫征不复，离群丑也。妇孕不育，失其道也。利用御寇，顺相保也。或得其桷，顺以巽也。终莫之胜吉，得所愿也。其羽可用为仪吉，不可乱也。",
	"ext": "《渐》卦：嫁女，结果是吉利，有利于占问。",
	"exp1": "初六：鸿渐于干，小子厉，有言，无咎。",
	"exp2": "倒数第一阴爻：大雁前进到溪水。小孩（到漠水）有危险，（家长）加以诃止，无害。",
	"exp3": "六二：鸿渐于磐，饮食衎衎，吉。",
	"exp4": "倒数第二阴爻，大雁渐进到水边石上，饮水吃鱼而欢乐，吉。",
	"exp5": "九三：鸿渐于陆，夫征不复，妇孕不育，凶；利御寇。",
	"exp6": "倒数第三阳爻：大雁前进到陆地。丈夫出征不回来，妇人有孕流产，凶。抵御敌人有利。",
	"exp7": "六四：鸿渐于木，或得其桷，无咎。",
	"exp8": "倒数第四阴爻：大雁前进到树上，有的停在（人家砍倒的）椽木上，无害。",
	"exp9": "九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。",
	"exp10": "倒数第五阳爻：大雁前进到山岭。妇三年不孕，到底没有人欺悔她，吉。",
	"exp11": "上九：鸿渐于逵，其羽可用为仪，吉。",
	"exp12": "最上阳爻：大雁飞上大山，它的羽毛可作为文舞的道具。吉。",
	"exp13": "",
	"exp14": "",

	"base": "山上有木，渐。君子以居贤德善俗。旭日东升之象 循序渐进之意 高楼地起 进化",
	"general": "大象：山上种有树木，逐渐生长，比喻循序渐进。",
	"lucky": "运势：逐渐走向光明前途，凡事宜打根基，可得吉庆，但须防色情之难及文书错失。 ",
	"emotion": "爱情：循序发展，可成功，但婚姻有再娶之象。",
	"health": "疾病：恶化之象，注意胃、肠、背痛等。",
	"find": "失物：多数不能寻回。 ",
	"sued": "诉讼：宜进不宜退，据理力争可胜。",
	"bussiness": "",
	"finance": "",
	"def":"渐女归，待男行也。颐养正也，既济定也",
	"story":"物不可以终止，故受之以渐；渐者进也",
	"poem":"俊鸟出笼",
	"kind": "土"
}
/*
- -
- -
- -
- -
- -
- -
*/
six_random_NaJia["000000"] = {"icon":"䷁","key":"2",
	"name": "坤为地",
	"p": "坤宫",
	"1": "子孙癸酉金 世",
	"2": "妻财癸亥水",
	"3": "兄弟癸丑土",
	"4": "官鬼乙卯木 应",
	"5": "父母乙巳火",
	"6": "兄弟乙未土",
	"extname": "《易经》第二卦 坤 坤为地 坤上坤下 ",
	"extnameexp": "坤：元，亨，利牝马之贞。 君子有攸往，先迷后得主，利西南得朋，东北丧朋。 安贞，吉。",
	"extexp": "彖曰：至哉坤元，万物资生，乃顺承天。 坤厚载物，德合无疆。 含弘光大，品物咸亨。 牝马地类，行地无疆，柔顺利贞。 君子攸行，先迷失道，后顺得常。 西南得朋，乃与类行；东北丧朋，乃终有庆。安贞之吉，应地无疆。",
	"extexp1": "象曰：履霜坚冰，阴始凝也。驯致其道，至坚冰也。六二之动，直以方也。不习无不利，地道光也。含章可贞，以时发也。或从王事，知光大也。括囊无咎，慎不害也。黄裳元吉，文在中也。龙战于野，其道穷也。用六永贞，以大终也。",
	"ext": " 《坤》卦：大通顺。占问雌马有利。君子有所往，起先迷路，后来得到房主人(的接待)。有利于到西南方去，得赚钱；到东北去，会失财。占问安居，吉。",
	"exp1": "初六：履霜，坚冰至。",
	"exp2": "倒数第一阴爻：踩著霜，坚冰将要到来。",
	"exp3": "六二：直，方，大，不习无不利。",
	"exp4": "倒数第二阴爻：(顺著天道是)直，(地道是)方、大，不熟习它，没有不利。",
	"exp5": "六三：含章可贞。 或从王事，无成有终。",
	"exp6": "倒数第三阴爻：(大地)含蕴¨文彩，占问是好的。有人从事王事，没有成法，但有结果",
	"exp7": "六四：括囊；无咎，无誉。",
	"exp8": "倒数第四阴爻：扎好口袋，没有害处，也没有好处",
	"exp9": "六五：黄裳，元吉。",
	"exp10": "倒数第五阴爻：(穿著)黄色的衣裳，大吉。",
	"exp11": "上六：战龙於野，其血玄黄。",
	"exp12": "上面的阴爻：两龙在野地相斗，它的血玄黄色。 (含有不吉利意)。",
	"exp13": "用六：利永贞。",
	"exp14": "用阴爻：占问永远吉利。",

	"base": "地势坤，君子以厚德载物。兼容万物之象　以柔制刚之意 柔顺伸展",
	"general": "大象：大地承载万物，以德服众，仁者无敌。",
	"lucky": "运势：诸事不宜急进，以静制动为宜。 ",
	"emotion": "爱情：急进有失，缓进反成，欲速不达。 ",
	"health": "疾病：病情严重，为腹、肠胃、肌肉等慢性病。 ",
	"find": "失物：难以寻回，大部份均不知下落。 ",
	"sued": "诉讼：防房地产之争，宜和解，有始无终之兆。",
	"bussiness": "",
	"finance": "",
	"def":"乾刚，坤柔，比乐，师忧",
	"story":"有天地，然后万物生焉",
	"poem":"饿虎得食",
	"kind": "土"
}
/*
- -
- -
- -
- -
- -
---
*/
six_random_NaJia["000001"] = {"icon":"䷗","key":"24",
	"name": "地雷复",
	"p": "坤宫",
	"1": "子孙癸酉金",
	"2": "妻财癸亥水",
	"3": "兄弟癸丑土 应",
	"4": "兄弟庚辰土",
	"5": "官鬼庚寅木",
	"6": "妻财庚子水 世",
	"f5": "父母巳火",
	"extname": "《易经》第二十四卦 复 地雷复 坤上震下",
	"extnameexp": "复：亨。 出入无疾，朋来无咎。 反复其道，七日来复，利有攸往。",
	"extexp": "彖曰：复亨，刚反，动而以顺行，是以出入无疾，朋来无咎。 反复其道，七日来复，天行也。 利有攸往，刚长也。 复其见天地之心乎？",
	"extexp1": "象曰：不远之复，以修身也。休复之吉，以下仁也。频复之厉，义无咎也。中行独复，以从道也。敦复无悔，中以自考也。迷复之凶，反君道也。",
	"ext": "《复》卦：通顺。出门的人不生病。赚了钱没有害。在路上来回，七天就能来回。有所往有利。",
	"exp1": "初九：不复远，无只悔，元吉。",
	"exp2": "倒数第一阳爻：走得不远就回来，没有大问，大吉。",
	"exp3": "六二：休复，吉。",
	"exp4": "倒数第二阴爻：很好地回来，吉。",
	"exp5": "六三：频复，厉无咎。",
	"exp6": "倒数第三阴爻：皱¨眉头回业，有危险，但无害。",
	"exp7": "六四：中行独复。",
	"exp8": "象曰：中行独复，以从道也。",
	"exp9": "六五：敦复，无悔。",
	"exp10": "倒数第五爻：经过考察，决定返回，可以无悔。",
	"exp11": "上六：迷复，凶，有灾眚。用行师，终有大败，以其国君，凶；至于十年，不克征。",
	"exp12": "最大阴爻：迷失回来的路，凶，有灾殃。至于行军迷路，终于有大败，以及他的国君受害。凶。至于十年不能出征。",
	"exp13": "",
	"exp14": "",

	"base": "雷在地中，复。先王以至日闭关，商旅不行，后不省方。万物更新之象 重修破旧之意 挫折奋起 修身",
	"general": "大象：雷在地中振发，喻春回大地，一元 始，万象更生。",
	"lucky": "运势：开运亨通之象，万事不宜急进，按部就班可成。 ",
	"emotion": "爱情：性急则事败，缓可得成，有合可能",
	"health": "疾病：病防 发，但可治，为肝、肠胃、神经系统病变。  ",
	"find": "失物：有失而 得之可能。 ",
	"sued": "诉讼：多人之事，但经多次扰攘才可解决。",
	"bussiness": "事业：已经渡过了困难时期，开始进入积极行动的阶段。但务必抓住时机，当机立断，却不可急躁，且应时常反省个人行动，严于修身，勇往直前，可望成功。",
	"finance": "经商：可大胆投资，与志同道合的伙伴坦诚合作，打开市场，勿因挫折而退缩。更可以打入外地，坚持商业道德，循序渐进，一定会有所赢利。",
	"def":"剥烂也，复反也",
	"story":"物不可以终尽，剥穷 上反下，故受之以复",
	"poem":"夫妻反目",
	"kind": "土"
}
/*
- -
- -
- -
- -
---
---
*/
six_random_NaJia["000011"] = {"icon":"䷒","key":"19",
	"name": "地泽临",
	"p": "坤宫",
	"1": "子孙癸酉金",
	"2": "妻财癸亥水 应",
	"3": "兄弟癸丑土",
	"4": "兄弟丁丑土",
	"5": "官鬼丁卯木 世",
	"6": "父母丁巳火",
	"extname": "《易经》第十九卦 临 地泽临 坤上兑下",
	"extnameexp": "临：元，亨，利，贞。 至于八月有凶。",
	"extexp": "彖曰：临，刚浸而长。 说而顺，刚中而应，大亨以正，天之道也。 至于八月有凶，消不久也。",
	"extexp1": "象曰：咸临贞吉，志行正也。咸临吉无不利，未顺命也。甘临，位不当也。既忧之，咎不长也。至临无咎，位当也。大君之宜，行中之谓也。敦临之吉，志在内也。",
	"ext": "《临》卦：大通顺，占问有利。到了八月有凶。 (因天旱不雨)",
	"exp1": "初九：咸临，贞吉。",
	"exp2": "倒数第一阳爻：用感化治民，占问是吉。",
	"exp3": "九二：咸临，吉无不利。",
	"exp4": "倒数第二阳爻：用感化政策治民，吉，没有不利。",
	"exp5": "六三：甘临，无攸利。 既忧之，无咎。",
	"exp6": "倒数第三阴爻：用钳制政策治民，没有什么好处。既而担心人民疾苦，无害。",
	"exp7": "六四：至临，无咎。",
	"exp8": "倒数第四阴爻：用真诚政策治民，没有害处。",
	"exp9": "六五：知临，大君之宜，吉。",
	"exp10": "倒数第五阴爻：用智慧去治民，是一国之君必需的，吉利。",
	"exp11": "上六：敦临，吉无咎。",
	"exp12": "最上阴爻：用敦厚态度治民，吉利，没有害处。",
	"exp13": "",
	"exp14": "",

	"base": "泽上有地，临。君子以教思无穷，容保民无疆。居高临下之象 循序渐进之意 蕴育浸长 施政",
	"general": "大象：池泽之水灌溉地面万物，相辅相成，生生不息。",
	"lucky": "运势：诸事亨通，上下和合，前途有望，但不宜过于急进。",
	"emotion": "爱情：柔顺者可得吉利，注意欲速则不达。",
	"health": "疾病：病情较轻，为肠胃，口腔之疾，并防泌尿生殖系统病变。",
	"find": "失物：不能立即发现，很久才能找回。可能被埋在地下。是件会发声或震动的物件。",
	"sued": "诉讼：宜柔不宜刚，因本欲欺他人，反伤自己。",
	"bussiness": "",
	"finance": "",
	"def":"临、观之义，或与或求",
	"story":"有事而后可大，故受之以临；临者大也",
	"poem":"发政施仁",
	"kind": "土"
}
/*
- -
- -
- -
---
---
---
*/
six_random_NaJia["000111"] = {"icon":"䷊","key":"11",
	"name": "地天泰",
	"p": "坤宫",
	"1": "子孙癸酉金 应",
	"2": "妻财癸亥水",
	"3": "兄弟癸丑土",
	"4": "兄弟甲辰土 世",
	"5": "官鬼甲寅木",
	"6": "妻财甲子水",
	"f5": "父母巳火",
	"extname": "《易经》第十一卦 泰 地天泰 坤上乾下",
	"extnameexp": "泰：小往大来，吉亨。",
	"extexp": "彖曰：泰，小往大来，吉亨。则是天地交，而万物通也；上下交，而其志同也。内阳而外阴，内健而外顺，内君子而外小人，君子道长，小人道消也。",
	"extexp1": "象曰：拔茅征吉，志在外也。包荒得尚于中行，以光大也。无往不复，天地际也。翩翩不富，皆失实也。不戒以孚，中心愿也。以祉元吉，中以行愿也。城复于隍，其命乱也。",
	"ext": "《泰》卦：小的去了大的来，吉，通顺。",
	"exp1": "初九：拔茅茹，以其夤，征吉。",
	"exp2": "倒数第一阳爻：拔茜草，按它的种类。出外，吉。",
	"exp3": "九二：包荒，用冯河，不遐遗，朋亡，得尚于中行。",
	"exp4": "倒数第二阳爻：大葫芦挖空了，用它来渡河，不至于坠下水去。钱丢了，在半路上得到补偿。",
	"exp5": "九三：无平不陂，无往不复，艰贞无咎。 勿恤其孚，于食有福。",
	"exp6": "倒数第三阳爻：没有平坦的不倾斜，没有出外的不回来。占问艰难的无害。勿 他的诚信，对于粮食是有福的。",
	"exp7": "六四：翩翩不富，以其邻，不戒以孚。",
	"exp8": "倒数第四阴爻：象轻快地飞舞，不富因为他的邻居（的掠夺），不加戒备因而被俘。",
	"exp9": "六五：帝乙归妹，以祉元吉。",
	"exp10": "倒数第五阴爻：帝乙嫁女，有福，大吉。",
	"exp11": "上六：城复于隍，勿用师。 自邑告命，贞吝。",
	"exp12": "最上阴爻：城墙倒塌在城濠里，不要用兵进攻，从邑里传来命令。占问不利。",
	"exp13": "",
	"exp14": "",

	"base": "天地交，泰，后以财成天地之道，辅相天地之宜，以左右民。天地交泰之象 阴阳顺遂之意 应时而变 治世",
	"general": "大象：天地阴阳之气相交感，上下和睦，流通无阻。",
	"lucky": "运势：诸事吉祥顺利，凡事宜内求，不宜外求，防乐极生悲。 ",
	"emotion": "爱情：情投意合，良缘缔结。  ",
	"health": "疾病：久病不利，注意肠肺及头部之症。 ",
	"find": "失物：不会出现。 ",
	"sued": "诉讼：是非由小事化大，终可和解。",
	"bussiness": "",
	"finance": "",
	"def":"否泰反其类也",
	"story":"履而泰，然后安，故受之以泰；泰者通也",
	"poem":"喜报三元",
	"kind": "土"
}
/*
- -
- -
---
---
---
---
*/
six_random_NaJia["001111"] = {"icon":"䷡","key":"34",
	"name": "雷天大壮",
	"p": "坤宫",
	"1": "兄弟庚戌土",
	"2": "子孙庚申金",
	"3": "父母庚午火 世",
	"4": "兄弟甲辰土",
	"5": "官鬼甲寅木",
	"6": "妻财甲子水 应",
	"extname": "《易经》第三十四卦 大壮 雷天大壮 震上乾下 ",
	"extnameexp": "大壮：利贞。",
	"extexp": "彖曰：大壮，大者壮也。 刚以动，故壮。 大壮利贞；大者正也。正大而天地之情可见矣！",
	"extexp1": "象曰：壮于趾，其孚穷也。九二贞吉，以中也。小人用壮，君子罔也。藩决不羸，尚往也。丧羊于易，位不当也。不能退不能遂，不详也。艰则吉，咎不长也。",
	"ext": "《大壮》卦：占问有利。 ",
	"exp1": "初九：壮于趾，征凶，有孚。",
	"exp2": "倒数第一阳爻：伤于脚趾，出行是凶。有所收获。",
	"exp3": "九二：贞吉。",
	"exp4": "倒数第二阳爻：占问吉。",
	"exp5": "九三：小人用壮，君子用罔，贞厉。 羝羊触藩，羸其角。",
	"exp6": "倒数第三阳爻：小民（相争）用强力，贵族( 相争）用法网，占问有危险。公羊触篱笆，它的角被卡住了。",
	"exp7": "九四：贞吉悔亡，藩决不羸，壮于大舆之輹",
	"exp8": "倒数第四阳爻：占问吉，没有悔恨。（公羊触篱笆），篱笆破了，不卡住它的角，又触在大车的轮条上，（撞伤了）。",
	"exp9": "六五：丧羊于易，无悔。",
	"exp10": "倒数第五阴爻：（殷代的王亥）去易国贩羊，把羊丢了，没有悔恨。",
	"exp11": "上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。",
	"exp12": "最上阴爻：公羊触篱笆，（角被篱笆卡住）、不能退，不能进，无所利，在艰难中得到解脱就吉。",
	"exp13": "",
	"exp14": "",

	"base": " 雷在天上，大壮。君子以非礼弗履。雷电交加之象 声威大壮之意 居安思危 大勇",
	"general": "大象：雷声响亮，光明天际，为正大光明之象，又为强烈地动之象，为六冲卦之一。",
	"lucky": "运势：运势虽强，但已届极盛之时，宜心平气和，否则反招失败，须知物极必反。 ",
	"emotion": "爱情：只要保持仁和谦恭，则有成果，否则易招反悔。 ",
	"health": "疾病：生平少病者遇此卦则不利，注意急性呼吸道感染和脑疾等。 ",
	"find": "失物：不能取回。 ",
	"sued": "诉讼：忌与人斗气，宜和解收场否则两败俱伤。",
	"bussiness": "",
	"finance": "",
	"def":"大壮则止，遁则退也",
	"story":"物不可终遁，故受之以大壮",
	"poem":"工师得木",
	"kind": "土"
}
/*
- -
---
---
---
---
---
*/
six_random_NaJia["011111"] = {"icon":"䷪","key":"43",
	"name": "泽天夬",
	"p": "坤宫",
	"1": "兄弟丁未土",
	"2": "子孙丁酉金 世",
	"3": "妻财丁亥水",
	"4": "兄弟甲辰土",
	"5": "官鬼甲寅木 应",
	"6": "妻财甲子水",
	"f5": "父母巳火",
	"extname": "《易经》第四十三卦 夬 泽天夬 兑上乾下 ",
	"extnameexp": "夬：扬于王庭，孚号，有厉，告自邑，不利即戎，利有攸往。",
	"extexp": "彖曰：夬，决也，刚决柔也。健而说，决而和，扬于王庭，柔乘五刚也。孚号有厉，其危乃光也。 告自邑，不利即戎，所尚乃穷也。 利有攸往，刚长乃终也。",
	"extexp1": "象曰：不胜而往，咎也。有戎勿恤，得中道也。君子夬夬，终无咎也。其行次且，位不当也。闻言不信，聪不明也。中行无咎，中未光也。无号之凶，终不可长也。",
	"ext": "象曰：泽上于天，夬；君子以施禄及下，居德则忌。",
	"exp1": "初九：壮于前趾，往不胜为吝。",
	"exp2": "象曰：不胜而往，咎也。",
	"exp3": "九二：惕号，莫夜有戎，勿恤。",
	"exp4": "象曰：莫夜有戎，得中道也。",
	"exp5": "九三：壮于頄，有凶。 君子夬夬，独行遇雨，若濡有愠，无咎。",
	"exp6": "象曰：君子夬夬，终无咎也。",
	"exp7": "九四：臀无肤，其行次且。 牵羊悔亡，闻言不信。",
	"exp8": "象曰：其行次且，位不当也。 闻言不信，聪不明也。",
	"exp9": "九五：苋陆夬夬，中行无咎。",
	"exp10": "象曰：中行无咎，中未光也。",
	"exp11": "上六：无号，终有凶。",
	"exp12": "象曰：无号之凶，终不可长也。",
	"exp13": "",
	"exp14": "",

	"base": "泽上于天，夬。君子以施禄及下，居德则忌。水满成灾之象 排除阻隔之意 树德除恶 寡怨",
	"general": "大象：泽水积满而泛滥成灾，滔天之势。又五阳爻之盛势必除去唯一阴爻，故一阴孤立。",
	"lucky": "运势：目前虽吉，但困难及变动正在蕴酿中，宜提高警觉，忌骄傲，防口舌是非。 ",
	"emotion": "爱情：防止上介绍人的当，也应注意对方的目的。 ",
	"health": "疾病：病情重宜速治，防头部、呼吸系统、肿瘤等疾。",
	"find": "失物：相信失物已经损坏，不能寻回。 ",
	"sued": "诉讼：不宜与人争执，因势孤力弱，宜寻求法律途径解决。",
	"bussiness": "",
	"finance": "",
	"def":"夬决也，刚决柔也，君子道长，小人道忧也。",
	"story":"益而不已，必决，故受之以夬； 夬者决也",
	"poem":"游蜂脱网",
	"kind": "土"
}
/*
- -
---
- -
---
---
---
*/
six_random_NaJia["010111"] = {"icon":"䷄","key":"5",
	"name": "水天需",
	"p": "坤宫",
	"1": "妻财戊子水",
	"2": "兄弟戊戌土",
	"3": "子孙戊申金 世",
	"4": "兄弟甲辰土",
	"5": "官鬼甲寅木",
	"6": "妻财甲子水 应",
	"f5": "父母巳火",
	"extname": "《易经》第五卦 需 水天需 坎上乾下",
	"extnameexp": "需：有孚，光亨，贞吉。 利涉大川。",
	"extexp": "彖曰：需，须也；险在前也。 刚健而不陷，其义不困穷矣。 需有孚，光亨，贞吉。 位乎天位，以正中也。 利涉大川，往有功也。",
	"extexp1": "象曰：需于郊，不犯难行也。利用恒无咎，未失常也。需于沙，衍在中也。虽小有言，以终吉也。需于泥，灾在外也。自我致寇，敬慎不败也。需于血，顺以听也。酒食贞吉，以中正也。不速之客来，敬之终吉。虽不当位，未大失也。	",
	"ext": "《需》卦：有收获，大通顺，占问吉。渡大河有利。",
	"exp1": "初九：需于郊。 利用恒，无咎。",
	"exp2": "倒数第一阳爻：停留在郊野，有利于久处，无害。",
	"exp3": "九二：需于沙。 小有言，终吉。",
	"exp4": "倒数第二阳爻：停留在沙地，有小的谴责，结果是吉的。",
	"exp5": "九三：需于泥，致寇至。",
	"exp6": "倒数第三阳爻：停留在泥泞里，招致寇盗到来。",
	"exp7": "六四：需于血，出自穴。",
	"exp8": "倒数第四阴爻：停留在血泊里，从洞穴里出来。",
	"exp9": "九五：需于酒食，贞吉。",
	"exp10": "倒数第五阳爻：停留在饮食里，占问是吉的。",
	"exp11": "上六：入于穴，有不速之客三人来，敬之终吉。",
	"exp12": "最上阴爻：进入洞穴，有不请的客三人来，敬重他们终归吉的。",
	"bussiness": "",
	"finance": "",

	"base": "云上于天，需。君子以饮食宴乐。密云不雨之象　待机而动之意 守正待时 慎始",
	"general": "大象：云登天上而未雨，不能急进，等待时机之象。",
	"lucky": "运势：诸事不宜急进，以静制动为宜。 ",
	"emotion": "爱情：急进有失，缓进反成，欲速不达。 ",
	"health": "疾病：病情严重，为腹、肠胃、肌肉等慢性病。 ",
	"find": "失物：难以寻回，大部份均不知下落。 ",
	"sued": "诉讼：防房地产之争，宜和解，有始无终之兆。",
	"bussiness": "",
	"finance": "",
	"def":"需不进也，讼不亲也",
	"story":"物稚不可不养也，故受之以需；需者饮食之道也",
	"poem":"明珠出土",
	"kind": "土"
}
/*
- -
---
- -
- -
- -
- -
*/
six_random_NaJia["010000"] = {"icon":"䷇","key":"8",
	"name": "水地比",
	"p": "坤宫",
	"1": "妻财戊子水 应",
	"2": "兄弟戊戌土",
	"3": "子孙戊申金",
	"4": "官鬼乙卯木 世",
	"5": "父母乙巳火",
	"6": "兄弟乙未土",
	"extname": "《易经》第八卦 比 水地比 坎上下坤 ",
	"extnameexp": "比：吉。 原筮元永贞，无咎。 不宁方来，后夫凶。",
	"extexp": "彖曰：比，吉也，比，辅也，下顺从也。 原筮元永贞，无咎，以刚中也。不宁方来，上下应也。 后夫凶，其道穷也。",
	"extexp1": "象曰：比之初六，有它吉也。比之自内，不自失也。比之匪人，不亦伤乎？外比于贤，以从上也。显比之吉，位正中也。舍逆取顺，失前禽也。邑人不诫，上使中也。比之无首，无所终也。",
	"ext": "《比》卦：再筮大通顺。占问长期无害。不愿臣服的侯国来，迟到的人凶。",
	"exp1": "初六：有孚比之，无咎。 有孚盈缶，终来有他，吉。",
	"exp2": "倒数第一阴爻：得到俘虏，亲近他无害。得宝充满瓦器，最后有别的变故，也吉。",
	"exp3": "六二：比之自内，贞吉。",
	"exp4": "倒数第二阴爻：亲近他从内部做起，占问是吉的。",
	"exp5": "六三：比之匪人。",
	"exp6": "倒数第三阴爻：亲近不好的人，凶",
	"exp7": "六四：外比之，贞吉。",
	"exp8": "倒数第四阴爻：跟外部亲近，占问是吉的。",
	"exp9": "九五：显比，王用三驱，失前禽。 邑人不诫，吉。",
	"exp10": "倒数第五阳爻：亲附光明，王用三面合围去打猎，逃脱了在前面的禽兽。邑中的百姓不惊骇，吉。",
	"exp11": "上六：比之无首，凶。",
	"exp12": "利最上阴爻：和行为不端的人亲近，结果使自己丢掉脑袋，当然是不吉。",
	"exp13": "",
	"exp14": "",

	"base": "地上有水，比。先王以建万国，亲诸侯。众星拱月之象 安逸进取之意 诚信团结 有亲",
	"general": "大象：一阳统五阴，比邻相亲相辅，和乐之象。",
	"lucky": "运势：平顺可得贵人提拔，凡事宜速战速决，不可过份迟疑。 ",
	"emotion": "爱情：两情相悦，美好良缘。 ",
	"health": "疾病：新病宜速就医，久病则危，为腹、肾、耳等疾。 ",
	"find": "失物：不会再现。通常均已遭损毁。",
	"sued": "诉讼：宜以和解态度面对，虽小人多，但可胜诉。",
	"bussiness": "",
	"finance": "",
	"def":"乾刚，坤柔，比乐，师忧",
	"story":"师者众也。众必有所比，故受之以比；比者比也",
	"poem":"船得顺风",
	"kind": "土"
}

var startinfo;
var where = new Array();      //地区
var three_random = new Array();      //硬币取爻
var six_random = new Array();      //本爻
var six_change_random = new Array();      //变爻
var six_random_empty = new Array();
var six_random_myth = new Array();
var six_random_help_myth = new Array();
var six_random_date = new Array();
var six_random_draw = new Array();
var six_random_question = ""


var htmldraw = new Array();
var htmlchangedraw = new Array();
var htmlmythdraw = new Array();
var htmlnajiadraw = new Array();
var htmlnajiachangedraw = new Array();
var htmlchangeinfodraw = new Array();

//易经中用6、7、8、9四个数字代表老阴、少阳、少阴、老阳.
const sixtycycletable = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];
const oldnegativevalue = 6;                 //老阴
const negativevalue = 8;                    //少阴
const positivevalue = 7;                    //少阳    
const oldpositivevalue = 9                  //老阳
const positive = 1
const negative = 0
const randomtime = 6

const negativedraw = "--- ---";
const positivedraw = "-------";
const negativechangedraw = "X->";
const positivechangedraw = "O->";
const nonechangedraw = "      ";
const nonechangehtmldraw = "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;";
const negativehtmldraw = "▄▄&nbsp;&nbsp;&nbsp;▄▄";
const positivehtmldraw = "▄▄▄▄▄";
const nonajiahtmldraw = "&nbsp;&nbsp;&nbsp;&nbsp;";


var j = [43856, 19416, 19168, 42352, 21717, 53856, 55632, 25940, 22191,
	39632, 21970, 19168, 42422, 42192, 53840, 53845, 46415, 54944,
	44450, 38320, 18807, 18815, 42160, 46261, 27216, 27968, 43860,
	11119, 38256, 21234, 18800, 25958, 54432, 59984, 27285, 23263,
	11104, 34531, 37615, 51415, 51551, 54432, 55462, 46431, 22176,
	42420, 9695, 37584, 53938, 43344, 46423, 27808, 46416, 21333,
	19887, 42416, 17779, 21183, 43432, 59728, 27296, 44710, 43856,
	19296, 43748, 42352, 21088, 62051, 55632, 23383, 22176, 38608,
	19925, 19152, 42192, 54484, 53840, 54616, 46400, 46752, 38310,
	38335, 18864, 43380, 42160, 45690, 27216, 27968, 44870, 43872,
	38256, 19189, 18800, 25776, 29859, 59984, 27480, 23232, 43872,
	38613, 37600, 51552, 55636, 54432, 55888, 30034, 22176, 43959,
	9680, 37584, 51893, 43344, 46240, 47780, 44368, 21977, 19360,
	42416, 20854, 21183, 43312, 31060, 27296, 44368, 23378, 19296,
	42726, 42208, 53856, 60005, 54576, 23200, 30371, 38608, 19195,
	19152, 42192, 53430, 53855, 54560, 56645, 46496, 22224, 21938,
	18864, 42359, 42160, 43600, 45653, 27951, 44448, 19299, 37759,
	18936, 18800, 25776, 26790, 59999, 27424, 42692, 43759, 37600,
	53987, 51552, 54615, 54432, 55888, 23893, 22176, 42704, 21972,
	21200, 43448, 43344, 46240, 46758, 44368, 21920, 43940, 42416,
	21168, 45683, 26928, 29495, 27296, 44368, 19285, 19311, 42352,
	21732, 53856, 59752, 54560, 55968, 27302, 22239, 19168, 43476,
	42192, 53584, 62034, 54560];
var o = ['9778397bd097c36b0b6fc9274c91aa', '97b6b97bd19801ec9210c965cc920e', '97bcf97c3598082c95f8c965cc920f',
	'97bd0b06bdb0722c965ce1cfcc920f', 'b027097bd097c36b0b6fc9274c91aa', '97b6b97bd19801ec9210c965cc920e',
	'97bcf97c359801ec95f8c965cc920f', '97bd0b06bdb0722c965ce1cfcc920f', 'b027097bd097c36b0b6fc9274c91aa',
	'97b6b97bd19801ec9210c965cc920e', '97bcf97c359801ec95f8c965cc920f', '97bd0b06bdb0722c965ce1cfcc920f',
	'b027097bd097c36b0b6fc9274c91aa', '9778397bd19801ec9210c965cc920e', '97b6b97bd19801ec95f8c965cc920f',
	'97bd09801d98082c95f8e1cfcc920f', '97bd097bd097c36b0b6fc9210c8dc2', '9778397bd197c36c9210c9274c91aa',
	'97b6b97bd19801ec95f8c965cc920e', '97bd09801d98082c95f8e1cfcc920f', '97bd097bd097c36b0b6fc9210c8dc2',
	'9778397bd097c36c9210c9274c91aa', '97b6b97bd19801ec95f8c965cc920e', '97bcf97c3598082c95f8e1cfcc920f',
	'97bd097bd097c36b0b6fc9210c8dc2', '9778397bd097c36c9210c9274c91aa', '97b6b97bd19801ec9210c965cc920e',
	'97bcf97c3598082c95f8c965cc920f', '97bd097bd097c35b0b6fc920fb0722', '9778397bd097c36b0b6fc9274c91aa',
	'97b6b97bd19801ec9210c965cc920e', '97bcf97c3598082c95f8c965cc920f', '97bd097bd097c35b0b6fc920fb0722',
	'9778397bd097c36b0b6fc9274c91aa', '97b6b97bd19801ec9210c965cc920e', '97bcf97c359801ec95f8c965cc920f',
	'97bd097bd097c35b0b6fc920fb0722', '9778397bd097c36b0b6fc9274c91aa', '97b6b97bd19801ec9210c965cc920e',
	'97bcf97c359801ec95f8c965cc920f', '97bd097bd097c35b0b6fc920fb0722', '9778397bd097c36b0b6fc9274c91aa',
	'97b6b97bd19801ec9210c965cc920e', '97bcf97c359801ec95f8c965cc920f', '97bd097bd07f595b0b6fc920fb0722',
	'9778397bd097c36b0b6fc9210c8dc2', '9778397bd19801ec9210c9274c920e', '97b6b97bd19801ec95f8c965cc920f',
	'97bd07f5307f595b0b0bc920fb0722', '7f0e397bd097c36b0b6fc9210c8dc2', '9778397bd097c36c9210c9274c920e',
	'97b6b97bd19801ec95f8c965cc920f', '97bd07f5307f595b0b0bc920fb0722', '7f0e397bd097c36b0b6fc9210c8dc2',
	'9778397bd097c36c9210c9274c91aa', '97b6b97bd19801ec9210c965cc920e', '97bd07f1487f595b0b0bc920fb0722',
	'7f0e397bd097c36b0b6fc9210c8dc2', '9778397bd097c36b0b6fc9274c91aa', '97b6b97bd19801ec9210c965cc920e',
	'97bcf7f1487f595b0b0bb0b6fb0722', '7f0e397bd097c35b0b6fc920fb0722', '9778397bd097c36b0b6fc9274c91aa',
	'97b6b97bd19801ec9210c965cc920e', '97bcf7f1487f595b0b0bb0b6fb0722', '7f0e397bd097c35b0b6fc920fb0722',
	'9778397bd097c36b0b6fc9274c91aa', '97b6b97bd19801ec9210c965cc920e', '97bcf7f1487f531b0b0bb0b6fb0722',
	'7f0e397bd097c35b0b6fc920fb0722', '9778397bd097c36b0b6fc9274c91aa', '97b6b97bd19801ec9210c965cc920e',
	'97bcf7f1487f531b0b0bb0b6fb0722', '7f0e397bd07f595b0b6fc920fb0722', '9778397bd097c36b0b6fc9274c91aa',
	'97b6b97bd19801ec9210c9274c920e', '97bcf7f0e47f531b0b0bb0b6fb0722', '7f0e397bd07f595b0b0bc920fb0722',
	'9778397bd097c36b0b6fc9210c91aa', '97b6b97bd197c36c9210c9274c920e', '97bcf7f0e47f531b0b0bb0b6fb0722',
	'7f0e397bd07f595b0b0bc920fb0722', '9778397bd097c36b0b6fc9210c8dc2', '9778397bd097c36c9210c9274c920e',
	'97b6b7f0e47f531b0723b0b6fb0722', '7f0e37f5307f595b0b0bc920fb0722', '7f0e397bd097c36b0b6fc9210c8dc2',
	'9778397bd097c36b0b70c9274c91aa', '97b6b7f0e47f531b0723b0b6fb0721', '7f0e37f1487f595b0b0bb0b6fb0722',
	'7f0e397bd097c35b0b6fc9210c8dc2', '9778397bd097c36b0b6fc9274c91aa', '97b6b7f0e47f531b0723b0b6fb0721',
	'7f0e27f1487f595b0b0bb0b6fb0722', '7f0e397bd097c35b0b6fc920fb0722', '9778397bd097c36b0b6fc9274c91aa',
	'97b6b7f0e47f531b0723b0b6fb0721', '7f0e27f1487f531b0b0bb0b6fb0722', '7f0e397bd097c35b0b6fc920fb0722',
	'9778397bd097c36b0b6fc9274c91aa', '97b6b7f0e47f531b0723b0b6fb0721', '7f0e27f1487f531b0b0bb0b6fb0722',
	'7f0e397bd097c35b0b6fc920fb0722', '9778397bd097c36b0b6fc9274c91aa', '97b6b7f0e47f531b0723b0b6fb0721',
	'7f0e27f1487f531b0b0bb0b6fb0722', '7f0e397bd07f595b0b0bc920fb0722', '9778397bd097c36b0b6fc9274c91aa',
	'97b6b7f0e47f531b0723b0787b0721', '7f0e27f0e47f531b0b0bb0b6fb0722', '7f0e397bd07f595b0b0bc920fb0722',
	'9778397bd097c36b0b6fc9210c91aa', '97b6b7f0e47f149b0723b0787b0721', '7f0e27f0e47f531b0723b0b6fb0722',
	'7f0e397bd07f595b0b0bc920fb0722', '9778397bd097c36b0b6fc9210c8dc2', '977837f0e37f149b0723b0787b0721',
	'7f07e7f0e47f531b0723b0b6fb0722', '7f0e37f5307f595b0b0bc920fb0722', '7f0e397bd097c35b0b6fc9210c8dc2',
	'977837f0e37f14998082b0787b0721', '7f07e7f0e47f531b0723b0b6fb0721', '7f0e37f1487f595b0b0bb0b6fb0722',
	'7f0e397bd097c35b0b6fc9210c8dc2', '977837f0e37f14998082b0787b06bd', '7f07e7f0e47f531b0723b0b6fb0721',
	'7f0e27f1487f531b0b0bb0b6fb0722', '7f0e397bd097c35b0b6fc920fb0722', '977837f0e37f14998082b0787b06bd',
	'7f07e7f0e47f531b0723b0b6fb0721', '7f0e27f1487f531b0b0bb0b6fb0722', '7f0e397bd097c35b0b6fc920fb0722',
	'977837f0e37f14998082b0787b06bd', '7f07e7f0e47f531b0723b0b6fb0721', '7f0e27f1487f531b0b0bb0b6fb0722',
	'7f0e397bd07f595b0b0bc920fb0722', '977837f0e37f14998082b0787b06bd', '7f07e7f0e47f531b0723b0b6fb0721',
	'7f0e27f1487f531b0b0bb0b6fb0722', '7f0e397bd07f595b0b0bc920fb0722', '977837f0e37f14998082b0787b06bd',
	'7f07e7f0e47f149b0723b0787b0721', '7f0e27f0e47f531b0b0bb0b6fb0722', '7f0e397bd07f595b0b0bc920fb0722',
	'977837f0e37f14998082b0723b06bd', '7f07e7f0e37f149b0723b0787b0721', '7f0e27f0e47f531b0723b0b6fb0722',
	'7f0e397bd07f595b0b0bc920fb0722', '977837f0e37f14898082b0723b02d5', '7ec967f0e37f14998082b0787b0721',
	'7f07e7f0e47f531b0723b0b6fb0722', '7f0e37f1487f595b0b0bb0b6fb0722', '7f0e37f0e37f14898082b0723b02d5',
	'7ec967f0e37f14998082b0787b0721', '7f07e7f0e47f531b0723b0b6fb0722', '7f0e37f1487f531b0b0bb0b6fb0722',
	'7f0e37f0e37f14898082b0723b02d5', '7ec967f0e37f14998082b0787b06bd', '7f07e7f0e47f531b0723b0b6fb0721',
	'7f0e37f1487f531b0b0bb0b6fb0722', '7f0e37f0e37f14898082b072297c35', '7ec967f0e37f14998082b0787b06bd',
	'7f07e7f0e47f531b0723b0b6fb0721', '7f0e27f1487f531b0b0bb0b6fb0722', '7f0e37f0e37f14898082b072297c35',
	'7ec967f0e37f14998082b0787b06bd', '7f07e7f0e47f531b0723b0b6fb0721', '7f0e27f1487f531b0b0bb0b6fb0722',
	'7f0e37f0e366aa89801eb072297c35', '7ec967f0e37f14998082b0787b06bd', '7f07e7f0e47f149b0723b0787b0721',
	'7f0e27f1487f531b0b0bb0b6fb0722', '7f0e37f0e366aa89801eb072297c35', '7ec967f0e37f14998082b0723b06bd',
	'7f07e7f0e47f149b0723b0787b0721', '7f0e27f0e47f531b0723b0b6fb0722', '7f0e37f0e366aa89801eb072297c35',
	'7ec967f0e37f14998082b0723b06bd', '7f07e7f0e37f14998083b0787b0721', '7f0e27f0e47f531b0723b0b6fb0722',
	'7f0e37f0e366aa89801eb072297c35', '7ec967f0e37f14898082b0723b02d5', '7f07e7f0e37f14998082b0787b0721',
	'7f07e7f0e47f531b0723b0b6fb0722', '7f0e36665b66aa89801e9808297c35', '665f67f0e37f14898082b0723b02d5',
	'7ec967f0e37f14998082b0787b0721', '7f07e7f0e47f531b0723b0b6fb0722', '7f0e36665b66a449801e9808297c35',
	'665f67f0e37f14898082b0723b02d5', '7ec967f0e37f14998082b0787b06bd', '7f07e7f0e47f531b0723b0b6fb0721',
	'7f0e36665b66a449801e9808297c35', '665f67f0e37f14898082b072297c35', '7ec967f0e37f14998082b0787b06bd',
	'7f07e7f0e47f531b0723b0b6fb0721', '7f0e26665b66a449801e9808297c35', '665f67f0e37f1489801eb072297c35',
	'7ec967f0e37f14998082b0787b06bd', '7f07e7f0e47f531b0723b0b6fb0721', '7f0e27f1487f531b0b0bb0b6fb0722'];
var l = ["小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑", "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪", "冬至"];
var h = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];
var d = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];
var p = ["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"];
var k = ["初", "十", "廿", "三十"];
var g = ["", "一", "二", "三", "四", "五", "六", "七", "八", "九"];
var n = ["正", "二", "三", "四", "五", "六", "七", "八", "九", "十", "十一", "腊"];

function comefrom(loca, locacity) { this.loca = loca; this.locacity = locacity; }
where[0] = new comefrom("选择省份", "选择城市");
where[1] = new comefrom("福建", "|安溪|长乐|长泰|长汀|崇安|大田|德化|东山|福安|福鼎|福清|福州|光泽|华安|惠安|吉田|建宁|建瓯|将乐|金门|晋江|连城|连江|龙海|龙溪|龙岩|罗源|闽侯|闽清|明溪|南安|南靖|南平|宁德|宁化|平和|平潭|屏南|莆田|浦城|清流|泉州|三明|沙县|上杭|邵武|寿宁|顺昌|松溪|泰宁|同安|武平|霞浦|厦门|仙游|永安|永春|永定|永泰|云霄|漳平|漳浦|漳州|诏安|柘荣|政和|周宁");
where[2] = new comefrom("广东", "|宝安|博罗|潮安|潮阳|潮州|澄海|从化|大埔|德庆|电白|东莞|斗门|恩平|番禺|丰顺|封开|佛岗|佛山|高明|高要|高州|广宁|广州|海丰|海康|海口|和平|河源|鹤山|洪江|花县|化州|怀集|惠东|惠来|惠阳|惠州|江门|蕉岭|揭西|揭阳|开平|乐昌|连南|连平|连山|连县|廉江|龙川|龙门|陆丰|罗定|茂名|梅县|梅州|南澳|南海|南雄|平远|普宁|清远|曲江|饶平|仁化|乳源|三水|汕头|韶关|深圳|始兴|顺德|四会|遂溪|台山|翁源|吴川|五华|新会|新十|新兴|信宜|兴宁|徐闻|阳春|阳江|阳山|英德|郁南|云浮|增城|肇庆|中山|珠海|紫金");
where[3] = new comefrom("北京", "|北京|昌平|大兴|房山|怀柔|密云|平谷|顺义|通县|延庆");
where[4] = new comefrom("上海", "|宝山|崇明|川沙|奉贤|嘉定|金山|南汇|青浦|上海|松江");
where[5] = new comefrom("天津", "|宝坻|蓟县|静海|宁河|天津|武清");
where[6] = new comefrom("重庆", "|壁山|长寿|大足|合川|南桐|綦江|荣昌|铜梁|潼南|万盛|永川|重庆");
where[7] = new comefrom("河北", "|安次|安国|安平|安新|霸县|柏乡|保定|泊头|博野|沧州|昌黎|成安|承德|赤城|崇礼|磁县|大厂|大城|大名|定县|定兴|东光|肥乡|丰南|丰宁|丰润|抚宁|阜城|阜平|高阳|高邑|藁城|沽源|固安|故城|馆陶|广平|广宗|海兴|邯郸|河间|衡水|怀安|怀来|黄骅|获鹿|鸡泽|冀县|交河|晋县|井陉|景县|巨鹿|康保|宽城|涞水|涞源|廊坊|乐亭|蠡县|临城|临西|临漳|灵寿|隆化|隆尧|卢龙|栾城|滦南|滦平|滦县|满城|孟村|内丘|南官|南和|南皮|宁普|平泉|平山|平乡|迁安|迁西|秦皇岛|青龙|青县|清河|清苑|丘县|曲阳|曲周|饶阳|任丘|任县|容城|三河|沙河|尚义|涉县|深县|深泽|石家庄|束鹿|肃宁|唐海|唐山|唐县|完县|万全|望都|威县|围场|蔚县|魏县|文安|无极|吴桥|武安|武强|武邑|献县|香河|新城|新河|新乐|兴隆|行唐|邢台|雄县|徐水|宣化|盐山|阳原|易县|永年|永清|玉田|元氏|赞皇|枣强|张北|张家口|赵县|正定|涿鹿|涿县|遵化");
where[8] = new comefrom("山西", "|安泽|保德|长治|长子|大宁|大同|代县|定襄|繁峙|方由|汾西|汾阳|浮山|高平|古县|广灵|和顺|河津|河曲|洪洞|侯马|壶关|怀仁|浑源|霍县|吉县|稷山|绛县|交城|交口|介休|晋城|静乐|岢岚|岚县|离石|黎城|临汾|临县|临猗|灵丘|灵石|陵川|柳林|娄烦|潞城|孟县|宁武|偏关|平定|平鲁|平陆|平顺|平遥|蒲县|祁县|沁水|沁县|沁源|清徐|曲沃|芮城|山阴|神池|石楼|寿阳|朔县|太谷|太原|天镇|屯留|万荣|文水|闻喜|五台|五寨|武乡|昔阳|夏县|乡宁|襄汾|襄垣|孝义|忻县|新绛|兴县|阳城|阳高|阳曲|阳泉|翼城|应县|永和|永济|右玉|榆次|榆社|垣曲|原平|运城|中阳|左权|左云");
where[9] = new comefrom("内蒙古", "|阿巴嘎旗|阿巴哈纳尔旗|阿拉善右旗|阿拉善左旗|阿鲁科尔沁旗|阿荣旗|敖汉旗|巴林右旗|巴林左旗|包头|布特哈旗|察哈尔右翼后旗|察哈尔右翼前旗|察哈尔右翼中旗|陈巴尔虎旗|赤峰|达尔罕茂明安联合旗|达拉特旗|磴口|东胜县|东乌珠穆沁旗|多伦|额尔古纳右旗|额尔古纳左旗|额济纳旗|鄂伦春自治旗|鄂托克旗|鄂托克前旗|鄂温克族自治旗|二连浩特|丰镇|固阳|海拉尔|杭锦后旗|杭锦旗|和林格尔|呼和浩特|化德|集宁|喀喇沁旗|开鲁|科尔沁右翼前旗|科尔沁右翼中旗|科尔沁左翼后旗|科尔沁左翼中旗|克什克腾旗|库伦旗|凉城|林西|临河|满洲里|莫力达瓦达斡尔族自治旗|奈曼旗|宁城|清水河|商都|上默特右旗|上默特左旗|四子王旗|苏尼特右旗|苏尼特左旗|太仆寺旗|通辽|突泉|托克托|翁牛特旗|乌海|乌拉特后旗|乌拉特前旗|乌拉特中旗|乌兰浩特|乌审旗|五原|武川|西乌珠穆沁旗|喜桂图旗|镶黄旗|新巴尔虎右旗|新巴尔虎左旗|兴和|伊金霍洛旗|伊克昭盟|扎鲁特旗|正蓝旗|正镶白旗|准格尔旗|卓资");
where[10] = new comefrom("辽宁", "|鞍由|北票|北镇|本溪|昌图|长海|朝阳|大连|大洼|丹东|灯塔|东沟|法库|凤城|抚顺|阜新|复县|盖县|海城|黑山|建昌|建平|金县|锦西|锦县|锦州|开原|康平|宽甸|辽阳|辽中|凌源|盘山|清原|沈阳|绥中|台安|铁法|铁岭|西丰|新宾|新金|新民|兴城|岫岩|义县|营口|垣仁|彰武|庄河");
where[11] = new comefrom("吉林", "|安图|白城|长白|长春|长岭|大安|德惠|东丰|敦化|扶余|抚松|海龙|和龙|桦甸|怀德|珲春|辉南|浑江|吉林|集安|蛟河|靖宇|九台|梨树|辽源|柳河|农安|磐石|乾安|舒兰|双辽|双阳|四平|洮安|通化|通榆|图们|汪清|延吉|伊通|永吉|榆树");
where[12] = new comefrom("黑龙江", "|阿城|爱辉|安达|巴彦|拜泉|宝清|北安|宾县|勃利|大庆|德都|东宁|杜尔伯特|方正|抚远|富锦|富裕|甘南|哈尔滨|海林|海伦|鹤岗|黑河|呼兰|呼玛|虎林|桦川|桦南|鸡东|鸡四|集贤|加格达奇|佳木斯|嘉荫|克东|克山|兰西|林甸|林口|龙江|萝北|密山|明水|漠河|牡丹江|木兰|穆棱|讷河|嫩江|宁安|七台河|齐齐哈尔|青岗|庆安|饶河|尚志|双城|双鸭山|绥滨|绥芬河|绥化|绥棱|孙吴|塔河|泰来|汤源|铁力|通北|通河|同江|望奎|五常|逊克|延寿|伊春|依安|依兰|肇东|肇源|肇州");
where[13] = new comefrom("安徽", "|合肥|长丰|淮南|凤台|淮北|濉溪|芜湖|铜陵|蚌埠|马鞍山|安庆|宿州|宿县|砀山|萧县|吴壁|泗县|五河|固镇|怀远|滁州|嘉山|天长|来安|全椒|定远|凤阳|巢湖|巢县|肥东|含山|和县|无为|卢江|宣城|当涂|郎溪|广德|泾县|南陵|繁昌|宁国|青阳|屯溪|休宁|旌得|绩溪|歙县|祁门|黟县|太平|石台|桐城|纵阳|怀宁|望江|宿松|太湖|岳西|潜山|东至|贵池|六安|霍丘|寿县|肥西|舒城|霍山|金寨|阜阳|毫县|涡阳|蒙城|利辛|颖上|阜南|临泉|界首|太和");
where[14] = new comefrom("江苏", "|宝应|滨海|常熟|常州|大丰|丹徒|丹阳|东海|东台|丰县|阜宁|赣榆|高淳|高邮|灌南|灌云|海安|海门|邗江|洪泽|淮安|淮阴|建湖|江都|江宁|江浦|江阴|金湖|金坛|靖江|句容|昆山|溧水|溧阳|连云港|涟水|六合|南京|南通|沛县|邳县|启东|清江|如东|如皋|沙洲|射阳|沭阳|泗洪|泗阳|苏州|宿迁|睢宁|太仓|泰县|泰兴|泰州|铜山|无锡|吴江|吴县|武进|响水|新沂|兴化|盱眙|徐州|盐城|扬中|扬州|仪征|宜兴|镇江");
where[15] = new comefrom("江西", "|安福|安义|安远|波阳|崇仁|崇义|大余|德安|德兴|定南|东乡|都昌|分宜|丰城|奉新|抚州|赣县|赣州|高安|广昌|广丰|贵溪|横峰|湖口|会昌|吉安|吉水|金溪|进贤|井冈山|景德镇|靖安|九江|乐安|乐平|黎川|莲花|临川|龙南|南昌|南城|南丰|南康|宁都|宁冈|彭泽|萍乡|铅山|清江|全南|瑞昌|瑞金|上高|上饶|上犹|石城|遂川|泰和|铜鼓|万安|万年|万载|武宁|婺源|峡江|新干|新建|新余|信丰|兴国|星子|修永|寻乌|宜春|宜丰|宜黄|弋阳|鹰潭|永丰|永新|永修|于都|于干|余江|玉山|资溪");
where[16] = new comefrom("山东", "|安丘|滨县|滨州|博兴|仓山|曹县|昌乐|昌邑|长岛|长清|成武|茌平|单县|德州|定陶|东阿|东明|东平|东营|肥城|费县|福山|高都|高密|高青|高唐|冠县|广饶|海阳|荷泽|桓台|黄县|惠民|即墨|济南|济宁|济阳|嘉祥|胶南|胶县|金乡|莒南|巨野|鄄城|垦利|莱芜|莱西|莱阳|崂山|乐陵|历城|利津|梁山|聊城|临清|临朐|临沭|临沂|临邑|陵县|蒙阴|牟平|宁津|宁阳|蓬莱|平度|平邑|平阴|平原|栖霞|齐河|青岛|庆云|曲阜|日照|荣成|乳山|商河|寿光|泗水|泰安|郯城|滕县|威海|微山|潍坊|潍县|文登|汶上|无棣|五莲|武城|夏津|莘县|新泰|新汶|烟台|兖州|阳谷|阳信|掖县|沂南|沂水|沂源|营县|鱼台|禹城|郓城|枣庄|沾化|章丘|招远|诸城|淄博|邹平|邹县");
where[17] = new comefrom("河南", "|安阳|宝丰|博爱|长葛|长垣|郸城|登封|邓县|范县|方城|封丘|扶沟|巩县|固始|光山|鹤壁|滑县|淮滨|淮阳|潢川|辉县|获嘉|汲县|济源|郏县|焦作|浚县|开封|兰考|林县|临汝|临颖|灵宝|卢氏|鲁山|鹿邑|栾川|罗山|洛宁|洛阳|漯河|孟津|孟县|泌阳|密县|民权|内黄|内乡|南乐|南阳|南召|宁陵|平顶山|平舆|濮阳|淇县|杞县|沁阳|清丰|确山|汝南|汝阳|三门峡|陕县|商城|商丘|商水|上蔡|社旗|沈丘|渑池|嵩县|睢县|遂平|台前|太康|汤阴|唐河|通许|桐柏|尉氏|温贺|武陟|舞阳|西华|西平|西峡|息县|淅川|夏邑|襄城|项城|新安|新蔡|新县|新乡|新野|新郑|信阳|修武|许昌|鄢县|延津|偃师|郾城|叶县|伊川|宜阳|义马|荥阳|永城|虞城|禹县|原阳|柘城|镇平|正阳|郑州|中牟|周口|驻马店");
where[18] = new comefrom("湖北", "|安陆|崇阳|大悟|鄂城|广济|汉川|汉阳|红安|黄陂|黄冈|黄梅|黄石|嘉鱼|监利|江陵|京山|荆门|罗川|麻城|蒲圻|蕲春|沙市|十堰|石首|通城|通山|武昌|武汉|浠水|咸宁|襄樊|孝感|新洲|阳新|宜昌|应城|应山|英山|云梦|钟祥");
where[19] = new comefrom("湖南", "|安化|安仁|安乡|保靖|茶陵|长沙|常德|常宁|郴县|郴州|辰溪|城步|慈利|大庸|道县|东安|洞口|凤凰|古丈|桂东|桂阳|汉寿|衡东|衡南|衡山|衡阳|洪江|花垣|华容|怀化|会同|吉首|嘉禾|江华|江永|津市|靖县|来阳|蓝山|泪罗|冷水江|澧县|醴陵|涟源|临澧|临武|临湘|零陵|酃县|浏阳|龙山|隆回|娄底|泸溪|麻阳|南县|宁乡|宁远|平江|祁东|祁阳|黔阳|汝城|桑植|邵东|邵阳|石门|双峰|双牌|绥宁|桃江|桃源|通道|望城|武冈|湘潭|湘乡|湘阴|新化|新晃|新宁|新邵|新田|溆浦|宜章|益阳|永顺|永兴|永州|攸县|沅江|沅陵|岳阳|芷江|株洲|资兴");
where[20] = new comefrom("浙江", "|安吉|苍南|长兴|常山|淳安|慈溪|岱山|德清|定海|东阳|洞头|奉化|富阳|海宁|海盐|杭州|湖州|黄岩|嘉善|嘉兴|建德|江山|椒江|金华|缙云|开化|兰溪|乐清|丽水|临安|临海|龙泉|宁波|宁海|瓯海|平湖|平阳|浦江|普陀|青田|庆无|衢州|瑞安|三门|上虞|绍兴|嵊四|嵊县|松阳|遂昌|泰顺|天台|桐庐|桐乡|温岭|温州|文成|武义|仙居|象山|萧山|新昌|义乌|鄞县|永康|永喜|余杭|余姚|玉环|云和|镇海|诸暨");
where[21] = new comefrom("广西", "|巴马|百色|北海|北流|宾阳|博白|苍悟|岑溪|崇左|大新|德保|东兰|都安|防城|凤山|扶绥|富川|恭城|灌阳|贵县|桂林|桂平|合浦|合山|河池|贺县|横县|环江|金秀|靖西|来宾|乐业|荔浦|临桂|灵川|灵山|凌云|柳城|柳江|柳州|龙胜|龙州|隆安|隆林|陆川|鹿寨|罗城|马山|蒙山|那坡|南丹|南宁|宁明|平果|平乐|平南|凭祥|浦北|钦州|全州|容县|融安|融水|三江|上林|上思|藤县|天等|天峨|田东|田林|田阳|梧州|武鸣|武宜|西林|象州|忻城|兴安|宜山|邕宁|永福|玉林|昭平|钟山|资源");
where[22] = new comefrom("海南", "|白沙|保亭|昌江|澄迈|儋县|定安|东方|海口|乐东|临高|陵水|琼海|琼山|琼中|屯昌|万宁|文昌|崖县");
where[23] = new comefrom("四川", "|阿坝|安县|安岳|巴塘|巴中|白玉|百沙|宝兴|北川|布拖|苍溪|长宁|成都|城口|崇庆|达县|大邑|大竹|丹巴|丹棱|道孚|稻城|得荣|德昌|德格|德阳|垫江|娥眉|峨边|丰都|奉节|涪陵|富顺|甘洛|甘孜|高县|古蔺|灌县|光元|广安|广汉|汉源|合江|黑水|红原|洪雅|华云|会东|会理|夹江|犍为|简阳|剑阁|江安|江油|金川|金口|金堂|金阳|井研|九龙|筠连|开江|开县|康定|来易|阆中|乐由|乐至|雷波|理塘|理县|梁平|邻水|隆昌|芦山|泸定|泸县|泸州|炉霍|马边|马尔康|茂汶|眉由|美姑|绵阳|绵竹|冕宁|名山|木里|沐川|内江|纳溪|南部|南川|南江|南坪|南溪|南允|宁南|彭水|彭县|彭由|蓬安|蓬溪|郫县|平昌|平武|屏由|蒲江|普格|琪县|黔江|青川|青神|邛崃|渠县|壤塘|仁寿|荣经|若尔盖|三台|色达|射洪|什邡|石棉|石渠|石柱|双流|松潘|遂宁|天全|通江|万县|万源|旺苍|威远|温江|汶川|巫山|巫溪|武隆|武胜|西昌|西阳|西允|喜德|乡城|小金|新都|新津|新龙|兴文|秀山|叙水|雅安|雅江|盐边|盐亭|盐源|仪陇|宜宾|宜汉|营山|岳池|越西|云阳|昭觉|中江|忠县|资阳|资中|梓潼");
where[24] = new comefrom("贵州", "|安龙|安顺|毕节|册亭|岑巩|长顺|赤水|从江|大方|丹寨|道真|德江|都匀|独山|凤冈|福泉|关岭|贵定|贵阳|赫章|黄平|惠水|剑河|江口|金沙|锦屏|开阳|凯里|雷山|黎平|荔波|六盘水|六枝|龙里|罗甸|麻江|湄潭|钠雍|盘县|平坝|平塘|普安|普定|黔西|清镇|晴龙|仁怀|榕江|三都|三穗|师阡|施秉|水城|思南|松桃|绥阳|台江|天柱|桐梓|铜仁|万山|望谟|威宁|瓮安|务川|息烽|习水|兴仁|兴义|修文|沿河|印江|余庆|玉屏|贞丰|镇宁|镇远|正安|织金|紫云|遵义");
where[25] = new comefrom("云南", "|安宁|保由|碧江|宾川|沧源|昌宁|呈贡|澄江|楚雄|大关|大理|大姚|德钦|峨山|洱源|凤庆|福贡|富民|富宁|富源|个旧|耿马|贡山|沽益|广南|河口|鹤庆|黑江|红河|华宁|华坪|会泽|建水|剑川|江城|江川|金平|晋宁|景东|景谷|景淇|开远|昆明|兰坪|澜沦|丽江|梁河|临沦|龙陵|陇川|泸水|泸西|鲁甸|陆良|禄丰|禄劝|路南|潞西|绿春|罗平|麻栗坡|马关|马龙|勐海|勐腊|蒙自|孟连|弥渡|弥勒|牟定|南华|南涧|宁蒗|屏边|普洱|巧家|丘北|曲靖|瑞丽|师宗|施甸|石屏|双柏|双江|思茅|嵩明|绥江|腾冲|通海|畹町|威信|巍山|维西|文山|武定|西畴|西盟|下关|祥云|新平|宣威|寻甸|盐津|砚山|漾濞|姚安|宜良|彝良|易门|盈江|永德|永富|永平|永仁|永善|永胜|玉溪|元江|元谋|元阳|云龙|云县|昭通|镇康|镇雄|镇沅|中甸");
where[26] = new comefrom("西藏", "|安多|昂仁|八宿|巴青|白朗|班戈|比如|边坝|波密|察雅|察隅|措美|措勤|错那|达孜|当雄|丁青|定结|定日|堆龙德庆|噶尔|改则|岗巴|革吉|工布江达|贡嘎|贡觉|吉隆|加查|嘉黎|江达|江孜|康马|拉萨|拉孜|朗县|浪卡子|类乌齐|林芝|林周|隆子|吕都|洛隆|洛扎|芒康|米林|墨脱|墨竹工卡|那曲|乃东|南木林|尼木|聂拉木|聂荣|普兰|穷结|曲水|曲松|仁布|日喀则|日上|萨嘎|萨迦|桑日|申扎|索县|谢通门|亚东|扎达|扎囊|仲巴|左贡");
where[27] = new comefrom("陕西", "|安康|安寨|白河|白水|宝鸡|彬县|长安|长武|成城|城固|淳化|丹凤|定边|凤县|凤翔|佛坪|浮风|府谷|富平|富县|甘泉|高陵|韩城|汉阴|汉中|合阳|横山|户县|华县|华阴|黄陵|黄龙|佳县|泾阳|靖边|岚皋|蓝田|礼泉|临潼|麟游|留坝|陇县|略阳|洛川|洛南|眉县|米脂|勉县|南郑|宁强|宁陕|平利|蒲城|岐山|千阳|乾县|清涧|人荔|三原|山阳|商南|商县|神木|石泉|绥德|太白|铜川|潼关|渭南|吴堡|吴旗|武功|西安|西乡|咸阳|兴平|旬阳|旬邑|延安|延长|延川|洋县|耀县|宜川|宜君|永寿|榆林|镇安|镇巴|镇坪|志丹|周至|子长|子洲|紫阳|柞水");
where[28] = new comefrom("甘肃", "|阿克塞|安西|成县|崇信|宕昌|迭部|定西|东乡|敦煌|甘谷|皋兰|高台|古浪|广河|合水|和政|华池|华亭|环县|徽县|会宁|积石山|金塔|泾川|景泰|靖远|静宁|酒泉|康乐|康县|兰州|礼县|两当|临潭|临洮|临夏|临泽|灵台|陇西|碌曲|玛曲|民乐|民勤|岷县|宁县|平凉|秦安|清水|庆阳|山丹|肃北|肃南|天水|天祝|通渭|渭源|文县|武都|武山|武威|西和|下河|永昌|永登|永靖|榆中|玉门|张家川|张掖|漳县|镇源|舟曲|庄浪|庄宁|卓尼");
where[29] = new comefrom("宁夏", "|固原|海原|贺兰|泾源|灵武|隆德|平罗|青铜峡|石嘴山|陶乐|同心|吴忠|西吉|盐池|银川|永宁|中宁|中卫");
where[30] = new comefrom("青海", "|班玛|称多|达日|大通|都兰|甘德|刚察|格尔木|共和|贵德|贵南|海晏|河南|互助|化隆|湟源|湟中|尖扎|久治|乐都|玛多|玛沁|门源|民和|囊谦|平安|祁连|曲麻菜|天峻|同德|同仁|乌兰|西宁|兴海|循化|玉树|杂多|泽库|治多");
where[31] = new comefrom("新疆", "|阿合奇|阿克苏|阿克陶|阿勒泰|阿图什|阿瓦提|巴楚|巴里坤|拜城|博湖|博乐|布尔津|策勒|察布察尔|昌吉|额敏|福海|阜康|富蕴|巩留|哈巴河|哈密|和布克赛尔|和静|和硕|和田|呼图壁|霍城|吉木乃|吉木萨尔|枷师|精河|柯平|克拉玛依|库车|库尔勒|奎屯|乐普湖|咯什|轮台|洛浦|玛纳斯|麦盖提|米泉|民丰|墨玉|木垒|尼勒克|皮山|奇台|青河|沙湾|沙雅|莎车|鄯善|石河子|疏附|疏勒|塔城|塔什库尔干|特克斯|吐鲁番|托克逊|托里|尉梨|温泉|温宿|乌鲁木齐|乌恰|乌什|乌苏|新和|新源|焉耆|叶城|伊宁|伊吾|英吉沙|于田|裕民|泽普|昭苏");
where[32] = new comefrom("香港", "香港");
where[33] = new comefrom("澳门", "澳门");
where[34] = new comefrom("台湾", "|台北市|桃园县市|台南县|东引岛|高雄市|新竹县|高雄县|马 祖|基隆市|苗栗县市|屏东县市|金 门|新竹市|台中县|花莲县市|台中市|彰化县市|台东县市|台南市|南投县市|绿 岛|台北县|云林县|兰 屿|宜兰县市|嘉义县市|澎湖县");
where[35] = new comefrom("自填经度", "自填经度");



var lunarInfo = new Array(
	0x04bd8, 0x04ae0, 0x0a570, 0x054d5, 0x0d260, 0x0d950, 0x16554, 0x056a0, 0x09ad0, 0x055d2,
	0x04ae0, 0x0a5b6, 0x0a4d0, 0x0d250, 0x1d255, 0x0b540, 0x0d6a0, 0x0ada2, 0x095b0, 0x14977,
	0x04970, 0x0a4b0, 0x0b4b5, 0x06a50, 0x06d40, 0x1ab54, 0x02b60, 0x09570, 0x052f2, 0x04970,
	0x06566, 0x0d4a0, 0x0ea50, 0x06e95, 0x05ad0, 0x02b60, 0x186e3, 0x092e0, 0x1c8d7, 0x0c950,
	0x0d4a0, 0x1d8a6, 0x0b550, 0x056a0, 0x1a5b4, 0x025d0, 0x092d0, 0x0d2b2, 0x0a950, 0x0b557,
	0x06ca0, 0x0b550, 0x15355, 0x04da0, 0x0a5d0, 0x14573, 0x052b0, 0x0a9a8, 0x0e950, 0x06aa0,
	0x0aea6, 0x0ab50, 0x04b60, 0x0aae4, 0x0a570, 0x05260, 0x0f263, 0x0d950, 0x05b57, 0x056a0,
	0x096d0, 0x04dd5, 0x04ad0, 0x0a4d0, 0x0d4d4, 0x0d250, 0x0d558, 0x0b540, 0x0b5a0, 0x195a6,
	0x095b0, 0x049b0, 0x0a974, 0x0a4b0, 0x0b27a, 0x06a50, 0x06d40, 0x0af46, 0x0ab60, 0x09570,
	0x04af5, 0x04970, 0x064b0, 0x074a3, 0x0ea50, 0x06b58, 0x055c0, 0x0ab60, 0x096d5, 0x092e0,
	0x0c960, 0x0d954, 0x0d4a0, 0x0da50, 0x07552, 0x056a0, 0x0abb7, 0x025d0, 0x092d0, 0x0cab5,
	0x0a950, 0x0b4a0, 0x0baa4, 0x0ad50, 0x055d9, 0x04ba0, 0x0a5b0, 0x15176, 0x052b0, 0x0a930,
	0x07954, 0x06aa0, 0x0ad50, 0x05b52, 0x04b60, 0x0a6e6, 0x0a4e0, 0x0d260, 0x0ea65, 0x0d530,
	0x05aa0, 0x076a3, 0x096d0, 0x04bd7, 0x04ad0, 0x0a4d0, 0x1d0b6, 0x0d250, 0x0d520, 0x0dd45,
	0x0b5a0, 0x056d0, 0x055b2, 0x049b0, 0x0a577, 0x0a4b0, 0x0aa50, 0x1b255, 0x06d20, 0x0ada0,
	0x14b63, 0x09370, 0x049f8, 0x04970, 0x064b0, 0x168a6, 0x0ea50, 0x06b20, 0x1a6c4, 0x0aae0,//2050-2059
	0x0a2e0, 0x0d2e3, 0x0c960, 0x0d557, 0x0d4a0, 0x0da50, 0x05d55, 0x056a0, 0x0a6d0, 0x055d4,//2060-2069
	0x052d0, 0x0a9b8, 0x0a950, 0x0b4a0, 0x0b6a6, 0x0ad50, 0x055a0, 0x0aba4, 0x0a5b0, 0x052b0,//2070-2079
	0x0b273, 0x06930, 0x07337, 0x06aa0, 0x0ad50, 0x14b55, 0x04b60, 0x0a570, 0x054e4, 0x0d160,//2080-2089
	0x0e968, 0x0d520, 0x0daa0, 0x16aa6, 0x056d0, 0x04ae0, 0x0a9d4, 0x0a2d0, 0x0d150, 0x0f252,//2090-2099
	0x0d520);


var m = {
	yearDataCache: {},
	getDate: function (u) {
		var lunarYear = "";
		var lunarMonth = ""
		var lunarDay = ""
		var isLeap = ""
		var isBigMonth = ""
		objDate = new Date(u)
		var i, leap = 0, temp = 0;
		var offset = (Date.UTC(objDate.getFullYear(), objDate.getMonth(), objDate.getDate()) - Date.UTC(1900, 0, 31)) / 86400000;

		for (i = 1900; i < 2101 && offset > 0; i++) { temp = this.getYearDays(i); offset -= temp; }

		if (offset < 0) { offset += temp; i--; }

		lunarYear = i;

		leap = this.getLeapMonth(i); //闰哪个月 
		isLeap = false;

		for (i = 1; i < 13 && offset > 0; i++) {
			//闰月 
			if (leap > 0 && i == (leap + 1) && isLeap == false) { --i; isLeap = true; temp = this.getLeapDays(lunarYear); }
			else { temp = this.getMonthDays(lunarYear, i); }

			//解除闰月 
			if (isLeap == true && i == (leap + 1)) isLeap = false;

			offset -= temp;
		}

		if (offset == 0 && leap > 0 && i == leap + 1)
			if (isLeap) { isLeap = false; }
			else { isLeap = true; --i; }

		if (offset < 0) { offset += temp; --i; }
		lunarMonth = i;
		lunarDay = offset + 1;

		//console.log("getdata:",lunarYear,lunarMonth,lunarDay,isLeap)
		return {
			lunarYear: lunarYear,
			lunarMonth: lunarMonth,
			lunarDay: lunarDay,
			isLeap: isLeap,
			//isBigMonth: v
		}
	},
	getYearDays: function (q) {
		var i, sum = 348;
		for (i = 0x8000; i > 0x8; i >>= 1) sum += (lunarInfo[q - 1900] & i) ? 1 : 0;
		return (sum + this.getLeapDays(q));
	},
	getLeapDays: function (q) {
		if (this.getLeapMonth(q)) return ((lunarInfo[q - 1900] & 0x10000) ? 30 : 29);
		else return (0);
	},
	getLeapMonth: function (r) {
		return (lunarInfo[r - 1900] & 0xf);
	},
	getMonthDays: function (r, q) {
		return ((lunarInfo[r - 1900] & (0x10000 >> q)) ? 30 : 29);
	}
};
var b = function (u, r) {
	var v = o[u - 1900];
	var t = [];
	var s = 0;
	var q;
	for (; s < 30; s += 5) {
		q = (+("0x" + v.substr(s, 5))).toString();
		t.push(q.substr(0, 1));
		t.push(q.substr(1, 2));
		t.push(q.substr(3, 1));
		t.push(q.substr(4, 2))
	}
	return new Date(u, parseInt(r / 2, 10), t[r])
};

/*
从已知日期计算干支纪日的公式为：

G = 4C + [C / 4] + 5y + [y / 4] + [3 * (M + 1) / 5] + d - 3

Z = 8C + [C / 4] + 5y + [y / 4] + [3 * (M + 1) / 5] + d + 7 + i

其中 C 是世纪数减一，y 是年份后两位，M 是月份，d 是日数。1月和2月按上一年的13月和14月来算。奇数月i=0，偶数月i=6。G 除以10的余数是天干，Z 除以12的余数是地支。

计算时带[ ]的数表示取整。

例如：查2006年4月1日的干支日。将数值代入计算公式。

G =4*20 + [20 / 4] + 5*06 + [06 / 4] + [3 * (4 + 1) / 5] + 1 - 3 =197

除以10 余数为 7 ，天干的第7位是‘庚’。

Z =8*20 + [20 / 4] + 5*06 + [06 / 4] + [3 * (4 + 1) / 5] + 1 + 7 + 6 =213

除以12 余数为 9 ，地支的第9位是‘申’。

答案是：2006年4月1日的干支日是庚申日。
*/
var c = {
	getTerm: function (y, n) {
		if (y < 1900 || y > 2100) {
			return -1;
		};
		if (n < 1 || n > 24) {
			return -1;
		};

		var _table = o[y - 1900];
		var _info = [
			parseInt('0x' + _table.substr(0, 5)).toString(),
			parseInt('0x' + _table.substr(5, 5)).toString(),
			parseInt('0x' + _table.substr(10, 5)).toString(),
			parseInt('0x' + _table.substr(15, 5)).toString(),
			parseInt('0x' + _table.substr(20, 5)).toString(),
			parseInt('0x' + _table.substr(25, 5)).toString()
		];
		var _calDay = [
			_info[0].substr(0, 1),
			_info[0].substr(1, 2),
			_info[0].substr(3, 1),
			_info[0].substr(4, 2),

			_info[1].substr(0, 1),
			_info[1].substr(1, 2),
			_info[1].substr(3, 1),
			_info[1].substr(4, 2),

			_info[2].substr(0, 1),
			_info[2].substr(1, 2),
			_info[2].substr(3, 1),
			_info[2].substr(4, 2),

			_info[3].substr(0, 1),
			_info[3].substr(1, 2),
			_info[3].substr(3, 1),
			_info[3].substr(4, 2),

			_info[4].substr(0, 1),
			_info[4].substr(1, 2),
			_info[4].substr(3, 1),
			_info[4].substr(4, 2),

			_info[5].substr(0, 1),
			_info[5].substr(1, 2),
			_info[5].substr(3, 1),
			_info[5].substr(4, 2)
		];
		return parseInt(_calDay[n - 1]);
	},
	calculate: function (q) {
		return h[q % 10] + d[q % 12]
	},
	getGzYear: function (r, s, q) {
		return this.calculate(s - 1900 + 36 - (q === s ? 0 : 1))
	},
	getGzMonth: function (q, r, s) {
		var d = q.getDate()
		var t = b(r, q.getMonth() * 2);

		return this.calculate((r - 1900) * 12 + s + 12 - (q < t ? 1 : 0))

	},
	getGzDay: function (q) {

		var t = new Date('Thu Jan 01 1970 00:00:00 GMT+0800 (CST)')
		var debug_t = new Date(q);
		var cur = new Date(debug_t.getFullYear(), debug_t.getMonth(), 0, 0, 0)
		var delat = Math.floor((cur) / 86400000) + 25567 + 10
		//console.log("getGzDay:delat",delat);
		return this.calculate(delat + debug_t.getDate() + 1)
	},
	/*

     北京时间  			甲己 乙庚 丙辛 丁壬 戊癸  
	 子【水】 23----1 	甲子 丙子 戊子 庚子 壬子  
	 丑【土】 1----3 	乙丑 丁丑 己丑 辛丑 癸丑  
	 寅【木】 3----5 	丙寅 戊寅 庚寅 壬寅 甲寅  
	 卯【木】 5----7 	丁卯 己卯 辛卯 癸卯 乙卯  
	 辰【土】 7----9 	戊辰 庚辰 壬辰 甲辰 丙辰  
	 巳【火】 9----11 	己巳 辛巳 癸巳 乙巳 丁巳  
	 午【火】 11----13 	庚午 壬午 甲午 丙午 戊午  
	 未【土】 13----15 	辛未 癸未 乙未 丁未 己未  
	 申【金】 15----17 	壬申 甲申 丙申 戊申 庚申  
	 酉【金】 17----19 	癸酉 乙酉 丁酉 己酉 辛酉  
	 戌【土】 19----21 	甲戌 丙戌 戊戌 庚戌 壬戌  
	 亥【水】 21----23 	乙亥 丁亥 己亥 辛亥 癸亥
	*/
	getGzTime: function (q,gzday) {
		var gzd = this.getGzDay(q)
		if (gzd!=gzday)
		{
			gzd=gzday
		}
		var offset = h.indexOf(gzd[0]) % 5 * 2;
		var hour = q.getHours();
		hour = Math.floor(hour / 2 + 0.5) % 12
		return h[(hour + offset) % 10] + d[hour % 12]
	},
	getGzQuarter: function (q) {
		var gzd = this.getGzDay(q)
		var offset = h.indexOf(gzd[0]) % 5 * 2;
		var hour = q.getHours();
		var min = q.getMinutes()
		var time = Math.floor(hour / 2 + 0.5) % 12
		time = d[time % 12]
		switch (Math.floor(min / 15)) {
			case 3:
				min = "四刻"; break;
			case 2:
				min = "三刻"; break;
			case 1:
				min = "二刻"; break;
			case 0:
				min = "初刻"; break;
		}

		return time + (0 === hour % 2 ? "正" : "初") + min
	}
}

/***************************************************************************** 
                                      日期计算 
*****************************************************************************/

class SixrandomModule extends React.Component {

	getTerm(y, n) {
		return c.getTerm(y, n)
	}
	/***************************************************************************** 
										  日期爻动 
	*****************************************************************************/

	get_six_random_help_myth()
/*
神煞
寅午戌马在申，桃花在卯；
亥卯未马在巳，桃花在子；
申子辰马在寅，桃花在酉；
巳酉丑马在亥，桃花在午。

甲禄在寅，乙禄在卯，丙戊禄在巳，丁己禄在午，庚禄在申，辛禄在酉，壬禄在亥，癸禄在子。
 
贵人
甲戊兼牛羊，乙己 鼠猴乡，丙丁猪鸡位，壬癸兔蛇藏，庚辛逢虎马
*/ {
		var m = startinfo.gzDate.slice(1)
		var n = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];
		var x = ["寅", "亥", "申", "巳", "寅", "亥", "申", "巳", "寅", "亥", "申", "巳"];
		var th = ["申", "巳", "寅", "亥"]
		var tt = ["卯", "子", "酉", "午"]
		var q = n.indexOf(m);
		var p = x[q]
		six_random_help_myth[0] = p
		six_random_help_myth[1] = tt[th.indexOf(p)]

		var l = ["寅", "卯", "巳", "午", "巳", "午", "申", "酉", "亥", "子"];
		var ll = startinfo.gzDate.slice(0, 1);
		var o = h.indexOf(ll);
		six_random_help_myth[2] = l[o];

		var g = ["丑,未", "子,申", "酉,亥", "酉,亥", "丑,未", "子,申", "寅,午", "寅,午", "卯,巳", "卯,巳"];
		var k = h.indexOf(ll)
		six_random_help_myth[3] = g[k];
	}
	get_six_random_myth()
/*
六神
甲乙起青龙.丙丁起朱雀.戊己起勾陈,庚辛起白虎.壬癸起玄武
*/ {
		var a = ["青龙", "朱雀", "勾陈", "縢蛇", "白虎", "玄武"];
		var n = ["青龙", "青龙", "朱雀", "朱雀", "勾陈", "縢蛇", "白虎", "白虎", "玄武", "玄武"];
		var m = startinfo.gzDate.slice(0, 1)
		var b = h.indexOf(m);
		var c = a.indexOf(n[b])

		for (index = 0; index < randomtime; index++) {
			six_random_myth[randomtime - index] = a[(c + index) % 6];
		}
	}

	get_one_random()
/*
六爻的启动测试，取三次正反，0表示反面，1表示证明
6表示全阴X
9表示全阳O
8表示少阴
7表示少阳
6 老阴 7 少阳 8 少阴 9 老阳
*/ {

		three_random[0] = Math.random(1) >= 0.5 ? 1 : 0;
		three_random[1] = Math.random(1) >= 0.5 ? 1 : 0;
		three_random[2] = Math.random(1) >= 0.5 ? 1 : 0;
		return three_random[0] + three_random[1] + three_random[2] + 6;

	}

	get_six_original_random()
/*
获取本卦六爻
*/ {

		for (index = 0; index < randomtime; index++) {
			six_random[randomtime - index] = this.get_one_random();
		}
	}
	recover_six_original_random(lunardate)
/*
获取本卦六爻
*/ {
		for (index = 0; index < randomtime; index++) {
			six_random[randomtime - index] = lunardate[randomtime - index - 1];
		}
		//alert(six_random)
	}
	get_six_change_random()
/*
获得变卦六爻
老阴变少阳
老阳变少阴
*/ {
		for (index = 0; index < randomtime; index++) {
			if (oldnegativevalue == six_random[randomtime - index]) {
				six_change_random[randomtime - index] = positivevalue
			}
			else if (oldpositivevalue == six_random[randomtime - index]) {
				six_change_random[randomtime - index] = negativevalue
			}
			else {
				six_change_random[randomtime - index] = six_random[randomtime - index]
			}

		}
	}

	get_empty_sixty_cycle(date)
/*
天干地支虚空表
输入："戊子"
得到："午""未"（array）
*/ {
		//.log(date);
		var skydate = date.slice(0, 1);
		var earthdate = date.slice(1);
		var i = h.indexOf(skydate);
		var j = d.indexOf(earthdate);
		return sixtycycletable[(10 - i + j) % 12] + sixtycycletable[(10 - i + j + 1) % 12];
	}

	get_empty_date() {
		six_random_empty[0] = this.get_empty_sixty_cycle(startinfo.gzYear);
		six_random_empty[1] = this.get_empty_sixty_cycle(startinfo.gzMonth);
		six_random_empty[2] = this.get_empty_sixty_cycle(startinfo.gzDate);
		six_random_empty[3] = this.get_empty_sixty_cycle(startinfo.gzTime);
	}


	lunar_f(cur)
/*
获得当前农历信息
*/ {
		var r = undefined == cur ? new Date() : new Date(cur);
		var w = r.getFullYear();
		var u = r.getMonth() + 1;
		var y = r.getDate();
		var v = (u - 1) * 2;
		var s = b(w, v);
		var q;
		var t = "";
		if (y != s.getDate()) {
			q = b(w, v + 1);
			if (y == q.getDate()) {
				t = l[v + 1]
			}
		} else {
			t = l[v]
		}
		var x = m.getDate(r);
		var Json_ret = LunarCalendar.solarToLunar(w,u,y)
		console.log(Json_ret)
		return {
			Hours: r.getHours(),
			Time: r.getHours(),
			Date: r.getDate(),
			Month: r.getMonth() + 1,
			Year: r.getFullYear(),
			animal: p[(x.lunarYear - 4) % 12],
			gzTime: c.getGzTime(r,Json_ret.GanZhiDay),
			gzDate: Json_ret.GanZhiDay,
			gzMonth: Json_ret.GanZhiMonth,
			gzYear:  Json_ret.GanZhiYear,
			luanrgzDate:c.getGzDay(r),
			lunargzMonth:c.getGzMonth(r,w,u),
			lunargzYear:c.getGzYear(r,w,x.lunarYear ),
			gzQuarter: c.getGzQuarter(r),
			lunarYear: x.lunarYear,
			lunarMonth: x.lunarMonth,
			lunarDate: x.lunarDay,
			lMonth: (x.isLeap ? "闰" : "") + n[x.lunarMonth - 1],
			lDate: x.lunarDay % 10 == 0 ? ["初十", "二十", "三十"][x.lunarDay / 10 - 1] : k[parseInt(x.lunarDay / 10, 10)] + g[parseInt(x.lunarDay % 10, 10)],
			term: t,
			isBigMonth: x.isBigMonth,
			oDate: r,
			cnDay: "日一二三四五六七".charAt(r.getDay())
		}
	};

	get_six_random_date() {
		six_random_date[0] = "公历：" + startinfo.Year + " " + startinfo.Month + " " + startinfo.Date + " " + startinfo.Hours + ":" + startinfo.oDate.getMinutes()
		six_random_date[1] = "农历：" + startinfo.lunarYear + " " + startinfo.lunarMonth + " " + startinfo.lunarDate
		six_random_date[2] = "四柱：" + startinfo.gzYear + " " + startinfo.gzMonth + " " + startinfo.gzDate + " " + startinfo.gzTime
	}

	get_random_name() {
		six_random_date[3] = "旬空：" + six_random_empty[0] + " " + six_random_empty[1] + " " + six_random_empty[2] + " " + six_random_empty[3]
		six_random_date[4] = "神煞：" + "驿马-" + six_random_help_myth[0] + " 桃花-" + six_random_help_myth[1] + " 日禄-" + six_random_help_myth[2] + " 贵人-" + six_random_help_myth[3]
		//ooup oodown 本卦的上下主客卦 ocup ocdown 变卦的上下主客卦
		var ooup = oodown = ocup = ocdown = "";
		for (index = 0; index < randomtime; index++) {
			if (oldnegativevalue == six_random[index + 1]) {
				if (index < randomtime / 2) {
					ooup = ooup + negative
					ocup = ocup + positive
				}
				else {
					oodown = oodown + negative
					ocdown = ocdown + positive
				}

			}
			else if (oldpositivevalue == six_random[index + 1]) {
				if (index < randomtime / 2) {
					ooup = ooup + positive
					ocup = ocup + negative
				}
				else {
					oodown = oodown + positive
					ocdown = ocdown + negative
				}
			}
			else if (positivevalue == six_random[index + 1]) {
				if (index < randomtime / 2) {
					ooup = ooup + positive
					ocup = ocup + positive
				}
				else {
					oodown = oodown + positive
					ocdown = ocdown + positive
				}
			}
			else if (negativevalue == six_random[index + 1]) {
				if (index < randomtime / 2) {
					ooup = ooup + negative
					ocup = ocup + negative
				}
				else {
					oodown = oodown + negative
					ocdown = ocdown + negative
				}
			}
		}
		six_random_date[5] = ooup + oodown
		six_random_date[6] = ocup + ocdown
		six_random_date[7] = six_random_NaJia[six_random_date[5]]
		six_random_date[8] = six_random_NaJia[six_random_date[6]];
		//fix_najia
		six_random_date[8] = this.fix_najia(six_random_date[7], six_random_date[8])
	}
	fix_najia(random, change) {

		var kindtable = {
			"金金": "兄弟", "木木": "兄弟", "土土": "兄弟", "火火": "兄弟", "水水": "兄弟",
			"金土": "父母", "木水": "父母", "土火": "父母", "火木": "父母", "水金": "父母",
			"金木": "妻财", "木土": "妻财", "土水": "妻财", "火金": "妻财", "水火": "妻财",
			"金火": "官鬼", "木金": "官鬼", "土木": "官鬼", "火水": "官鬼", "水土": "官鬼",
			"金水": "子孙", "木火": "子孙", "土金": "子孙", "火土": "子孙", "水木": "子孙",
		}
		//console.log("结果")
		var orignalkind = random["kind"];
		//console.log(orignalkind);
		//console.log(change);
		var changekind = new Array();
		var changerandom = JSON.parse(JSON.stringify(change))

		changekind[1] = orignalkind + changerandom[1].slice(4, 5)
		changekind[2] = orignalkind + changerandom[2].slice(4, 5)
		changekind[3] = orignalkind + changerandom[3].slice(4, 5)
		changekind[4] = orignalkind + changerandom[4].slice(4, 5)
		changekind[5] = orignalkind + changerandom[5].slice(4, 5)
		changekind[6] = orignalkind + changerandom[6].slice(4, 5)
		//console.log(changekind);
		//console.log(change);
		//console.log(change[index].slice(0,2))

		for (index = 1; index < 7; index++) {
			changerandom[index] = kindtable[changekind[index]] + changerandom[index].slice(2,5)
		}

		//console.log(change);
		return changerandom


	}
	get_simple_random_draw() {
		var _build = new Array();

		//_build.push("")
		_build.push("")
		_build.push("求测：" + six_random_question)
		_build.push("")
		if ("" != six_random_question) {
			try {
				_build.push(six_random_question);
				_build.push(" ")

			} catch (error) {

			}
		}
		else {
			_build.push(six_random_date[7]["general"]);
			_build.push(" ")
		}


		_build.push(six_random_date[0]);
		_build.push(six_random_date[1]);
		_build.push("")
		_build.push(six_random_date[7].name  + six_random_date[7]["poem"])
		_build.push("")

		_build.push(six_random_date[7]["base"]);
		_build.push("")
		_build.push(six_random_date[7]["def"]);
		_build.push(six_random_date[7]["story"]);
		_build.push("")





		for (index = 0; index < randomtime; index++) {
			if (oldnegativevalue == six_random[randomtime - index]) {
				six_random_draw[randomtime - index] = negativedraw
			}
			else if (oldpositivevalue == six_random[randomtime - index]) {
				six_random_draw[randomtime - index] = positivedraw
			}
			else if (positivevalue == six_random[randomtime - index]) {
				six_random_draw[randomtime - index] = positivedraw
			}
			else if (negativevalue == six_random[randomtime - index]) {
				six_random_draw[randomtime - index] = negativedraw
			}
		}

		for (index = 0; index < randomtime; index++) {
			_build.push(six_random_draw[index + 1]);
		}



		return _build
	}

	get_random_draw() {
		var infobase = new Array()
		var infogrid = new Array();
		var _build = new Array();
		_build.push("")
		_build.push("求测：" + six_random_question)
		_build.push(six_random_date[7]["base"]);
		if ("" != six_random_question) {
			try {
				//_build.push(six_random_question);
				//_build.push("")

			} catch (error) {

			}
		}
		else {
			_build.push(six_random_date[7]["general"]);
			_build.push("")
		}



		_build.push(six_random_date[0]);
		_build.push(six_random_date[1]);
		_build.push(six_random_date[2]);
		_build.push(six_random_date[3]);
		_build.push(six_random_date[4]);
		//console.log(six_random_date[5]);
		//console.log(six_random_date[6]);
		_build.push("")


		_build.push("")
		infobase = _build;
		//console.log("infobase",infobase)
		//_build.push(("      本卦：  "+six_random_date[7].name+"   变卦：  "+six_random_date[8].name))
		//infogrd目前是按一行5列设计的
		//卦的名称
		infogrid[0] = new Array()
		infogrid[0].push("")
		infogrid[0].push("")
		infogrid[0].push("本卦:" + six_random_date[7].name)
		infogrid[0].push("变卦:" + six_random_date[8].name)

		infogrid[1] = new Array()
		infogrid[1].push("")
		infogrid[1].push("")
		infogrid[1].push("")
		infogrid[1].push("")

		infogrid[2] = new Array()
		infogrid[2].push("")
		infogrid[2].push("")
		infogrid[2].push(six_random_date[7]["poem"])
		infogrid[2].push(six_random_date[8]["poem"])

		//console.log();
		var o = ["", "上爻", "五爻", "四爻", "三爻", "二爻", "初爻"]
		var curlenght = infogrid.length -1

		for (index = 0; index < randomtime; index++) {
			infogrid[curlenght +randomtime - index + 1] = new Array()
			six_random_draw[randomtime - index] = six_random_myth[randomtime - index] + ":" + o[randomtime - index] + "          ";
			infogrid[curlenght +randomtime - index + 1].push(six_random_myth[randomtime - index] + ":" + o[randomtime - index])
			infogrid[curlenght +randomtime - index + 1].push("")
			if (oldnegativevalue == six_random[randomtime - index]) {
				six_random_draw[randomtime - index] = six_random_draw[randomtime - index] + negativedraw + " " + negativechangedraw + " "
				infogrid[curlenght +randomtime - index + 1].push(negativedraw + " " + negativechangedraw)

			}
			else if (oldpositivevalue == six_random[randomtime - index]) {
				six_random_draw[randomtime - index] = six_random_draw[randomtime - index] + positivedraw + " " + positivechangedraw + " "
				infogrid[curlenght +randomtime - index + 1].push(positivedraw + " " + positivechangedraw)

			}
			else if (positivevalue == six_random[randomtime - index]) {
				six_random_draw[randomtime - index] = six_random_draw[randomtime - index] + positivedraw + " " + nonechangedraw + " "
				infogrid[curlenght +randomtime - index + 1].push(positivedraw + " " + nonechangedraw)

			}
			else if (negativevalue == six_random[randomtime - index]) {
				six_random_draw[randomtime - index] = six_random_draw[randomtime - index] + negativedraw + " " + nonechangedraw + " "
				infogrid[curlenght +randomtime - index + 1].push(negativedraw + " " + nonechangedraw)
			}
		}

		for (index = 0; index < randomtime; index++) {
			if (oldnegativevalue == six_change_random[randomtime - index]) {
				six_random_draw[randomtime - index] = six_random_draw[randomtime - index] + negativedraw
				infogrid[curlenght +randomtime - index + 1].push(negativedraw)
			}
			else if (oldpositivevalue == six_change_random[randomtime - index]) {
				six_random_draw[randomtime - index] = six_random_draw[randomtime - index] + positivedraw
				infogrid[curlenght + randomtime - index + 1].push(positivedraw)
			}
			else if (positivevalue == six_change_random[randomtime - index]) {
				six_random_draw[randomtime - index] = six_random_draw[randomtime - index] + positivedraw
				infogrid[curlenght + randomtime - index + 1].push(positivedraw)
			}
			else if (negativevalue == six_change_random[randomtime - index]) {
				six_random_draw[randomtime - index] = six_random_draw[randomtime - index] + negativedraw
				infogrid[curlenght + randomtime - index + 1].push(negativedraw)
			}
		}

		for (index = 0; index < randomtime; index++) {
			//_build.push(six_random_draw[index+1]);
		}

		//console.log("infogrid",infogrid)
		//_build.push("")
		//下面是纳甲
		curlenght = infogrid.length
		for (index = 0; index < randomtime; index++) {
			var t = index + 1
			//先装用神
			infogrid[curlenght + index + 1] = new Array();
			infogrid[curlenght + index + 1].push(six_random_myth[index + 1])



			var n = six_random_date[7][t]
			var change = 5 == n.length ? true : false;
			var fs = "f" + t
			if (undefined === six_random_date[7][fs]) {
				n = "                " + n
				//再装伏神
				infogrid[curlenght + index + 1].push("")
			}
			else {
				n = six_random_date[7][fs] + " " + n
				//再装伏神
				infogrid[curlenght + index + 1].push(six_random_date[7][fs])
			}
			//再装卦
			infogrid[curlenght + index + 1].push(six_random_date[7][t])
			var c = six_random[t]
			var cc = ""
			if (3 == c) {

				cc = positivechangedraw + " "
				infogrid[curlenght + index + 1] = infogrid[curlenght + index + 1] + " " + positivechangedraw

			}
			else if (0 == c) {

				cc = negativechangedraw + " "
				infogrid[curlenght + index + 1] = infogrid[curlenght + index + 1] + " " + negativechangedraw


			}
			else {

				cc = "     "


			}

			if (true == change) {
				n = six_random_myth[t] + " " + n + " "

				//_build.push(n+"     "+cc+six_random_date[8][t]);


			}
			else {
				n = six_random_myth[t] + " " + n + " "

				//_build.push(n+cc+six_random_date[8][t]);

			}
			//再装变卦
			infogrid[curlenght + index + 1].push(six_random_date[8][t])

		}

		var infoext = new Array()
		infoext.push("")
		infoext.push("《序卦传》《杂卦传》解释")
		infoext.push("")
		infoext.push(six_random_date[7].name)
		infoext.push(six_random_date[7]["def"]);
		infoext.push(six_random_date[7]["story"]);
		infoext.push("")
		infoext.push(six_random_date[8].name)
		infoext.push(six_random_date[8]["def"]);
		infoext.push(six_random_date[8]["story"]);
		infoext.push("")
		infoext.push("《卦象》(伏羲)、 《卦辞》(文王)解释")
		infoext.push("")
		infoext.push(six_random_date[7].base)
		infoext.push(six_random_date[7].extname)
		infoext.push(six_random_date[7].extnameexp)
		infoext.push(six_random_date[7].extexp)
		infoext.push(six_random_date[7].extexp1)
		infoext.push(six_random_date[7].ext)
		infoext.push("")
		
		for (index = 1; index < 13; index++) {
			var x = "exp" + index
			infoext.push(six_random_date[7][x])
		}
		infoext.push("")
		infoext.push("")
		infoext.push("")
		infoext.push(six_random_date[8].base)
		infoext.push(six_random_date[8].extname)
		infoext.push(six_random_date[8].extnameexp)
		infoext.push(six_random_date[8].extexp)
		infoext.push(six_random_date[8].extexp1)
		infoext.push(six_random_date[8].ext)
		infoext.push("")
		
		for (index = 1; index < 13; index++) {
			var x = "exp" + index
			infoext.push(six_random_date[8][x])
		}
		infoext.push("")
		infoext.push("")
		infoext.push("")
		return { _build, infobase, infogrid, infoext }
	}
	get_sixrandom_name(lunar) {
		var x = ""
		for (index = 0; index < 6; index++) {
			var t = lunar[index]
			if ("6" == t || "8" == t) {
				x = x + "0";
			}
			else if ("7" == t || "9" == t) {
				x = x + "1";
			}
			//x = x + (("6"==t || "8"==t)?"0":"1")
			//console.log(x)
		}
		return six_random_NaJia[x]["name"]
	}

	get_six_random()
/*
获取本卦，变卦，时间，天干，地支，用神，旬空，六亲
*/ {

		this.get_six_random_date();

		//变卦
		this.get_six_change_random();
		//伏神纳甲世应
		//旬空
		this.get_empty_date();
		//神煞
		this.get_six_random_help_myth()
		//六神
		this.get_six_random_myth()
		//装卦
		this.get_random_name()
		//调试画卦
		//this.get_random_draw();
		return {
			info: startinfo,
			six_random_date: six_random_date,
			six_random: six_random,
			six_change_random: six_change_random,
			six_random_empty: six_random_empty,
			six_random_myth: six_random_myth,
			six_random_help_myth: six_random_help_myth,
			//htmldraw:htmldraw,
			//htmlchangedraw:htmlchangedraw,
			//htmlmythdraw:htmlmythdraw,
			//htmlnajiadraw:htmlnajiadraw,
			//htmlnajiachangedraw:htmlnajiachangedraw,
			//htmlchangeinfodraw:htmlchangeinfodraw,
		}

	}

	lunarsix()
/*
六爻发动
*/ {
		//取爻
		startinfo = this.lunar_f();
		this.get_six_original_random();
		//本卦爻变
		return this.get_six_random();
		//存盘序列化
	}

	getArgs() {
		var args = {};
		var match = null;
		var search = decodeURIComponent(location.search.substring(1));
		var reg = /(?:([^&]+)=([^&]+))/g;
		while ((match = reg.exec(search)) !== null) {
			args[match[1]] = match[2];
		}
		return args;
	}

	recoverlunarsix(ret_info = null) {
		//Mon Jul 10 2017 23:43:54 GMT+0800 (CST)
		var info = ret_info
		startinfo = this.lunar_f(info.date);
		//alert(startinfo)
		this.recover_six_original_random(info.lunar)
		//本卦爻变
		six_random_question = info.question
		return this.get_six_random();
		//return null
		//存盘序列化
	}

	build(msg) {
		//console.log(msg)
		var info = null;

		var ret;
		var args = {};
		var match = null;
		var search = decodeURIComponent(msg.substring(1));
		var reg = /(?:([^&]+)=([^&]+))/g;
		while ((match = reg.exec(search)) !== null) {
			args[match[1]] = match[2];
		}
		info = args
		//alert(info)

		ret = this.recoverlunarsix(info)
		return ret
	}

	getnegativedraw() {
		return negativedraw;
	}
	getpositivedraw() {
		return positivedraw;
	}

	lunar2solar(y, m, d) {
		return chineseLunar.lunarToSolar(y, m, d, true)
	}
}

var sixrandommodule = new SixrandomModule()
module.exports = {SixrandomModule:sixrandommodule,six_random_NaJia:six_random_NaJia  }