


import React, { Component } from 'react';


var zh_s = '皑蔼碍爱翱袄奥坝罢摆败颁办绊帮绑镑谤剥饱宝报鲍辈贝钡狈备惫绷笔毕毙闭边编贬变辩辫鳖瘪濒滨宾摈饼拨钵铂驳卜补参蚕残惭惨灿苍舱仓沧厕侧册测层诧搀掺蝉馋谗缠铲产阐颤场尝长偿肠厂畅钞车彻尘陈衬撑称惩诚骋痴迟驰耻齿炽冲虫宠畴踌筹绸丑橱厨锄雏础储触处传疮闯创锤纯绰辞词赐聪葱囱从丛凑窜错达带贷担单郸掸胆惮诞弹当挡党荡档捣岛祷导盗灯邓敌涤递缔点垫电淀钓调迭谍叠钉顶锭订东动栋冻斗犊独读赌镀锻断缎兑队对吨顿钝夺鹅额讹恶饿儿尔饵贰发罚阀珐矾钒烦范贩饭访纺飞废费纷坟奋愤粪丰枫锋风疯冯缝讽凤肤辐抚辅赋复负讣妇缚该钙盖干赶秆赣冈刚钢纲岗皋镐搁鸽阁铬个给龚宫巩贡钩沟构购够蛊顾剐关观馆惯贯广规硅归龟闺轨诡柜贵刽辊滚锅国过骇韩汉阂鹤贺横轰鸿红后壶护沪户哗华画划话怀坏欢环还缓换唤痪焕涣黄谎挥辉毁贿秽会烩汇讳诲绘荤浑伙获货祸击机积饥讥鸡绩缉极辑级挤几蓟剂济计记际继纪夹荚颊贾钾价驾歼监坚笺间艰缄茧检碱硷拣捡简俭减荐槛鉴践贱见键舰剑饯渐溅涧浆蒋桨奖讲酱胶浇骄娇搅铰矫侥脚饺缴绞轿较秸阶节茎惊经颈静镜径痉竞净纠厩旧驹举据锯惧剧鹃绢杰洁结诫届紧锦仅谨进晋烬尽劲荆觉决诀绝钧军骏开凯颗壳课垦恳抠库裤夸块侩宽矿旷况亏岿窥馈溃扩阔蜡腊莱来赖蓝栏拦篮阑兰澜谰揽览懒缆烂滥捞劳涝乐镭垒类泪篱离里鲤礼丽厉励砾历沥隶俩联莲连镰怜涟帘敛脸链恋炼练粮凉两辆谅疗辽镣猎临邻鳞凛赁龄铃凌灵岭领馏刘龙聋咙笼垄拢陇楼娄搂篓芦卢颅庐炉掳卤虏鲁赂禄录陆驴吕铝侣屡缕虑滤绿峦挛孪滦乱抡轮伦仑沦纶论萝罗逻锣箩骡骆络妈玛码蚂马骂吗买麦卖迈脉瞒馒蛮满谩猫锚铆贸么霉没镁门闷们锰梦谜弥觅绵缅庙灭悯闽鸣铭谬谋亩钠纳难挠脑恼闹馁腻撵捻酿鸟聂啮镊镍柠狞宁拧泞钮纽脓浓农疟诺欧鸥殴呕沤盘庞国爱赔喷鹏骗飘频贫苹凭评泼颇扑铺朴谱脐齐骑岂启气弃讫牵扦钎铅迁签谦钱钳潜浅谴堑枪呛墙蔷强抢锹桥乔侨翘窍窃钦亲轻氢倾顷请庆琼穷趋区躯驱龋颧权劝却鹊让饶扰绕热韧认纫荣绒软锐闰润洒萨鳃赛伞丧骚扫涩杀纱筛晒闪陕赡缮伤赏烧绍赊摄慑设绅审婶肾渗声绳胜圣师狮湿诗尸时蚀实识驶势释饰视试寿兽枢输书赎属术树竖数帅双谁税顺说硕烁丝饲耸怂颂讼诵擞苏诉肃虽绥岁孙损笋缩琐锁獭挞抬摊贪瘫滩坛谭谈叹汤烫涛绦腾誊锑题体屉条贴铁厅听烃铜统头图涂团颓蜕脱鸵驮驼椭洼袜弯湾顽万网韦违围为潍维苇伟伪纬谓卫温闻纹稳问瓮挝蜗涡窝呜钨乌诬无芜吴坞雾务误锡牺袭习铣戏细虾辖峡侠狭厦锨鲜纤咸贤衔闲显险现献县馅羡宪线厢镶乡详响项萧销晓啸蝎协挟携胁谐写泻谢锌衅兴汹锈绣虚嘘须许绪续轩悬选癣绚学勋询寻驯训讯逊压鸦鸭哑亚讶阉烟盐严颜阎艳厌砚彦谚验鸯杨扬疡阳痒养样瑶摇尧遥窑谣药爷页业叶医铱颐遗仪彝蚁艺亿忆义诣议谊译异绎荫阴银饮樱婴鹰应缨莹萤营荧蝇颖哟拥佣痈踊咏涌优忧邮铀犹游诱舆鱼渔娱与屿语吁御狱誉预驭鸳渊辕园员圆缘远愿约跃钥岳粤悦阅云郧匀陨运蕴酝晕韵杂灾载攒暂赞赃脏凿枣灶责择则泽贼赠扎札轧铡闸诈斋债毡盏斩辗崭栈战绽张涨帐账胀赵蛰辙锗这贞针侦诊镇阵挣睁狰帧郑证织职执纸挚掷帜质钟终种肿众诌轴皱昼骤猪诸诛烛瞩嘱贮铸筑驻专砖转赚桩庄装妆壮状锥赘坠缀谆浊兹资渍踪综总纵邹诅组钻致钟么为只凶准启板里雳余链泄';
var zh_t = '皚藹礙愛翺襖奧壩罷擺敗頒辦絆幫綁鎊謗剝飽寶報鮑輩貝鋇狽備憊繃筆畢斃閉邊編貶變辯辮鼈癟瀕濱賓擯餅撥缽鉑駁蔔補參蠶殘慚慘燦蒼艙倉滄廁側冊測層詫攙摻蟬饞讒纏鏟産闡顫場嘗長償腸廠暢鈔車徹塵陳襯撐稱懲誠騁癡遲馳恥齒熾沖蟲寵疇躊籌綢醜櫥廚鋤雛礎儲觸處傳瘡闖創錘純綽辭詞賜聰蔥囪從叢湊竄錯達帶貸擔單鄲撣膽憚誕彈當擋黨蕩檔搗島禱導盜燈鄧敵滌遞締點墊電澱釣調叠諜疊釘頂錠訂東動棟凍鬥犢獨讀賭鍍鍛斷緞兌隊對噸頓鈍奪鵝額訛惡餓兒爾餌貳發罰閥琺礬釩煩範販飯訪紡飛廢費紛墳奮憤糞豐楓鋒風瘋馮縫諷鳳膚輻撫輔賦複負訃婦縛該鈣蓋幹趕稈贛岡剛鋼綱崗臯鎬擱鴿閣鉻個給龔宮鞏貢鈎溝構購夠蠱顧剮關觀館慣貫廣規矽歸龜閨軌詭櫃貴劊輥滾鍋國過駭韓漢閡鶴賀橫轟鴻紅後壺護滬戶嘩華畫劃話懷壞歡環還緩換喚瘓煥渙黃謊揮輝毀賄穢會燴彙諱誨繪葷渾夥獲貨禍擊機積饑譏雞績緝極輯級擠幾薊劑濟計記際繼紀夾莢頰賈鉀價駕殲監堅箋間艱緘繭檢堿鹼揀撿簡儉減薦檻鑒踐賤見鍵艦劍餞漸濺澗漿蔣槳獎講醬膠澆驕嬌攪鉸矯僥腳餃繳絞轎較稭階節莖驚經頸靜鏡徑痙競淨糾廄舊駒舉據鋸懼劇鵑絹傑潔結誡屆緊錦僅謹進晉燼盡勁荊覺決訣絕鈞軍駿開凱顆殼課墾懇摳庫褲誇塊儈寬礦曠況虧巋窺饋潰擴闊蠟臘萊來賴藍欄攔籃闌蘭瀾讕攬覽懶纜爛濫撈勞澇樂鐳壘類淚籬離裏鯉禮麗厲勵礫曆瀝隸倆聯蓮連鐮憐漣簾斂臉鏈戀煉練糧涼兩輛諒療遼鐐獵臨鄰鱗凜賃齡鈴淩靈嶺領餾劉龍聾嚨籠壟攏隴樓婁摟簍蘆盧顱廬爐擄鹵虜魯賂祿錄陸驢呂鋁侶屢縷慮濾綠巒攣孿灤亂掄輪倫侖淪綸論蘿羅邏鑼籮騾駱絡媽瑪碼螞馬罵嗎買麥賣邁脈瞞饅蠻滿謾貓錨鉚貿麽黴沒鎂門悶們錳夢謎彌覓綿緬廟滅憫閩鳴銘謬謀畝鈉納難撓腦惱鬧餒膩攆撚釀鳥聶齧鑷鎳檸獰甯擰濘鈕紐膿濃農瘧諾歐鷗毆嘔漚盤龐國愛賠噴鵬騙飄頻貧蘋憑評潑頗撲鋪樸譜臍齊騎豈啓氣棄訖牽扡釺鉛遷簽謙錢鉗潛淺譴塹槍嗆牆薔強搶鍬橋喬僑翹竅竊欽親輕氫傾頃請慶瓊窮趨區軀驅齲顴權勸卻鵲讓饒擾繞熱韌認紉榮絨軟銳閏潤灑薩鰓賽傘喪騷掃澀殺紗篩曬閃陝贍繕傷賞燒紹賒攝懾設紳審嬸腎滲聲繩勝聖師獅濕詩屍時蝕實識駛勢釋飾視試壽獸樞輸書贖屬術樹豎數帥雙誰稅順說碩爍絲飼聳慫頌訟誦擻蘇訴肅雖綏歲孫損筍縮瑣鎖獺撻擡攤貪癱灘壇譚談歎湯燙濤縧騰謄銻題體屜條貼鐵廳聽烴銅統頭圖塗團頹蛻脫鴕馱駝橢窪襪彎灣頑萬網韋違圍爲濰維葦偉僞緯謂衛溫聞紋穩問甕撾蝸渦窩嗚鎢烏誣無蕪吳塢霧務誤錫犧襲習銑戲細蝦轄峽俠狹廈鍁鮮纖鹹賢銜閑顯險現獻縣餡羨憲線廂鑲鄉詳響項蕭銷曉嘯蠍協挾攜脅諧寫瀉謝鋅釁興洶鏽繡虛噓須許緒續軒懸選癬絢學勳詢尋馴訓訊遜壓鴉鴨啞亞訝閹煙鹽嚴顔閻豔厭硯彥諺驗鴦楊揚瘍陽癢養樣瑤搖堯遙窯謠藥爺頁業葉醫銥頤遺儀彜蟻藝億憶義詣議誼譯異繹蔭陰銀飲櫻嬰鷹應纓瑩螢營熒蠅穎喲擁傭癰踴詠湧優憂郵鈾猶遊誘輿魚漁娛與嶼語籲禦獄譽預馭鴛淵轅園員圓緣遠願約躍鑰嶽粵悅閱雲鄖勻隕運蘊醞暈韻雜災載攢暫贊贓髒鑿棗竈責擇則澤賊贈紮劄軋鍘閘詐齋債氈盞斬輾嶄棧戰綻張漲帳賬脹趙蟄轍鍺這貞針偵診鎮陣掙睜猙幀鄭證織職執紙摯擲幟質鍾終種腫衆謅軸皺晝驟豬諸誅燭矚囑貯鑄築駐專磚轉賺樁莊裝妝壯狀錐贅墜綴諄濁茲資漬蹤綜總縱鄒詛組鑽緻鐘麼為隻兇準啟闆裡靂餘鍊洩';
var pinyin={
  "赵":"zhào",
  "钱":"qián",
  "孙":"sūn",
  "李":"lǐ",
  "周":"zhōu",
  "吴":"wú",
  "郑":"zhèng",
  "王":"wáng",
  "冯":"féng",
  "陈":"chén",
  "褚":"chǔ",
  "卫":"wè",
  "蒋":"jiǎng",
  "沈":"shěn",
  "韩":"hán",
  "杨":"yáng",
  "朱":"zhū",
  "秦":"qín",
  "尤":"yóu",
  "许":"xǔ",
  "何":"hé",
  "吕":"lǚ",
  "施":"shī",
  "张":"zhāng",
  "孔":"kǒng",
  "曹":"cáo",
  "严":"yán",
  "华":"huà",
  "金":"jīn",
  "魏":"wèi",
  "陶":"táo",
  "姜":"jiāng",
  "戚":"qī",
  "谢":"xiè",
  "邹":"zōu",
  "喻":"yù",
  "柏":"bǎi",
  "水":"shuǐ",
  "窦":"dòu",
  "章":"zhāng",
  "云":"yún",
  "苏":"sū",
  "潘":"pān",
  "葛":"gě",
  "奚":"xī",
  "范":"fàn",
  "彭":"péng",
  "郎":"láng",
  "鲁":"lǔ",
  "韦":"wéi",
  "昌":"chāng",
  "马":"mǎ",
  "苗":"miáo",
  "凤":"fèng",
  "花":"huā",
  "方":"fāng",
  "俞":"yú",
  "任":"rèn",
  "袁":"yuán",
  "柳":"liǔ",
  "酆":"fēng",
  "鲍":"bào",
  "史":"shǐ",
  "唐":"táng",
  "费":"fèi",
  "廉":"lián",
  "岑":"cén",
  "薛":"xuē",
  "雷":"léi",
  "贺":"hè",
  "倪":"ní",
  "汤":"tāng",
  "滕":"téng",
  "殷":"yīn",
  "罗":"luó",
  "毕":"bì",
  "郝":"hǎo",
  "邬":"wū",
  "安":"ān",
  "常":"cháng",
  "乐":"yuè",
  "于":"yú",
  "时":"shí",
  "傅":"fù",
  "皮":"pí",
  "卞":"biàn",
  "齐":"qí",
  "康":"kāng",
  "伍":"wǔ",
  "余":"yú",
  "元":"yuán",
  "卜":"bǔ",
  "顾":"gù",
  "孟":"mèng",
  "平":"píng",
  "黄":"huáng",
  "和":"hé",
  "穆":"mù",
  "萧":"xiāo",
  "尹":"yǐn",
  "姚":"yáo",
  "邵":"shào",
  "湛":"zhàn",
  "汪":"wāng",
  "祁":"qí",
  "毛":"máo",
  "禹":"yǔ",
  "狄":"dí",
  "米":"mǐ",
  "贝":"bèi",
  "明":"míng",
  "臧":"zāng",
  "计":"jì",
  "伏":"fú",
  "成":"chéng",
  "戴":"dài",
  "谈":"tán",
  "宋":"sòng",
  "茅":"máo",
  "庞":"páng",
  "熊":"xióng",
  "纪":"jì",
  "舒":"shū",
  "屈":"qū",
  "项":"xiàng",
  "祝":"zhù",
  "董":"dǒng",
  "梁":"liáng",
  "杜":"dù",
  "阮":"ruǎn",
  "蓝":"lán",
  "闵":"mǐn",
  "席":"xí",
  "季":"jì",
  "麻":"má",
  "强":"qiáng",
  "贾":"jiǎ",
  "路":"lù",
  "娄":"lóu",
  "危":"wēi",
  "江":"jiāng",
  "童":"tóng",
  "颜":"yán",
  "郭":"guō",
  "梅":"méi",
  "盛":"shèng",
  "林":"lín",
  "刁":"diāo",
  "钟":"zhōng",
  "徐":"xú",
  "邱":"qiū",
  "骆":"luò",
  "高":"gāo",
  "夏":"xià",
  "蔡":"cài",
  "田":"tián",
  "樊":"fán",
  "胡":"hú",
  "凌":"líng",
  "霍":"huò",
  "虞":"yú",
  "万":"wàn",
  "支":"zhī",
  "柯":"kē",
  "昝":"zǎn",
  "管":"guǎn",
  "卢":"lú",
  "莫":"mò",
  "经":"jīng",
  "房":"fáng",
  "裘":"qiú",
  "缪":"miào",
  "干":"gān",
  "解":"xiè",
  "应":"yīng",
  "宗":"zōng",
  "丁":"dīng",
  "宣":"xuān",
  "贲":"bēn",
  "邓":"dèng",
  "郁":"yù",
  "单":"shàn",
  "杭":"háng",
  "洪":"hóng",
  "包":"bāo",
  "诸":"zhū",
  "左":"zuǒ",
  "石":"shí",
  "崔":"cuī",
  "吉":"jí",
  "钮":"niǔ",
  "龚":"gōng",
  "程":"chéng",
  "嵇":"jī",
  "邢":"xíng",
  "滑":"huá",
  "裴":"péi",
  "陆":"lù",
  "荣":"róng",
  "翁":"wēng",
  "荀":"xún",
  "羊":"yáng",
  "於":"yū",
  "惠":"huì",
  "甄":"zhēn",
  "曲":"qū",
  "家":"jiā",
  "封":"fēng",
  "芮":"ruì",
  "羿":"yì",
  "储":"chǔ",
  "靳":"jìn",
  "汲":"jí",
  "邴":"bǐng",
  "糜":"mí",
  "松":"sōng",
  "井":"jǐng",
  "段":"duàn",
  "富":"fù",
  "巫":"wū",
  "乌":"wū",
  "焦":"jiāo",
  "巴":"bā",
  "弓":"gōng",
  "牧":"mù",
  "隗":"kuí",
  "山":"shān",
  "谷":"gǔ",
  "车":"chē",
  "侯":"hóu",
  "宓":"mì",
  "蓬":"péng",
  "全":"quán",
  "郗":"xī",
  "班":"bān",
  "仰":"yǎng",
  "秋":"qiū",
  "仲":"zhòng",
  "伊":"yī",
  "宫":"gōng",
  "宁":"nìng",
  "仇":"qiú",
  "栾":"luán",
  "暴":"bào",
  "甘":"gān",
  "钭":"tǒu",
  "厉":"lì",
  "戎":"róng",
  "祖":"zǔ",
  "武":"wǔ",
  "符":"fú",
  "刘":"liú",
  "景":"jǐng",
  "詹":"zhān",
  "束":"shù",
  "龙":"lóng",
  "叶":"yè",
  "幸":"xìng",
  "司":"sī",
  "韶":"sháo",
  "郜":"gào",
  "黎":"lí",
  "蓟":"jì",
  "薄":"bó",
  "印":"yìn",
  "宿":"sù",
  "白":"bái",
  "怀":"huái",
  "蒲":"pú",
  "邰":"tái",
  "从":"cóng",
  "鄂":"è",
  "索":"suǒ",
  "咸":"xián",
  "籍":"jí",
  "赖":"lài",
  "卓":"zhuó",
  "蔺":"lìn",
  "屠":"tú",
  "蒙":"méng",
  "池":"chí",
  "乔":"qiáo",
  "阴":"yīn",
  "鬱":"yù",
  "胥":"xū",
  "能":"nài",
  "苍":"cāng",
  "双":"shuāng",
  "闻":"wén",
  "莘":"shēn",
  "党":"dǎng",
  "翟":"zhái",
  "谭":"tán",
  "贡":"gòng",
  "劳":"láo",
  "逄":"páng",
  "姬":"jī",
  "申":"shēn",
  "扶":"fú",
  "堵":"dǔ",
  "冉":"rǎn",
  "宰":"zǎi",
  "郦":"lì",
  "雍":"yōng",
  "郤":"xì",
  "璩":"qú",
  "桑":"sāng",
  "桂":"guì",
  "濮":"pú",
  "牛":"niú",
  "寿":"shòu",
  "通":"tōng",
  "边":"biān",
  "扈":"hù",
  "燕":"yān",
  "冀":"jì",
  "郏":"jiá",
  "浦":"pǔ",
  "尚":"shàng",
  "农":"nóng",
  "温":"wēn",
  "别":"bié",
  "庄":"zhuāng",
  "晏":"yàn",
  "柴":"chái",
  "瞿":"qú",
  "阎":"yán",
  "充":"chōng",
  "慕":"mù",
  "连":"lián",
  "茹":"rú",
  "习":"xí",
  "宦":"huàn",
  "艾":"ài",
  "鱼":"yú",
  "容":"róng",
  "向":"xiàng",
  "古":"gǔ",
  "易":"yì",
  "慎":"shèn",
  "戈":"gē",
  "廖":"liào",
  "庾":"yǔ",
  "终":"zhōng",
  "暨":"jì",
  "居":"jū",
  "衡":"héng",
  "步":"bù",
  "都":"dū",
  "耿":"gěng",
  "满":"mǎn",
  "弘":"hóng",
  "匡":"kuāng",
  "国":"guó",
  "文":"wén",
  "寇":"kòu",
  "广":"guǎng",
  "禄":"lù",
  "阙":"quē",
  "东":"dōng",
  "欧":"ōu",
  "殳":"shū",
  "沃":"wò",
  "利":"lì",
  "蔚":"wèi",
  "越":"yuè",
  "夔":"kuí",
  "隆":"lóng",
  "师":"shī",
  "巩":"gǒng",
  "厍":"shè",
  "聂":"niè",
  "晁":"cháo",
  "勾":"gōu",
  "敖":"áo",
  "融":"róng",
  "冷":"lěng",
  "訾":"zǐ",
  "辛":"xīn",
  "阚":"kàn",
  "那":"nā",
  "简":"jiǎn",
  "饶":"ráo",
  "空":"kōng",
  "曾":"zēng",
  "母":"mǔ",
  "沙":"shā",
  "乜":"niè",
  "养":"yǎng",
  "鞠":"jū",
  "须":"xū",
  "丰":"fēng",
  "巢":"cháo",
  "关":"guān",
  "蒯":"kuǎi",
  "相":"xiàng",
  "查":"zhā",
  "后":"hòu",
  "荆":"jīng",
  "红":"hóng",
  "游":"yóu",
  "竺":"zhú",
  "权":"quán",
  "逯":"lù",
  "盖":"gài",
  "益":"yì",
  "桓":"huán",
  "公":"gōng",
  "晋":"jìn",
  "楚":"chǔ",
  "闫":"yán",
  "法":"fǎ",
  "汝":"rǔ",
  "鄢":"yān",
  "涂":"tú",
  "钦":"qīn",
  "墨":"mò",
  "哈":"hǎ",
  "谯":"qiáo",
  "笪":"dá",
  "年":"nián",
  "爱":"ài",
  "阳":"yáng",
  "佟":"tóng",
  "仉":"zhǎng",
  "督":"dū",
  "归":"guī",
  "海":"hǎi",
  "岳":"yuè",
  "帅":"shuài",
  "缑":"gōu",
  "亢":"kàng",
  "况":"kuàng",
  "后":"hòu",
  "有":"yǒu",
  "琴":"qín",
  "商":"shāng",
  "牟":"móu",
  "佘":"shé",
  "佴":"nài",
  "伯":"bó",
  "赏":"shǎng",
  "言":"yán",
  "福":"fú",
  "万俟":"mò qí",
  "司马":"sī mǎ",
  "上官":"shàng guān",
  "欧阳":"ōu yáng",
  "夏侯":"xià hóu",
  "诸葛":"zhū gě",
  "闻人":"wén rén",
  "东方":"dōng fāng",
  "赫连":"hè lián",
  "皇甫":"huáng pǔ",
  "尉迟":"yù chí",
  "公羊":"gōng yáng",
  "澹台":"tán tái",
  "公冶":"gōng yě",
  "宗政":"zōng zhèng",
  "濮阳":"pú yáng",
  "淳于":"chún yú",
  "单于":"chán yú",
  "太叔":"tài shū",
  "申屠":"shēn tú",
  "公孙":"gōng sūn",
  "仲孙":"zhòng sūn",
  "轩辕":"xuān yuán",
  "令狐":"lìng hú",
  "钟离":"zhōng lí",
  "宇文":"yǔ wén",
  "长孙":"zhǎng sūn",
  "慕容":"mù róng",
  "鲜于":"xiān yú",
  "闾丘":"lǘ qiū",
  "司徒":"sī tú",
  "司空":"sī kōng",
  "亓官":"qí guān",
  "司寇":"sī kòu",
  "颛孙":"zhuān sūn",
  "端木":"duān mù",
  "巫马":"wū mǎ",
  "公西":"gōng xī",
  "漆雕":"qī diāo",
  "乐正":"yuè zhèng",
  "壤驷":"rǎng sì",
  "公良":"gōng liáng",
  "拓跋":"tuò bá",
  "夹谷":"jiá gǔ",
  "宰父":"zǎi fǔ",
  "榖梁":"gǔ liáng",
  "呼延":"hū yán",
  "子车":"zǐ jū",
  "段干":"duàn gān",
  "百里":"bǎi lǐ",
  "东郭":"dōng guō",
  "南门":"nán mén",
  "羊舌":"yáng shé",
  "微生":"wēi shēng",
  "梁丘":"liáng qiū",
  "左丘":"zuǒ qiū",
  "东门":"dōng mén",
  "西门":"xī mén",
  "第五":"dì wǔ",
  "南宫":"nán gōng",
}


var fivechange = new Array()
fivechange["火"] = new Array()
fivechange["火"][1]=[""]
fivechange["火"][2]=["刁","丁","二","力","了"]
fivechange["火"][3]=["彳","大","孓","之","女","勺","巳","乇","幺","弋","丈"]
fivechange["火"][4]=["尺","丹","吊","仃","斗","火","井","支","仂","内","日","太","天","屯","午","爻","仉","止","中"]
fivechange["火"][5]=["丙","代","旦","叨","氐","叮","冬","叻","立","尥","令","另","奶","尼","奴","冉","他","它","田","仝","仗","召","只","左"]
fivechange["火"][6]=["吃","弛","打","忉","氘","多","耳","旮","亘","光","尖","匠","她","决","旯","老","耒","劣","六","甪","氖","囡","年","乓","全","肉","同","氽","佤","妄","吆","宅","兆","旨","至","仲","自"]
fivechange["火"][7]=["犴","呈","辵","呔","甙","但","低","弟","佃","甸","玎","疔","盯","豆","囤","旰","灸","良","牢","李","利","吝","伶","吕","卵","免","男","呐","佞","弄","努","求","忐","忑","町","廷","佟","彤","吞","托","佗","妥","巫","妖","佁","佔","志","豸","住","灼","姊","足"]
fivechange["火"][8]=["哎","佰","长","炒","坼","侈","炊","佽","徂","耷","妲","沓","岱","宕","到","的","狄","底","玓","典","店","耵","定","咚","侗","抖","妒","咄","剁","佴","昉","炅","昊","戽","姐","咎","抉","炕","两","争","政","知","直","昆","剌","来","佬","肋","例","戾","冽","囹","呤","侣","仑","旻","奈","呶","妮","念","弩","疟","妾","炔","乳","侍","帑","弢","忝","佻","帖","投","罔","昕","炎","佯","易","找","制","帙","炙","忠","隹","卓"]
fivechange["火"][9]=["炳","抶","抽","怛","待","怠","殆","眈","抵","帝","酊","订","段","祋","盹","盾","哆","哚","赴","拐","曷","烀","咴","姞","柬","炯","玦","俊","怜","亮","拉","厘","俚","俐","咧","拎","律","哪","娜","柰","耐","南","怒","虐","炮","炱","泰","炭","畋","殄","亭","突","凃","拖","拓","歪","纨","肟","炫","紃","殃","徉","咬","映","昱","怨","灾","炸","招","昭","者","贞","祉","致","盅","重","纣","胄","炷","籽","秭","耔","奏"]
fivechange["火"][10]=["哧","耻","翀","娖","玳","耽","疸","紞","岛","倒","娣","玷","爹","瓞","冻","恫","蚪","趸","耿","烘","恍","疾","晋","珏","倔","烤","俩","凉","畜","烜","朕","肢","值","朗","烙","哩","娌","料","烈","玲","瓴","凌","留","旅","伦","倮","耄","拿","纳","肭","衲","孬","能","娘","恧","衄","哦","秦","恁","朊","芮","蚋","偌","晒","晌","恕","朔","趿","肽","唐","倘","讨","套","特","疼","屉","倜","恬","甜","挑","条","庭","挺","徒","彖","庹","挖","挝","倭","乌","娭","夏","讯","迅","秧","烊","窈","舀","旃","展","站","珍","秩","舯","衷","冢","祝","倬","笫","恣"]
fivechange["火"][11]=["唉","捭","蛃","晡","眵","敕","从","凑","绐","带","袋","聃","胆","啖","蛋","盗","羝","顶","啶","动","敚","舵","阨","珥","烽","晗","焓","焊","斛","将","狷","诀","觖","徕","狼","勒","梨","狸","猁","唳","粒","梁","聊","羚","翎","聆","蛉","娄","卤","鹿","略","囵","捋","珞","那","婥","讷","您","胬","戚","软","晟","胎","酞","贪","袒","啕","剔","悌","粜","烃","停","珽","屠","豚","唾","娲","袜","烷","挽","焐","晞","烯","珣","珧","斩","张","章","帐","啁","侦","振","执","痔","窒","舳","捉","啄","眦","偬"]
fivechange["火"][12]=["掰","焙","采","场","焯","掣","程","塍","嗒","傣","贷","单","氮","悼","登","迪","觌","诋","邸","睇","掂","阽","惦","跌","喋","耋","痘","短","惇","敦","掇","迩","焚","钬","焦","接","嗟","晶","就","厥","吭","詈","晾","量","欻","诊","轸","证","焜","啦","喇","琅","稂","劳","犁","喱","理","傈","痢","捩","裂","趔","琉","硫","虏","掠","抡","捺","喃","赧","捻","傩","晴","闰","婼","邰","毯","探","掏","啼","腆","掭","祧","迢","贴","婷","痛","饨","跎","酡","惋","惘","喔","窝","幄","寻","循","巽","焱","蛘","轺","轶","媛","哲","蛰","彘","智","痣","轴","粢"]
fivechange["火"][13]=["稗","煲","煏","煸","裎","嗤","媸","驰","传","搭","靼","迨","亶","当","砀","嗲","电","殿","揲","牒","鼎","督","煅","顿","躲","惰","跺","烦","觥","煳","焕","煌","晃","幌","诙","迹","煎","炼","煊","睐","啷","廊","酪","诔","傫","愣","蜊","里","赁","零","旒","偻","赂","辂","琭","禄","路","乱","煤","睦","乃","恼","农","暖","逄","稔","塔","痰","逃","绨","提","跳","蜓","艇","退","煺","蜕","脱","驮","陀","顽","脘","畹","煨","炜","蜗","熄","烟","琰","扬","旸","炀","徭","虞","煜","詹","盏","照","罩","蜇","郅","置","雉","追","惴","琢","赀","觜","趑","訾"]
fivechange["火"][14]=["熬","畅","尘","逞","瞅","绰","瘩","捣","嘀","嫡","递","腚","胨","郖","逗","端","对","裰","夺","尔","裹","伙","奖","尽","恺","奁","连","踉","僚","寥","廖","瘌","辣","罱","郎","嫪","嫘","酹","嘞","嫠","粼","绫","领","熘","绺","喽","陋","绿","纶","裸","雒","瑙","嫩","宁","喏","搦","炝","熔","煽","裳","台","态","叹","搪","耥","趟","慆","慝","滕","逖","惕","裼","舔","蜩","通","透","图","团","箨","蜿","绾","腕","诶","鞅","疡","摇","荧","毓","搌","绽","嫜","彰","胀","幛","赵","这","祯","种","逐","缀","缁"]
fivechange["火"][15]=["皑","僾","熛","噌","层","彻","踟","齿","憏","憃","除","褚","踔","逴","辍","腠","褡","逮","儋","弹","德","敌","骶","缔","踮","调","蝶","董","陡","缎","饵","缓","践","瑾","进","噘","练","谅","辆","嘹","寮","阵","鸩","征","诤","赉","阆","唠","乐","黎","厉","撂","刘","瘤","搂","鲁","逯","戮","虑","轮","论","脶","骆","熳","鼐","腩","蝻","脑","闹","馁","辇","侬","驽","挪","噢","僻","热","熵","踏","骀","谈","郯","赕","羰","瑭","躺","铽","踢","缇","髫","抟","褪","驼","腽","辋","腰","瑶","熠","熨","暂","摘","獐","账","折","辄","赭","质","觯","肿","驻","缒","禚","辎"]
fivechange["火"][16]=["撤","陈","撑","鸱","炽","俦","辏","达","殚","掸","惮","导","道","灯","谛","谍","蹀","都","赌","憝","吨","炖","遁","踱","燔","积","撅","獗","琏","撩","獠","燎","璇","臻","赖","褴","螂","捞","擂","缡","璃","罹","历","廪","陵","遛","龙","瘘","卢","陆","录","焖","挠","鲇","哝","诺","逎","燃","烧","燊","遂","鲐","昙","糖","螗","绦","陶","蹄","醍","头","暾","鸵","橐","熹","晓","谑","焰","鸯","晔","燚","燠","璋","瘴","踵","猪","撰","赘","谘","髭"]
fivechange["火"][17]=["暧","餲","灿","龀","瞠","骋","丑","黛","担","瘅","挡","蹈","队","鸸","鲕","烩","绩","琎","爵","裢","殓","魉","疗","阑","痨","缧","儡","励","隶","临","瞵","磷","懔","隆","耧","蝼","缕","螺","麋","缪","黏","咛","騃","燧","遢","蹋","饧","膛","螳","醣","誊","嚏","瞳","疃","臀","襄","燮","谣","遥","繇","燥","择","辗","蟑","褶","鸷","膣","螽","烛","纵"]
fivechange["火"][18]=["痴","虫","戳","丛","戴","焘","鞮","癜","断","怼","丰","烬","粮","缭","职","醪","耢","釐","礼","鲤","膦","噜","辘","璐","谬","蛲","耨","懦","适","曙","抬","鹈","题","阗","餮","魍","曛","曜","烨","瞻","障","遮","谪","贽","掷","踬","转","骓","擢"]
fivechange["火"][19]=["薆","摆","爆","蹭","嘲","蛏","歠","骴","哒","裆","邓","鲷","鸫","胴","蹲","齑","际","谲","蹶","帘","臁","蠊","脸","裣","辽","郑","羸","类","离","丽","呖","邻","遴","辚","鲮","馏","咙","撸","庐","氇","蠃","蟆","撵","脓","庞","曝","蹻","烁","谭","韬","鼗","玺","鄩","绎","赠","鄣","辙","骘","鲻"]
fivechange["火"][20]=["宝","阐","郸","党","鲽","窦","嚼","矍","懒","黧","醴","疠","龄","骝","胧","拢","炉","掳","罗","糯","飘","赡","獭","挞","腾","龆","鼍","曦","耀","赢","躅"]
fivechange["火"][21]=["缠","踌","跻","爝","腊","蜡","癞","斓","览","烂","累","俪","疬","珑","髅","骡","曩","鳎","鲦","鳐","鹞","灶","啭","馔","龇"]
fivechange["火"][22]=["颤","龊","籴","叠","读","龛","鲢","邋","粝","躐","鹨","聋","癃","窿","胪","舻","孪","囊","摄","赎","傥","饕","听","弯","鹧"]
fivechange["火"][23]=["雠","恋","鹩","蛎","鳞","麟","轳","挛","栾","猡","猱","摊","体","显"]
fivechange["火"][24]=["螭","鞑","癫","蠹","攫","雳","谰","鳢","灵","陇","鹭","让","闼","瘫","厅","龌","鳣"]
fivechange["火"][25]=["叆","纛","揽","鬣","酃","颅","脔","摞","囔"]
fivechange["火"][26]=["逦","郦","驴","逻","瘰","攮"]
fivechange["火"][27]=["谠","缆","鸬","鲈","骧"]
fivechange["火"][28]=["魑","跞","轹"]
fivechange["火"][29]=["骊","躏"]
fivechange["火"][30]=["鹂","鲡","鸾","馕"]
fivechange["土"] = new Array()
fivechange["土"][1]=["一","乙"]
fivechange["土"][2]=["又"]
fivechange["土"][3]=["己","山","土","丸","兀","丫","也","尢","于"]
fivechange["土"][4]=["厄","切","王","卬","夭","尹","引","尤","友","予","曰","允"]
fivechange["土"][5]=["凹","瓦","戊","矽","央","以","永","用","由","右","幼","孕","仔"]
fivechange["土"][6]=["吖","安","充","地","圪","艮","圭","灰","圾","岌","戌","圳","圮","屺","戍","似","吐","圩","仵","伍","伢","羊","伊","衣","圯","夷","亦","屹","因","有","宇","羽"]
fivechange["土"][7]=["岙","岜","坂","坌","辰","坊","坩","均","坎","坑","牡","圻","岐","岍","坍","秃","完","位","圬","氙","岘","呀","岈","延","冶","矣","佚","役","邑","吲","甬","攸","卣","佑","余","欤","玙","址"]
fivechange["土"][8]=["艾","坳","垇","坻","坫","矾","附","矸","岣","岵","岬","坷","岢","岫","盱","坤","垃","峁","岷","坭","爬","帕","坢","坯","坪","坡","坦","坨","宛","往","旺","委","忤","亚","奄","肴","夜","依","抑","佾","咏","呦","侑","於","盂","臾","昀","狁"]
fivechange["土"][9]=["哀","垵","拗","砭","垞","衩","昶","垤","垌","峒","肚","砘","垛","垩","垡","垓","垢","砍","砉","奎","趴","怕","盆","砒","垧","哇","娃","威","韦","畏","胃","瓮","屋","侮","型","峋","押","垭","娅","砑","咽","匽","怏","垚","姚","要","咿","怡","咦","姨","舣","姻","音","垠","俑","勇","幽","疣","羑","囿","宥","纡","舁","禹","垣","爰","约","玥","窀"]
fivechange["土"][10]=["啊","唉","埃","砹","鹌","俺","按","案","盎","敖","芺","峬","城","埕","砥","峨","恩","砝","砩","个","埂","埚","轩","砬","埒","埋","砰","破","埔","砌","峭","窃","容","埏","砷","堍","砣","娓","翁","唔","阢","峡","蚜","氩","恹","胭","宴","晏","氧","恙","眙","酏","益","殷","氤","蚓","祐","迂","邘","育","彧","眢","员","袁","砸","砟","砧","肫"]
fivechange["土"][11]=["挨","庵","唵","埯","崩","埠","堾","埭","岽","硐","堆","岗","硌","崮","硅","崞","胡","基","崛","崆","勖","峥","埴","堀","崃","硭","埝","鸟","啪","培","堋","埤","崎","畦","牵","眭","堂","窕","眺","婉","唯","帷","伟","尉","迕","捂","牾","硒","崤","硎","琊","崖","哑","讶","迓","崦","焉","偃","痒","野","痍","移","异","埸","翌","狺","寅","迎","茔","庸","恿","悠","蚰","蚴","狳","域","欲","蛭"]
fivechange["土"][12]=["捱","媕","啽","晻","胺","媪","傲","奡","堡","堛","嵖","砗","堤","奠","堞","恶","费","黑","堠","画","黄","堪","跖","喹","岚","塄","嵋","垴","蛙","崴","为","围","帏","惟","喂","硪","婺","痦","翕","硖","翔","硝","砚","堰","揶","掖","猗","壹","诒","迤","贻","胰","喑","堙","喁","釉","嵛","鼋","粤","越","崽"]
fivechange["土"][13]=["阿","矮","爱","嗌","揞","暗","嗷","嶅","廒","奥","碑","碚","碘","碉","碇","碓","痱","话","觟","嵴","碱","垲","诩","块","跬","袅","硼","圣","嵊","嵩","塑","碎","塌","塘","填","琬","碗","嵬","猥","痿","艉","猬","温","嗡","握","呜","蜈","坞","勋","埙","睚","衙","揠","蜒","爷","揖","饴","诣","意","裔","饮","佣","雍","蛹","犹","猷","瘀","园","圆","援","塬","氲","恽","晕","愠","轾","稚","嵫"]
fivechange["土"][14]=["肮","獒","塝","碥","碴","墋","诞","碲","垫","碟","砜","闺","监","碣","境","墚","顼","嘘","墟","逵","壸","嵝","墁","呕","碰","堑","岖","墒","塾","墅","硕","碳","维","玮","诬","误","寤","瑕","鞋","碹","腌","嫣","耶","腋","祎","旖","夤","瑛","墉","踊","诱","与","鸢","冤","猿","殒","翟","崭","嶂","坠","准"]
fivechange["土"][15]=["腤","鞍","璈","墺","嶓","嶒","墀","磁","磋","嶝","墩","堕","废","坟","磙","嘿","糊","蝴","峤","磕","糈","蝰","崂","磊","嶙","碾","嬲","欧","殴","怄","磐","嵚","确","豌","纬","诿","卫","慰","庑","娴","鸦","养","噎","叶","靥","亿","逸","影","慵","忧","邮","鱿","蝣","牖","谀","缘","院","阅","增","磔"]
fivechange["土"][16]=["嗳","嫒","谙","聱","螯","懊","磅","壁","碜","惯","衡","垦","垮","磨","瓯","碛","墙","融","坛","违","谓","怃","歙","遐","鸭","阉","燕","噫","颐","峄","殪","阴","壅","馀","豫","鸳","螈","运","郓","酝","砖"]
fivechange["土"][17]=["癌","隘","闇","鮟","醠","遨","謷","磴","礅","鲑","壕","壑","磺","矶","礁","圹","岭","硗","嵘","闱","鲔","邬","压","阳","嶷","忆","怿","翳","应","婴","膺","拥","优","黝","隅","屿","辕","远","龠","郧"]
fivechange["土"][18]=["碍","瑷","盫","袄","蹦","璧","础","礓","垒","讴","韪","鄢","医","黟","彝","癔","鄞","鄘","鼬","陨","韫"]
fivechange["土"][19]=["爊","礤","坏","疆","坜","垄","垆","稳","鹉","骛","臆","臃","韵"]
fivechange["土"][20]=["骜","巉","矿","岿","砾","壤","鼯","鹜","邺","瘾","嘤","罂"]
fivechange["土"][21]=["鳌","礴","蠡","砺","砻","碌","礞","巍","撄","誉","跃"]
fivechange["土"][22]=["巅","峦","鸥","懿","隐","璎","鳙","饔"]
fivechange["土"][23]=["娈","岩","缨"]
fivechange["土"][24]=["坝","罐","盐","艳","呓"]
fivechange["土"][25]=[""]
fivechange["土"][26]=[""]
fivechange["土"][27]=[""]
fivechange["土"][28]=["鹦"]
fivechange["土"][29]=["鹳"]
fivechange["土"][30]=[""]
fivechange["金"] = new Array()
fivechange["金"][1]=[""]
fivechange["金"][2]=["匕","刀","人","入","厶","厂"]
fivechange["金"][3]=["才","叉","亍","川","寸","千","刃","三","上","尸","士","夕","小"]
fivechange["金"][4]=["仇","乏","戈","仁","仍","冗","少","升","什","氏","手","殳","四","兮","心","刈","仄","爪"]
fivechange["金"][5]=["册","叱","斥","出","叼","刊","尻","正","仟","且","仞","申","生","失","石","史","矢","世","仕","市","示","甩","司","玊","仙","乍","占","主"]
fivechange["金"][6]=["臣","丞","舛","此","次","汆","存","丢","而","吏","列","任","扔","如","色","舌","式","守","妁","死","寺","夙","凸","刎","西","吸","先","囟","匈","旬","曳","再","在","早","吒","州","舟","字"]
fivechange["金"][7]=["扱","岔","吵","车","成","赤","氚","串","吹","忖","兑","秀","序","卮","吱","判","七","吣","忍","妊","礽","删","劭","佘","伸","身","束","吮","私","伺","兕","姒","宋","忒","吻","伭","辛","巡","酉","皂","伫","助","妆","壮","孜","走","佐","作","坐"]
fivechange["金"][8]=["侘","昌","抄","弨","扯","忱","承","忡","初","垂","佌","刺","儿","庚","刮","戋","金","净","侃","刻","侄","孥","妻","戕","青","取","叁","刹","姗","疝","尚","舍","社","侁","呻","使","始","事","受","抒","叔","刷","祀","忪","怂","所","兔","昔","穸","些","姓","刖","甾","昃","怎","咋","轧","忮","周","妯","咒","宙","侏","抓","宗","卒"]
fivechange["金"][9]=["臿","查","姹","差","拆","怊","伡","疢","宬","怵","穿","舡","春","殂","促","毒","度","耏","钆","宫","剞","刭","俓","咻","庥","胥","叙","宣","怔","枯","前","怯","侵","秋","纫","肜","柔","砂","衫","舢","厍","哂","矧","甚","牲","省","施","食","室","是","首","姝","耍","帅","闩","思","娀","叟","俗","剃","祆","籼","庠","削","信","星","性","页","钇","俞","俣","哉","昝","蚤","则","眨","咤","咫","峙","肘","拄","拙","咨","姿","俎","昨","怍"]
fivechange["金"][10]=["剥","财","睬","仓","敇","豺","刬","伥","倡","鬯","晁","眧","耖","唓","宸","乘","蚩","持","翅","刍","俶","纯","祠","脆","厝","凋","钉","珐","刚","罡","剐","怪","借","峻","钌","修","脩","訏","徐","痃","畛","疹","拯","症","倪","钋","剖","倩","挈","邛","讱","轫","衽","狨","辱","弱","珊","闪","讪","剡","扇","哨","射","珅","娠","神","眚","师","十","时","拾","狩","书","纾","殊","衰","拴","素","祟","孙","隼","唆","索","恸","剜","紊","唏","息","席","掀","宵","笑","眩","殉","栽","宰","奘","唣","哳","痄","窄","钊","针","真","纸","指","酎","疰","拽","酌","租","祖","祚","唑","座"]
fivechange["金"][11]=["偲","彩","参","曹","侧","钗","产","娼","常","徜","唱","巢","晨","趻","偁","琤","瓻","匙","豉","舂","崇","紬","偢","处","绌","啜","船","钏","玼","疵","瓷","粗","啐","挫","得","钓","钒","副","寂","祭","剪","旌","勘","羞","袖","酗","旋","胗","栀","胝","馗","率","捏","钕","珮","阡","钎","氢","圊","悫","雀","蚺","唼","啥","钐","商","捎","绍","奢","蛇","设","赦","绅","胂","售","孰","庶","唰","爽","悚","讼","宿","狻","捅","偷","钍","问","悉","欷","觋","徙","细","舷","祥","斜","偰","訢","衅","邢","悦","责","舴","扎","蚱","砦","粘","趾","终","昼","珠","蛀","专","着","紫","族","组","胙","做"]
fivechange["金"][12]=["钯","钣","钸","猜","裁","残","伧","厕","嗏","觇","孱","猖","惝","敞","怅","钞","超","朝","抻","牚","胵","啻","惆","喘","窗","创","捶","词","猝","酢","悴","毳","皴","嵯","痤","矬","措","貂","掉","钭","钝","贰","钫","钙","割","钩","辜","壶","戟","绝","钧","竣","剀","琇","须","婿","絮","喧","挣","狰","帧","脂","殖","絷","钠","甯","钮","掊","裒","钤","钦","禽","情","氰","然","韧","绒","伞","散","丧","扫","嫂","痧","跚","善","稍","邵","猞","畲","肾","甥","盛","剩","视","授","瘦","疏","舒","黍","述","税","顺","舜","丝","斯","俟","竦","嗖","酥","诉","粟","飧","睃","钛","替","童","推","惜","傒","晰","犀","粞","舾","舄","羡","象","胸","绚","喻","钥","咱","凿","枣","迮","曾","喳","诈","掌","诏","轵","众","蛛","贮","兹","诅","尊","阼"]
fivechange["金"][13]=["铋","钵","钹","铂","踩","粲","恻","插","诧","琛","嗔","脭","絺","饬","傺","愁","稠","酬","蜍","楚","揣","歂","蠢","跐","琮","催","瘁","搓","脞","钿","堵","钴","钾","剿","捷","靖","钜","钶","貅","绣","嗅","煦","揎","暄","钲","睁","铃","铆","钼","铌","刨","铍","钷","铅","钳","蜣","惬","嗪","銎","饪","揉","塞","搔","裟","歃","煞","伤","艄","蛸","诜","蜃","诗","狮","势","试","轼","毹","暑","鼠","蜀","睡","嗍","嗣","肆","送","搜","肃","嗉","睢","岁","嗦","羧","唢","铊","钽","酮","媳","郄","酰","嫌","蚬","跣","详","想","绡","新","歆","惺","猩","铉","驯","询","铀","铕","愉","揄","蝓","伛","钰","裕","愈","钺","载","贼","揸","闸","债","斟","黹","酯","诛","邾","瘃","庄","装","资","揍","阻"]
fivechange["金"][14]=["铵","艑","綵","嘈","察","瘥","僝","嫦","玚","綝","称","诚","铖","酲","铳","搊","绸","裯","殠","搐","搋","僢","怆","慈","雌","粹","翠","铞","铥","睹","铒","罚","阀","铬","铪","郝","划","铰","精","聚","劂","铐","需","赈","蜘","摭","铑","闾","铭","陧","齐","綮","慊","戗","腔","抢","劁","寝","蜻","铨","逡","认","铷","瑞","睿","搡","瘙","铯","僧","绱","韶","赊","慎","逝","誓","寿","绶","署","说","搠","嗽","诵","嗾","瞍","速","愫","僳","觫","酸","狲","损","铫","铜","僮","骰","途","酴","僖","蜥","铣","屣","郤","禊","衔","线","限","像","逍","铘","铱","劓","铟","银","腴","瑜","窬","臧","造","啧","帻","甄","碡","帚","铢","综","腙","粽","僔"]
fivechange["金"][15]=["锕","钡","惭","惨","艖","掺","摻","婵","鋋","廛","谄","肠","麨","瞋","漦","瘛","冲","摴","厨","锄","諔","嘬","疮","摐","噇","踳","赐","醋","摧","锉","嘟","锇","锋","敷","锆","刽","刿","铗","缄","剑","节","靓","锔","剧","锞","锈","绪","儇","稹","刳","锒","锂","锍","锊","劈","铺","噙","锓","请","趣","髯","糅","锐","腮","毵","磉","傻","陕","殇","赏","审","谂","胜","实","蚀","驶","奭","艏","熟","数","腧","摔","谁","咝","缌","嘶","驷","艘","螋","谇","琐","锑","铤","腿","鋈","嘻","陷","缐","腺","哓","销","锌","腥","陉","缊","糌","驵","噪","锃","帜","陟","挚","皱","嘱","翥","幢","谆","诼","踪","诹","陬"]
fivechange["金"][16]=["锛","餐","憯","穇","舱","糙","蹅","侪","幨","阊","氅","鋹","谌","踸","赪","褫","憧","瘳","踹","遄","陲","锤","輴","錞","糍","璁","璀","撮","蹉","鹾","错","锝","雕","锭","辐","钢","锢","锪","辑","锦","静","锯","锩","髹","谖","缜","铮","整","锟","铼","钔","锰","穆","锫","凭","錡","钱","锖","嫱","揿","瘸","蹂","儒","缛","褥","噻","嬗","膳","鄃","输","蛳","撕","稣","锬","颓","锡","羲","螅","阋","锨","醒","谒","逾","觎","谕","憎","甑","瘵","战","绉","诸","麈","撞","锥","锱","郰","撙"]
fivechange["金"][17]=["锿","嚓","擦","縩","操","艚","螬","懆","馇","锸","禅","偿","韔","鼌","帱","憷","歜","黜","膗","聪","独","镀","锻","锷","锅","锾","徽","蹇","饯","键","骏","锴","链","鸺","鍼","镅","镁","縻","鍪","遣","跄","锹","锲","嚅","孺","鄏","赛","糁","缫","擅","声","谥","蟀","瞬","锶","耸","锼","谡","虽","隋","缩","膝","蟋","谿","戏","鲜","痫","猃","馅","谢","逊","翼","舆","糟","罾","铡","斋","毡","锗","钟","诌","瞩","总","邹"]
fivechange["金"][18]=["翱","鏊","镑","鎞","饆","璨","蝉","繟","儭","艟","懤","雏","幮","储","蹙","窜","鄜","镐","镉","环","秽","劐","镓","铠","镇","织","镏","镎","聂","啮","镍","拧","狞","阕","阙","镕","鞣","铩","缮","蟮","觞","婶","双","飕","锁","钨","雟","饩","燹","蟓","擤","镒","遭","赜","缯","膪","颛","鬃"]
fivechange["金"][19]=["鏖","镚","镖","襜","蟾","铲","鲳","惩","迟","宠","畴","辞","蹴","祷","镝","颠","牍","犊","镜","铿","馐","选","鎏","镂","镘","锚","镆","锘","迁","锵","谯","鲭","鹊","颡","骚","臊","膻","鄯","绳","识","兽","摅","馊","擞","镗","醯","系","暹","赞","錾","躁","谮","鲰","镞","遵"]
fivechange["金"][20]=["镡","犨","触","鰆","镫","镦","镄","铧","锏","镢","鐍","锎","镣","续","铹","鏻","聍","镤","镨","缱","镪","黥","謦","蝾","襦","繻","蠕","鳃","馓","骟","释","孀","铴","璺","霰","馨","译","谵","驺"]
fivechange["金"][21]=["鐾","骖","鸧","虿","搀","忏","羼","韂","衬","铛","躇","呲","鹚","骢","铎","镌","镰","镭","嗫","谴","蛩","麝","随","隧","邃","铁","燨","险","镱","儹","踯","属","镯","鄹"]
fivechange["金"][22]=["镔","镲","躔","冁","摛","蹰","撺","镬","鉴","癣","跫","慑","袭","隰","骁","铸"]
fivechange["金"][23]=["镳","黪","髑","镥","颥","鳝","铄","鸶","髓","鼷","鱚","纤","鹇","攒","脏","齇","鳟"]
fivechange["金"][24]=["镈","蚕","谗","谶","矗","鑫","瓒","骤"]
fivechange["金"][25]=["鑶","镵","鲿","蹿","镧","蹑","镶","赃"]
fivechange["金"][26]=["馋","镩","骥","镊","酾","跹","趱"]
fivechange["金"][27]=["黩","銮","锣","颞","钻"]
fivechange["金"][28]=["齼"]
fivechange["金"][29]=[""]
fivechange["金"][30]=["爨"]
fivechange["水"] = new Array()
fivechange["水"][1]=[""]
fivechange["水"][2]=["勹","卜","乜"]
fivechange["水"][3]=["凡","亡","下","子"]
fivechange["水"][4]=["巴","比","不","歹","反","方","分","夫","父","互","户","化","幻","毛","爿","匹","片","壬","卅","水","文","毋","勿"]
fivechange["水"][5]=["叭","白","半","包","北","必","弁","卟","布","弗","付","夯","禾","弘","乎","玄","矛","民","皿","末","母","仫","目","丕","皮","氕","平","叵","仨","兄","穴","疋","印","匝"]
fivechange["水"][6]=["扒","百","冰","并","凼","伐","帆","氾","犯","仿","妃","份","缶","伏","亥","好","合","冱","回","汁","米","糸","名","牟","仳","牝","乒","收","汀","危","向","刑","行","凶","休","血"]
fivechange["水"][7]=["吧","夿","弝","伴","贝","伻","皀","佊","吡","妣","庇","别","兵","伯","孛","吥","步","汊","池","汎","妨","彷","吠","吩","佛","否","呋","孚","甫","汞","佝","含","罕","汗","亨","宏","囫","弧","汲","即","江","戒","况","冷","忙","尨","每","芈","妙","尿","妞","伾","屁","汝","汕","汜","忘","尾","污","汐","希","孝","形","汛","妤","妘"]
fivechange["水"][8]=["岸","八","把","爸","扳","攽","版","扮","姅","孢","卑","屄","沘","彼","畀","忭","抃","汳","汴","表","秉","幷","帛","瓝","沉","沌","泛","房","放","非","氛","汾","忿","奉","扶","府","咐","阜","侅","冈","汩","卦","沆","呵","劾","和","佫","呼","虎","或","泐","盲","牦","没","妹","门","氓","孟","汨","宓","明","命","殁","沫","侔","姆","沐","牧","忸","扭","狃","抛","咆","庖","呸","沛","佩","帔","朋","批","沏","汔","汽","沁","沙","沈","汰","汪","味","汶","沃","武","物","弦","冼","享","协","忻","幸","汹","沂","雨","沅","咂","沚","状"]
fivechange["水"][9]=["疤","拔","拜","拌","保","抱","背","祊","甭","泵","毖","扁","窆","拚","便","昪","波","泊","勃","哺","怖","匆","沲","法","畈","飞","沸","狒","玢","风","封","凫","怫","拂","俘","氟","罘","拊","讣","负","泔","沽","哈","孩","河","很","红","泓","侯","后","厚","狐","怙","徊","奂","宦","皇","虺","哕","计","沮","炬","姥","泪","泠","泖","昴","冒","玫","眉","美","昧","虻","咪","弭","泌","沔","勉","眇","秒","咩","抿","泯","抹","哞","某","拇","泥","拍","哌","泮","叛","盼","狍","泡","疱","怦","抨","披","毗","姘","品","屏","泼","匍","柒","泣","泅","泉","染","娆","沭","泗","沱","咸","香","巷","泄","卸","泫","泶","妍","沿","泱","盈","泳","油","沾","沼","治","注"]
fivechange["水"][10]=["氨","粑","呗","班","般","舨","豹","趵","倍","倴","畚","秕","俾","舭","毕","珌","髟","俵","病","玻","砵","亳","庯","秤","臭","泚","洞","娥","洱","肪","纺","舫","肥","匪","肺","纷","峰","俸","服","祓","蚨","俯","釜","害","氦","蚶","邗","函","航","耗","盍","狠","恨","哼","恒","洪","候","祜","洹","洄","恚","活","洎","浃","津","酒","恤","洫","洌","洛","马","邙","旄","们","勐","洣","敉","秘","眠","眄","珉","秣","毪","亩","纽","俳","派","畔","袢","旁","配","疲","蚍","拼","娉","俜","洴","珀","哱","圃","凄","讫","迄","洽","洳","洒","杀","纱","娑","洮","洼","洧","纹","蚊","务","洗","效","胁","绁","洩","屑","恂","洵","训","衍","洋","洇","耘","拶","洲","洙","浊"]
fivechange["水"][11]=["捌","豝","胈","败","绊","邦","浜","胞","狈","被","偝","偪","逼","闭","狴","婢","庳","敝","贬","匾","徧","彪","婊","邠","斌","浡","舶","捕","涔","唇","讹","返","贩","访","啡","酚","唪","趺","麸","绂","绋","浮","匐","艴","妇","够","海","酣","浛","毫","浩","盒","痕","珩","唿","唬","扈","瓠","患","凰","悔","彗","晦","婚","货","浸","泾","涓","浚","虚","浪","流","麻","麦","脉","曼","袤","浼","眯","觅","密","冕","喵","苗","敏","眸","涅","徘","胖","脬","袍","匏","胚","旆","烹","啤","偏","殍","票","贫","婆","粕","浦","渠","涩","涉","涑","挲","涕","涂","晚","望","偎","浯","浠","习","涎","消","邪","挟","婞","讻","雪","涌","鱼","雩","浴","浙","浞"]
fivechange["水"][12]=["跋","阪","湴","绑","傍","棓","报","悲","邶","备","贲","絣","琫","诐","邲","弼","皕","赑","揙","猋","幖","邴","啵","博","跛","钚","瓿","淳","淙","淬","淡","发","番","饭","邡","防","扉","淝","悱","斐","粪","冯","稃","跗","涪","袱","幅","复","傅","富","淦","蛤","涫","胲","顸","邯","涵","寒","喊","琀","绗","淏","诃","喝","涸","訸","贺","惚","淮","唤","徨","蛔","惠","混","耠","惑","渐","荆","涼","涞","淋","淩","渌","沦","傌","买","茫","蛑","贸","帽","媒","媚","寐","扪","闷","猛","脒","幂","黾","描","淼","闵","淖","排","牌","跑","彭","捧","邳","痞","胼","评","迫","普","淇","浅","清","脎","深","淑","涮","淞","淌","淘","添","淟","涴","雯","涡","无","淅","喜","闲","现","项","淆","雄","徇","涯","淹","液","淫","淤","淯","渊","云","粥","涿","淄"]
fivechange["水"][13]=["靶","颁","斑","斒","稖","雹","陂","琲","迸","哔","愊","愎","痹","辟","閟","惼","飑","禀","摒","脖","渤","补","测","滁","渡","沨","蜂","脯","溉","港","傼","颃","嗥","号","郃","貉","郈","轷","湖","猢","琥","郇","换","涣","豢","惶","湟","挥","晖","汇","会","贿","喙","毁","浑","贾","湔","茳","湫","较","粳","鸠","渴","粱","溆","雷","妈","吗","湄","猸","渼","盟","迷","渺","湣","愍","酩","莫","貊","脲","琶","湃","湓","琵","媲","睥","犏","剽","聘","瓶","裘","惹","绥","汤","湍","微","湋","渭","渥","熙","湘","渫","渲","湮","游","渝","郁","渣","湛","浈","滞","渚","煮"]
fivechange["水"][14]=["搬","蝂","饱","悖","绷","嘣","鼻","币","滗","裨","弊","碧","馝","稨","滮","裱","宾","菠","驳","搏","僰","箔","逋","沧","滀","呆","涤","滇","绯","蜚","腓","翡","偾","疯","逢","凤","孵","郛","福","辅","腑","滏","腐","阁","沟","嘏","寡","滚","嗨","豪","滈","阂","菏","瑚","华","滑","猾","痪","滉","珲","诲","魂","溷","祸","溘","溧","溴","滥","溜","犸","唛","嘛","幔","髦","瑁","瞀","么","酶","艋","蜢","嘧","蜜","绵","瞄","灭","闽","鸣","冥","溟","暝","嫫","麽","陌","寞","溺","滂","搒","脾","罴","蜱","嘌","嫖","萍","颇","仆","溥","蜞","溱","溶","溽","飒","饲","溲","溯","溻","溏","滔","网","瘟","闻","郚","舞","郗","溪","携","熊","踅","熏","窨","溢","荥","源","滋","滓"]
fivechange["水"][15]=["鲃","魃","罢","瘢","魬","褒","鸨","褓","暴","辈","褙","骳","奔","陛","腷","駜","髲","编","蝙","褊","缏","麃","摽","憋","饼","葧","踣","餔","部","漕","浐","蝽","漘","醇","滴","幡","范","鲂","诽","肤","幞","蝠","驸","赋","腹","蝜","蝮","澉","缑","盥","虢","憨","汉","撖","颌","褐","滹","浒","沪","哗","踝","逭","漶","辉","麾","慧","浆","涟","漩","震","漤","凛","漏","漉","履","落","玛","码","祃","劢","卖","鞔","满","慢","漫","漭","猫","蝥","貌","霉","魅","缅","缈","庙","缗","瞑","摸","摩","漠","墨","慕","暮","沤","蒎","盘","醅","赔","喷","嘭","郫","陴","翩","漂","魄","噗","漆","憩","渗","漱","霆","万","逶","嬉","虾","饷","霄","勰","写","演","漾","漪","颍","渔","漳","涨","渍"]
fivechange["水"][16]=["澳","鲅","办","鲍","虣","惫","糒","甏","嬖","觱","鮅","鞞","遍","辨","瘭","傧","拨","饽","播","鲌","膊","馞","潺","潮","澈","澄","霏","奋","愤","讽","抚","鲋","骸","骇","颔","翰","翮","醐","寰","遑","潢","讳","阍","馄","涧","浇","洁","噱","溃","潦","涝","霖","蚂","骂","瞒","螨","醚","悯","螟","瘼","默","谋","霓","凝","潘","螃","耪","陪","霈","澎","膨","骈","蹁","谝","瓢","瞟","撇","瞥","频","鲆","扑","氆","潜","润","撒","霎","潸","潲","渑","澍","澌","潭","烫","潼","隈","沩","涠","阌","宪","廨","兴","学","浔","鄅","沄"]
fivechange["水"][17]=["癍","帮","谤","跸","臂","褾","豳","擘","澹","点","淀","璠","繁","鼢","缝","缚","醢","鼾","韩","憾","撼","嚎","鸿","觳","浣","擐","璜","隳","浍","诨","濂","阔","蒗","澧","潞","嬷","缦","蟒","蟊","弥","谜","糜","谧","摹","膜","浓","蟠","貔","缥","螵","嫔","皤","璞","霜","濉","禧","霞","乡","鲞","亵","懈","獬","鲟","澡","泽","澶"]
fivechange["水"][18]=["鼥","鞴","鄙","毙","濞","髀","奰","鞭","飚","蹩","滨","摈","殡","袯","鹁","馎","鵏","闯","荡","翻","黻","赙","覆","馥","濠","阖","鄠","鲩","缋","蟪","济","谩","鄚","朦","鄍","谟","馍","貘","泞","蹒","蟛","癖","濮","濡","鲨","湿","穗","涛","潍","隙","獯","滢","杂","濯"]
fivechange["水"][19]=["瓣","鹎","襞","瀌","瘪","薄","醭","簿","瀍","鹑","渎","蹯","鲱","羹","鞲","鲴","缳","绘","嚯","溅","猎","浏","泺","懑","懵","蠓","祢","靡","湎","鹋","鹏","骗","鄱","谱","蹼","瀑","扰","雾","泻","霪"]
fivechange["水"][20]=["膀","龅","鲾","避","襣","躄","鳊","辫","穮","缤","濒","蠙","膑","黼","鳆","瀚","蚝","鹕","怀","还","濑","沥","泷","泸","迈","颟","馒","鹛","蠛","魔","譬","嚷","邂","瀣","潆","瀛","潴"]
fivechange["水"][21]=["黯","霸","辩","骠","膘","飙","襮","藩","瀵","鹤","轰","护","潋","澜","露","猕","腼","邈","霹","鼙","鳍","瀼","攘","潇","醺","瀹"]
fivechange["水"][22]=["边","鳔","鳖","沣","灌","骅","欢","獾","霁","漓","霾","鳗","艨","鳘","耱","瓤","穰","滠","响","飨","鳕","藻"]
fivechange["水"][23]=["鷩","变","鲼","鬟","禳","滩"]
fivechange["水"][24]=["蚌","髌","鬓","霍","辔","颦","躞"]
fivechange["水"][25]=["灞","酆","灏","鹱","漯","蛮","蘼","襻"]
fivechange["水"][26]=["湾"]
fivechange["水"][27]=["滦","缬"]
fivechange["水"][28]=["滟","戅"]
fivechange["水"][29]=[""]
fivechange["水"][30]=["骉"]
fivechange["木"] = new Array()
fivechange["木"][1]=[""]
fivechange["木"][2]=[""]
fivechange["木"][3]=["干","工","弓","丌","及","孑","巾","久","口","廿","乞","彡","已"]
fivechange["木"][4]=["卞","丐","公","勾","介","今","斤","亢","孔","木","牛","亓","欠","犬","牙","元","月","匀"]
fivechange["木"][5]=["本","尕","甘","功","古","瓜","宄","卉","加","甲","叫","句","巨","卡","可","叩","卯","巧","丘","囚","去","外","未","五","仡","玉","札"]
fivechange["木"][6]=["朳","朵","尬","各","共","乩","吉","伎","奸","幵","囝","件","交","臼","伉","考","朽","旭","匡","夼","企","犰","曲","戎","仰","吁","聿","朱","竹"]
fivechange["木"][7]=["杓","材","岑","杈","床","村","杜","呃","伽","改","杆","杠","告","更","攻","估","谷","庋","呙","囯","旱","何","吼","肓","妓","忌","夹","见","角","疖","劫","妗","究","局","姖","君","佧","扛","囥","壳","克","扣","困","伲","你","杞","扦","羌","劬","却","杉","我","吴","吾","扤","杌","匣","吓","杏","言","吟","杖"]
fivechange["木"][8]=["昂","枊","板","杯","杵","东","妸","扼","枋","斧","秆","杲","疙","供","咕","姑","孤","固","呱","乖","官","果","杭","忽","昏","肌","亟","佶","技","季","佳","肩","艽","佼","届","卺","京","纠","赳","玖","疚","居","咀","具","卷","咔","咖","抗","肯","空","枕","枝","快","狂","林","枚","杪","艿","呢","杻","杷","枇","其","奇","歧","穹","虬","屈","券","枘","松","枉","卧","析","呷","欣","芎","厓","兖","杳","宜","竺","杼"]
fivechange["木"][9]=["柲","柄","柴","柢","芏","俄","枹","尜","肝","柑","竿","疳","肛","缸","纥","革","虼","哏","狗","枸","牯","故","冠","咣","皈","轨","癸","柜","哄","訇","虹","芨","咭","级","急","纪","既","枷","叚","架","建","牮","姜","姣","皆","界","疥","蚧","矜","劲","扃","九","韭","拘","狙","拒","军","看","柯","科","咳","客","芝","哐","柃","柳","咯","芒","怩","昵","拈","柈","芃","枰","祈","芑","契","恰","芊","俏","俅","酋","畎","芍","柿","柁","柝","芄","玩","侠","狎","柙","相","枵","彦","奕","弈","疫","羿","胤","柚","禺","竽","芋","栅","柘","枳","柱","斫","柞"]
fivechange["木"][10]=["桉","芭","笆","柏","栢","梆","苄","栟","屙","婀","苊","芳","芬","粉","芙","酐","绀","羔","高","哥","格","鬲","哿","根","耕","哽","肱","恭","蚣","躬","拱","贡","股","骨","罟","挂","倌","桄","鬼","桂","衮","核","桁","讧","笏","花","桓","恢","唧","姬","屐","笄","笈","脊","记","珈","家","痂","恝","兼","豇","狡","讦","拮","桀","芥","衿","肼","弪","径","柩","桕","疽","桔","俱","倨","娟","倦","桊","隽","拷","栲","珂","疴","恪","倥","恐","芤","栩","祗","哭","库","框","括","栝","栳","栗","匿","臬","耙","芘","栖","芪","耆","岂","起","气","虔","肷","芡","衾","芩","芹","祛","拳","缺","桑","芟","秫","栓","凇","笋","桃","桐","砼","桅","芴","奚","哮","校","芯","桠","芽","芫","唁","苡","倚","痈","邕","娱","圄","峪","原","纭","芸","笊","芷","桎","株","桌"]
fivechange["木"][11]=["茇","苞","苯","笨","苾","梐","彬","梣","茬","趁","笞","茌","崔","笪","笛","兜","轭","梵","苻","桴","符","苷","敢","舸","梗","珙","苟","笱","蛄","梏","牿","胍","规","匦","国","悍","捍","偈","寄","笳","袈","戛","蛱","胛","徦","假","坚","枧","趼","健","皎","教","秸","婕","堇","近","婧","竟","救","苴","趄","苣","捐","眷","桷","捃","胩","康","苛","氪","啃","寇","许","苦","眶","悝","盔","悃","捆","梱","婪","笠","啉","苓","茅","茆","茂","梅","苠","茉","苜","旎","偶","苤","笸","启","弃","乾","悄","茄","卿","顷","筇","蚯","区","蛆","朐","娶","悛","圈","痊","苒","若","啬","苫","梢","苕","笙","倏","梳","术","笥","桫","梭","苔","梯","笤","梃","桶","偓","梧","悟","晤","狭","厢","枭","偕","械","研","厣","眼","悒","挹","翊","茚","英","唷","圉","庾","苑","笮","苎","棁","茁","梓"]
fivechange["木"][12]=["棒","笔","草","策","茶","枨","茺","楮","篅","荈","棰","茈","茨","答","等","第","棣","迭","栋","筏","棼","茯","尴","皋","胳","袼","给","茛","轱","觚","酤","诂","雇","棺","贯","胱","晷","贵","棍","聒","椁","皓","闳","喉","荒","茴","嵇","极","戢","棘","殛","集","几","掎","悸","迦","袷","跏","间","犍","荐","绛","茭","椒","蛟","绞","窖","喈","街","杰","结","筋","荩","阱","景","痉","窘","啾","厩","掬","椐","莒","讵","距","犋","掘","珺","喀","开","凯","闶","钪","轲","棵","控","椋","植","筐","贶","傀","喟","蛞","棱","荔","络","荦","荬","棉","茗","猊","棚","椑","期","欺","祁","棋","掐","掮","茜","嵌","强","羟","乔","邱","球","诎","蛐","荃","筌","荏","茸","茹","阮","森","筛","耜","覃","棠","茼","统","筒","椭","皖","稀","厦","筅","荇","悻","荀","雅","掩","雁","尧","傜","荑","椅","茵","硬","哟","驭","饫","寓","栈","棹","茱","椎","棕","最"]
fivechange["木"][13]=["嗄","荸","箅","筴","搽","猹","槎","茝","椿","榱","戥","荻","椴","莪","蛾","愕","枫","莩","该","陔","赅","戤","概","感","幹","筻","嗝","塥","跟","绠","诟","彀","痼","诖","琯","诡","跪","嗬","荷","猴","逅","畸","嫉","楫","麂","荚","嫁","拣","笕","减","楗","毽","酱","郊","跤","脚","敫","揭","诘","睫","解","仅","禁","靳","经","茎","睛","胫","敬","迥","揪","舅","琚","雎","榉","绢","筠","揩","慨","楷","戡","莰","稞","窠","嗑","筘","廉","楝","窟","夸","蒯","诓","揆","暌","琨","髡","廓","莨","楞","莉","莅","琳","莽","莓","楣","娩","募","楠","逆","睨","筢","榀","莆","颀","琦","琪","祺","佥","愆","箝","呛","樯","愀","琴","勤","倾","楸","诠","辁","裙","群","嗓","莎","筲","椹","筮","竖","颂","荽","莛","荼","莞","莴","斡","珷","皙","暇","莶","苋","楔","歇","莘","楦","靴","筵","罨","杨","椰","业","义","肄","楹","莜","莸","莠","愚","榆","瘐","预","御","楂","桢","孳","罪"]
fivechange["木"][14]=["菝","榜","菢","菶","萆","菜","菖","苌","尝","篪","椽","菙","萃","萏","菪","凳","摁","菲","榧","菔","嘎","盖","赶","纲","睾","膏","搞","槁","诰","郜","歌","搿","箇","郠","构","菇","菰","箍","鼓","褂","管","逛","绲","帼","蜾","菡","赫","瘊","槐","萑","夥","箕","暨","跽","嘉","郏","瘕","笺","菅","搛","戬","僭","降","僬","侥","饺","酵","截","竭","诫","骱","紧","廑","菁","腈","兢","僦","裾","菊","矩","皲","菌","郡","忾","犒","裉","箜","榛","筝","骷","酷","筷","魁","睽","匮","愧","莱","榔","菱","榴","杩","樠","萌","墓","幕","萘","箄","裴","菩","桤","萋","嘁","萁","旗","綦","绮","葺","搴","歉","枪","敲","侨","诮","箧","轻","箐","逑","赇","巯","蜷","绻","榷","荣","榕","箬","瑟","菽","槊","菘","算","榫","榻","萄","萜","菟","菀","伪","萎","菥","箫","榍","榭","菸","厌","酽","疑","瘗","蜴","萤","郢","萸","语","妪","箢","瑗","愿","菑","榨","寨","肇","菹"]
fivechange["木"][15]=["葆","萹","箯","标","槽","箣","郴","樗","枞","稻","噔","蒂","腭","樊","葑","橄","稿","葛","赓","巩","穀","广","妫","瑰","郭","掴","荭","篌","糇","葫","槲","篁","蝗","叽","缉","赍","稽","瘠","挤","稷","葭","价","驾","稼","俭","翦","贱","腱","箭","僵","桨","娇","胶","噍","颉","羯","槿","儆","獍","阄","樛","驹","踞","蒈","慷","靠","颏","瞌","蝌","课","缂","抠","萱","箴","侉","侩","宽","款","诳","葵","醌","阃","楼","面","模","耦","葩","篇","葡","槭","葜","悭","椠","庆","穷","茕","萩","蝤","葚","枢","樘","葶","葳","苇","蒍","妩","葸","瞎","贤","缃","葙","箱","蝎","样","仪","谊","毅","莹","媵","窳","葬","樟","荮","著","箸","醉"]
fivechange["木"][16]=["蓓","荜","筚","蓖","篦","蔀","篰","苍","橙","篘","莼","笃","饿","谔","鄂","阏","萼","遏","噩","蒽","篚","噶","篙","糕","缟","膈","骼","鸪","毂","掼","龟","辊","过","蒿","嚆","横","黉","骺","鲎","桦","慌","隍","荤","机","畿","墼","蒺","剂","冀","髻","颊","缣","蒹","谏","踺","彊","耩","犟","挢","徼","缙","噤","颈","憬","橘","举","踽","窭","鄄","橛","麇","瞰","眍","篥","蓄","蓁","蒸","裤","哙","窥","愦","梦","蒲","朴","器","褰","黔","橇","桥","憔","樵","撬","鞘","亲","擒","檎","螓","檠","磬","遒","鼽","糗","趋","鸲","磲","桡","蓉","蓐","穑","树","蒴","蒜","荪","蓑","蓊","樨","县","橡","筱","啸","谐","阎","谚","窑","缢","荫","萦","蓥","嬴","颖","阈","遇","圜","樾","筑","篆","嘴","樽"]
fivechange["木"][17]=["蒡","蔽","檦","檗","蔡","柽","苁","葱","蔟","簇","档","瞪","懂","蔸","篼","擀","鸽","篝","购","媾","鸹","馆","簋","蝈","馘","癀","桧","豁","击","玑","激","哜","觊","艰","鞯","捡","检","謇","讲","蒋","鲛","矫","阶","鲒","鞠","鞫","据","飓","糠","颗","髁","恳","莲","联","敛","蓼","蓿","蔻","挎","狯","亏","栏","檑","檩","蒌","篓","簏","蔓","懋","甍","蔑","篾","茑","蓬","蹊","谦","瞧","擎","罄","蕖","阒","篸","蔌","簌","檀","蔚","檄","蓰","辖","罅","芗","魈","蔫","檐","营","狱","岳","箦","蔗","栉","赚","桩"]
fivechange["木"][18]=["槟","檫","蒇","槌","箪","簦","簟","蕫","鹅","额","颚","蕃","搁","隔","鲠","遘","觏","鹄","瞽","归","鲧","簧","蟥","蕙","获","犄","蕺","虮","鲫","鲣","睑","裥","简","谫","槛","糨","蕉","谨","觐","旧","屦","瞿","鹃","蕨","骒","蒉","篑","聩","拦","瞢","拟","腻","柠","骐","骑","荨","襁","鄡","荞","窍","翘","苘","躯","璩","觑","鬈","荛","绕","蕤","蕊","蔬","梼","檮","隗","魏","芜","黠","蕈","颜","蝇","鹆","蜮","簪","蕞"]
fivechange["木"][19]=["薜","簸","橱","薋","蹬","椟","臌","关","犷","薅","薨","蕻","谎","荟","讥","蓟","缰","缴","轿","醮","襟","馑","鲸","鬏","绔","胯","脍","旷","鲲","扩","蕾","枥","栎","橹","麓","难","鲵","攀","麒","髂","签","蔷","跷","缲","黢","醛","萨","薯","薇","蕹","萧","肖","撷","薤","蟹","薪","薛","赝","遗","蚁","薏","蓣","籀"]
fivechange["木"][20]=["藊","藏","榇","筹","篡","鹗","鳄","藁","鳇","攉","蠖","籍","继","舰","藉","警","竞","龃","遽","醵","觉","阚","悬","喾","跨","郐","纩","馈","蓝","篮","栊","栌","檬","藐","篷","脐","蛴","荠","骞","琼","鳅","劝","薷","薹","牺","献","薰","严","邀","议","橼","黦","槠","橥","纂"]
fivechange["木"][21]=["藨","鹘","顾","鳏","颢","饥","鸡","歼","鹣","茧","赆","夔","藜","藕","鞒","驱","饶","薮","藤","嚣","药","艺","龈","莺","樱","蕴"]
fivechange["木"][22]=["蔼","龚","瓘","蘅","骄","惧","鱇","邝","籁","苈","蔺","茏","笼","芦","蘑","孽","苹","蕲","氍","权","苏","俨","瘿","龉","鬻"]
fivechange["木"][23]=["欑","蘩","蛊","鳜","藿","鹪","惊","鹫","蠲","蔹","兰","椤","蓦","蘖","蘧","癯","藓","鼹","验","驿","鹬"]
fivechange["木"][24]=["霭","簖","赣","羁","搅","蓠","篱","酿","衢","龋","魇","鹰","攥"]
fivechange["木"][25]=["观","鲚","髋","榄","萝","箩","蘸","缵"]
fivechange["木"][26]=["蠼","躜"]
fivechange["木"][27]=["颧","谳"]
fivechange["木"][28]=["笾","戆","棂"]
fivechange["木"][29]=[""]
fivechange["木"][30]=[""]

import chuci from './../../config/Json/NameData/chuci.json';
import cifu from './../../config/Json/NameData/cifu.json';
import gushi from './../../config/Json/NameData/gushi.json';
import shijing from './../../config/Json/NameData/shijing.json';
import songci from './../../config/Json/NameData/songci.json';
import tangshi from './../../config/Json/NameData/tangshi.json';
import yuefu from './../../config/Json/NameData/yuefu.json';


var constbooks = new Array()
constbooks.push(chuci)
constbooks.push(cifu)
constbooks.push(gushi)
constbooks.push(shijing)
constbooks.push(songci)
constbooks.push(tangshi)
constbooks.push(yuefu)


class NameToolsModule extends React.Component {
  constructor(props) {
    super(props);
    this.state = {
    };
  };
  formatStr(str) {
    // const res = str.replace(/[\s　 ]/g, '');
    let res = str.replace(/(\s|　|”|“){1,}|<br>|<p>|<\/p>/g, '');
    res = res.replace(/\(.+\)/g, '');
    return res;
  }

  splitSentence(content) {
    if (!content) {
      return [];
    }
    let str = this.formatStr(content);
    str = str.replace(/！|。|？|；/g, s => `${s}|`);
    str = str.replace(/\|$/g, '');
    let arr = str.split('|');
    arr = arr.filter(item => item.length >= 2);
    return arr;
  }
  updatename(value){
    
    var data = new Array()
    const nametabs = value.split("")
    indextab = ["金","木","水","火","土"]
    
    nametabs.forEach(nameindex =>{
      indextab.forEach(element => {
        const index = fivechange[element]
        for(i=1;i<31;i++)
        {
          const ret = index[i].includes(nameindex)
          if(ret)
          {
            var o = {}
            o.text = nameindex
            o.feature = element
            o.step = i
            
            data.push(JSON.stringify(o))
          }
        }
      });
    })
    return data
  }
  S2Tchar(x)
  {
    var n = zh_s.indexOf(x)
    if(-1!=n)
    {
      return zh_t[n]
    }
    return x
  }
  Pingyin(x)
  {
    if(undefined != pinyin[x])
    {
      return x +":"+pinyin[x]+" "
    }
    return " "
  }

  choose = (arr) => {
    const index = this.between(0, arr.length);
    return arr[index];
  };

  between = (min, max) =>
    // max is not included
    min + Math.floor(Math.random() * (max - min));

  // 清除标点符号
  cleanPunctuation(str) {
    const puncReg = /[<>《》！*\(\^\)\$%~!@#…&%￥—\+=、。，？；‘’“”：·`]/g;
    return str.replace(puncReg, '');
  }

  cleanBadChar(str) {
    const badChars = '胸鬼懒禽鸟鸡我邪罪凶丑仇鼠蟋蟀淫秽妹狐鸡鸭蝇悔鱼肉苦犬吠窥血丧饥女搔父母昏狗蟊疾病痛死潦哀痒害蛇牲妇狸鹅穴畜烂兽靡爪氓劫鬣螽毛婚姻匪婆羞辱'.split('');
    return str.split('').filter(char => badChars.indexOf(char) === -1).join('');
  }

  genName(givename) {
    // const len = this.book.length;
    try {
      var curbook = constbooks[0]
      var cur = Math.floor(Math.random() * constbooks.length)
      var index = 0
      constbooks.forEach(element=>{
        if(cur==index)
        {
          curbook = element
        }
        index++
      })
      const passage = this.choose(curbook);
      const { content, title, author, book, dynasty } = passage;
      if (!content) {
        return null;
      }

      const sentenceArr = this.splitSentence(content);

      if (!(Array.isArray(sentenceArr) && sentenceArr.length > 0)) {
        return null;
      }

      // if (Array.isArray(sentenceArr) && sentenceArr.length <= 0) {
      //   log({ passage, sentenceArr });
      // }

      const sentence = this.choose(sentenceArr);


      const cleanSentence = this.cleanBadChar(this.cleanPunctuation(sentence));
      if (cleanSentence.length <= 2) {
        return null;
      }

      // log({ content, sentence });
      // const charList = this.cleanBadChar(cleanSentence);
      name = this.getTwoChar(cleanSentence.split(''));
      if(undefined!=givename)
      {
        name = givename
      }
      var sname=name.split("");     
      var tname = ""
      var py = ""
      var fx = []
      sname.forEach(element=>{
        
        tname = tname+this.S2Tchar(element)
        py = py + this.Pingyin(element)
        fx.push(this.updatename(element)) 
      }
      )
      

      const res = {
        name,
        sentence,
        content,
        title,
        author,
        book,
        dynasty,
        tname,
        py,
        fx,
      };
      return res;
    } catch (err) {
      return null
    }
  }

  getTwoChar(arr) {
    const len = arr.length;
    const first = this.between(0, len);
    let second = this.between(0, len);
    let cnt = 0;
    while (second === first) {
      second = this.between(0, len);
      cnt++;
      if (cnt > 100) {
        break;
      }
    }
    return first <= second ? `${arr[first]}${arr[second]}` : `${arr[second]}${arr[first]}`;
  }
}
var e = new NameToolsModule()
module.exports=e;  